{"Document Name":{"0":"Diary_0487","1":"Diary_0487","2":"Diary_0487","3":"Diary_0487","4":"Diary_0487","5":"Diary_0487","6":"Diary_0487","7":"Diary_0487","8":"Diary_0487","9":"Diary_0487","10":"Diary_0487","11":"Diary_0487","12":"Diary_0487","13":"Diary_0487","14":"Diary_0487","15":"Diary_0487","16":"Diary_0487","17":"Diary_0487","18":"Diary_0487","19":"Diary_0487","20":"Diary_0487","21":"Diary_0487","22":"Diary_0487","23":"Diary_0487","24":"Diary_0487","25":"Diary_0487","26":"Diary_0487","27":"Diary_0487","28":"Diary_0487","29":"Diary_0487","30":"Diary_0487","31":"Diary_0487","32":"Diary_0487","33":"Diary_0487","34":"Diary_0487","35":"Diary_0487","36":"Diary_0487","37":"Diary_0487","38":"Diary_0487","39":"Diary_0487","40":"Diary_0487","41":"Diary_0487","42":"Diary_0487"},"Date":{"0":"unknown","1":1178.0,"2":1179.0,"3":1180.0,"4":1181.0,"5":1182.0,"6":1183.0,"7":1184.0,"8":1185.0,"9":1186.0,"10":1187.0,"11":1188.0,"12":1189.0,"13":1190.0,"14":1191.0,"15":1192.0,"16":1193.0,"17":1194.0,"18":1195.0,"19":1196.0,"20":1197.0,"21":1198.0,"22":1199.0,"23":1200.0,"24":1201.0,"25":1202.0,"26":1203.0,"27":1204.0,"28":1205.0,"29":1206.0,"30":1207.0,"31":1208.0,"32":1209.0,"33":1210.0,"34":1211.0,"35":1212.0,"36":1213.0,"37":1214.0,"38":1215.0,"39":1216.0,"40":1217.0,"41":1218.0,"42":1219.0},"Entry":{"0":"\n\n \n\nShelterwood Camp South\n\n","1":"\n\nIn camp. Morning parade devoted to routine work and rousing people up generally – a very necessary process. Word arrived that my leave is approved and later I went to DHQ and arranged to get permission to visit Paris. In the afternoon we moved out to Mametz Wood using our horses – the little black is a beauty. Formed up the Battalion in the rear of the wood and we then carried out an attack practice right through it. The splintered trees are throwing out fresh shoots and the undergrowth is coming up again. The tree boles are scarred with bullet marks and could tell great tales of dead men and hard fights in bloody combat. \n\nAfter the operation we returned to camp via Contalmaison road. Some Taubes overhead. Fritz brought down one of our observation balloons in a sheet of flame, the observers must have been killed instantly. A fine sunny day quite the best we have had for a long while. Hunt very industrious cleaning gear and clothes ready for Paris trip. After mess had some interesting talk with our doctor (Craig) and Major Byers who is resting here with us. Preparations for move up to line tomorrow.\n\n \n\nShelterwood Camp\n","2":"\n\nIn camp all day overhauling belongings The Battalion preparing to move up to the front line and another coming in here. At 4 pm they all moved off in full battle order and I went across the road and messed with Byers & Maughan of 19th. Saw an interesting range finder captured from the enemy. They lost about 100 this time in. Remarkable how callous we get about our losses, go in and lose perhaps some of our best friends there and come out leaving their bodies unfound and unburied. Arrived back at huts all is merriment – singing eating and no more thought is expended on those who have fallen than if their absence was merely one of leave.\n\nIt is well that these things rest thus lightly on our minds for brooding over those who are gone would affect our work. About 9 pm met my horse and orderly (Flower) and went to DHQ to get necessary move warrants and orders for Paris leave. Had a considerable wait there as the despatch rider from Corps HQ had not arrived. A busy office. All work focussing on two men who sit side by side at a table – the \"A\" & the \"Q\", Housed in huts lit by electric light. Set out at 10.30 on a \n\n \n\nAlbert & Amiens\n\n2\/3\/17\n\n25 mile ride to Amiens. Passed through Albert ruined and desolate but full of sleeping troops thickly packed for all the dark silent empty streets. Hit the main road and plugged along quietly in the moonlight. Horses went well and at 2.30 am we pulled up near Gare du Nord Amiens. Feeling sore and chaffed. Sent Flower back with the horses and then knocked\n","3":" up the Hotel Belfort on the corner and was soon fast asleep. They could not give me any coffee or supper owing to food restrictions. Arranged to be called at 5 am and turned into white sheets and soft bed for a couple of hours. Called on time and found breakfast was contrary to also so cleared over to the station. Got necessary papers and had great luck in striking the 1.30 Paris train which had been delayed. An English tommy bumped me in and bought a paper. Travelling companions in this carriage are 3 French officers & 2 civilians, the former smart in their blue uniforms and caps gold braided. is one of them. A quiet journey. Condensation of breath on windows prevents looking out. At Chantilly we had an influx of additional passengers – a little widow among them. \n\n \n\nParis\n\n3\/3\/17\n\nGarb consists of a small black felt hat lined in white. This imparts a virginal air and looks awfully neat – usual crepe streamers are attached. Pulled into Paris running in quickly among factories and alighted on a crowded platform of a big station. A picturesque crowd Matelots, dirty soldiers from the trenches, smart ones who had never been there, Belgian soldiers, gold laced officers, zouaves, turcos, civilians. Slowly pushed on towards a barrier where an MP handed out a little paper of instructions.\n\nThen took a taxi (after some fruitless arguments with one of those filthy greasy beings, the bulbous nosed, vinous Paris \"cocher\" with his dirty cab. A good distance up to the Hotel Continental but the fare charged was only 2\/3 – different to London.\n\nSome British officers about. Entered the hotel and an officious elderly English speaking porter showed me to my room. Having closed the door he said that he was available as a guide – he knew all the good places and wished me to put my programme in his hands.\n\n \n\n3\/3\/17\n\nBeing exceedingly tired turned in and rested in a fashion until 3 pm. Then went out and did some shopping and found prices reasonable. Bought two guide books. English is spoken in a great many of the shops. Fine streets full of bustling crowds, not many British but many other soldiers including Russians. A feature of the streets is the newspaper kiosk which is everywhere, extremely convenient and does away with noisy newsvendors. Had a look at the Opera House – a fine place rather over decorated with statuary. It has a good square in front of it where numbers of streets converge. Also saw the Place de Vendome, a quiet square with quiet shops round it. The monument in the centre has a laurel wreathed figure (Napoleon?) on it. \n\nShews statements about latrine publicity were quite true, men complete arranging their wardrobe as they walk along. There seemed to be some very fine glove shops about. Returning to Hotel met Mrs Eckelstein who asked me to dine with her. Big char-a-bancs (much resembling) tanks charge about the streets. Traffic is less well managed to what it is in London and there is a full of excitement in negotiating street crossings. Again – the Paris cabby is the dirty limit\n\n \n\nParis\n\n3\/3\/17\n\nHad dinner with Mrs Eckelstein – 3 courses in accordance with law. Afterwards adjourned to the lounge and chatted all evening meeting the sweetest little Roumanian girl of 16 – Ella Coumsha the essence of daintiness. Her people fled via Russia Sweden & England to here where she had previously been at school. Movements of hands and general gesticulation a language in itself with these people. \n\nOffered to take any English letters direct there as a courier was just on the point of leaving. This girl speaks fluently French, German, Italian, Russian and some Spanish besides English and her own native tongue. Nations surrounded with others who speak a different language to themselves must become linguists. This girl from her babyhood had a French nurse as well as an English one and consequently commenced learning two extra tongues by the time she could toddle. \n\nForeign officers resplendent in aigullettes and dressy uniforms, an education this to a parochial Australian in this big hotel it is a hard job finding the room but did so at 11 pm.\n\n \n\nParis\n","4":"\n\nLuxurious hot bath at 8 and coffee and rolls while dressing. Left at 9 and walked down Rue St Honore to Place de la Concorde. Being Sunday most of the shops in the streets are closed. In the centre of the Place (where Madame Guillotine was located) there fine fountains the jets rising from mermen inwards to the second water tier. It is a fine big open space surrounded with statues representing the various parts of France. That of Strasburg is wreathed with immortelles & wreaths. In the centre is the Luxor obelisk just similar to Cleopatra’s needle. \n\nThe Seine runs past this square and seems a fine clear river, there are many bridges. Across the bridge is the Chamber of Deputies above which the tricolor was flying – an ordinary building. After a look around here walked up to the Church of La Madeline which does not resemble a church in exterior. It is in the form of a Greek temple with many Corinthian pillars. Going inside found it rather like a bank (Colonial) A service was in progress. A very elaborate flunkey dressed in a cocked hat and gold laced coat and carrying a mace kept going round preceding a piggily fat priest who passed round\n\n \n\nParis\n\n4\/3\/17\n\na collection bag. The flunkey kept calling out for alms \"sil vous plait\". Near the entrance to the pews an old man was sitting, he had a brush the end of which was wet with holy water as the people all touched this and then crossed themselves. At 11 High Mass started and the church was so full that many could not get seats. The smell of incense and the smell of scents on the women became very overpowering. The music was good and the Church commonly supposed to have the best in Paris.\n\nReturning to the Place walked down the Avenue Champs Elysees easily the finest street to be seen anywhere. There are quite a lot of parallel roads each lined with trees. The trees at present are leafless and must be very beautiful when in full leaf. Crowds of people taking a stroll and dressed in all fashions. Soldiers of every variety. At the end after about a walk of a mile came to the Arc de Triumphe, an enormous arch with fine lifelike statuary. Crude plain force and no attempt to bowdlerise at all. From here down the Avenue Kleber to\n\n \n\nParis\n\n4\/3\/17\n\nthe Palais de Trocadero, stopping to lunch at Hotel Baltimore, an obscure place where there were several Japs. To Trocadero which was evidently a sort of exhibition building and the scene of some entertainment today for the Red Cross. There was no sign of the lift to the tower so went outside where a fine view of park like ground is laid out. A few hundred yards down the Eiffel Tower straddles the road and rears its girders up above the city. It was fenced round and under the charge of the military and fitted up for wireless purposes.\n\nWandered round here for a while and then by devious routes to Les Invalides to which people were thronging. An old place \nwhich\n with a garnish of guns in front of it. Entering the courtyard one sees its barrack like arrangement not unlike Kasr el Nil. Some Boche planes, mgs and a few field pieces seemed to get a good deal of attention. There are museums all round the court and many old relics. In one room upstairs they had German flags captured during the war and there was a great crush around them. In the Chapel \n\n \n\nParis\n\n4\/3\/17\n\nhundreds of old and tattered flags depend from the roof. Over the door is a fine picture of French dead. \"Nos Martyrs pour la Droit & Patrie\". Round the back came on what is really the front of the place. A big dome and large building. Inside is a circular arrangement and you look over the rail on to an immense red granite sarcophagus where lies the body of the Napoleon Bonaparte. The paving round the tomb is done in coloured tiles. Twelve big statues circle the tomb (each a victory) and captured flags are placed in between them. \n\nOn the other level are tombs of Jerome & Joseph and also some of the Marshalls. There is an altar here and windows nearby are off coloured glass and give it the appearance of being bathed in flame. Went from here across the Alexander III bridge and then on to the Champs Elysees & home. Some big palaces being used for exhibition purposes. Near Invalides public latrine only has narrow covering about 3’ in width. Shocking our notions. In each of these places are doctor circulars about VD. Returned to Hotel Continental about 4.45 \n\n \n\nParis\n\n4\/3\/17\n\nBeing tired rested until about 7 pm and read the papers, then set our for the Place d’Opera going via the dark Place de Vendome. The streets were fairly quiet except round the Opera where Aida was being performed and many taxis were drawing up. Lights appear to be permitted just the same as in times of peace. Refusing services of guides wandered along Boulevard d’Italiens and other streets looking for a restaurant. The former were all closed. There are many newspaper kiosks in the streets and the interior of them is illuminated which throws into relief the advertisements on their glass sides. Had some diner in a place near the Opera. Soup roast beef and a piece of tart cost 11 fcs. carving done by a special man who cuts very thin but covers the plate as if helping one lavishly. \n\nIn the streets there were crowds passing and many couples intent only on themselves, kissing each other unrestrainedly as they walked along. In the heaven of bliss, - Some good providence seemed to guard their footsteps from tripping for they had no eyes for their path. Soldiers everywhere. Taxis and chara-bancs busses tearing round like juggernauts, Gendarmes in caps capes & slacks walk slowly up & down. Returned to hotel & needed no rocking to sleep being dog tired\n\n \n\nParis\n","5":"\n\nInto a hot bath by 8 o’c and had again a breakfast of coffee and rolls while dressing. French butter being unsalted, the salt canister forms a necessary part of the breakfast equipment. Had a haircut in the hotel saloon and left some razors to be done up. For about 12 fcs. the barber wanted to sell a very poor strop. The streets were a little wet from the nights rain. Made for the Place de Concord and walked through the Jardin des Tiuleries – fine open space but the trees being leafless the beauty of it was of a severe kind. Walked right through to the Arc de Triomphe du Carrousel which of course is not in the same place as the arch on the Avenue de Champs Elysees. A little further on is a statue to Gambetta with wreaths upon it. \n\nThe Louvre was now looming into sight and it is the grandest place stretching on both sides. Being Monday it was closed but from a workman I understood that it was closed until April owing to the shortage of coal for heating purposes. There is a large courtyard and thoroughfare right through to the Church of St German l’Auxerrois which has very old carved work and statues on its front\n\n \n\nParis\n\n5\/3\/17\n\nOver the front door a big curtain like a pall was hanging with a large embroidered \"A\" on it. Inside there were a few worshippers, a coffin on catafalque, and a pleasing amount of stained glass. From the tower of this church the bell tolled out in 1572 the signal for the massacre of the hugenots. There is a window in stained glass of the 12 Apostles by Viollet le Duc. It consists of 11 and a blank washout which presumably is Judas. From here made by many winding streets towards the markets which were crowded with busy vendors, men and women running round carrying meat on their heads. \n\nThere was the Church of St Eustache just opposite but the entrance facing here was closed. Round another side was a door with \"Liberte Egalite Fraternatie\" inscribed above it and I did not think that this was the church until afterwards. Evidently the revolutionaries have occupied it at some time and plastered their legend upon it. Shall have another look at this. Walked on and eventually got lost and had to hail a taxi. The taxi fares here are cheap – the men give\n\n \n\nParis\n\n5\/3\/17\n\nchange readily and only expect a small tip. The driver seemed deliberately to misunderstand his directions and landed me at the Gare du Nord when Notre Dame was the correct destination. Reached there about 11.45. A fine church with stone that like Westminster Abbey, is becoming white with age. Elaborate carving on the front but nothing like Amiens. Inside the first impression was one of severity and gloom and that impression persists. It was not a sunny day outside nor was it unduly dull. \n\nAbout the centre of the church on either side are two enormous rose windows, their expanse and the quantity of glass used in them is very great. Remarkable how the slight tracery of wood and stone work holds all this in place. Above the choir are fine stained glass windows. The carvings all round the choir represent different biblical scenes and bear signs of modern touching up. Side chapels behind the altar as usual. One stone monument was rather gruesome. A coffin with lid lifted back. At the head Death with hourglass at the feet a wailing woman and recumbent between a most emaciated dying old\n\n \n\nParis\n\n5\/3\/17\n\nman about half in and half out of the coffin. Coming outside turned round along the riverside and there sat down to admire the outside. The slender steeple, lovely flying buttresses, and grim leering gargoyles most of which act as drain pipes. Along the ridge beam of the roof runs an intricate pattern in iron or stone. One could not help thinking of the marvellous brain of the architect who could think out all the detail for such a marvellous place as this.\n\nCrossed over the road and steered for the gilded steeple of St Chapelle passing near the Palais de Justice. Out of the courtyard of the Palais rode a troop of gendarmerie in blue breeches and red caps. Found that its elaborately carved steeple was all that could be seen of St Chapelle as it was not open today. The Conciergerie was also closed. Monday is an off-day with show places and a good many were not open today for inspection. Passed on up the Boulevard St Michel until meeting a garden full of old ruins and pieces of statuary. This surrounds Hotel de Cluny a museum which was closed being Monday so turned \n\n \n\nParis\n\n5\/3\/17\n\ninto a little restaurant in Boulevard St Michel and had an excellent lunch of fish, meat and vegetables bread and cream with a demi-bouteille of Bordeaux rouge for 6 francs. The wine here is excellent. Many French officers in here for lunch. An extremely pretty and dainty girl came in and had dinner at the adjoining table and endeavoured to commence a conversation by making eyes. She fell to a French officer after being unsuccessful in this quarter. \n\nIn this street is a building with a fountain or cascade forming one side of it. The water forms a fall right down the wall and cascades into a large basin. Thence to the Sorbonne or University which is not unlike that of Edinburgh and surrounded with booksellers shops stocked with text books of all kinds. A small Russian quarter up this way. The Church of the Sorbonne is a rather bare looking place and chiefly remarkable for the tomb of Richelieu. It is a wonderful group of statues done in alabaster-like stone. Above it, hangs from a rope the Cardinals red hat now much dust covered. The old scristan sold me\n\n \n\nParis\n\n5\/3\/17\n\nsome postcards (in all these places there are little booths for sale of postcards) and with many blessings let me out into the courtyard of the University. Crossed this and walked through a hall decorated with mural paintings to the street. From here made for the Palais du Luxembourg where are fine gardens with fountains playing. Paris seems to have a wealth of these beautiful park. The Palais was closed. \n\nFrom here walked up to the Pantheon which was also closed. It is modelled on a heathen temple and has been used for a church at times. There appears to have been a cult of the old pagan gods in France and they dropped Christianity. They have taken the old Romans & Greeks as exemplars. About the nation there is something that resembles the old Romans and had they not their mighty Caesar in Napoleon? The Pantheon (surmounted by a cross) was closed. In front is a statue by Rodin \"The Thinker\". A mighty naked man seated on a rock head in hand. In rear is the Church of St Etienne du Mont a very beautiful old place. Right across the nave in front of the \n\n \n\nParis\n\n5\/3\/17\n\naltar is a carved stone bridge (jube) or altar screen. The stained glass is very lovely. There is tomb of St Genevieve surrounded by candles and with a priest seated near it. Rather much gold paint (reminiscent of mosque tombs) From here walked down Boulevard St Michel where are some fine shops and bought some articles and then took a taxi back to the hotel. Had coffee and bread and butter and then to reading room until 7.30 pm had a most animated talk with Mlle. Ella Cumsha late of Bucharest. \n\n \n\nParis\n","6":"\n\nDid not awake till 8.30 and then slipped into bath and marched out by 9.30. Through the Tuileries gardens which appear very bare owing to leafless trees and then on to the Louvre passing again under Arc du Carrousel. The Louvre unfortunately was again completely closed and admission to view its wonders was not to be had. It is indeed bad luck if one has to go back to Australia without having been through it and the British Museum. Passed across to the church St Germain l’Auxerrois and went inside to get a rest and consult guide book. Some people at work sketching.\n\nOut into Rue de Rivoli once more and after a fairly long walk among busy throngs, passed the Tour St Jacques a square Gothic tower with a small garden round it – all that is left of an old church. Went on still keeping in Rue de Rivoli. Many fruit and vegetable barrows doing as brisk trade with housewives. The Hotel de Ville is a large typically French building which seems to carry one right back a century and a half. After another long walk picked up the Colonne de Juilliet as a land a mark and steered for it. It marks the site of the \n\n \n\nParis\n\n6\/3\/17\n\nold prison of the Bastile which as the personification of so many of their greivances, was torn down by an infuriated revolutionary mob. The column is a tall round one surmounted by a gilt flying statue. Turned down the Boulevard Henry IV and passed the barracks of the Garde Republicane outside which was a sentry wearing the brass helmet with horse hair mane. Came back this way again and walked about a mile to the Cemetery of Pere Lachaise which is situated on a height from which a good view of Paris is to be had – today was hazy. \n\nThe streets in the vicinity of the cemetery are full of shops devoted to the sale of the funeral appendages of woe – wreaths, tombstones and very many earthenware things shaped like life buoys – really artificial wreaths. The tombs are packed close together like little houses and this burial ground is evidently the French equivalent of Westminster Abbey as on all sides are to be seen the tombs of men famous in Art, Letters, & Politics. At the head of the main avenue is a most wonderful and striking piece of a statuary called \"Aux Morts\" It is full of the horror all men and women feel at death. \nSet out\n In some of\n\n \n\nParis\n\n6\/3\/17\n\nthe tombs were comfortable upholstered chairs I suppose for any members of family who might visit the ancestral grave and care for a sit down. Set out once more and after a long walk reached the Buttes Chaumont which a fine garden in the centre of which is a temple but the military are in charge and admission barred. Had rather a trouble in finding this park and had to traverse low and squalid streets. A little dirty simple soldat \"sur permission\" shook hands heartily and brought in a spirit sodden female to aid in indicating the way. \n\nInto the Rue de Manin to a cafe and had cafe au lait and whips of bread and butter for 1f. 50 cms plus the inevitable 2 sous pourboire for the waiter. hailed a taxi and he drove me right to the Bourse for 1\/1. Travelling is nothing like as dear as in London. Pulled up at the Bourse which is modelled on the Temple of Vespasian and ascended the steps and watched an animated buying and selling accompanied by much noise and yelling. Did not go inside but walked right down to Lloyds Bank near\n\n \n\nParis\n\n6\/3\/17\n\nthe Opera House and changed some English money into French and then across to a box office and got a ticket for Rigolletto on Thursday night. The Boulevards all round here crowded with a gay and highly fashionable throng. Officers gay in medals and ribbons and soldiers of all varieties and nations with ladies in tow. Great traffic of taxis tearing round. Back to hotel at 2.30. Wrote some letters and read and at about 6.30 went round to Restaurant Italien off the Boulevard Italiens for dinner. Had Spaghetti, and snails the later required a little courage to master their ground flavour. Served with little tongs to hold the shell and a small fork to extract the snail. On the menu under heading of \"fish\". Finished off with Caneravallo cheese and a demi of Bordeaux rouge (should have been Chianti!).\n\nFrom here tried to walk to Montparnasse but got lost and had to get a cocher to drive me. An awful dead and alive hole – nothing doing. The Moulin Rouge like some gaunt skeleton. returned via Metro (underground) same smell as London. Good trains. To Opera & walked home having a Bock at a cafe en route. Women here are marvellous in their dress and looks and use subtle intoxicating scents that permeate all round them. \n\n \n\nParis\n","7":"\n\nLeft about 10 am via Rue Rivoli to the Louvre passing a fine gilt statue of Jean D’Arc, and the Palais Royale about which in a cursory glance there appears nothing extraordinary. Some fine shops down this way. Continued along the Rue de Rivoli and then turned up through Les Halles which were very busy tons and tons of meat much of it still in the whole was being transported by wagons and on men’s backs. A large semi circular building across the way was the Church of St Eustache and going inside the interior was found to be handsome. There are many little side chapels and a roll of honour of butchers \"tombe sur Champ d’honneur\". \n\nFrom here walked through the Louvre grounds and by the Pont Neuf across the Seine. A few ferry boats with women fare collectors plying the river. The embankment walls are fitted on top with many cases of second hand books and stretch for hundreds of yards. Noticed a Baedeker London for which the women wanted 6 fcs. Beat her down to 4, but only offered 3 and must come back tomorrow to get it. Led up to the Palais\n\n \n\nParis\n\n7\/3\/17\n\nde Justice and through its gates to Saint Chapelle which is built in behind it. Found the church closed until 1.30 so went to Notre Dame instead and was again struck with the enormous rose windows on either side amidships and the great gloom there inside. Had another look at the buttresses and gargoyles from the riverside – the latter appear much smaller than postcards would have you believe. \n\nIt now blew up very black and started to snow so I ran before the wind and up to the Boulevard St Michel to Cafe Soufflit for a lunch of fish, mutton and a bottle of grave superieur at a cost of 6 fcs. Meals could be got much cheaper by patronising cheaper restaurants but one is diffident (perhaps foolishly so) when so distinctively uniformed. The snow was still drifting down in this fine busy street so made for St Chapelle again and this time found it open. Entered by a door and found the place in two storeys – the bottom on ground level and called the crypt. A spiral old staircase ascends to the high chapel and winds up past little old loopholes and niches cut in the tower wall. At last it emerges in a chapel that for\n\n \n\nParis\n\n7\/3\/17\n\nsheer beauty cannot be surpassed. It reminds me of the Chapel of Henry VII at Westminster Abbey. It is lovely and one mass of stained glass in the sides high narrow windows and in the altar end also. Above the door is a rose window.\n\nOne is constantly seeing wonders each of which surpasses the others but this little chapel is easily the best. The snow was now coming down very heavily so took the Metro back to the Opera – excellent clean trains and neatly dressed people everywhere. Wrote some letters and had 5 o’c tea with Mrs Enkenstein. The little Rumanian tete-a-tete with a French officer so she could not join the party worse luck. \n\n \n","8":"\n\nAwakened at 6 am and feeling restless got up at once and decided to see the busy City markets in early morning. A lowering sky and snow two inches thick on the ground. Men at work sweeping the footpaths and crossings. Outside the large shops were waiting the shop hands ready to commence the day’s work. Reached the Halles and took a walk through and though a very busy sight, was not sufficiently extraordinary or busy to warrant such early rising. Being rather too early for breakfast – I wandered round the streets & watched the business world wake up – outside one grocers was a long string of people waiting. \n\nSnow was drifting down in little drifts and it was cold to boot. Took the Metro to Gare du Montparnasse and there just missed a train to Versailles and had to wait for an hour. Crowds of piolus and others stamping up and down trying to keep their feet warm. Much edification to be derived from watching the girls – even the humblest so good looking and neat. Eventually boarded a train at about 9.40 and we had an hours run to Versailles. The outlook was all a mass of snow which lay thick over everything even in these\n\n \n\nParis\n\n8\/3\/17\n\ncrowded suburbs the Frenchman still fosters his love of trees and even the tiniest little place seemed to sport a couple. In places we passed through groves but the snow lay thick on the bare twigs and a feeble sun caused it to fall frequently. Reaching Versailles R.G. (rive gauche) found no vehicles except some cars for French officers so walked the half mile adopting the principle of following the nose. \n\nCame up to the Palace through an ordinary little town and entered a large courtyard in the centre of which is an equestrian statue. The huge palace extends on all sides and the grounds are literally adorned with statues. Unfortunately on every side there were notices that the in consequence of a new order all the galleries were closed and also another little notice that on account of the danger of trees falling from the incumbent weight of the snow they had closed the park also. I wandered round the front and saw the Trianon nestling in among trees and got a little idea of the vast extent of the place and made up my mind that it is a place \n\n \n\n8\/3\/17\n\nthat should be seen on a sunshiny day when the trees are all out in leaf. Returned to the station and had an exceedingly slow journey to the Invalides in an electric train. The carriages were very warm and the stops en route so tiresome that in common with most of the other passengers went to sleep a couple of times. Leaving Invalides walked past the Chamber of Deputies and over a windy bridge. Have not yet seen the whole 7 bridges at once owing to bad lights. The square of the Concorde was full of dirty snow and the mademoiselles ventured across the road with much trepidation and, at times, squealing. Passed up past Maximes (its chief claim to a place in the sun seems to be in its high prices) and had lunch not far from the Madeline. A bottle of a fish & a large steak with a following of tart cost 7 fr. 10. Caught many odd and ends of conversation – a group next door was driving a hard bargain and concluding some deal.\n\n \n","9":"\n\nHad an appointment (if weather fine) to walk down to the Bois de Boulogne with Mlle Ella Jane Coucha but at 11o’c we decided that the conditions were not favourable as snow flakes were pitting down. So we walked round to the Boulevard des Capucine and she ordered the despatch of some bons-bons to her filleul and I bought some for her. Quite a sweet little girl. We chatted at the hotel until lunch time and then I went out to Cafe Weber and dined off a bottle of Macon, some fish and stewed pear. Then to the Church of St Augustin and along Boulevard Haussmann passing the Chapelle Expiatoire in memory among others, of Marie Antoinette.\n\nSoon came to the shops of the \"Printemps\" – a very extensive place thronged with women folk and passing through them was difficult. The smell of violet powder was so strong at times as to raise a feeling of suffocation. Reached a small square in front of the Church of La Trinite and deliberated with the map which road to pursue. Went right up through Montmartre which is exceedingly quiet and saw in daylight the celebrated Moulin Rouge and one of the Cabaret Artistique just opposite it. Came\n\n \n\nParis\n\n9\/3\/17\n\nback by Metro to the Bourse and after poking round the streets there made for home via the Rue du quartre Septembre. Around the hotel was very busy with taxis. At 6.45 Ella came in having been detained at Ciros for her tea and we had a good talk and she presented me to her Mother. Then to Arrigonis for dinner of Chianti fish etc and found many of the same people there. Taking the place of the club of the English the French allow cafe life to form their chief relaxation and pleasure. It is made the occasion of the day and the talk, bustle and chatter are as good as a play. There is no hurry and all dally over the meal and devote great attention to their male companions. The streets on the dark side and quite & slippery so feeling tired returned to the hotel and stayed in the reading room.\n\n \n\nParis\n","10":"\n\n\"make so much stupidite\" French officers salute each other in passing which is much more comradelike than the English way of passing along ignoring one another. It must be lovely among these avenues and paths in Spring when the trees are all green. The place is shorn of half its beauty under bare poles. \n\nWe returned from our walk and had a long talk and then I went out for lunch meeting Matthews and some of the others. We decide to lunch together and went to Pruniers which is easily the noisiest cafe I had seen. Lunch was too heavy (commencing with a dozen oysters) & culminated in wasteful excess of roast chicken. Evidently a popular place with Russian officers of whom there were quite a number and all had ladies with them. Extraordinary beauties are most of these and the acme of daintiness. At 3 o’c returned to the Continental and with my friend went up Boulevard des Italiens and had an amusing living photos taken in 3 poses by an awfully comical old Frenchman whose explicit instructions & gesticulations were as comical as his appearance\n\n \n\nParis\n\n10\/3\/17\n\nWalked round mingling in the afternoon crowds on this boulevard and then back to the hotel noticing that the top shops in Rue de le Paix are all first class jewel shops and full of precious stones. The Ritz is on the Place Vendome and has plenty of motor cars and taxis round it as a rule. Back to hotel and after more talk about nothing met Mde and all adjourned to a place in the Rue de Rivoli close by and found it absolutely packed with the chic (skich) – est crowd. Here we harpooned some cakes after the manner of Groppis in Cairo. \n\nFound it fairly easy to understand Mdme’s French and to reply. Until 7 we talked at the hotel and then I set out for the Follies Bergeres to meet Matthews and party for the evening performance. An attempt to reach there by working on the chart proved unsuccessful and had to hail a taxi. His fare was only 60 centimes – rather contrast to London. Many taxis were dashing up and people passing inside and when our party was complete we did likewise and found our box adjoined right on to the stage and commanded the whole house\n\n \n\n10\/3\/17\n\nOn the whole the show may be described as rotten. At the back is the promenade a very brilliant sight and nearly the whole audience repair there between the acts to stroll and listen to an orchestra there. Throngs of girls – some very beautiful infest the place and persistently keep pestering you clinging on to belt and having to be beaten off almost. The performance on the stage would not have been tolerated in Australia first on account of its dirt (which had not even the redeeming grace of smartness) and secondly on account of its absolute weakness. \n\nMost of the songs and gags were in French. The only bright spot was at the last when all lights were turned out and a girl appeared in the air sitting in a chariot on the end of a long pole. This was thrust right over the audience and her feet brought just above the heads of the audience. There was great competition to get her shoes and eventually she lost them both. When the show terminated we set off for home and had to run the gauntlet of guides & girls which took not a little negotiating. Then to the hotel and well after the hour of midnight turned in.\n\n \n\nParis\n","11":"\n\nThe sun was shining when woke at 10 am and there was every prospect of a bright day. This good promise did not continue and at half past the hour it was again a day of the usual dullness. After reading the paper met E. and set out for a Sunday morning promenade of the Bois de Boulogne and Champs \nd\n Elysees. \n\nCrossing the Place de la Concorde we went down the Avenue Champs \nd\n Elysees which was frequented chiefly by the nurse girls and little ones.\n\nContinuing past the Arc de Triumphe the Bois came into sight – on the right was a riding track and there were a number of riders. On the left the crowd was very thick – exquisitely dress women and officers in their smartest uniforms. Russians and Italians were especially noticeable in addition to the French. The cult of the dog has not quite reached the ridiculous dimensions it has in England but it is still quite bad enough. We went right down to the Bois where is a very chic restaurant, and sat down and talked a little. An aeroplane was circling overhead among the clouds. \n\nIt seems to be the fashion to have a black filleul and one Princess was strolling along with\n\n \n\nParis\n\n11\/3\/17\n\nher husband and a coal black negro of the French Colonial Army. The crowd here was very smart and gay. On the road an officer was riding a motor scooter – evidently somewhat of a novelty. Returned the same way noticing the home of M. Poincaire, President of the Republic. Many taxis and motors running round. Just as we reached the hotel it began to rain a little. Sat in the lounge talking until 1 pm and then went out to the cafe Weber and had some Chablis ordinaire, fish, beef, compote de fruits & benedictine (item af.) and having bought La Vie Parisienne from a kiosk returned for a rest and a read.\n\nAt 4 o’c again redezvoused with our little friend who takes up so much time and adjourned with her and Mrs E. at 5 to tea just round the corner and overlooking the Tuilieries. Find this custom of making this a time of conversation and recreation is most agreeable. Returned to hotel and chatted until preparatory to going to the Theatre des Varieties. At 8.15 left with Mdme Cumsha & Mrs E. per taxi and on arrival at the Theatre found \"Le Roi de l’Air\" just commenced. The play was entirely in French but easy to follow by\n\n \n\nParis\n\n11\/3\/17\n\nthe incidents. The ventilation seems bad and the theatre stuffy but the people seem to abhor even the thought of an open door. Our loge was small and rather cramped. Between the acts most of the people went out and promenaded up and down along the corridors and ourselves were no exceptions. The performance was not over until 12 and to avoid a rush for taxis we got the concierge on to the job beforehand and voyaged off quite triumphantly making the hotel toutes de suite. Owing to the closing rules there was no supper of any kind to be had and everyone perforce had to turn in unfed.\n","12":"\n\nRose and bathed at 8 and then went for a walk down Rue de Rivoli and through the Tuilieries gardens and the Louvre. The statuary here is lovely and always worth the looking at. The Louvre itself is a splendid piece of architecture and gigantic. Leaving here crossed the Seine by Pont Carrousel (all these bridges are works of decorative art) and searched the second hand embankment booksellers only to find the scene deserted – perhaps too early. Strong current running in the river\n\n \n\nParis\n","13":"\n\nLast day of a most enjoyable permission. At 8 o’c got up and had a hot bath noting with satisfaction that skin is several degrees paler and cleaner than on arrival here and am pleased to say that the continual itchiness that seems part of trench life has here become a thing of the past. A breakfast of coffee and rolls while dressing and then out along the Rue de Rivoli across the gardens of the Tuilieries and the Louvre. A dull morning. Something new comes to sight in the statuary in these gardens every time one goes there.\n\nIn the shops in the city are many works of art but rather unconventional subjects are taken. Leda and the Swan and Europa and the Bull are two that are very popular. In the gardens this morning was a lady feeding sparrows which crowded round her without fear. She threw them morsels of bread and some birds jumped into flight and made off with it before it had touched the ground in quite an amazing manner. Passing out onto the Pont Carrousel went over the other side and along the\n\n \n\nParis\n\n13\/3\/17\n\nQuai on the parapet of the stone wall are the long rows of boxes each full of second hand books. The proprietor sits down in a chair close by and reads his journal while would be buyers turn over his stock. Later, after lunch, came here again and the day being fine, for hundreds of yards all these cases were open for business. Bought for 50 centimes a Baedeker’s Paris (about 15 years old certainly). The woman was a decent looking person and evidently English as she spoke our language without even a suspicion of accent and had good mastery of it judging by her choice of words. Also got a copy of Baedeker’s London but very old. \n\nAbout 10 oc returned to hotel, first going up to the Boulevard des Italiens for the living photographs which turned out rather well. Saw a detachment of French soldiers on the march – evidently a guard. Dressed in the old fashioned uniforms the packs very neatly rolled. Passed the Bourse and then along the rue 4 Sept. to the Opera Place. With Ella & Mrs E took a\n\n \n\nParis\n\n13\/3\/17\n\ntaxi down as far as the gates of the Bois de Boulogne and walked round the avenues. The grass looks very green in among the thickly planted tree trunks – some trees on the verge of bursting into bloom. These trees are all under about 40 years of age for a clean sweep was made here in ’70 to prevent the wood being used as shelter by the invaders. . Fronting the Bois in both directions are high walls of stone – part of the fortifications of the city. There were not many people in the Bois but those who had come out were very chic. A few were riding up and down on fine horses. \n\nThe whole park is intersected by magnificent roads of ashpalt which converge near the gates. Walked along the avenue of approach as far as the Arc of Triumph. General Castlenau was riding on the tan. Took taxi home and then walked out alone at 1 for the Cafe Weber and some lunch. After lunch with E. took a taxi to the Gare du Nord to find out about tonight’s train. No RTO here so an M.P. informed me. \nAfter\n\n \n\nParis\n\n13\/3\/17\n\nFor the last time trotted into Arrigonis and had the usual Chianti which is always excellent. Loud voiced American egoist with his little bit of skirt wanted to know how things were in Canada. Returned to hotel and after some more stupidity left at 10.45. E. in a little evening blouse and awfully sweet and nice. Took taxi to Gare du Nord (fare to Amiens first class 3 francs) and an English Tommy procured seat until the stimulus of a tip. Indeed last moments in Paris were all tips – valet, femme de chambre, liftman, porter and boy. Will always look back on this little stay with feelings of great pleasure.\n\nTravelling companions were French officers and civilians and most of us were snoring loudly by the time the train pulled out. The run to Amiens was a nonstop and quite pleasant. Slept nearly all the while – the carriage very warm on account of the heaters which are well poked up at each halt by the railway staff. A fine dark night.\n\n \n\nAmiens\/Albert\n","14":"\n\nTo Hotel Belfort at about 3.45 am and turned in between the sheets for a short rest having coffee in bed and completing bath and shave before 10. A rainy and muddy morning. At the station was informed with true English bovine politeness that the Albert train goes at 5.40 tomorrow morning. Took a short constitutional round the streets and had another look at the Cathedral - small after Notre Dame. Returning to hotel collected baggage and took train to the Barrier and at once was fortunate in catching a motor lorry which gave me a jolty ride in Albert. \n\nTo the YMCA Club near the Church for lunch – a good lunch and then tried to find our post office but it has already moved on ahead. Phoned for horse and it arrived in charge of Snowdon at 6 pm and we then proceeded to the transport lines Slept with Evanston in comfortable quarters turning in on a palliasse on the floor & some horse blankets.\n\n \n\nBazentin\n","15":"\n\nRose at 8 am and after some breakfast inspected the Transport lines. They have fairly good stables full of horses with their men hard at work with curry comb and brush. In our Transport section we have many of the old heads – bushmen and knowing they are on a good job they are exceedingly careful to take no risk of being sent into the trenches. They have all humpies – nondescript shelters built out of nothing and have congregated into little messes.\n\nSome of the older bushmen live alone and prepare their own rations and make an occasional damper. The inside of all these humpies is very neat and clean as Evans has an inspection every morning. Old Flower is one of the solitarys . In the forge Caffrey and his assistant were hard at work shoeing. Collected gear and set off towards the park, there to meet Willis and the mess cart the road into the stables being too bad to bring the cart along. Had a look at the celebrated crater of\n\n \n\nBazentin\n\n15\/3\/17\n\nof La Boisselle – an enormous hole which penetrates deep into the chalk. Many must have been killed by this explosion as there are monuments of wood close by to the Colonel and many men of the Tyneside Scottish. The old trenches criss cross hereabouts and there is much barbed wire in the ground. Accidents due to detonation of duds owing to some blow are common. A few days ago Evans buried some arms and legs lying hereabouts – relics of the last fight. \n\nMet Willis and drove up to the QM’s store at Bazentin where the railhead is. Locomotives heavy and light, puffing in the yards and salvage men at work on the dumps. Met Miles and received bundle of letters and orders to remain with QM. The poor chaps have had a devil of a time in, 10 days now and no rest and the Bosche fighting his way back. Corne’s body recovered. Massey missing. Read and wrote all the afternoon in tent which is comfortable.\n\n \n\nBazentin\n","16":"\n\nA fine sunny day with continuous distant cannonade. We are just at the gates of Bapaume now and rumours are that Fritz is shelling it which looks like evacuation. O.P Hunt my batman is under open arrest having been pinched in Amiens while I was away. No woman could be more tender in her care of me than he is probably because he thinks all he does now will mitigate his punishment. I slapped 5 days No. 2 into him myself at on another charge. It will be hard looking after oneself after two years having had the entire services of full buck Australian Billjim who does no other work.\n\nMiles went up forward to Battn HQ where they are on road and other work. It is not possible to ride up there well beyond the Butte. The returning empty limbers were cleaning out the dump near the station – once in No Mans Land. It seems foolish to permit this seeing how hard it is to get stuff forward when mud is with us. A couple of aeroplanes over before lunch.\n\n \n\nBazentin & Bapaume\n","17":"\n\nFine day and very quiet. Loafed round in tent all day. Busy railhead here and the starting place for the Decauvilles. All run by soldiers. Rumoured that our people are well through Bapaume.\n","18":"\n\nBreakfast at 6.30 am and then turned out. Tents were struck and put on limbers and Miles and myself pushed on ahead. The route lay through Martinpuich and Le Sars through both of which there were many troops moving forward. Passed right over what was our firing line a few days ago and near the Butte (which looks a very small mound when you are right near it) we found the railway yards coal dump and much broken material. Hereabouts is desperately churned up and torn about which shows what Fritz has gone through. Much of his wire remains quite intact.\n\nWe kept on the main Bapaume road (an excellent track) lined with trees on both sides. Someone had planted a triumphant flag atop the Butte. Their heavy railway had run alongside the road and on it was a train which our guns had evidently got right into\n\n \n\nBapaume\n\n18\/3\/17\n\nthe middle of. Continual streams of men and transport passed us all pushing forward and Pioneers and others were hard at it on the roads with pick and shovel. The tank traps had evidently been made by blowing up mines. Reached Bde HQ and had a word with the General and Col Forbes and then made for Batt HQ which was in a dugout down one of the inevitable sunken roads. Found them all well and ready to move but they all had colds. \n\nReturned and saw the Padre and had a rest and Miles then got orders to push on into Bapaume and establish his store there. We now left behind the dreadful shell torn desolation and found ourselves riding along a fine road bordered with smiling fields quite ready for the farmers to come and fill them. Everywhere was green grass and silence – no shelling at all. Coming into the town there was still barbed wire, many German noticeboards and transport yards etc. We now rode into the town. Quite as ruined but not as large as Ypres. Many of the ruins were on fire and smouldering. Came right along\n\n \n\nBapaume\n\n18\/3\/17\n\nto the Town Hall beside which was the base of a statue dated 1871 which had apparently been used for anti-aircraft mounting. Explored several buildings round here – all full of rubble and rubbish none had not been damaged by shell fire. The dugouts were nothing like as numerous or comfortable as expected. Having picked yards for the transport we put up our horses at one of them and proceeded on foot. Near the railway station were some more dugouts containing nothing much. Cut all wires before entering. \n\nMiles established a cutting up room in an old Banque which still has four walls and a leaky roof. Rumour that \nthe\n General Gellibrand has been right on ahead and seen nothing of the Boche. 23rd here. Colonel Forbes 21st Battn moving right through and our chaps follow doing advanced guard. No sign of Fritz but sound of an odd gun is heard and one big shell plunked near the town. Many roads converge here and it must have been pretty in peace. Little villages round about\n\n \n\nBapaume\n\n18\/3\/17\n\nThe Hun has undoubted superiority in the air and brought down 4 of ours yesterday. Our chaps need much courage to face him with such inferior machines. The men are many wearing picklehaubens and caps. \"Jonah\" created a sensation by donning a tiny boxer hat. All our transport moves into here today. It has been a pretty little village in peace time. Stewart and Bunning were in during the afternoon and have no news of any move forward. \n\nThe cooks pitched a tent for me in the front of the Bank ruins. Read and wrote quietly in this village for the for the fringe of which there was last night a stiff encounter. Just about dark all horses were removed to the rear. Macgregor dropped in and his talk of heavy shells sufficiently disturbed me to send O.P Hunt ahead to search for a deep dugout. He will probably put something heavy in tonight. It is not often that our QM is ahead of the Battn.\n\n \n\nBapaume\n\n18\/3\/17\n\nFierce arguments among QM staff as to whether Fritz is lousier then we are. Such gems of conversation as float over here from the staff positively corruscate with oaths. \"Jonah\" considers that war is good as these places are so old that they want knocking down. One house dated 1723 was smouldering today – \"by the f....\" is a stock phrase of Jones. MM. Hunt’s search for dugout proved fruitless so he is sleeping close and I have told him that if a 10\" shell falls on me he will know all about it. \n\nBrigade HQ has pushed on ahead – everyone is out of touch. Rear echelons will want to get moving. A sticky job in front of us digging in opposite his Cambrai Line. \n\nFurphey that the G. is getting 6th Divn Quite to our disappointment Fritz did not put any heavy stuff into us during the night but remained absolutely quiet and silent. Slept like a top throughout until morning.\n\n \n\nBapaume\n","19":"\n\nDull and chilly. 200 of our men at work road repairing just outside here. Furphey (afterwards confirmed) that we are moving back to Bazentin tonight. After some breakfast of bacon and army biscuit I went out the back way & walked across a green paddock to the neat hedge encircle civil cemetery which has been used by the Germans for their burials as well. There were many gold lettered neat stones for dead officers and many wooden crosses for the numerous soldiers buried in common graves In the centre of the cemetery there is a large monument to the French soldiers who fell in 1870 and not far from it the Germans have erected an even more imposing one to the memory of their dead in 1914 – 5.\n\nThiepval seems to have been where a lot of them fell. The ground round here is pastoral and free of shell holes. Fritz has been living in clover compared to us. Our men today are digging vegetables out of the many fields around. In the cemetery are some 23rd men and beyond the town in a paddock is another grave.\n\n \n\nBapaume\n","20":"\n\nOur planes active this morning but have trouble in beating back against a stiff wind. Battalion moves back tonight to Bazentin Camp No. 8 and goes further back tomorrow. At 2 pm walked over the Batt HQ – a few heavy shells coming over. Relieved there by the 26th Battalion and marched back to Misty Way where tents were lying on the ground ready for erection. The men piled arms and got to work in a sharp shower. A camp soon sprang up like a mushroom.\n\nIt started to blow in the evening and tents commenced dripping. Yarned with the Dr. & Colonel all the evening & then turned in lacing up my valise from top to bottom. The men 17 to a tent but all warm and though no issue of candles there was a light in every tent. Crowds of troops and transport bivouacked here just like manoeuvres. Cookers had great trouble getting along road and did not reach here till 3.30 am. Saw General Smith during morning. He is sacking Davis & has handed out 28 days No 2 as a start\n\n \n\nMisty Way Camp near Butte\n\n20\/3\/17\n\nBleak and cold. The wind rattling the loose canvas and making conditions bad. Mud everywhere but all quite happy and cheerful knowing that worse things might easily be encountered. Old soldiers dont growl much now-a-days. Nothing is so bad that there has not been something worse in their experience. Great blockage of traffic on road owing to some tractor motor lorries etc being bogged and the road falling in in places. This sole artery of our new operations is of vital importance to us and its rapid deterioration is serious. \n\nThe 21st & 23rd struck trouble last night and many wounded passed during the afternoon. They struck a nasty snag and lost about 150 boys. The evacuation of the wounded was slow and the line of vehicles blocked on the road stretched for miles. All our pioneers and batmen busy making floors, bunks etc. Went over to the Barque and found it a mass of ruins and desolation. The men carting boards and material out all day to put in their tents which are getting comfortable and collecting coal from the Butte Camp\n\n \n\nTent Camp near Le Barque \n","21":"\n\nSome snow fell during morning. wind and deep black clouds. \n\nThe men at work digging drains running down each line of tents. Walked with Colonel over to Le Barque enormous quantity of good timber appears to be used by the enemy everywhere. Many nose caps and dud shells lying about. Visited the 21st Battn. Crowther seemed cold miserable and upset so sent him down some coal and blankets. They had very rough experiences and describe the m.g. fire as wonderful. We seem to have trodden so closely on their heels as to compel them to fight and they gave us all we wanted. Our men could see them going out in trains.\n\nIn camp here today all hands working with a will have effected great improvements. Deep trenched drains run the whole length and duckboards and timber carried from Le Sars have been laid everywhere. Most of the tents now have wooden floors, each man doing a bit. Col. Davis still unwell. The Dr & myself have decided to once more attempt French together – another good resolution. During the evening flares of all kinds were being fired up & bombs let off by ‘tags’.\n\n \n\nTent Camp Bapaume Rd near Le Barque\n","22":"\n\nHad need to rise about 3 am and found the ground two inches deep in snow. Early parties commenced to march down to Bazentin for bathing and the camp was comparatively empty all day. Very cold squalls and a couple of powdery snow storms during the day. Men needed their bath as their bodies and clothes were quite lousy and some backs nearly raw with their scratching. Today in Bapaume a Taube was brought down with Prince Leopold aboard. He made an attempt to get away and our fellows shot him through the body – not expected to live. The wrecked plane was loudly cheered as it passed. \n\nTraffic much diminished on roads today and control better organised. Furphies insistent that we are going into rest and move to Mametz on 25th. Being idle had several discussions with Dr on abstract subjects such as Conversation, Universe etc etc and with him did some French in the evening. Bitterly cold evening and night. Staff Capt. down and well primed. got his walking ticket to join the 65th Battalion and Elmiger & Greig are now at Bazentin\n\n \n\nCamp near Le Barque\n","23":"\n\nFine but cold wind. Morning programme of drill and training. The NCO’s were taken apart under one officer per company. Saw & questioned the NCO’s in the reinforcements who joined up last night. After lunch the General & Bill came down and told us that there were some more villages to be taken, to be ready to move forward and that we are going out for a month rest. Horses brought round and a few of us rode to Pozieres to put a cross up in memory of Mackay Curnow & others.\n\nA 5 mile ride through the tangled ruins of Le Sars.\n\nMany tanks sprawling uselessly where shells had knocked them out and salvage gangs were at work on them. A few aeroplanes also lying about. Between the Sugar Factory – a heap of twisted bullet-punctured and wrecked machinery – and the head of Pozieres village the ground is full of the largest shell holes I have seen. The 5.9’s seem to have just poured in there and ripped the place to bits. Got to a concrete building in ruins (not unlike a silhouette of a kneeling camel) and all at once recognised it as Gibraltar. Walked here for a while and spent the time in \n\n \n\nCamp near Le Barque & Pozieres\n\n23\/3\/17\n\nlooking round. There are a hut or two and a few dugouts scattered round and a few Australian graves. Germans had just a few inches mounded above them where they fell and boots and handbones were sticking out. Around were the tiny carcases of the characteristic maggots all turned black. All professed to be able to recognise the ground and it came as a surprise to find that we were a quarter of a mile from Gibraltar and everyone was quite out in their reckoning! \n\nThrough Stewart’s messing the limber and cross went to the wrong place and we had to come home after a fruitless journey. Most vexatious. Rode back with Dooley. \n\n we noticed embedded several whole shells which had failed to explode and the trees edging the road were liberally sprinkled with bullet splashes. Road busy with tractors guns and other traffic. Orders to hold ourselves in readiness to move forward tonight for a stunt. Hope it comes to nothing\n\n \n\nCamp near Le Barque\n\n24\/3\/17\n\nThe commencement of the equinocial gales cold penetrating wind which makes tent life almost a hardship. In spite of a feeble sun clung closely to a brazier all day. Battalion all on salvage work \"Percy\" put over a few heavy shells which passed back towards Butte. Padre Lamble came in to see me during afternoon – much aged. Mail included a card and letter from \"ma marriane\". Many papers from Australia and England. Orders arrived for our relief by 13th Bde and return to Mametz Camp tomorrow. Brigadier decides to transfer Bazeley to 23rd as Adjutant. Forbes looked in for a talk during the morning Rumoured that ‘Batey’ is getting his extra star temporarily. Srewart left on leave for England taking a couple of diaries for safekeeping at the bank and order for a tunic on Berkleys. Padre Durnford borrowed some tarpaulins and made a windscreen for his service at 6 pm. Spiller to act as Adjutant until Stewart’s return. Very sorry about Bazeley going.\n\n \n\nTent Camp Bapaume Rd near Le Barque\n","24":"\n\nWe had settled down for the evening and issued preliminary orders for a move tomorrow back to Mametz when message arrived cancelling everything for 24 hours and then ordering us up to Bapaume at 4.30 am on 26\/3\/17.\n","25":"\n\nLess wind and not so cold. \"Percy\" spoke again and sent his heavy screechers over us. An air fight before breakfast in which two planes were forced down. Machine guns fired in air combat have a muffled dull bubbly sound. Church parade at 10.30 am sermon by padre 21st on adjoining ground had to move because of our encroachment on their preserves. \n\nHeavy artillery fire about dawn and again at 11.15. During the church parade the padre’s words were once drowned by the clatter of airplanes some passing very low overhead – they come much lower now than in past times. Triplanes are now in use in addition to the bis and monoplanes and are known to the men as backshees & corporals and sergeants. Our camp looked very well on inspection the kits being neatly laid out. Rifles want oiling more \n\n \n\nTent Camp Bapaume Rd near Le Barque\n\n25\/3\/17\n\nAll watches were advanced one hour at 11 pm last night for summer time. During afternoon Padre went over burying any bodies lying about and discovered scores of our own & German Turned them in and said a prayer. Dr Craig rather shocked him by saying that it was rather a waste of labour and it would be far better to get an Archbishop up in full vestments in a few months and solemnly consecrate the whole map square from M18 a C 3.2 to M19 a C 32 inclusive!\n\nG. O. Greig up to the front line for tonight’s stunt to get in touch once more with present day methods! Late afternoon was beautiful, cloudless sky and bright (but feeble) sun. After tea batman brought in large white hot brazier which made the tent like a furnace and cannot be good for one. In preparation for early morning move made arrangements for all superfluous contents of the tents such as papers, tins etc to be dumped at the incinerators and also for a party of men to stay behind and clean up after the companies move out. Turned in at 10 pm only removing tunic & boots and slept warm but awoke crumby & messy\n\n \n\nBapaume \n","26":"\n\nCalled at 2.30 am and arose in the cold and dark and quickly dressed. The camp was already roused and on going out one found people dashing to and fro and much bustle of batmen shifting their officers valises etc. Cooks and cookers had already gone ahead. Between reveille and advance hardly enough time was allowed and we also found that it was half an hour longer to Bapaume than we expected. The companies marched out in the darkness and the Dr, Padre and myself came along in the rear of the Battalion.\n\nThe exercise of walking kept us from feeling the cold. Negotiated successfully several tank traps and soon we found ourselves in the ruined streets of the town. The men were blocked up on the roads waiting for their billets and pushing on ahead to find out what the delay was, found that the road was blocked with heaps of debris on top of which men were working by the light of wood fires. The Town Hall had suddenly blown up at midnight by a large mine\n\n \n\nBapaume \n\n26\/3\/17\n\n- whether fired by accidental tug at a wire or by an infernal time machine is not known. 3 off 28 men are buried in the ruins. The former have been safely dug out and the mangled bodies of 5 private soldiers have been unearthed so far. Passing over this heap we turned down a side street and after ducking through many doors and ruins brought up in a fairly sound mess room and found some tea waiting for us and the Town Major Maugham. \n\nYarned until dawn when General Smith came in and went of with him to see how the work at the Town Hall was progressing and then to his Bde HQ in some cellars further down while he rang up Division for authority to use us as a working party. Returned to billet about 7.30 and sat down by fire. At dawn the 7th Bde charged after a dense artillery preparation and the result is not yet known here. Rain now sets in but most of the men are well under shelter. 2000 start work at 11 am on Town Hall.\n\n \n\nBapaume \n\n26\/3\/17\n\nWork on the Town Hall proceeded apace and saw some men still alive brought out – one walked off nonchalantly. At lunchtime the 7th Bde HQ dugout blew up and buried four men we had to put parties on then – bad ammonal fumes. During the morning visited the church which evidently had been constructed of a poor soft stone. In the vestry were many old vestments lying on the floor and a little of religious books & tracts. Many copies of a pastoral letter protesting against the building of some public buildings in such a manner as to wall the church in. The church is completely wrecked. \n\nFrom here we proceeded to a scarped hilly cliff covered prettily with fir trees. Fine artillery dugouts & ingenious O.P.’s hidden in trees scaled by ladders – all branches loped off the back of tree. From here splendid observation could be obtained in all directions. Bapaume nothing like as badly knocked about as Ypres. To the cemetery and again saw the monuments etc. The splendid way they have looked after the graves of their dead soldiers is a credit to them\n\n \n\nBapaume \n\n26\/3\/17\n\nAfter lunch a two storey building next to the ruins of the Town Hall collapsed like a pack of cards. A wet afternoon. Coming down from the tent camp last night five men fell out under a Corporal. Being a short march I said rather scornfully \"New men, Corporal?\" Then one sprang up re. shouldered an extra load of rations and made off at a great pace after the column \"New man! I’m an old hand just out of hospital\" Deeply insulted. The new man less heavily laden still hung back until prodded on by Corporal. Wonderful thing ‘esprit de corps’.\n\nGeneral Smith in to tea. Hot brazier made us fairly comfortable after tea but the early rising was conducive to turning in early. Colonel & myself slept in valises laid out on the floor and were comfortable except for cold wind whistling round every corner. Definite information obtained from prisoner that local mines were detonated by means of electric clocks. We expected to \"go up\" any time but nothing happened! Our working parties on all night\n\n \n\nBapaume & Mametz\n\n27\/3\/17\n\nA fine sunny morning. No more bodies recovered from Town Hall. Went to 5th Bde HQ and got permission to more on relief by 2 & 4 GE on excavating work. Issued our orders accordingly. Saw Capt Roth and he had been talking to a prisoner who says the men in ranks there are mystified by this move and rumours of food riots in Saxony reach them in the trenches. Their own food is excellent and good wine issue. At 3 pm left on horseback, the companies moving on ahead independently and leaving the road near Le Sars for the duckwalks. \n\nMany troops and much traffic on the roads and delays were frequent. Could anything be more depressing than travelling through this region – desolate mud & little crosses. Behind the lines there very few graves to be seen and nothing like the large cemeteries we have all over the place. What do they do with their dead? Along muddy roads through Martinpuich Bazentin to Mametz. This back area deserted to what it used to be before the Hun retreated. A long march. Reached huts and found\n\n \n\n\"B\" Camp Mametz\n","27":"\n\nbare places cold and empty. No fuel or food. YMCA sent over tea and biscuits and after batmen and valises arrived things became more comfortable. Went round to all the companies and found them more or less comfortable. The men have had rather a heavy day and owing to hurried move, have had to go on rather slight rations – no hot meal. Roused about this because it was possible to have prepared a meal had the cooks put their minds to it. But they do not do their best and always raise a cry of not possible\" unless they are told they have to damn well do it.\n","28":"\n\nIn Mametz huts. Cleaning up & issue of dinkum Aust hats and clothing the QM had fortunately secured. Established mess with Alderson as Secretary and had fine dinner in the evening. Drank the health of the new mess & I then delivered a lecture on \"Mess Etiquette & Manners\" – a subject on which some of our junior subs. need much teaching.\n\n \n\n\"B\" Camp Mametz\n","29":"\n\nA cold wintry day. Men all cleaned up and turned out smart on parade. At 10 am conference of O.C. Corp re yet another method of attack formations and spent most of the morning going through it. Fine breakfast in our officers mess. These huts are very comfortable and we are just settled down nicely when orders arrive that we must move to \"D\" Camp tomorrow. Padre has gone in to Albert to buy canteen goods Stewart is to bring our band instruments back from London when he returns.\n\nAfter lunch took a summary of evidence and Dr Sanbrook arrived in a heavy rainstorm. Sent for horse and with him and Dr Craig rode to Vivier Mill for a bath. An excellent canteen here but it and the village of Meaulte were deserted owing to the forward movement of all arms. Roads that were previously crowded are now deserted. The ground between Meaulte and Becordel is nothing like as badly scarred as it is further on. A quiet evening. Pedler in to mess. French studies proceeding slowly.\n\n \n\n\"D\" Camp Mametz\n","30":"\n\nShowery and cold. Battalion moved down to D Camp at 10 am. Astonishing the amount of rubbish that comes to light on a shift and particularly annoying is the dumping of government property blankets ammunition etc that so often occurs. Some fool put a Mills bomb in the incinerator and caused a big explosion. After everyone had moved out inspected the lines and left a very clean camp to walk down the road to a place where 24th had left. A similar camp to our old one but left in a dirty state. \n\nAfter lunch all the newer N.C.Os fell in and with Alderson, Archer, McKinnon & W.O. Caldwell we tuned them up to some purpose in word of command smartness of movement etc. Drilled on a green hill side which had been shelled once – a deep trench ran across it and shell holes and empty cartridge cases told of very bloody battle. At the foot of the rise was a small cemetery of German graves \"Here rests in God\" is their favourite inscription\n\n \n\n\"D\" Camp Mametz\n\n30\/3\/17\n\nVery comfortably located in this hut with hessian partitions. At 9.30 am took over N.C.Os class and marched out to our hillside parade ground. A smart turnout and good tall keen Australian boys all so clean and debonair with turned up hats – a sight to gladden a lasse’s heart. The pity of it to think of them being war fodder and so soon many of them to be rotting loathsome dead things. Communication drill was pushed on with – these big chaps are strangely nervous and afraid to use their voices until they get plenty of practice. Their drills were carried out with smartness and precision. \n\nGeneral Gellibrand in at lunchtime and arranged transfers of Barton & Wood to","31":" Our little padre developed measles. He has done great work in forming a canteen and a snug little writing room and library. McKinnon took over the good work. Last night had great entertainment in the person of Dr Campbell Smith – a bottle and a half in – he reduced us to helplessness by describing our Dr (Craig) as an animal who ate raw eggs at Raratonga to please his kids! An exquisite sunset tonight – held everyone’s attention. It is the first clear sunset for months.\n\n \n\n\"D\" Camp Mametz\n","32":"\n\nFell in at 9 and marched down to Becourt for church parade and presentation of medals and ribbons by General Birdwood. The men all clean and looking well dressed in greatcoats and drill order hats. Gas helmets slung over everything and hanging at the left side. Marched along sloppy roads until we reached some high ground near Becourt. Passed many Hun prisoners on the roads doing fatigue work. \n\nThe Battn formed up in mass and we soon had a Brigade square with about 2600 men on parade. A good view in all directions. Albert’s fallen statue and trees and untouched ground on slopes in rear. General Birdwood and staff came on parade and service proceeded. Rather interrupted by the curiosity of a flying squadron the noise of which quite drowned the preacher’s voice as they circled overhead. After service Military Medals and ribbons were presented to the men who had won them. General Birdwood made an address and gave the latest war news. Marched home to camp again. Battalion officers mess now\n\n \n\n\"D\" Camp Mametz\n\n1\/4\/17\n\nin full swing and a fine thing it has proved. German privates salute by flick of head toward me. Spent the afternoon over the fire with a French dictionary and returned to it after tea. \"A\" Coy moved to our old camp once more to give us more room. Pay was dealt out after tea. Elmiger reported back and was posted to \"B\" Co. Ella Comsha sent a pretty little letter full of quaintness.\n","33":"\n\nIdle morning owing to all men being at the Baths. Interviewed some NCOs after lunch – we have just received our first batch of NSW reinforcements. At 4 pm rode down to Becourt to hear General Gellibrand lecture on various topics affecting the Brigade. It commenced to snow heavily on the way and when we came out there were several inches on the ground. All the huts were clothed in white and Becourt Wood (which shells have spared) looked very pretty. The whole aspect of the landscape changes when snow falls and even on made roads it is hard to find the way. It is infinitely more so out \"in front\" round the battle line and we thank our stars we are not there tonight.\n\n \n\nMametz & Bapaume\n","34":"\n\nSnow still thick on the ground but had mostly vanished by midday and the whole surface of the ground was streaming and slushy. Joe Slater suddenly ordered off to the Divn Bomb School and had to imshi toute de suite – hardly fair to him this messing about. Marched the NCOs class out and carried on all the morning with them and notice great improvement in their word of command. Our thoroughfare is through the graves of fallen Germans, a few of which bare a simple cross and the laconic legend \"Soldat Allemand\". A sample of their own inscription\n\n\"Hier Rurt in Goff\n\nWehrmann\n\nMartin Frank\n\n7KP RIR III\n\ngef 26 OKT 1914\n\nThe sun came out in the middle of the morning and a skylark mounted and gave us our first spring song. Everywhere round where once was bustle is now silence and desertion due to everyone moving forward. During lunch the General rang up to say he would come to tea and\n\n \n\nMametz & Bapaume\n\n3\/4\/17\n\nalso imparted the cheerful warning to be in readiness to move up to Bapaume! Afternoon parade was practical company outposts and although platoon commanders had carefully explained everything I was able to find several men who knew dam – all. Quite a number of men can’t answer questions owing to speech impediment and they always get more nervous when an officer is speaking to them The Colonel came out with an order for me to proceed at once to Bapaume in advance to make arrangements. \n\nReturned to camp ordered horse and pushed off about 4 for the Transport lines. Passed La Borcelle crater and had tea with Evans. Changed orderlies taking two forward and got out on the main Bapaume road which is quite altered again. All the big Stationary Hospitals have moved forward and there are large lorry parks established. Pozieries is a busy railway siding. Derelict tanks with painted names \"The Bing Boys are here\" etc. Interesting in going through Le Sars to see the spots past which we\n\n \n\nMametz & Bapaume\n\n3\/4\/17\n\nused to creep so warily at night when the firing line was just in front. Noticed a couple of our sausage balloons up as we got near Bapaume and suddenly a hawklike Taube appeared out the blue and pounced on one. It burst into flames and came down in a trail of fire and smoke. Its occupants could not have lived Meantime a second was being hauled down fast and the German missed his first go. The occupants jumped out in parachutes and the balloon was getting quite low to the winch when the Hun very pluckily returned dodging the shells and brought it down too. He then sailed over Bapaume and got another.\n\nEntered the town and soon find the Canadian Railway Battn and got all particulars re our job. Saw Town Major and got a billet in a cellar on lousy straw on boards. \n\nA transport driver for a room mate – sent the other back with a message to Mametz. \n\nSoldiering lands in some odd places. Already before going to sleep I feel itchy all over – God knows how I shall fill in the morning.\n\n \n\nBapaume\n","35":"\n\nThe cellar was dark and for all its lousiness the bunk was so comfortable that it was 11.30 before turning out time. Got up rather hurriedly on realising this, and going out side found a fairly heavy snowstorm in progress. Round to the Town Major for lunch first calling on the BM 12th Bde and found that arrangements for the tents were under weigh. After lunch shifted all gear to the Hospice and got a fire going there in a little room covered with religious pictures and with only one leak in the roof. \n\nSent orderly to Canteen and got 10 francs worth of eatables. Someone came into our billet later in the night and stole all these. Went down to the Canadians after tea and with their O.C. inspected camp site. Their custom of calling \"tea\" supper and \"guessing\" seem strange. On the ground met Groves and party and 3 motor lorries of tents Carted these on to the ground and put a few up. A camp fire boiled a dixie. \"Percy\" spoke frequently today and put one shell right into the yard of the station. A peppering with clods was my worst damage. Returned to billets and he blew up the place next door\n\n \n\nBapaume\n","36":"\n\nA lovely sunny morning with skylarks singing and the fields looking nice and green.\n\nFar more pleasant country this to rest in than at Memetz. Out in front all the time the sound of guns continues and has its accompaniment of wicked machine gun rattle. On the door of the Hospice were a few old posters nearly indecipherable. They are in French and German. \"Le Maniere Anglais de faire la guerre\" deals with the use of dum-dum ammunition which is alleged to have been found on British prisoners. Bullets with the ends filed off \"C’est la manier de guerre la plus brutale\" and practiced only by savages of Africa and Asia. \"A nation guilty of practices such as these cannot be accorded a place among those civilised\".\n\nAnother poster was evidently one issued just after the taking of Warsaw and stated the \nthe\n totals of prisoners in German hands was about 600,000. In the main illegible but some of the following were the details\n\nFrench 3459 Officers 7 Generals 215905 Other ranks\n\nRussian 3575 Officers 18 Generals (Illegible)\n\nOther posters were ‘curfew’ orders and cautions re drinking water that had not been sterilized\n\n \n\nBapaume\n\n5\/4\/17\n\nOn arriving down at our camp site found the erection of tents busily in progress. Selected a place for the transport. Many other large camps around and a band was playing in the warm sun. Were it not for the sound of artillery one might imagine oneself back at some peace manoeuvres. The men on this advance party were mostly new men but worked very hard erecting tents and our camp looked very neat. \"Percy\" spoke often during the day with a heavy shell travelling very fast. One wounded two men about 150 y away. Others landed very close round the lines but did no damage.\n\nThe comments of the new men were rather amusing. Archer came after lunch with a big heap more tents on motor lorries and word that our move had been cancelled. Sent him back with message that we awaited orders and wanted rations. During afternoon many aircraft were aloft in the sunny skies. The men kept on making the camp. Went over to see the Canadians but found them out. While there Filmer came with orders to move back to Mametz again. Made all preparations. Damned Staff messing \n\n \n\nBapaume\n\n5\/4\/17\n\nSet out for La Boisselle at 6.45 and reached there by 8.45 pm the road excellent. Dismounted at Poizieres and went over and looked at the cross to our dead officers \"Dulce et decorum est pro patria mori\" What a bloody place this was. Near the big railway siding here is a big cross to the 4th Bde dead. Near La Boisselle on the road is a big Main Dressing Station Operating Centre 5th Army. Right alongside is a big bomb dump. This misuse of the Red Cross is so flagrant and prevalent () that it appears part of a definite policy. \n\nStayed with Evans for a cup of tea & some toast and then made back to camp. Lovely night bright moon. The hum of an aeroplane up high with a searchlight trying to find it. Later two of ours with lights sailed across. At camp received a big bundle of letters from home folk and also saw of America’s entry into the war. All valises and blankets still being in Bapaume decided perforce to sleep in some old ones. Maguire had raked up and spent a night tolerably comfortable. Orders out for musketry tomorrow.\n\n \n\nMametz\n","37":"\n\nMusketry on the range is always hurled at us and rushed through. 400 men have to fire 5 practices (in all 25 shots) on targets between 1.30 and dark. Why can they not let us take time and \nteach\n the men instead of rushing them through. Marched down after lunch and put a little march discipline into them in the way of neat piling of arms and observance of rules of the road. Near Becourt Chateau the terrain is very pretty and some hospitals are there located. Becourt Wood seemed to have escaped the wholesale strafing of the neighbourhood. \n\nThe 21st were just finishing their shooting as we arrived but we were soon on the job and put 150 men through four practices on 8 targets. Heavy rain came on about sunset and wet us all forcing us to desist. After mess Joe Slater lectured on trench to trench attack and I emphasised his remarks by quoting actual fighting experiences that showed the importance of communication by report and the need of initiative by private as well as officer\n\n \n\nMametz\n","38":"\n\nCarried out trench to trench attack practice under inky black clouds and with cold wind. Afternoon was half holiday. Company football in the afternoon\n","39":"\n\nEaster Sunday. A busy day. Sat on a Court Martial in the morning and awarded 6 years penal servitude to a man for desertion. After lunch gave 10 years to another. Then rode out and reconnoitred ground for a tactical scheme tomorrow and after mess had conference on it & helped CO. draw up his OO.\n","40":"\n\nA wet inclement morning with a flake or two of snow. Practiced a Battalion attack in the morning and carried it out in the afternoon at Tara Hill under the eye of the General. Adjourned to 21st Mess for some afternoon tea and then to a prosy lecture by Colonel Bridges on Ad Guards. Did not reach home till late and had as busy an evening as the day was. The last few days have been quite strenuous enough for anyone.\n\n \n\nMametz\n","41":"\n\nPowdery snow falling before breakfast and the ground white. Rough on the people in the front line trenches particularly in the present pushing. Just at \"fall in\" a dense snow storm came on and it became quite dark. Parade postponed accordingly for half an hour. The sun then came out and the morning `was not unpleasant despite cold wind. A season of great contrasts is this. There are signs of much combing out in England as Kennedy has now joined up. Rumoured that HJ Smith is also under orders to rejoin. Tonight we have a concert and sports are also under weigh. Training this morning – drill, general with artillery formations this afternoon. Worked out officers leave roster. How far down my own name now is! News of big stunts plenty of prisoners taken looks like the Big Push commencing. Roar of guns deep sounding at night – we shall soon be in the merry game again. At 3 pm went down to Bde HQ and the CO. & QM came also. Colonel Somerville\n\n \n\nMametz\n\n10\/4\/17\n\nwas there with the D.A.D.O.S. and some of their figures regarding stores & were particularly illuminating. After they had done the General came in and we had a discussion on our attack of a few days since over some afternoon tea. Our argument lasted until 6 so I phoned to Spiller to carry on with the mess. Pedler walked back with us & we found that Major Parkes & Dr Campbell Smith had already dined and all hands were on the way to the concert which had been well organised by Capt Alderson. Every item was excellent – the voices were good and there were no duds. A large audience – the men all fresh and smiling and looking fit. Their minds well off the War. Stewart returned from leave today and he brought me my new tunic. Ella sent a splendid parcel of chocolate from Paris. Fierce arguments re the War – all consider USA entrance must shake the Hun up\n\n \n\nMametz\n\n11\/4\/17\n\nThe dental branch of the Army as far as our experience goes, has been rather a joke as we can never get the dentist to do anything owing to him always being packed up Having a tender gum I went to Bicourt farm passing through the wood (now cut down), the stumps of trees left are bullet scarred and the ground is littered with underbrush. Found the dentist at work in a little room in a hut. He had a very complete kit and seemed to be doing good work on his patients. Scraped my teeth and then agreed to put in an hour on the work tomorrow morning. The bttns camped round here were 5th Bde so called at the Bde HQ. The General not yet returned but expected today. Col Ralston told me that 4th Divn were through the Hindenburg line with the aid of tanks. Training this morning was practical advance guards and went off very well. Afternoon was half holiday and devoted to Coy. football matches. Spent most of the time writing letters \n\n \n\nMametz\n","42":"\n\nand arguing with Campbell Smith on medical and surgical experiences. Late in the afternoon a silent thick and heavy snowstorm started and soon the whole place was under snow. The air full of heavy flakes – quite the story book kind of snowstorm. Tomorrow we hope to start letting 5% of men into Amiens and Albert where they can get a square feed and see a woman. A soulkilling business for the private soldier is this constant grind into and out of the trenches. Had an injection of thyphoid vaccine which left left arm stiff and tender. Received notice to go to a GSCM as waiting member. General Wisdom President. Accused one Harold R Townson 19th Battn.\n\n"}}