{"Document Name":{"0":"Diary_0512","1":"Diary_0512","2":"Diary_0512","3":"Diary_0512","4":"Diary_0512","5":"Diary_0512","6":"Diary_0512","7":"Diary_0512","8":"Diary_0512","9":"Diary_0512","10":"Diary_0512","11":"Diary_0512","12":"Diary_0512","13":"Diary_0512","14":"Diary_0512","15":"Diary_0512","16":"Diary_0512","17":"Diary_0512","18":"Diary_0512","19":"Diary_0512","20":"Diary_0512","21":"Diary_0512","22":"Diary_0512","23":"Diary_0512","24":"Diary_0512","25":"Diary_0512","26":"Diary_0512","27":"Diary_0512","28":"Diary_0512","29":"Diary_0512","30":"Diary_0512","31":"Diary_0512","32":"Diary_0512","33":"Diary_0512","34":"Diary_0512","35":"Diary_0512","36":"Diary_0512","37":"Diary_0512","38":"Diary_0512","39":"Diary_0512","40":"Diary_0512","41":"Diary_0512","42":"Diary_0512","43":"Diary_0512","44":"Diary_0512","45":"Diary_0512","46":"Diary_0512","47":"Diary_0512","48":"Diary_0512","49":"Diary_0512","50":"Diary_0512","51":"Diary_0512","52":"Diary_0512","53":"Diary_0512","54":"Diary_0512","55":"Diary_0512","56":"Diary_0512","57":"Diary_0512","58":"Diary_0512","59":"Diary_0512","60":"Diary_0512","61":"Diary_0512","62":"Diary_0512","63":"Diary_0512","64":"Diary_0512","65":"Diary_0512","66":"Diary_0512","67":"Diary_0512","68":"Diary_0512","69":"Diary_0512","70":"Diary_0512","71":"Diary_0512","72":"Diary_0512","73":"Diary_0512","74":"Diary_0512","75":"Diary_0512","76":"Diary_0512","77":"Diary_0512","78":"Diary_0512","79":"Diary_0512","80":"Diary_0512","81":"Diary_0512","82":"Diary_0512","83":"Diary_0512","84":"Diary_0512","85":"Diary_0512","86":"Diary_0512","87":"Diary_0512","88":"Diary_0512","89":"Diary_0512","90":"Diary_0512","91":"Diary_0512","92":"Diary_0512","93":"Diary_0512","94":"Diary_0512","95":"Diary_0512","96":"Diary_0512","97":"Diary_0512","98":"Diary_0512","99":"Diary_0512","100":"Diary_0512","101":"Diary_0512","102":"Diary_0512","103":"Diary_0512","104":"Diary_0512","105":"Diary_0512","106":"Diary_0512"},"Date":{"0":"unknown","1":1602.0,"2":1603.0,"3":1604.0,"4":1605.0,"5":1606.0,"6":1607.0,"7":1608.0,"8":1609.0,"9":1610.0,"10":1612.0,"11":1613.0,"12":1614.0,"13":1615.0,"14":1616.0,"15":1617.0,"16":1618.0,"17":1619.0,"18":1620.0,"19":1621.0,"20":1622.0,"21":1623.0,"22":1624.0,"23":1625.0,"24":1626.0,"25":1627.0,"26":1628.0,"27":1629.0,"28":1630.0,"29":1631.0,"30":1632.0,"31":1633.0,"32":1634.0,"33":1635.0,"34":1636.0,"35":1637.0,"36":1638.0,"37":1639.0,"38":1640.0,"39":1641.0,"40":1642.0,"41":1643.0,"42":1644.0,"43":1645.0,"44":1646.0,"45":1647.0,"46":1648.0,"47":1649.0,"48":1650.0,"49":1651.0,"50":1652.0,"51":1653.0,"52":1654.0,"53":1655.0,"54":1656.0,"55":1657.0,"56":1658.0,"57":1659.0,"58":1660.0,"59":1661.0,"60":1662.0,"61":1663.0,"62":1664.0,"63":1665.0,"64":1666.0,"65":1667.0,"66":1668.0,"67":1669.0,"68":1670.0,"69":1671.0,"70":1672.0,"71":1674.0,"72":1675.0,"73":1676.0,"74":1677.0,"75":1678.0,"76":1679.0,"77":1680.0,"78":1681.0,"79":1682.0,"80":1683.0,"81":1684.0,"82":1685.0,"83":1686.0,"84":1687.0,"85":1688.0,"86":1689.0,"87":1690.0,"88":1691.0,"89":1692.0,"90":1693.0,"91":1694.0,"92":1695.0,"93":1696.0,"94":1697.0,"95":1698.0,"96":1699.0,"97":1700.0,"98":1701.0,"99":1702.0,"100":1703.0,"101":1704.0,"102":1705.0,"103":1706.0,"104":1707.0,"105":1708.0,"106":1709.0},"Entry":{"0":"\n\n","1":"\n\nUp at 6 a.m. rolled my blankets and passed them into the Q.M. Stores. 8-30 parade, had another med. inspection, then got our kits ready. 10-30 parade again with full kits up, after inspection we moved out onto the road. 11-15, started off for Codford headed by the pipers. (Rowl King took a photo of me with my full kit on.) When we arrived at the station we had a cup of tea and a pkt. of biscuits given to us by the C. of E. institue. We boarded the train at 1-15, 8 men to each compartment, arrived at Southampton at 3-30 p.m. after about a dozen stops on the way.\n\nWe were allowed to wander about on the pier until 6 p.m., but were not allowed to go into the town. There was a big batch of Yanks and Tommies on the pier. I saw the \"Olympic\" and the \"Warilda\", the Warilda had the bow knocked off her by striking another boat. I also saw the \"Sequoya\" with a huge hole in her side, caused by a torpedo. The \"Gloucester Castle\" is being painted after being repaired (torpedoed). The \"Caesarea\" was at the wharf. We went on board the \"Duchess of Argyll\" at 6-30 p.m. and had to wait until 8-30 before moving off (about 800 on board, Yanks, Tommies, Light Horse and Artillery,) slept all the way over, curled up on a seat with another chap, the only trouble was that his spurs kept digging into my ribs.\n","2":"\n\nArrived at Havre 20 past 4 and tied up at the wharf at 10 to 5 a.m., had to wait on deck until 7-15, then moved off to camp at 7-30. After having a few spells along the road reached camp at 10-15, we were then split up and put into bell tents (12 to each) we then got our kits, all those who had brought bags with them had them taken away. 12 noon, dinner, more than we\n\ncould eat, and very good, 1-30 parade, 2 p.m. Medical inspection (S. arm & Scabies), we then went through the Q.M. Stores and got two blankets, 1 tin Hat, 1 pr. underpants, 1 tin dubbin and 1 Waterproof sheet and cape, we were then finished for the day. After tea (5-30) went to the pictures. 8-30 went to bed tired out.\n","3":"\n\nUp at 6-30 on parade 6-45 after rollcall we were marched off to breakfast. 8-45 parade, had jerks and games till 10-30. (I took part in cockfighting, by some means made my opponent’s nose bleed, but he won.) We were then dismissed for the morning.\n\n12-30 parade, with gas masks, and waterproofs and tin hats had to march about 2½ miles (all up hill) to the gas testing at the \"Tommies\" camp, it took all afternoon to put us through Lacramentary and Chlorine Gas, drill and lecture, arrived back in camp 6 p.m. as hungry as hawks. The march was through some fine country thickly wooded, from the camp a fine view could be seen right across to the bay at Le Havre, with the town in the valley with some fine hills as a background.\n\nWent to service in C. of E. Hut, at the close of the service five of us who were going on draft received the church’s blessing.\n","4":" (Anzac Day)\n\nChurch parade in Y.M.C.A. Hall at 9 a.m. Bishop Long of Bathurst, spoke of the undying fame that was won by the men of Anzac. 2 p.m. Inspection by the Adjutant those with long hair had to get it cut. 2-30 went to Anzac sports, a very good show, saw the W.A.A.Cs racing, they were a fine lot, and in good condition. The Tug of war was won by the Australian team who beat the Yanks, Canadians and Tommies. After tea went to Concert in Y.M. Hall. A 4 act play \"You never can tell\" was an excellent performance, lasted from 6-30 to 9 p.m.\n","5":"\n\n6-45 got orders to get ready to move off. 7 a.m. breakfast 8-30 inspected by Lt. Col. O’Donnell. 9 a.m. left camp, after a few stops arrived at station 11-45 and 32 men were put into each truck. Everyone was nearly dead after the march with their kits on (Haversack, mess tin, Waterbottle, Gas mask, tin hat, Waterproof, bandolier, blanket and change of underclothes as well as iron rations). Left Havre 2 p.m. 6 p.m. stopped for a cup of tea at Buchy the country we have passed through has mostly been farming and agricultural, the cattle being of fine quality and in good condition. Left again at 8 p.m., went to bed 9 p.m. all packed together like sardines, heads and tails, our truck had a square wheel\n\nand it took a long while to get to sleep, slept in instalments until 8 a.m.\n","6":"\n\nArrived at Pont Remy 9-30 and disentrained, had a roll call then moved off to camp arriving at 10-45, uphill all the way. 8 men were allotted to each tent. From the camp a fine view can be obtained of the surrounding country, (mostly farming). 2 p.m. parade, had the standing orders read to us, then we were dismissed for the day. In the camp are R.F.A., R.H.A., Indians and \"Aussies\". Along the roadways is to be seen in large quantities, guns of various kinds, carts, wagons and other implements of war. \n\n5.30 went for a walk into the town, went over the Somme River, went inside the R.C. Cathedral, had a lot of images and lighted candles around the walls and on pedestals. Had a feed of steak and chips with a cup of black coffee cost 2 frs 30 cent (wasn’t bad either).\n","7":"\n\nBreakfast at 7-30, a mug of tea, a small piece of bacon and slice of bread. 2.30 p.m. parade with full kits up, moved out onto the road at 3 p.m. and formed up into divisions. 3.30 set out for Longpree, 6 miles away, arrived at ¼ to 6 then had a mug of tea and two biscuits, everyone growling at the march, while at the station I saw a lot of refugees\n\n \n\nthat had come from La Bassee. We entrained at 7 p.m. for ---- when we arrived we had another 3 miles march in the rain and mud and dark as pitch. 9.30. We were all billeted in barns, I slept in a loft on the straw with about 16 others, and we were all glad to get our heads down and get to sleep as we were all footsore and weary. Went to sleep with the guns booming in the distance.\n","8":"\n\nAwoke at 20 to 8, had breakfast on tea and Dog biscuits. 9-30 to 10-30 had a lecture on gas, we were shown a German gas mask and allowed to smell two kinds of german gas (Mustard and Fosgene ). We were then taken for a march along the road for about 2 miles and back again. We were all growling as we hadn’t got over our previous days marching. After dinner went for another march, passed 79 motor lorries undergoing repairs, one was completely riddled with bullet holes. 6.30 saw a squadron of flying machines (12) after a Fritz machine.\n","9":"\n","10":" a.m. on Parade with Kits up ready to move off, 9-30 got a move on, started raining and rained all day, stopped at Flasselles for our bully beef and biscuits, four of us and an officer started out to get a cup of tea, after walking about ¾ of a mile\n\nwe went into a cottage and made ourselves at home. Madame was quite pleased to have us. Started on the 2nd part of our march at 2.30, reached Villers Brogage 4 p.m., we were then put into tents. Went for a walk into the village and had a look round. All along the road to camp was very busy with horse wagons and motor lorries, hundreds of them must have passed us. Our tent leaked like fun all night, it was very pleasant dodging the drops, it is very nice here, mud everywhere. I was kept awake with the booming of the guns and the cold.\n","11":"\n\n7 a.m. breakfast, tea, bully and biscuit. Moved off on our march at 9-30 a.m. Our officers didn’t know the way with the result we got lost and walked about four miles more than we should. Arrived at Allonville 1 oclock, hungry and tired. passed through a few small villages. along the roadway we saw hundreds of chinese making earth works and entanglements. also saw the usual traffic of motors and troops. After dinner lay down and slept until 5-30 then had tea. One of the chaps in our tent was taken to hospital.\n","12":"\n\nHad our usual bully & biscuit for breakfast. I was awakened at a ¼ to 3 by the sound\n\nof heavy cannonading. At 6 a.m., a big squadron of Flying machines flew over our tents. Moved out of camp at 1-30 for Beurtacourt. While waiting to move, a german taube flew over the camp, and the anti air craft guns started shelling him, they burst very near him and drove him off. Arrived at D.A.C., Boulincourt, 5 p.m., we were then divided into brigades and batterys, I am in the 4th Division, 11th Brigade, 41st Battery, F.A. We were again billeted in barns.\n\nFriday May 3rd\n\n3-30 a.m., we had an aeroplane attack from Fritz, he dropped four bombs within 50 yds. of where I was sleeping, where the bombs hit, they tore up trees, and a thick brick wall, also took all the tiles off the roof alongside, there were 8 chaps wounded and some horses killed, the concussion shook the plaster off the walls of our barn. One hole was about 20 ft. across and about 9 ft. deep, I got a piece of the ariel torpedo. The days work consisted of cleaning the lines, cleaning and grazing donks. 6 p.m. Had to go on Wagon guard, went on my shift at 8 p.m. till 10 p.m.\n","13":"\n\nOn guard again 2 a.m. to 4 a.m. It was very erie listening to and seeing the flashes of the guns intermingled with the he haws of the donks. It was just like a continued thunderstorm especially as it was raining. next shift 8 to 10 a.m., everyone busy packing up getting ready to move off. 11-15 a.m. moved out of camp, passed through Behencourt and Pont Noyelles, camped in the open at 4 p.m. had to make a humpy for ourselves. I\n\nsneaked a canvas cover to put over us and it was just as well as it rained heavy during the night.\n","14":"\n\n8 a.m. had to go up to the guns and dig gun pits, we had just finished one lot of pits, when we we told we were on the wrong sector. After dinner we started a new lot. when we got back to camp I found they had shifted camp so we had to take our belongings and canvas to the new camp about another mile’s walk, arriving 8.30 had tea then started to dig ourselves into the side of the hill went to bed 10.30 tired out.\n","15":"\n\nHad to go up to the pits again, about four miles walk, put in a hard days work, picking and shoveling chalk stone. One of Froggies Naval guns alongside our camp had a premature burst, killing 4 Frenchies and one \"Aussie\", besides tearing up the line.\n","16":"\n\nhad been raining very heavy all night. still raining. was made mess orderly. Didn’t do anything all morning, too wet. After dinner took horses to graze, then started cutting a dug out for the Orderly Room in the side of the hill. 8.30 p.m. got orders to go up to the guns in the morning.\n","17":"\n\n9.30 a.m. left camp in the cooks cart for the guns. Did some shooting to get the range. after dinner started on a dug out for myself. There are Tommies, Frenchies and Aussie batterys all round here. 18 pounders, 4-5s.\n\n9 in. Naval and 75s, make a small noise when they are all firing. Two of our chaps went into Villers Bretoneux on a foraging expedition and brought back Cardigans, Ladies stockings, Scarves and reels of cotton.\n","18":"\n\nDidn’t get up until 8 a.m. put in the day on the dugout, making it shrapnel proof. I got paid 40 Francs (£1-9-4) my first pay in the field. 11-30 p.m. had to go on Gas and S.O.S. Guard until 1 a.m. The sky was lit up with Star shells and the flashes of the guns and bursting shells. The shells passing overhead sounded like the rush of a train intermingled with the rattle of rifles and machine guns, and through it all could be hard the whistling of some night birds.\n","19":"\n\nDigging holes all day. The weather for the last 3 days has been \"Tray Bon\". Two of our chaps went into Villers Bretoneux again and brought back a motley collection of goods (a clock, a chair, ink etc.).\n","20":"\n\nMy turn to do the cooking for the centre section. for breakfast I fried bacon and bread, Dinner, roast beef, stewed figs and rice, Tea, bully beef stew, which I spoiled through putting too much salt into it. Supper, Cocoa and milk. Fritz shelled the gully to the right of our battery, but did no damage.\n","21":"\n\nHad an easy day. 9 p.m. had to go on S.O.S. till 10.30. Fritz had two searchlights on the go. (He must have had the wind up.)\n","22":"\n\nHad our blankets fumigated. 8.30 a.m. had to go to H.Q. and make horse lines in the side of a hill. During the early morning hours we had a visit from a couple of Fritz’s planes (they dropped a few bombs, but never hurt anyone). He shelled the ridge in front of our battery all morning. After dinner did a little shooting (18 rounds).\n","23":"\n\nDidn’t get up until 9 a.m. Fritz again shelled the ridge in front of us during the morning. 4 p.m., we had a visit from a French General, who inspected the guns and pits, thought the way we camouflaged our guns, very good. Fritz started shelling on both flanks of our battery and in front at 6 p.m., kept it up until 10.30. One shell burst about 20 yards away from me and covered me with stones and dirt. It was too close to be pleasant. no one was hit, although one piece of shell went through the roof of A. Subs dug out.\n","24":"\n\nSome of Fritzs planes were over at 5 a.m. and dropped bombs all round us, and some gas bombs as well, made me sneeze like fun. 9 a.m. one of Fritz’s planes was brought down by machine gun fire. Fritz again shelled the gully on our right. I saw three Fritz planes brought down during the day.\n","25":"\n\nOn S.O.S. guard 3 a.m. till 4.30. 8.30 Fritz started peppering the gully. Saw a good box on between some planes, one of Fritz’s was forced to land behind our lines and was taken prisoner with his machine. 4.30 p.m. did a little\n\nshooting, had to dig in the trail so as to get the elevation. After tea Fritz started shelling again, nearly got the French battery on our right.\n","26":"\n\nOne of the gothas came down in front of our battery during the early morning, but the two Huns got away. The weather is getting very warm.\n","27":"\n\nHad a quiet day. 7.30 pm. had to go and dig dug outs at the forward position. Fritz lobbed 3 shells right amongst us and scattered us, wounded one chap in the leg. I experienced that feeling of having my heart in my mouth and wanting a stick to push it down again.\n","28":"\n\nOn S.O.S. 12 midnight till 1-30 a.m. filled in the time shovelling earth over the white stones from the control pit. Watched one of Fritz’s planes using his machine gun along the trenches, he then started to drop bombs. had to go and help finish the forward gun positions after breakfast until dinner time.\n","29":"\n\nHad a quiet day, was roused out of bed at 11-30 p.m. to shoot.\n","30":"\n\nShooting all night, until 5.15 a.m. (6 hours). At 4 a.m. one of Fritz’s planes flew over and started sowing bombs, he dropped one on our ammunition dump and burnt it (it made some flare). 6.30 a.m. had a little breakfast and went to bed, slept until 12.30 midday. 4.30 p.m. had another shoot (had my first turn as No. 3).\n","31":"\n\nHad a quiet day, had to go on S.O.S. 11 p.m. to 12.30, while on saw a bomb\n\ndropped on one of our ammo dumps (made a great amount of flame & Smoke.\n","32":"\n\nHad a shoot during morning. After tea had to go and cut logs in the woods, then carried them back to guns. 9 p.m. had a shoot.\n","33":"\n\nRained all day. Amused myself making a few things from shell casings & bullets.\n","34":"\n\nOn S.O.S. 4.30 to 6 a.m. Things very quiet along the line. Had new glasses put in my gas mask. After dinner had to dig a trench behind our gun’s pit (for more protection).\n","35":"\n\nWas awakened early with gas in our dugout. 9.30 parade. Finished the trench behind the gun. 9.30 to 11 p.m. on S.O.S. While on duty saw a German dump blown up by one of our planes.\n","36":"\n\nRoused out of bed at 2.30 a.m. to do a shoot, lasted until ½ past 4. fired 130 rounds. After we had cleaned the gun we had breakfast then went to bed until 12 mid-day. Had to get out of bed 10-30 and go to the rear position for the clerk (gave him my blessing?).\n","37":"\n\nOut of bed again 2.30 a.m. to do a shoot, had another shoot 2.30 p.m. and 4 p.m. Saw a good box-on between our planes & Fritz’s (about 16 of them, very high up) don’t know who won.\n","38":"\n\nFritz still keeps up his shelling on our right.\n","39":"\n\nHad a good unbroken nights sleep. Old Fritz\n\nmade things very warm for our forward guns and the 42nd Battery on our right, shelled them for about four hours without stop, blew one gun up and set fire to it. Two of the 42nd ran up and put it out while the shells were dropping all round them. Received my first letter since leaving England.\n","40":"\n\nOn S.O.S. 12 to 1.30 a.m., things were very quite. 2 p.m. had a shoot, had to work the gun all on my own. Fritz left us alone all day for a change. We had just got into bed and settled down when we had to get out again to do a shoot, as our infantry were making a raid on Fritz.\n","41":"\n\nFritz sent over a lot of gas during the early morning hours (it has a rotten stink with it). The weather is continuing to keep fine & warm. Started to get things ready to move out.\n","42":"\n\nOn S.O.S. 1.30 to 3 a.m. Old Jerry was shelling fairly liberally on our right (dirty dog). 4.30 roused out of bed again. Gas very thick all around us, had to put on our masks. 11 a.m. left the gun position at V. Bret. for Glissy. Spent the afternoon cleaning the gun. After tea had a swim in the Somme (the 1st wash for three weeks) then went to bed.\n","43":"\n\nUp at 4 a.m. started to get the wagons packed. 8 a.m. left Glissy, passed through some exceedingly fine country and saw some beautiful scenry, until we reached the outskirts of Amiens. then it was nothing but desolation, houses smashed to pieces by shells and bombs, roads torn up, telegraph poles and wire lying all over the place. Bricks, glass, wood, iron all mixed together in heaps with the furniture & contents of the different houses. It was the same all the way through Amiens. The Cathedral is still standing.\n\nWhile we were stopped for a rest I went into one of the wrecked houses & got a few souveniers. It seemed awful to think that innocent civilians had to suffer in such a way. After passing through, the countryside took on its peaceful aspect again, the soil being cultivated and crops of rye & barley for acres and acres intermingled with beautiful patches of varied hued wildflowers. At 2.30 p.m. I had to go on guard with 3 others over 2 prisoners (handcuffed). We had to walk all the way to our stopping place which we reached at 5-15 p.m., only having 10 minutes spell during that time, needless to say we were slightly fagged after it. After we were relieved I went into the town (Hangest) and had a good feed, then came back and went to bed out in the open.\n","44":"\n\nUp at 5 a.m., left Hangest 8.30 a.m. on the last part of our journey. The day was fine and cool. We passed through some very nice villages and towns and the countryside along the way made me think of Aussie with its crops and fruit trees. Along the roadway we passed hundreds of guns and limbers that were being repaired and overhauled. I saw some Italian troops in one of the villages. Passed through Pont Remy (one of my old camping places). Arrived at our camping place 4 p.m. (Epagne), then made horse lines under some beautiful big trees. We are camped in a French Chateau near the Somme River and it is some place. After tea went for a walk to the river and had a look round.\n","45":"\n\nOn parade 6 a.m. not feeling too good, went to Dr. who gave me some tablets and sent me to bed (temp. 100°) but I didn’t go. I got paid 55 frcs. After dinner Ron Powell & I walked into Pont Remy and spent the afternoon there. After we had had some tea we went to a concert given by the 4th Divisional concert party, and it was a really fine show. Arrived back in camp 8.30pm and went to bed tired out.\n","46":"\n\nUp at 5.30 a.m. Went to Dr. again and got some more tablets and was again told to rest. (Got a touch of fever.) Feel very groggy. Went for a walk through the woods and lay down under a tree and went to sleep. After tea watched the \"try out\" races between the 41st battery horses and donks. There were some very good finishes.\n","47":"\n\nMade another visit to the Dr. and was again told to take it easy. After dinner went out on the wagon to practice for the review on Sunday.\n","48":"\n\nWent to Dr. again (got my usual tablets) feeling rotten, temp up to 100 again. After dinner went into Pont Remy and wandered round, after tea went to a play by J.M. Barrie, and was very good too.\n","49":"\n\nLeft camp 10 a.m. for the review ground, after getting there we took out the horses and watered and fed them, then cleaned the gun & wagons for the inspection.\n\nAfter we had walked and trotted past General Birdwood, he presented some Military medals and D.C.M.’s to the men in the Brigade who had won them. The parade looked very well, consisting of hundreds of men, horses, guns and wagons.\n","50":"\n\nNo parades, treated like a Sunday. Rained all morning. 5-30 p.m. had to go on Town Picquet until 12 p.m. Knocked out a bit of fun wandering round the different boozers.\n","51":"\n\nAfter dinner went with Ron into Abbeville, had to walk all the way. It is cruel the way the town has been knocked about by bombs. Statues, shops, houses, and furniture all smashed to pieces. I went into two of the big Cathedrals, they were beautifully furnished, with oil paintings and statuary all round the walls, they were the finest I have yet seen in a R.C. Church. It is quite depressing to see so many people dressed in black and seeing all the wrecked houses.\n","52":"\n\nHad to go on the water cart and fill it twice, then help dig a trench. After dinner went to the 4th Divisional Horse races, met Ed Tonkin there. Saw some very good racing.\n","53":"\n\nAfter dinner sneaked off and went to Bray with Row and had a hot bath\n\nand a change of clothes. After tea went to Pont Remy by motor and saw the \"Smart Set\" Concert. They give a very good show.\n","54":"\n\nWent to Dr. about my headaches, he gave me some tablets that made me feel queer. Got a letter from Rol King. 1.30 Muster parade, all the Batteries had their photos taken, the 41st were first; had the rest of the afternoon off. After tea went into Pont Remy by car and back again, saw a queer sight on the road (A french woman ).\n","55":"\n\n6.30 had to go to river and pump water for the horses. 9 a.m. took two horses out to exercise and graze, one of them fell into the swamp and couldn’t get out, had to get chains under him and pull him out. I got covered with mud during the operations. When I got back I felt I wanted some vaseline. Had the afternoon off. After tea went to the final concert of the Smart Set at Pont Remy. It was a splendid show and have some good talent amongst them, came home by car. Sewed my colours on tunic.\n","56":"\n\n6.30 had to go to the river again and draw water for the horses. 9.30 a.m. we were dismissed, I then went for a walk through the woods among the ferns and wild flowers. It made me long to be back home again. After tea went to picture show at Epange, passed a couple of hours away, even if I did have to sit on the floor. then came home and wrote letters.\n","57":"\n\nDuring the early morning hours some of Fritz’s planes came over on their way to Abbeville, our anti air craft guns put up a terrific barrage of shells and turned them back. 6.30 had to clean stables. 9 a.m. started to pack the wagons, getting ready to move off again. 11.30 went to a Lecture by the Bishop of Bathurst on the A.I.F. Educational Scheme for the training of the men in trades etc. Had an easy afternoon. After tea went to the pictures.\n","58":"\n\nLeft Epange 11 a.m. passed through some small villages and saw some very fine large Chateau’s, arrived 4.30 p.m. at St. Ain (Bourdon) and camped for the night. Travelled about 18 kilos, went on guard 2 p.m. to 3 p.m. with the prisoners.\n","59":"\n\nRained all night, settled the dust, moved off at 9.30 a.m. moved very slow all day. Arrived at Montierie (a suburb of Amiens) at 3.30. Camped in a distillery for the night. After tea went for a walk towards Amiens and had a look around the shell wrecked houses, everything looked desolate and deserted, seemed as if I was in a city of the dead. Felt thankful that war had not touched Australia.\n","60":"\n\nUp at 5.30 a.m. cleaning and watering horses. Left Montierie 1.30 p.m. and went through the outskirts of Amiens.\n\nLeft the left section behind us to come on next day. Arrived at Pont Noyelles near Corbie (our wagon lines) 4.45 p.m. and relieved the 53rd Battery, who were going out for a spell. 7 p.m. I had to go on Guard.\n","61":"\n\nOn guard 7 a.m. to 9 a.m. rained during the night, very cold and windy. Came off guard 6 p.m. went to bed early as it was raining.\n","62":"\n\nrained all night. During the early morning Fritz sent over a few big shells and wounded 7 horses & donks. Our S.M. left to go to O.T.C. in England. Put in the day cleaning up the horse lines, cleaning and watering donks. After tea (7.30) had to go to the guns with Ammunition, got back 9.30. had a rough ride as the drivers were racing each other along the road. Got 6 letters from Aussie, 1 from wife, 1 from Mim, 1 from Vi, 2 from Clarice, 1 from Mr. & Mrs. Rose. Where we are camped is where a battle was fought between the French and Germans in the Prussian war, there is a big stone monument to mark the place.\n","63":"\n\nHad the afternoon off, filled in the time writing letters (6), some letter writer!\n","64":"\n\nSlept in - didn’t get up till 7 a.m. slept like a log all night. 9 a.m. up befor the beak for missing 1st parade, was let off with a caution. Put in the day pick & shoveling. After tea went for a walk over to an observation balloon and had a look round it, had it explained to us by the chap on guard.\n","65":"\n\nPut in the afternoon enlarging my dug out, making it more comfortable. 6 p.m. had to go on guard. Got two letters from Aussie, 1 from Wife, 1 from Jack Richie (with photo).\n","66":"\n\nOn guard 8 to 10. weather very cold and windy, came off guard 6 p.m. then went for a walk with Peter Sinclair to find some of his cobbers. I met Harry Petty and had a long yarn with him. During the afternoon our battery played a cricket match with the 43rd, beat them easily. 11.30 p.m. a lot of Fritz’s planes came over and dropped some bombs but did no damage.\n","67":"\n\nHad an easy day. A huge shoal of our planes flew overhead (about 50 of them) during the afternoon. After tea there was a lot of ariel fighting. 9.15 p.m. one of our planes landed near our horse lines and turned completely over through being caught in some crop. The Pilot was dead being riddled with machine gun bullets in the stomach, the Observer was badly wounded in the leg and head.\n","68":"\n\nA glorious morning. During the night the R.F.C. took the damaged plane away. 10 a.m. went for a ride over to the D.A.C. with a letter for ammunition. At tea time one of Fritz’s planes came over and set a light to one of our observation balloons, it made a great blaze and smoke. He was quickly paid back for he was shot down\n\nby machine guns in front of our wagon lines. 9.30 got orders to pack my kit and go up to the guns at 10 p.m. Arrived at the new gun position, Vaux, 11.30 and unloaded ammunition. 12.30 the guns arrived, after putting them in position and covering them up, went to bed, camped alongside a brick wall out in the open.\n","69":"\n\nUp at 6.30 had to cook the breakfast. After breakfast cleaned out the room, then went into the village and got a table and five chairs, to make ourselves comfortable. Then finished our dug out, went to bed 12.30 after stacking ammo.\n","70":"\n\nAfter breakfast went and dug some potatoes that were growing near, slept all afternoon, then wrote a letter home. Went on S.O.S. 10 p.m. to 12 midnight. While on I saw two of Fritz’s dumps set on fire by our Planes, lit up the whole sky.\n","71":"\n\nAfter tea saw some good fights in the air between our planes and Fritz’s, five came down, four Fritzs and one of ours, both in flames. Every night about 10 p.m. Fritz shells all round us. To night sent over some gas.\n","72":"\n\nMy turn to cook, getting quite a don at it. Saw an enormous number of planes up, 151 of them were counted.\n","73":"\n\nDid some washing.(clothes). Made our dug out gas proof. Getting ready for the stunt on the morrow. 7 p.m. had to go with two others up on the hill and\n\ndig a trench for the O.P. ground very hard and flinty, finished at 11.15 p.m. coming back nearly got in the way of a tommy battery’s fire, just sung out in time.\n","74":"\n\nOn S.O.S. midnight to 1 a.m. everything very quiet, with a lot of our planes flying overhead. At 20 to 3 a.m. we were all roused out of bed to stand to our guns. At 10 past 3 a.m. the stunt opened, it was just as if hell had been let loose, guns thundering everywhere over 500 of them, it lasted for two hours, firing as fast as we could load the gun. Fritz was driven out of Hamel, right over the hill through the Wood. The report we got was that our infantry had captured 999 men, two Colonels, two Adjutants, 40 trench mortors and 60 machine guns, very satisfactory, with the loss of very few men. While we were having breakfast (7.30 a.m.) 20 Hun prisoners went past our \"dining room\" carrying two strechers with wounded Fritz’s on them. During the afternoon we dug our guns in for more protection At 10 p.m. we got an S.O.S. signal, as Fritz was making a counter attack, it was a repetition of the morning when the guns got going. Some of Fritz’s planes came overhead and started firing at us with their machine guns, but didn’t hit us, all the same it put the wind up. We were firing off and on all night.\n","75":"\n\nMy turn to cook again. Didn’t get up until 11.30, had breakfast & dinner\n\ntogether. Had a shoot during the afternoon. I gave them roast beef, boiled spuds & onions for tea. I went up on the hill and had a look through the glasses at the ground over which the drive took place. Saw a plane and two tanks that were put out of action during the fight. All the ground is honeycombed with the bursting of the shells. During the stunt a new idea was tried, Aeroplanes were used to take up ammunition for the infantry and tanks, and it worked well. 10.15 p.m. got orders to stand too as Fritz was making another attack. He got well slathered for his troubles.\n","76":"\n\nCalled out at 3 a.m. to give Fritz another dose of iron. Our gun got out of action twice during the stunt, broke the firing pin and the trigger \"part two\", but we made up for it when we got going. \n\nIn the stunt of 4th July we got 1200 prisoners. In the counter attack we got over 100 prisoners.\n\ngot back into bed 4.30 slept until30 a.m. At ¼ to 10 p.m. Fritz dropped some shells on us, killed Cliff Meagher and wounded Capt. Kitoe, Corp. Fairclough and Gunner Carter, we were unloading ammunition at the time. One wagon had a lucky escape, it had just moved off when a shell landed where it had been standing.\n","77":"\n\nRoused out at 12 to do a shoot. Our infantry made another advance of 700 yards and got a few more prisoners. My turn to cook again. Wrote some letters during afternoon.\n","78":"\n\nHad an easy day. Fritz left us alone. After tea had a thunder storm. Got a letter and parcel (100) of smokes from Juniper Green.\n","79":"\n\nHad a good nights sleep as we wern’t called out to shoot. Weather still close. Started to dig spuds, but had to leave off as Fritz sent up a couple of balloons and we were in full view. Started to rain during afternoon. Got four packets of letters, 33 in all, took nearly all night to read them.\n","80":"\n\nDidn’t get up till 12 oclock, as I was on S.O.S. from 2 a.m. till 3 a.m. While on, our planes were giving Fritz rats with bombs and machine gun fire. Busy writing letters at 4 p.m. and had to leave off and go and dig gun pits at the new position, got one finished at 8.30 then knocked off for tea. Got two more letters from Aussie.\n","81":"\n\nAfter dinner went back to guns, as a new lot were sent up to finish the pits, put in the afternoon packing up. 9.45 p.m. left with the guns for the new position, after putting gun in position and stacking ammunition went to bed at 1.30 a.m.\n","82":"\n\nOn S.O.S. 4 a.m. to 5 a.m. Put in the afternoon pick and shovelling (its great).\n","83":"\n\nWife’s birthday. I was made cook for a week (seem to be satisfied with my\n\ncooking). Don’t have to do any gun work. Got a letter from Uncle Robert. I am camped in a bonza humpy, has a wire mattress, belonged to the O.C. of 54th Batt. Wrote letters (8) until midnight. One of Fritz’s planes came over and brought down two of our balloons and sneaked off again.\n","84":"\n\nShowery all day, made some soup for dinner, the boys wanted to know if it was porridge or dishwater. After tea wrote some more letters.\n","85":"\n\nA dull morning, one of Fritz’s planes came over in the clouds and set fire to one of our balloons, it was rather amusing seeing the observers jumping out with their parachutes. Had a shoot during the afternoon blowing out some Hun machine gun positions. At ½ past 5 Fritz opened out on the 42nd Battery and knocked two guns out, but got no men, as every one got off at the toot. The right section moved off to their new position.\n","86":"\n\nDuring afternoon packed up ready to move. 10 p.m. packed a G.S. Wagon with kits and moved off to new positions. The wagon almost turned over through getting into a shell hole coming along the road. During Morning over 100 of our planes went over Fritzs line and towelled him up, the planes seemed to be everywhere at the same time.\n\nAfter we had unloaded the wagon we played cards until ½ Past 2, waiting for the wagon to come back again but it didn’t arrive.\n","87":"\n\nUp at 8 a.m. and got some breakfast ready. 9.30 had a shoot, one of our planes brought down a Fritz balloon in flames. 10.30 Fritz put over some \"toot Sweet\" stuff, too close to be comfortable. After dinner went down for a swim in the Lagoon in Heeily.\n","88":"\n\nHad been raining heavy during night. Another one of Fritz’s balloons brought down. Rained heavy during afternoon, cleared off at night.\n","89":"\n\nOur planes worried Fritz all day flying up and down his lines. They brought down three more of Jerry’s balloons (seem to be making a practice of it). One of Fritz’s planes made an attempt to bring one of our balloons down, but came a severe gutzer.\n","90":"\n\nA party came up to relieve us off the guns, got back to the wagon lines just in time to miss dinner. Made our happy home in a bonza room of a café in Franvilliers.\n","91":"\n\nStarted my new job on the feed heap, have 24 Horses and donks to look after and see that they get fed, or in other words I am the \"Donks mess orderly\". Put in the afternoon writing letters.\n","92":"\n\nUp at 5.30 watching some Hun planes flying about. One of our Airmen brought down two Fritz balloons. 2.30 p.m. One of Fritz’s planes brought down one of our balloons. The total for the week being four of ours down and seven of Fritzs. Got a letter from Mother and Rosie Neal. We got news from the Flying Corps that two of Fritz’s planes had been brought down and three balloons.\n","93":"\n\nRained nearly all day, made everything very muddy and sticky. Got two letters from Aussie, 1 from Browns & one from Gordon Crook. Had a feed of apples (stewed) and custard for Supper.\n","94":"\n\nOne of the chaps on the feed heap cut the top off his \nfinger\n Thumb with the chaff cutter. During the afternoon the 41st played H.Q. cricket and beat them. After tea finished off some souvenirs.\n","95":"\n\nShowery all day. While coming back from the pits, after carting ammunition, two drivers and three donks were wounded. 10-30 p.m. (Davis & Hutchie).\n","96":"\n\nMy Birthday. We got a new chaff cutter so the old one is broken. Weather still showery. Packed up a tin of souvenirs to send to Scotland for safe keeping.\n","97":"\n\nMore rain. Did my usual days\n\nchaff cutting. After tea played draughts till midnight.\n","98":"\n\n1.30 a.m. Two of Fritz’s planes came over and dropped some bombs in the village. During afternoon took the cutter to pieces and fixed it up as it wasn’t cutting properly.\n","99":"\n\nRelieved of my job, not sorry. Had to clean up horse lines. 2 a.m. An attack was made on Fritz, our line was advanced 1000 yds. besides taking 200 prisoners. 600 dead Fritz’s were counted.\n","100":"\n\nI went to Dr. about my old trouble, gave me no duty. Saw some London Terrotorials going up to the lines, a fair amount of Yanks were mixed with them. They had a drum and fife band with them, and it sounded well.\n","101":"\n\nWent to Dr. again, got two days no duty, told to come back again. After tea played draughts. We had just got into bed when \"Jerry\" came over and started dropping bombs, they made our house shake (me too). Killed one man.\n","102":"\n\nA glorious morning. Did nothing all day. While we were having tea a Fritz came over in one of our planes and destroyed four balloons. He was that pleased with himself that he looped the loop, but\n\njust as he finished one of our scouts knocked him, and brought him down in flames.\n","103":"\n\nRaining. Went to Dr. again got no duty \nagain\n, will have to go under an operation. After dinner had a hot bath and got a change of clothes.\n","104":"\n\nPut in the morning packing up. We were relieved by a \"Tommy\" battery. Who had lost all their guns and gunners in the retreat across the Marne. Moved off after dinner for Daiors, a couple of hours trip. Mud everywhere. Went through Franvillers, La Housouye, Pont Noyelles and Bussy. Had to put up a tent before we could go to bed.\n","105":"\n\nThe 4th Anniversary of the war. Put in the morning cleaning the gun. Made new horse lines after dinner. Got 12 letters from Aussie, also some photos. After tea went for a walk and found Buchdoldt, Barney King and Rowl King, spent the night with Rowland.\n","106":"\n\nShowery all day. Put in the day loading the wagons with ammunition. 9 p.m. had to go with ammunition to new position (raining heavy). Went up to within 700 yds. of the front line with it. We got blocked on the road both\n\ngoing and coming. There was a motley collection on the roads. Traction Engines, Motor lorries, Ambulances, Tanks by the hundred, Artillery of all kinds (18 pdrs., Anti’s, Hows, Navals, & Tanks), Ammunition wagons, Cavalry, Infantry, Motor bicycles and cycles, just one continual stream on both sides of the road. We went through Daours, Aubigny and Hamel. While we were hung up on the road I was speaking to a chap on a tank who said they could carry 50 men and travel 10 miles an hour. Got back to camp about 3 a.m. and went to bed.\n\n "}}