{"Document Name":{"0":"Diary_0493","1":"Diary_0493","2":"Diary_0493","3":"Diary_0493","4":"Diary_0493","5":"Diary_0493","6":"Diary_0493","7":"Diary_0493","8":"Diary_0493","9":"Diary_0493","10":"Diary_0493","11":"Diary_0493","12":"Diary_0493","13":"Diary_0493","14":"Diary_0493","15":"Diary_0493","16":"Diary_0493","17":"Diary_0493","18":"Diary_0493","19":"Diary_0493","20":"Diary_0493","21":"Diary_0493","22":"Diary_0493","23":"Diary_0493","24":"Diary_0493","25":"Diary_0493","26":"Diary_0493","27":"Diary_0493","28":"Diary_0493","29":"Diary_0493","30":"Diary_0493","31":"Diary_0493","32":"Diary_0493","33":"Diary_0493","34":"Diary_0493","35":"Diary_0493","36":"Diary_0493","37":"Diary_0493","38":"Diary_0493","39":"Diary_0493","40":"Diary_0493","41":"Diary_0493","42":"Diary_0493","43":"Diary_0493","44":"Diary_0493","45":"Diary_0493","46":"Diary_0493","47":"Diary_0493","48":"Diary_0493","49":"Diary_0493","50":"Diary_0493","51":"Diary_0493","52":"Diary_0493","53":"Diary_0493","54":"Diary_0493","55":"Diary_0493","56":"Diary_0493","57":"Diary_0493","58":"Diary_0493","59":"Diary_0493","60":"Diary_0493","61":"Diary_0493","62":"Diary_0493","63":"Diary_0493","64":"Diary_0493","65":"Diary_0493","66":"Diary_0493","67":"Diary_0493","68":"Diary_0493","69":"Diary_0493"},"Date":{"0":"unknown","1":1447.0,"2":1448.0,"3":1449.0,"4":1450.0,"5":1451.0,"6":1452.0,"7":1453.0,"8":1454.0,"9":1455.0,"10":1456.0,"11":1457.0,"12":1458.0,"13":1459.0,"14":1460.0,"15":1461.0,"16":1462.0,"17":1463.0,"18":1464.0,"19":1465.0,"20":1466.0,"21":1467.0,"22":1468.0,"23":1469.0,"24":1470.0,"25":1471.0,"26":1472.0,"27":1473.0,"28":1474.0,"29":1475.0,"30":1476.0,"31":1477.0,"32":1478.0,"33":1479.0,"34":1480.0,"35":1481.0,"36":1482.0,"37":1483.0,"38":1484.0,"39":1485.0,"40":1486.0,"41":1487.0,"42":1488.0,"43":1489.0,"44":1490.0,"45":1491.0,"46":1492.0,"47":1493.0,"48":1494.0,"49":1495.0,"50":1496.0,"51":1497.0,"52":1498.0,"53":1499.0,"54":1500.0,"55":1501.0,"56":1502.0,"57":1503.0,"58":1504.0,"59":1505.0,"60":1506.0,"61":1507.0,"62":1508.0,"63":1509.0,"64":1510.0,"65":1511.0,"66":1512.0,"67":1513.0,"68":1514.0,"69":1515.0},"Entry":{"0":"\n\n \n\n","1":" Locre\n\nAnother grey dull day. In the morning training of specialists and musketry. Spent some time on the bayonet course and then had a talk with the observers and scouts on messages. After lunch baths were available. At about 5 p.m. Rolland came along for a talk and we recalled old times. At 7 rode in to an old nunnery to a farewell dinner to \"the Babe\" and found all the other C.O.s and many other people there assembled. A great night!.\n\n \n","2":" Kemmell Huts near Locre\n\nFiner, with a sun of no power or warmth. Men on baths &c during the morning. Went round about endeavouring to get the use of some fields for sport & training but had little luck. Many of the people are in the direst poverty and cannot speak French at all. After lunch rode up over the Kemmell Ridge to the village – a very pretty ride. From the top of the ridge there is a fine view for miles a great sight first of all of crowded Camps and transport lines. Then a zone of gun flashes beyond that the trenches. A flat dreary zone. The Messines ridge is plain from here. A.J.Smith came into to tea. Inspected the rifle range & platoon there. At 6 o’c a Gotha came over & dropped about 7 bombs which landed very close – one within 50 yards. Some splinters round but no damage fortunately. Mounted L.G.s but they can do no good. \"B\" Coy had a fine company euchre party & singsong tonight finishing with refreshments. All in good fettle.\n\n \n","3":" Mt Kemmell\n\nMost men on fatigue during the morning and a great deal of loafing going on – some of the young officers are very pussy to the old type. Lewis gunners doing live firing into the base of the hill. This pretty little ridge has been a picnic place and on top is a lookout from which you can look for miles over country that is a dead level. After lunch went down to Kemmel village and played the 58 Batt. football. A good crowd. Went down to Col Denehy’s mess and found them comfortable. They treated us at the Canteen – very hospitable and kind. A dull day with bleak cold wind as we came back along the pretty winding road through the hill. Colonel Miles General Staff was round during morning & the D.A.D.M.S during the afternoon. A good battalion concert in the evening with plenty of talent in the Cinema Hall. Pte Larry Herz late Blane Holt as stage manager.\n\n \n","4":" Mt. Kemmell\n\nChurch parade in the Cinema Hall. A sunny day, but the sun has no strength and a cold biting wind made it most unpleasant out of doors. Padre Lamble took the service which went well. For lunch Capt Bean came in and we had interesting arguments. After lunch there was a football match H.Q. v D Coy but the perishing wind made it cold for the onlookers. From the slopes here is a fine view for miles in all directions over what is possibly the flattest country in the world. After mess Alderson (just back from Paris) lectured on esprit de corps and I then followed on the same topic and covered many points of the officer’s duty. Our anteroom is very cosy and lends itself to anything of this nature well. Our strength in officers is now well up and the family is large. is the M.O. And a decent chap but very boyish for his majority. A moonlight windy night with roar & roll of guns.\n\n \n","5":" Mt. Kemmell\n\nA fine day but bitterly cold. Cut out all specialist training in the morning and put all on to close order drill saluting &c and kept them busy and moving all the time. Kept going round from one company to another. After lunch there were two football matches A v C. &c B v rest of Battalion at soccer. Major Simmonds reported from C.C.S to take the place of Stevens. Took the first steps towards commencing a Battalion paper by calling for a name &c. Started on the raiding platoon and its organization. After mess went out and saw the reading room which is well fixed up and then went to a euchre party of A Coy which was a great success and all the old Billjims were hard at the game and trying to be on their very best behavior. Coffee and biscuits were served at 9 pm.\n\n \n","6":" Mt Kemmell\n\nThe morning broke wet and bleak and early our parties commenced their trudge off to the baths. It cleared up a little later and I rode into Locre & called on the three Colonels in there, having a cup of tea with Col. James at his Q.M’s. Returned to camp about noon and after lunch held orderly room and dished out some punishments, then inspected the personnel of Transport section at the Transport lines. There was much interest in a football match B v D Co. resulting in a win for the latter. An excellent game and many wagers on it. \"D\" Co also put on a very smart guard at the guard mounting ceremony. Leon Barbier came for mess & was amusing with his love adventures. Formal mess with several guests. Visited D Co euchre tournament. A calm moony night so we expect Gothas. A heavy & continuous bombardment raging\n\n \n","7":" Mt. Kemmell\n\nSpecialist training all the morning and training of a raiding platoon. The day was much finer. With the orderly officer and the M.O. made an inspection of the camp and found the usual cases of slackness and duly roused. The ration has not been too good of late and a substitute for milk is no good. After lunch the sun came out and made the afternoon a pleasant one. There was a tug of war in front of the battalion Office and then an adjournment was made to the football ground. Went up to the top of Mt. Kemmell the highest piece of ground in Belgium. A pleasant wooded hill which, in times of peace, has been a pleasant resort. There are winding tracks and paths and shrubberies and we started a hare across our path. Trenches and dugouts are made all the way up. On the top there is an old ruin of a brick lookout and a clear space that was used as an OP. From here we could look out on a great\n\n \n\n28\/11\/17 Mt. Kemmell\n\npanorama and over the Messines ridge and all the German positions to the fair land beyond. Ypres scarred and white lay beyond the Dickebush Lake. Further over was the Zillebeke by the shores of which we had a wet Battn H.Q. just a year ago. Now a place some miles behind the front line. From out of this grey plain an occasional gun flash lashed upwards. The towers of Menin could be plainly seen despite a ground mist that the wind had not shifted. Armentieries lay plain to view and further over in the dim distance could be faintly made out with difficulty, the outlines of Lille. A party of Japanese officers was up here looking round. Returned to Battalion H.Q. in time to see the guard mounting. Nothing special about the guard tonight. After mess a debate on conscription took place the Ayes were captained by Wall and the Nays by Gorman. Some very good speeches were made by both sides. Summing up by Southwell.\n\n \n","8":" Mt. Kemmell\n\nToday has been a lovely day quite one out of the box. The sun had little warmth but made things look bright and there was no wind. The aircraft were active and a long chain of balloons circled the front. Specialist training was in progress during the morning and after taking all of these out there were not many rank and file left. After lunch Colonel Brazenor came up with the Staff Captain and inspected our transport which thanks to Thewlis looked very well and fit. The horses were well groomed and wood oil made the limbers shine. Football matches were in progress. Brazenor stayed to afternoon tea. About dark a heavy bombardment commenced and rattled our huts. Preparations for issue of our battalion paper are under way. Choosing a name is difficult and some good sketches & suggestions have been received. C Coy had a good euchre party tonight.\n\n \n","9":" Mt. Kemmell\n\nTraining of raiders and specialists. Went round and saw the people at work including an officers’ squad at firing of Lewis guns. Groves had live bombing under way. After lunch a steady drizzle commenced and through it we played the","10":" N.G.C at football and beat them - despite uneven scores this was a good game. Major Dooley returned from Paris leave.\n","11":"\n\nThe Battalion paraded at full strength in a green field close to camp. After the mass parade Matthews & myself judged the drill squads. The drill was good but the cold made the hands numb. Number 16 platoon under \"Waxy\" won the first place. After the Competitions made the parade do some doubling & blood warming exercises and then took the salute as they did a ceremonial march past to the music of the band. At 1.30 left on horseback with King and rode over to Reninghelst by\n\n \n\n1\/12\/17 Mt. Kemmell\n\ndevious winding roads across muddy byways. From there went on to Houpoutre just outside Poperinghe and had a good hot bath there. Rode down to the 3rd Casualty Clearing Station and in the cemetery found Bertie’s grave after much searching. An icy shower of rain was drenching the graves – they pack the dead close together in their beds. From here we went through Wippenhoek and Westoutre. Darkness came on as we trotted along quiet muddy roads only meeting now and then a stray motor lorry or a peasant coming back from work. Women bareheaded and sturdy trudging along with their heads down. All plain looking bar one who called out \"Hullo, darling\" much to the amusement of the groom. In the little villages the churchyards are full of tawdry wooden crosses – better ones are not worth putting up for the little while the title in the grave is allowed to rest in these lands. After mess went to H.Q. Euchre party. Pay night. Drunks.\n\n \n","12":" Mt. Kemmell\n\nThe first snow of the season was lying on the grass in patches and on the duckboards this morning. The sun was bright but powerless and the wind biting so I ordered greatcoats for church parade conducted by Padre Lamble. He came up to the top of Mt Kemmell with Cawthorne and myself and we could see the Channel plainly but Lille was in mist. The flat country stretching for miles below is covered with camps. The bursts of odd shells could be seen and also the good country in rear of the German lines. How many good men of British & German races lie dead in this vast plain. Read & wrote all the afternoon getting very black from a smutty brazier. HJSmith was our guest at mess. Afterwards there was a battalion concert run by Pte. Larry Herz with scenery well painted out of salvaged stuff by Merson. An excellent tenor in of an English labour company.\n\n \n","13":" Mt. Kemmell\n\nThe ground froze during the night and became as hard as a board and dusty. The sun was shining brightly but there was not an atom of warmth in its rays. A cold icy wind made this the coldest day we have had yet this season. Early parties commenced going to the Baths and so on throughout the morning. As they returned a kit inspection and check took place. The rations this morning were better and the cooks had a good meal on for mid day. At 1.30 I left on horseback with Murphy for Bailleul having a good ride but the frozen roads were slippery enough to be dangerous. Wandered round the village – last time I was here was in company with Bert Curnow. In a small shop Madame a conversational dame of 40 entertained me at great length with a recital of the hardships of War in the way of shells bombs and the casualty of civilians. Went round to\n\n \n","14":" Bailleul & Mt. Kemmell\n\n6th Field Ambulance and after much hunting found the dentist who was working in a room over an estaminet with nothing outside to show the place. Had an impression taken and a yarn to the fellows there. There is a big market place here all cobbled. The old town hall and the church of St Pierre Vaast are essentially Flemish. A guild of lace makers operates here and there is a loom in every house. A few dirty looking girls were standing bareheaded round the square and now and then walking off with a soldier. The streets were busy with lorries and limbers and the traffic police are busy men. Left about 4 and had a quick passage home through Locre. Matthews being at Camiers today I presided at mess and we had a few guests from the 23rd. Smuts from a coal brazier cover up everything.\n\n \n","15":" Mt. Kemmell. Locre & Bailleul\n\nTraining of raiders and bombers. Some tiny flakes of snow were falling during the morning. Colonel Brazenor and Savage were round during the morning. After lunch rode into Bailleul to see the dentist of 6th. F Amb. and got an impression taken. Roads & cobbles very slippery. A good number of people about in there. Before entering the town we pass an aerodrome and a religious institution of some kind with nuns about it. Our chaps are getting very slack about their saluting again and want tuning up. Furphey that we are not going into the line work & the 5th. & 7th. Bdes. will go into the front line. Alderson received word to report to the India Office for his commission in the Indian Army. We drank his good health and wished him good luck before we sent off this good old original officer.\n\n \n","16":" Mt. Kemmell\n\nRode to D.H.Q. to a conference of C.O.’s and G.O.Cs all the heads being there gathered together. Major General Smythe presided & discussed many matters arising out of the campaign and our experiences. Rode on into Bailleul with Brazenor and dined at the Officer’s Club there. The roads were slippery and smooth. Returned to our place and saw the last half of an excellent football match between ourselves and the 23rd, which the latter won. Afterwards we entertained 18 of their officers to mess, Cutler, our cook excelling himself and turning out a good meal. Habel the mess corporal is a good manager. After mess we had a bridge tournament and badly beat them at it. Altogether a very interesting evening and one of which I hope we shall have more as it brings the officers together and lets them exchange views about their work &c.\n\n \n\n6\/12\/17 Mt. Kemmell\n\nEverything was frozen when we woke up this morning. A fatigue 200 strong was put on burying water pipe and the balance carried on with ordinary work. In the afternoon ran off a few events in our battalion sports and did not unearth any very special in the way of athletes. As soon as it was dark Gothas came over and the long fingers of many searchlights started groping for them. Judging by the numerous explosions they must have bombed some of the places very severely. The archies kept firing but do no good. Got a couple of officers up and gave them some rousing up & look for an improvement. The searchlights were busy and concentrated together while our guns fired. Once a flaming mass was seen to fall and we think that it must have been an enemy machine brought down crashing about \"Pop\".\n\n \n","17":" Locre Bailleul, Hazebrouck\n\nRose at 6 a.m. and was agreeably surprised to find it a rather warm morning and no hardship. It was dark when Bunning and myself rode into Locre and there met Colonels Brazenor, Duggan, James and others. We embarked on a motor bus and drove off for Leulinghem near St. Omer to witness a demonstration with trench mortars. Our route lay through Strazelle, Hazebrouck. First we ran out through Bailleul where (being the first Friday in the month) there was a small procession of women and children carrying a banner into the Church. From here we ran out to Strazelle the country being bleak and there were not many troops about. Thence to Hazebrouck. Along the fields there are many root crops in silage heaps covered over with turfs. Hazebrouck is quite a good little town and we passed out through Ebblinghem and Renescure to Arques\n\n \n\n7\/12\/17 Hazebrouck St Omer. Mt. Kemmell\n\nand St. Omer. Just outside the latter is an old donjon tower like the Tower Jean d’Arc at Rouen. The fine old town lies sprawling on the flats. We went right through to the poor village of Leulinghem and there saw plenty of bombarding by flying pigs &c. hundreds of officers were collected here. Lunched in St. Omer and did some shopping having a fair run back and then walking out from Locre in the dark. Found plenty of work awaiting me and reams of papers. \"A\" Coy had their dinner tonight and it went off well. This was Xmas dinner in case we die in the line then.\n","18":" \n\nMarched out at 10 am to Bde. Sports where there was a successful day’s events. The weather was not bad. Lunched at the 23rd. Battalion & obtained the second highest number of points in the day. Attended \"B\" Coy’s dinner in the evening – a great and sumptuous \"feed\" not to say \"gorge\".\n\n \n","19":" Mt. Kemmell & Bailleul\n\nRaining. Left with Proudfoot for Bailleul about 10 and had a quick ride to there over slippery and sloppy roads. Being Sunday the working folk had on their best clothes and were trudging back from Mass. In Bailleul things were quiet and I saw the dentist and got a new denture. Did a little shopping and then returned reaching camp before noon. Everyone is much depressed today on account of the bad news that the papers are full of. Spent the afternoon on routine jobs and dealt with a couple of Orderly Room cases and also with a man charged with posting a letter in a Civil Post Office. It rained nearly all the afternoon and about 4.30 it was pitch dark. Indeed 3.30 sees it dark these days. Fritz is putting over very heavy high big shrapnel whether trying for balloons or something else it is hard to say. We detailed 100 men for Bde. Church parade – no volunteers.\n\n \n","20":" Mt. Kemmell\n\nUp betimes to see our N.C.O.s School of Instruction make a beginning. About 32 all told. A fine sunny morning and mild. The usual fatigues having been taken out, we bathed the remainder in Locre. Inspected the huts and found them none too satisfactory so accordingly got the O.C. Coys. up and put it into them. At the same time issued orders regarding the polling for the Referendum. Rode into Locre about 2 pm to a football match with the 21st. and after a good game they beat us owing to our lack of system. Rolland was here to lunch and before him came Colonel Heron of the 3rd. Division who is going to relieve us here. German Gothas over today dropped bombs. Later on a propaganda balloon floated over. Copies of papers were dropped from aeroplanes near our Camp. Had dinner with \"D\" Coy - they had decorated the hall very fittingly and we had a great feed. Toasts and songs made the night pass quickly.\n\n \n","21":" Mt. Kemmell\n\nBattalion paraded less 200 men on fatigue and we did some ceremonial before going on to other work. N.C.Os school in full swing. Raiding party working on the bombing ground under Hutton. Picked suitable ground and positions for a demonstration to be given before General Smythe on Thursday. Put 50 men and Keith Sutherland on the job of digging the facsimile trenches & linking up the existing breastworks. After lunch there were boxing contests and some men went away on a pipe laying job. Rode into Bailleul on my new black charger and had my teeth attended to. It became dark very early and a good nip of frost was in the air. Some heavy explosions during the evening and an incessant mutter of gun fire. Attended \"C\" Coys. dinner and made a speech. After the loyal toast several singers came on with ribald songs which of course brought down the house. \n\n \n\n12\/12\/17 Mt. Kemmell\n\nTwo hundred men on fatigue and the balance doing drill and training. Spent all the morning rehearsing the raiding platoon. General Paton came along. In the trench they fixed up some very realistic dead Germans for the different parties to rat. Not a bad stunt after several tries at it. After lunch we played the A.S.C 5th. Div at football and beat them badly. A big squadron of Gothas came over on a bombing raid but did not touch us. An impressive sight. They killed and wounded a number in the 3rd Div battn we are relieving. Sutherland came back from there blood bespattered. They got in among a crowd playing football & caused much consternation. The roar of guns have greatly increased on the sector the last few days. At 6 pm. H.Q. had their dinner and it proved to be extremely enjoyable.\n\n \n\nRaw and cold and misty. Carried out a demonstration with our raiding platoon for a crowd of officers from the other battalions and it worked quite well. Telephones working and bareheaded members of the party. The afternoon turned out dark and foggy and there was an intercompany football match. Went down to Locre to dinner with Colonel Duggan and had a very pleasant tete-a-tete meal before going on to Br. H.Q. to a conference at which the General presided. The work on the Corps line in our new area was discussed and our future movements. The gentle Hun’s massing forebodes something in the way of an offensive and we are getting ready for him. Who would have thought this time last year that we would be on the defensive now! Rode back to camp along pitch dark and wet roads.\n\n \n","22":" Mt. Kemmell\n\nBattalion parade in full marching order in a hedge enclosed field. Practised the general salute with our buglers. Two little Belgian kids wandered on in the middle of the show and had to be carried off by a blushing Billjim. Later one toddler about 4 was noticed to be \ncarried\n carrying a rifle grenade. When this was taken from him by a sergeant major he promptly turned round to him and said \"f - you!\" Carried on with close order drill & saluting and had a smart parade. A Scotch mist was prevailing during part of this parade. In the afternoon carried out more close order work and training. The flash of shrapnel bursts could be plainly seen over Ypres way. We had 116 men killed in our last 3 tours of duty & sent crosses up today by Kohn. After mess I lectured the officers on their duties regarding the care of their men.\n\n \n","23":" Mt. Kemmell & Kortypip \n\nFell everyone in at 9 a.m. and got them on to the job of cleaning up the camp. It turned out a fine clear day with a cold wind. We left the camp very thoroughly clean and pushed off by noon having had the mid day meal. An interval of 100 yards in between companies was preserved and Sgt. Monaghan was in charge of the band. The route lay along a twisting muddy road as far as Dranoutre where we struck the pave. The 3rd. Division were marching out and passed us. They were marching in threes. Between Dranoutre and Neuve Eglise are many motor lorries parked. Neuve Eglise is a village of the Ribemont type and was full of troops of the","24":" Bde in steel helmets and sandbags ready to go up to the line. Being payday there were not a few shirkers among them. Just outside here we piled arms for a rest. Having\n\n \n","25":" Kortypip \n\npicked up our own guides we marched into camp about 2.30. There is a grand football field and a game of Rugby was in progress on it. Today we checked the blankets on arrival here and found many interesting things in the bundles as nowadays we have so many old soldiers with us! Our canteen was well installed and ready to do good business as tonight the men were paid. Met Colonel James and walked over to Brigade with him and then had a cup of tea with the General and listened to some of his yarns about Ploegsteert. Returned to Camp for mess and then got busy with interior economy and nearly got suffocated by the sulphurous fumes of French coal burned in a brazier. Hanging over these braziers makes men filthy and with the cold weather they shirk washing. Long hair is also only too prevalent.\n\n \n","26":" Kortypip \n\nChurch parades were held all the morning in a Y.M.C.A hut in the Camp and a good deal of cleaning up was carried out. In the afternoon there was a black sky and many snowflakes which did not lie about for long. Rode out with the Company Commanders along very good roads out to Ploegsteert Wood to reconnoitre our readiness position. Fritz was putting over some heavy shells close to the road and rather frightened the horses which were very fresh. He also shelled the vicinity of our camp during the morning. We went right up to Red Lodge and in the wood we marked out the ground for the assembly. A dominating ridge runs through the wood on its reverse slope is a cemetery. In the wood are many old gun positions with boxes and little bags of explosive lying about. The pools were all frozen over with a thin ice. Rode \n\n \n\n16\/12\/17 Kortypip \n\nnow about 5 miles down to the South and found another place on the outskirts of Armentieres – now a ruined and deserted town. The enemy was shelling a place about 500 yards from us, the shelling was constant and the debris dust and smoke of the explosives was filling the air long before the whining screech and ultimate crash reached us. From here we rode home at a gallop to find the 24th. officers beating ours at football. Stewart returned from his school of Instruction and resumed duty. Yarned with Colonel James and gave him some afternoon tea and then got busy with maps and defence schemes. After mess did some routine work and some correspondence and was very cosy in this little room. The sound of merriment by night on account of the fullness of pockets after pay day.\n\n \n","27":" Kortepyp\n\nAwoke to find it snowing drifting flakes softly falling from a dead black sky and covering the ground everywhere. Ordered all parades inside and then inspected the whole camp finding that there is much room for improvement all round owing to the state of repair in which the huts are. Pottered round all the morning and ordered some improvements. In the afternoon it cleared up and I went over to Brigade and saw the General about the Cadet Battalion. A flock of Gothas came over late and were engaged by our people. Put all men under cover while they were about. N.C.O’s school still in progress. Our Canteen is not doing such good business here owing to the proximity of the Y.M.C.A. Sent forward platoon commanders and Major Matthews to reconnoitre up to the Corps Line. Great improvement shown by the Band under Monaghan.\n\n \n","28":" Kortepyp\n\nEverything is frozen hard today and places that before were bogs are now as hard as iron. Tried out some of the members of the N.C.O.’s class and found them improving. Left at 10.30 with Cawthorn and rode down to the outskirts of Armentieres. The sun was shining and on the ground was the remains of yesterday’s snow. The countryside and roads all round here seemed to be remarkably deserted. Dismounted near an old Gasometer and walked over some ground that had been heavily strafed towards a C.T. that normally is full of mud but now is fine and frozen hard. An airfight was in progress high up in the blue and a few crumpy shrapnels were coming over. There seems to be an unusual amount of m.g. fire probably the gunners firing to keep the cooling jackets from freezing. We went up as far as the Corps Line which is well defined but in bad repair. The land here is dead\n\n \n\n18\/12\/17 Kortepyp\n\nlevel. We now retraced our footsteps and met the groom and exchanged steel hats for the more comfortable slouch ones. Rode through the fringe of Armentieres – all dead quiet and absolutely deserted. Seeing the square tower of Erquinghem church in the distance we steered for it and found the town full of dopey and dirty Tommies and more damaged from shellfire that it used to be. The girls had a smile for Les Australiens. Went up to the Church and found Bruce Kings grave in the cemetery. The usual churchyard full of tawdry wooden crosses. The old church tower is 800 years old but the rest of the church is new and uninviting. We went inside – a few pasteboard statues including one of Joan of Arc. Rode up to the baths which used to be the best in France but Fritz had put a shell into the officer’s portion and put them out of action. Put across to Nieppe not a bad little village & saw Donnelly of the\n\n \n\n18\/12\/17 Kortepyp\n\nPioneers who had an officer killed today. We then came out on the main Bailleul road where there was plenty of traffic and so home. In the evening one of our Lewis gunners from La Creche came back and I asked him how they got on for fuel. \"Good!\" he says, \"it’s a case of ‘hold out your bag, Digger’, & the Aussies fill it\"!. Mr. Leon Barbier had afternoon tea with us. \n\nAm suffering from a cold due to getting suddenly away from the warmth of braziers. The stoves we have send out an acrid stifling smoke that well nigh blinds one and French coal burnt in open braziers emits carbonic acid gas dangerously. Awarded punishment to some drunk & A.W.L’s.. The word \"set\" is acquiring great popularity just lately. It is used to imply \"alright\" or \"all correct\". The whole camp after dark is carefully screened to keep any lights from showing. Our wet canteen seems to be doing brisk business.\n\n \n","29":" Kortepyp\n\nAnother hard frost. Supervised the work of our N.C.O.’s school of instruction and found that they are coming on very well. Devoted nearly all the morning to trying different ones out and testing their words of command. The ground remains frozen as hard as iron and more slippery than glass. Crouching over hot stoves indoors and then going out into the cold gives us all colds. Ordered the issue of an extra blanket per man today out of our regimental store. During the afternoon drew up some recommendations for the Croix de Guerre Belge. Stewart went on leave today and Bourke came back from hospital. Half holiday this afternoon – the Band played and a football match was on. Padre to lecture on \"Rome\" tonight in the Church Army hut. A cloudless chill night.\n\n \n","30":" Kortepyp\n\nA hard frost which presented a sight beautiful and remarkable. The whole world was glistening white – the trees were outlined with icicles in every twig and looked like a lovely pattern in white lace. A narrow road runs along the front of the camp and the view looking along it is fine. The cold is intense and the men had to be kept moving. Had a muster parade and got a fairly smart turnout except for the cooks who are incorrigible. \"D\" Coy’s went on a sort of mild strike so we pushed them all back to their company and put new men on. I inspected the lines and found them fairly good. Our N.C.O’s class put in some work on handling the men of their company. They have made good progress. Two companies marched off to baths at Papot and I went over to a farmhouse close to here and had a bath in a tub. Madame \n\n \n\n20\/12\/17 Kortepyp\n\nsupplied some buckets of hot water and the tub was placed on the floor of her bedroom. For 1 franc it was possible to get wet all over. It was desperately cold coming out. \n\nOne platoon was on the rifle range this afternoon and the balance were on drill. At 5 o’c HJWiltshire came down from the 21st and then Jack (now a first Lieut.) came in and we had a yarn. Jack stayed to mess after which Lanyon lectured on Cooperation with Artillery. Main reported and I told him exactly what the position was as regards himself. After mess spent the evening with Jack talking in our little centre room which is very cosy. Some absentees are doing odd robberies round here, some are said to have murdered a boy at Nieppe & one of the 24th. was pinched for sand bagging. It is a strange war. Every indication of another freeze.\n\n \n","31":" Kortepyp\n\nStill the freeze continues but this morning is warmer & forbodes the thaw. A little sun came out later and incrusted trees formed a most lovely sight. Tried out a few N.C.Os. on the parade ground (most of the men are on fatigue). Visited Col. James and had a yarn. After lunch marched out all available men to a concert down at Neuve Eglise. At 2 p.m. inspected the Transport Section and found them all very fair and the horses comfortable. The officers of the 23rd. Battn. played us here this afternoon and we beat them at football. It became dark very early and our evenings are very long. After Mess we had a lecture by Sutherland and Groves on Intelligence and I followed with some remarks. Put in the evening writing letters &c. Fizele our artist went to London yesterday to compete in a drawing competition.\n\n \n","32":" Kortepyp\n\nMuch warmer today. The frost still remains on the ground but the trees have shed their loads of white. The sun came out and was pleasingly warm. Supervised the work of the N.C.O’s school and when they broke up addressed them and gave them a few words of advice and encouragement. This School has been a good institution and we shall keep the system going. Most men were away on fatigues. Saw our signallers at work and also our Lewis gunners – the latter were practising the Vickers gun on the range. The afternoon was a half holiday and we played the renowned 24th – losing, much to my chagrin. Our team has improved but we have no luck up to the present. The Band under Monaghan is coming on well and doing better work. Heavy & continuous bombardment about dusk. No newspapers today in Bailleul. This is the second occasion we have had a miss. Our ‘planes up and the usual observation balloons.\n\n \n","33":" Kortepyp\n\nChurch parade in Church Army hut at 9.30. marched too and from it with the band. After an inspection of the huts of one company went over to Bde.H.Q and saw the General and B.M. and discussed the work to be done up forward. A fine clear day with a cold sun. The 24th. beat us at soccer this afternoon. Bunning’s marching orders for India came. Towards dark there was an airfight between Gothas and our planes. Interviewed a draft of reinforcements who had just marched in and had a talk \nof\n with the new officer Parsons (M.M. & Croix de Guerre) a good lad who commenced with us as a private. At evening the frost was still as thick on rooves as it was first thing this morning. News today of the definite turning down of conscription in Australia – a negative majority of 200,000 so the breakup of some of the divisions appears inevitable.\n\n \n","34":" Kortepyp\n\nMuch sounds of brawling in the early hours and, exasperated, I rose and sent Bunning out to see what it was. Again after reveille was a recurrence and this time one of the huts in \"C\" Coy lines was a writhing mass of men hopelessly drunk. Put a few in the guard room and others under arrest and confiscated a petrol tin and water bottle full of neat rum that they had \"pinched\" during the night. I was very wroth and put the C.S.M and the sergeant of the guard under arrest and roused hell into the old Major. \n\nThe thaw commenced properly today and the frozen ground now has a slippery surface. At 10.30 left with Bunning to inspect our Lewis gun teams at La Creche where the guns are all laid on converging angles for barraging. Found the men cheerful and happy but so dirty and grimy & filthy. I roused King up and afterwards sent him a\n\n \n\n24\/12\/17 Kortepyp\n\ncake of soap for a Xmas present! The cobbled pave road was busy with motor lorries and caterpillars hauling big guns. Returned to camp and after dinner tried some orderly room cases. Left at 3.15 p.m. to inspect Swanton’s party at the 6th Engineers. Found them clean and very well. A thick fog came down over the country and the remains of white frozen snow and thick frost still lies on the ground. All pools are ice covered to a depth of inches. Such is our Xmas Eve 1917 and it might be much worse. Neuve Eglise has been well strafed. Its large church is roofless and ruined. A few direlict inhabitants wander round its little streets now full of soldiers. A. Smith returned from the Anzac Corps School and says it has gone off. Heavy snow has stopped train traffic round Amiens.\n\n \n","35":" Kortepyp. Belgium.\n\n150 men left early on working parties round the reserve lines. The day early was dull but fine. At 9.30 all men left in camp fell in and marched to church parade in the Church Army hut. The Band (which had played carols at reveille) marched us back to camp. At lunch a little snow fell but the outlook cleared until the middle afternoon when a heavy driving snowstorm sprang up – a remarkable sight. The snow continued intermittently after that & darkness fell on the growing whiteness of snow drift. The men for tea had soup, fish, roast rabbit & beef stuffed & plenty of vegetables, plum pudding with rum sauce, plenty of cigarettes and a Xmas parcel each from the Comforts fund. Also issued a Battalion Xmas Card to each chap. The cooks did good work & everyone enjoyed their dinner. Saw a cook thawing a boxful of rabbits tonight. Henry Crowther rang up and we swopped greetings. \n\n \n","36":" Kortepyp\n\nDeep snow covered the ground. At 10 a.m. set off with Kennedy & Dooley for the trenches to carry out an order writing business for any counter attack. The roads proved so slippery that we could hardly hold the horses up and we sent them back to the Transport lines and pushed ahead on foot. An old mill on the main road is very quaint. An enormous superstructure perched on a small base and with a big spread of sail. The miller has been grinding specially fine flour for Xmas pastry &c of surrounding units. Everything seemed quiet and peaceful looking under its carpet of snow until Ploegsteert Wood is reached. On the reverse slope of Hill 63 are some camps and a band was playing. The wood is gaunt & bare of leaf. Beside the road in a little cemetery a large grave was being dug and we soon met the corpses that were to fill it coming down on\n\n \n\n26\/12\/17 Kortepyp & Ploegsteert\n\nstretchers and covered with blankets. One was a circular shapeless mass & the poor chap must have been well smashed up. A sad Xmas. for somebody. All the undergrowth of the woods was deeply snowcovered but the sun was shining faintly. Called in at a Y.M.C.A dugout and had some cocoa and then went ahead round Hyde Park corner, still going through the wood, to Advanced Estaminet where we sat down and consulted maps. Now along a road to an artillery O.P. but it came on to snow and very little could be seen from there. Crossed over the old German front line and saw some of our mine craters – one pillbox had been blown up entire. We then went along a railway or tramline under direct observation from Warneton tower and while there was an airfight on overhead big shells were bursting aimlessly in the snow.\n\n \n\n26\/12\/17 Ploegsteert & Kortepyp\n\nTook a C.T. at Mud Corner and went up to St. Yves. The trench here runs round what was the post office of the place and some people live under it! Watched the scene from here and then returned to Hyde Park Corner. From here we caught a motor lorry back as far as the old windmill. Spent the rest of the afternoon & drafted the operation order. After mess sent for all the officers and gave them some rules about how to do fatigue – check tools &c. Cawthorne received word he is for the Indian Army – a serious loss to me. This now makes three – Bunning, Cawthorne and Alderson. Little Sutherland will make an Adjutant some day but there is a good deal of weakness among the other material. A bright cold night with the moonlight glinting on the snow and the stars just like silver winking out of the blue. Cannonade on the front.\n\n \n","37":" Kortepyp\n\nMore snow. Felt unwell so stayed abed until about 10.30. Pottered round on odd jobs and sent Major Matthews up to the line to see our working party on the job. Pottered about all day. Our dinner in the evening – General Paton and Col. James were there and about 16 other guests. 38 of our own chaps. I proposed the toast of 6th Bde & the General responded. A good evening.\n","38":" - 29\/12\/17}\n\nUnwell and stayed in bed with a heavy cold. Nothing much doing except that Brigade H.Q. rang up and said I was to have a month’s leave starting in about a week’s time. The weather still continues cold and snowy and the evenings are long and dark. Some of our young officers are very slack and don’t keep themselves aloof from the men as they should.\n\n \n","39":" Kortepyp\n\nGot up this morning about 10 am. Another dull cold day, the snow is still lying heavy on the ground but the thaw has commenced. Engaged in jobs of a routine nature preliminary to handing the reins over to Matthews for a while. Padre Lamble came in after Church parade and we spent the morning talking. Our band is improving and fresh instruments which cost 150 pounds arrived from England today. The paper this morning has a gazette and we got 4 or 5 \"Mentions\". Cawthorn and Bunning are off to England in the morning and then to the Indian Army so tonight at mess we toasted them both. H. Smith also \nleaves\n leaves at the same time for the","40":" T.B. K. \nAnderson\n Sutherland is acting as Assistant Adjutant and a smart little chap too. Putting Groves on the job as Intelligence officer.\n\n \n","41":" New Year’s Eve. Kortepyp\n\nAll available men moved out under Matthews to Ploegsteert wood to salvage and did good work there. I remained in camp and combed out any who were left in. The snow is still on the ground but is frozen into slippery snow ice. Our N.C.O’s school has been held in-doors and consequently the work is monotonous. Until the ground is dry enough for drilling the school will be discontinued. At 10.30 carried out an inspection of the whole camp and notice that the fumes of the braziers have affected the rifles and dulled the metal work. Use of covers will nullify this. Our doctor is inclined to be too easy with the sick and the result is that we have three times as many off duty as the people next door. Roused the doctor up about this. The cooks as usual are amusing and extraordinary people. At noon\n\n \n\n31\/12\/17 Kortepyp\n\nwent to Bde.H.Q and saw the General. There received my pass for England and shall leave tomorrow by train. There is a general increase of leave just now and we have no men, hardly over 12 months without it. A few of course are exceptions – usually venereal, no money or no desire to go away on leave. Gorman returned from Paris much elated with his trip there. Cawthorne and Bunning left here at 10 this morning for England we feel a blank in their room. Our canteen is an institution that is doing well and runs a good stock. Receipts go up to 40-50 pounds a day about pay but now range about 10 pounds only. A couple of different people blew in during the evening and dealing with them absorbed some time. A Gotha was over on a bombing excursion.\n\n \n","42":" Kortepyp – Boulogne\n\nAn extremely cold morning with a faint sun. The ground is like ashphalt and where the snow remains it is devilishly slippery. At 9.45 the mess cart turned up for me and drove into Steenwerck. The roads splendid but slippery and everyone muffled up. At Steenwerck boarded the leave train which was standing in a siding and settled down in an old carriage. The journey was a slow uneventful one of the usual military sort and feet were numbed and icy. Past Hazebrouck the country became deeper and deeper in snow and roads & all else were blotted out. Reached Boulogne after dark and put up at the Terminus hotel. Walked up the streets but could see little as they are so absolutely dark. Flashing electric torches &c.\n\n \n\n1\/1\/18 Boulogne\n\nHad dinner at the hotel and then went up to the officers Club up the street. It seems to be a very good and well kept place and I am sorry not to have gone there in the first place. The leave boat pulls out at 10.30 a.m. in the morning. The town is pitch dark and one cannot see more than a few paces ahead. All along the streets one gets flashes of electric torch from ships that pass in the night. An intensely biting cold wind that seems to cut through all overcoats & clothes. Shaded lights at the busy railway station where crowds of troops (leave, details drafts &c) are marching in and out all the time. English is the language most heard in the street, a few loud brawling voices coming from out of the darkness but otherwise the whole place is most deadly quiet and there is nothing doing. A number of nurses (mostly Canadian) are staying at this hotel. In the Officers Club and elsewhere are the W.A.A.C’S – a tremendous risk parents take in permitting their girls to take on work in an atmosphere like this.\n\n \n\n21\/1\/18 Boulogne\n\nHad breakfast about 9 and then strolled down on the pier and located the leave boat. A fine cold morning. Cleared out at 10 a.m. and embarked on the boat meeting Fairweather among the crowd. The men were packed on one end of the boat and the officers on the deck. Dropping out of the harbour a better idea of Boulogne could be obtained – all the houses covering the cliff sides and looking grey & old. We had a quiet but cold passage having several other ships in our convoy and being escorted by torpedo boat destroyers. Later an airship appeared – an awkward fish shaped object but it manoeuvred very neatly and came down very close to the surface of the water. There was a heavy head wind too but it did not seem to affect it. We made Folkestone about 2 pm and found Pullmans awaiting us dined on the train. The English war bread is very good and palatable. A pleasant & quick journey.\n\n \n","43":" Kent & London\n\nthrough the soft variegated countryside all much greener than France. Many hop fields with their forest of stakes & their kilns. Ran into London about 4 to Victoria Station and after trying the Grosvenor put up with Fairweather at the Belgrave Mansions. Went out up Buckingham Palace Road to make a few purchases but had difficulty in finding the way owing to the absolute black darkness prevailing. Much struck by the lack of politeness, curtness & boorishness of the people in shops – French manners & politeness have spoilt us. Went up to Piccadilly by tube and dined at Scotts on oysters bitters & cheese. Everything very dark here and the streets crowded with women. Walked round for a while & then went & saw Geo. Robey in Zig Zag at the Hippodrome. Slept long and well through until about 8.30 in the morning.\n\n \n","44":" London\n\nSome snow had fallen during the night and lay on the rooves and the footpaths. Had hot bath and then breakfasted before setting out with Fairweather for Horseferry Road. Went there and exchanged some money finding the place somewhat changed evidently for the better. The surroundings are thronged with Australians and all the shops are full of Australian goods. From here we wended our way to the Strand by bus. Westminster Abbey St Margarets and Houses of Parliament were half shrouded in mist. Trafalgar square placarded with War Loan advertisements. Up the Strand we did a good deal of shopping and then walked on to St Pauls. A flock of tame pigeons outside here were being fed by passers by. To the Cheapside and up past St. Mary le Bow and Bennetts where a Gog and Magog\n\n \n\n3\/1\/18 London Belgrave Mansions Hotel\n\nstrike the hours. From the Strand up to here is a mass of splendid shops and one cannot but marvel at this array of commerce. To the Bank of England, low windowless and squat where beadles in cocked hats and old uniforms were strolling round. The Exchange was placarded with the results of war saving campaigns in the country towns. To the Bank of Australasia to see if there were any letters and there met Mr. Blogg who asked us to come and have a chop with him. Now to the old Cock Tavern for a meal of boiled mutton & caper sauce and a pint of bitter. An old fashioned place and full of old fashioned people – here we met and English officer and drank some port with him after our lunch, going upstairs to an old sanded floored smoking room. Now by bus to Wandsworth\n\n \n\n3\/1\/18 Belgrave Mansions Hotel. London\n\nwhere we saw Thwaites & Woolf both doing well and some good little V.A.Ds. The hospital has many more wards devoted to officers now but is a very barrack like place. It was dark when we left and bussed back to Vauxhall bridge where we got a tram for our hotel at Victoria. After a wash we again set off for the Strand. The city was now all in darkness and a searchlight was playing on the clouds. Noticed today the pathetic sight of many margarine and tea queues and the police managing them. The London policemen are indeed marvels and seem to know everything. They are all alike in build and in looks. Now to the old Cheshire Cheese found after some trouble owing to the street being so black. Turning down Wine Office Court we landed in past the funny red\n\n \n\n3\/1\/18 Belgrave Mansions Hotel London\n\nbar we gained the dining room which had a huge fire, sanded floor and the old fittings of 1667. We dined well off rump steak pie and vegetables followed by toasted cheese washed down by dark ale. A couple of little dinner parties here. Much money can be saved by going away from Piccadilly for meals. Noticed cars with coal gas bags on top for driving them. A great many good looking girls here. After dinner returned to hotel and repacked my box which had come from Cox & Co’s. \n\n \n","45":" London Belgrave mansions Hotel\n\nBreakfasted in room and then set out on execution of various commissions. A raw cold foggy morning. Went by bus up Victoria Street and then up to the Bank. Went into Bank of Australasia and saw Blogg and withdrew all my safe custody packets. Then down the Poultry and bought some clothes. Went into the Church of St. Marylebone which is one of the old type of church with old tombs & monuments the latter with long eulogistic epitaphs. Went to Cooks and booked through to Penzance in Cornwall. Through streets full of most excellent shops down to St Pauls Cathedral. This great church suffers as far as realizing its size goes by being cramped in among other buildings. Unlike the Church of St Peter at Rome & the Paris Notre Dame there has been no clearance of buildings to increase the prospect. Went inside – the fog was hanging round the interior in spite of the warmth of the heaters. A few old banners hung up in the church. A portion of one was\n\n \n\n4\/1\/18 London Belgrave Mansions Hotel\n\nscaffolded up for use by workmen. On one wall is Holman Hunt’s \"Light of the World\". Rambled down the Strand buying maps and odds and ends and so back to the hotel to meet Fairweather and to lunch with him. At 2 pm we caught a train at Victoria for East Croydon and after leaving the ugliness of railway yards behind we commenced to go through suburbs. \n\nNearly every house had its little allotment under cultivation but compared with France the country over this side of the Channell is not intensely cropped and much seems idle. At Croydon we went to see the Misses Valentine & a Miss Fairweather at Chichester Lodge. Their house is right on the border of the fields and they keep 4 servants and a chauffeur to look after 3 of them!. The car is laid up just now on account of petrol restrictions. Enjoyed very much talking with these dear old ladies who are so patriotic. They have rationed themselves & do much work. \"Food\" & \"air raids\" were\n\n \n\n4\/1\/18 London Belgrave Mansions Hotel\n\nchief topics of discussion. We dined well, waited on by a silent neat maid, in quite the old English style. They had some splendid sherry with a fascinating bouquet and haunting taste. Left at 9.45 and trained to London Bridge which we walked across. The broad silent river quietly bubbling on & no one else on the bridge. Passed the monument which a policeman said was William IV & took a tube. The tube not as good as Paris. An English A.S.C officer fat, gross & evidently boozed sleeping with head on the shoulder of a little girl. Reached Victoria about 12 and made all arrangements for being called early. Nearly all the employees at this hotel are \"Swiss\". Packed up and then arranged to be called.\n","46":" \n\nUp at 7 and much bustle. Left at 9 by taxi for Paddington after the usual orgie of tipping. Reached Paddington early & put in time on the platform until getting a good seat in the heated carriage of the G.W.R. Another dull and foggy day\n\n \n\n5\/1\/18 London – Penzance\n\nThe country is looking far greener than France. Had a quick run to Taunton and enjoyed pretty scenery through Somerset and Devon. The train tore along at a good speed and though very smooth running, it gave me the usual nausea. About 6 p.m. pulled into Penzance and took a chariot to the Queens Hotel which is on the esplanade. A cold dark night with the tide dashing in. The Hotel seems a good and comfortable one and not too many other people staying here. Dined well and noticed no lack of food, washed the meal down with some excellent claret. A few other diners all in dress clothes and mostly elderly people. Did some writing after dinner and then turned in early lulled to sleep by the waves dashing up against the esplanade. Everything is spotless and clean at this Queens Hotel. \n\n \n","47":" Penzance Queen’s Hotel\n\nBreakfasted at 9.30 a.m. and found the day pouring wet with lowering clouds and all the cliffs and headlands wrapped in mist. After reading the paper, put on a raincoat over mufti and cruised round the town. Walked to Newlyn, a little quaint cobbled fishing village about a mile out, and then passed on another couple of miles to Mousehole. The road lay through a winding lane along the cliff top. On one side the dull grey sea was tumbling in on the shingle while on the other side the cliffs rose high up. Out to sea were a good many odd craft. Mousehole is rather picturesque and must be pretty on a fine day. There is no order about its streets – they wind and twist and lead nowhere. Some of the houses are very old and much below the level of the streets. The floors are made of the shingly stones cemented together. The sea comes\n\n \n\n6\/1\/18 Penzance Queens Hotel\n\nright up to the back doors and the favourite method of disposing of all household garbage seems to be to throw it straight out where the tide gets it. Many fishing boats are moored hereabouts and there are crowds of seagulls floating round. Noticed a very large flock of them lying on the waves some distance out from the shore. Today is Sunday and from many houses came sounds of hymn tunes. The people about were mostly seafaring folk wearing dark clothes, neckerchiefs and caps. A sprinkling of jacktars and naval reserve men from coastguard and life boat stations round. There seemed to be a couple of large Wesleyn chapels here and some of their congregations were coming home. Serious looking people here but the majority of girls and women are good looking. Coming home turned into the Fisherman’s\n\n \n\n6\/1\/18 Queens Hotel Penzance\n\nArms at Newlyn and there had some fried ham potatoes bread and cider for 1\/5 and the good wife said the food question was acute. Had a look round Moorab Gardens and Market Jew St. in Penzance. An ordinary country town this as far as one can judge. Sunday and wet have combined to make things dull and as it does not look like clearing up I decided to leave for Taunton in the morning. On the Esplanade about 3.30 a fair number of people were promenading. Outside one shop noticed a couple of dog bowls marked R.S.P.C.A!! A dull grey sea rolling in, dull low clouds, headlands & cliffs hid in mist, such are my day’s impressions. Dined at 7.30 in that solemn state so dear to the Englishman and then turned \nturned\n into bed early.\n\n \n","48":" Penzance & Taunton\n\nAnother dull day. At 8 o’c it was still quite dark – a heavy grey sea tumbling in. Breakfasted and then took an omnibus from hotel to station and caught the 9.45 a.m. train for Taunton. Had a good journey with some merchant service officers who had been torpedoed only a few hours before. Crossed the Dart with old wooden three deckers on it and some ships of the navy. Very beautiful scenery round Exeter and right through to Taunton which we reached at about 3. Went to the Great Western Hotel – a quiet country farmers hostelry and then set out on a tour of exploration. The town of Taunton has the air of a market town and smacks of the soil. The people speak with a soft drawl, the girls have fresh rosy complexions and the little children are the dearest imaginable. The shops seem very clean and prosperous. Walked right through the long main street and soon got out\n\n \n\n7\/1\/18 Taunton\n\ninto the country. A characteristic of southern England is the multitude of hedges. Of course being winter the trees are bare of leaf but the country is very beautiful and no wonder the Englishman so well loves his land. Snug little farmhouses, trim hedges and the most beautiful green neat meadows. Returning to hotel called in at the Post Office and noticed the whole staff with one exception is feminine – some good lookers too. In the streets W.A.A.C’s wearing issue greatcoats. – what will these girls do after the War. It is to be hoped all this taking on of men’s work wont make them coarse. At the hotel dined in solitary state – there does not appear to be anyone lese staying here. The people all seem well clothed and comfortable in appearance round here and the girls are good looking and neat. Needless to say there are a few gallant Anzacs about.\n\n \n","49":" Taunton & Bath\n\nA fine day, weak sun, and an iron ground so hard had it frozen during the night. Set out on a tour of exploration and had much difficulty in finding a way out of Taunton as the old roads and streets are most tortuous. Took a pleasant lane which led on through hedges containing much holly. After leaving one small village (Bathpool) behind the road commenced to rise and led on to the outskirts of West Monkton. Of course all the trees are bare of leaf but just here the scene is very beautiful. Heavy old rugged oaks line the road and farms snuggle down in hollows. A fair amount of stock about and the country folk are agreeable and bid one \"Good day\" as a matter of course. Towards a fine wood on the side of a hill and from here was to be had\n\n \n\n8\/1\/18 Taunton & Bath\n\na fine view of the whole of the valley of Taunton Deane backed by the Quantock Hills on top of which a Wellington Monument is prominent. In the valley is the town with three square towered churches not unlike that at Roque . Between – a land of hedges and little farms. This must be a great sight in springtime. Embowered in the wood on the side of the hill is one of the \"stately homes of England\". Followed the road round right back into Taunton and had a lunch before catching the train for Bath. The railway skirts the coast after leaving Taunton and we found ourselves in land lightly snowcovered. Entering Bristol there is a gorge with prominent suspension bridge and from the train can be had a good birds eye view of the city. Landed at\n\n \n\n8\/1\/18 Bath\n\nBath at about 3 and put up at the Royal hotel. Went into Bath Abbey a fine old place with walls thickly covered with tablets and pompous verbose epitaphs. The old Abbey dates from the 14th. century. The town appears a pleasant place and the shops good and thriving. Many soldiers about in hospital blue suits. The saluting farce is played to the bitter end and poor cripples try to salute too. There seem to be a great many historic houses here. Overlooking the town is a range of cliffs and the town is compactly in a valley. In springtime I should say that this is a very lovely place – even in winter’s grip there is a charm about it. Dined at the hotel. The solemn state of English dinner gets me down after Parisian gaiety. Meagre helpings point to Food Control.\n\n \n","50":" Bath\n\nDuring the night heavy snow fell and this morning turned out dull and dark with black snowy clouds. The footpaths were extremely icy and slippery. Walked round the old Abbey and remarked on the front. Two Jacob’s ladders of stone with angels ascending and descending. To show which were coming down as distinct from those going up the old architect has depicted the descending angels coming down head first. To the Grand Pump Room which is just like a large lounge or concert room. On one side is a fountain from which streams artesian water very clear and quite warm into a number of mugs. I took the waters. A maid hands over a mug on a bowl and it turned out exactly as Sam Weller said \"Wery decided flavour of warm flatirons with a killibeate taste\".\n\n \n\n9\/1\/18 Bath\n\nThe old Roman bath seemed to be very modern judging from the exterior. All this quarter has an old world air about it and a church near by has the flying dragon wind vane familiar from those of Wren’s London churches. Walked out of the town a little way and got among what were evidently billets – plenty of sentries outside the different houses and what seemed to be a great waste of men. The saluting damned annoying, the Tommies going to great pains to salute right across the road and almost round corners. This with the bad walking and unpleasant weather, drove me indoors so I returned to the hotel. A fog hanging over the town. Had the day been fine the view from the surrounding cliffs and high ground would have been splendid.\n\n \n\n9\/1\/18 Bath & Oxford\n\nThe afternoon continued dull and cold so remained by the fire until 3 o’c when settled up & caught the Oxford train. Had a good journey to Didcot passing through pleasant country with odd old farmhouses and green thatched little villages nestled round the small church. The countryside differs from France in being so covered with hedges – every little meadow is hedged or planted with trees. Some of the country hereabouts is heavily timbered by reason of these \"hedges\" &c but still the cultivable land is not encroached upon. Changed at Didcot and had a quick run into Oxford & to the Randolph Hotel per taxi. A very black night with cold whistling wind. After dinner sat by the Smoking Room fire and was edified (?) and amused by the conversation of 3 R.F.C subs – \"lardedah\" foul and affected.\n\n \n","51":" Randolph Hotel. Oxford\n\nA fine day with sun. The town is chock full of the most old & venerable buildings whichever way you turn and a big proportion of those not colleges i.e. private houses, inns, shops and the like also appear to be ancient. Just outside the hotel is the Martyrs cross erected some 60 years ago when the High Church movement was on, to the memory of Ridley, Latimer & Cranmer who were here tried for their anti-papal teachings. The streets are busy and full of good shops but over all is an air of seclusion & learning that is due to so many schools & college buildings. In the streets a great many cadets with white banded caps for each college has a company of aspirant officers in lodging there. Went into the old church of St Michael at North Gate – an old square squat tower with slits well adapted for bow and arrow defence.\n\n \n\n10\/1\/18 Oxford\n\nThe Ashmolean Museum is just opposite the hotel and has many old Greek & Roman marbles all mutilated of everything phallic like those of the Roman museums. Only in Naples do you meet Nature unadorned. In a cabinet upstairs is King Alfred’s jewel with a circular inscription. There was a good deal of interesting pottery of Roman days & also some Egyptian mummies &c. To the Bodleian Library which is entered through a quiet and beautiful old courtyard. On view were many old manuscripts and books, missals &c and old heathen screeds including one of the Iliad. Upstairs is a picture gallery and more manuscripts also a number of models of churches &c. After lunch set out to find New College and it is not an easy matter to find any particular place here so crowded together are all these places. Through\n\n \n\n10\/1\/18 Oxford\n\nan insignificant entrance into a courtyard encrusted with the usual old Tudory looking walls. The porter opened the Chapel door and it is in much the same condition as when opened in 1386. Most of the stained glass is original but some fine painted modern windows have been added. Saw the Reredos and the old Founders Pastoral Staff. Into the Cloisters now which run round the old green lawn and are shady and tranquil just the place for the thinker. On the walls and underfoot are inscriptions aged and numerous. Just alongside is St Peters in the East church, Norman and ancient – a small place with a large quiet green graveyard beyond which is a prospect of other green places, all remote from bustle & incongruous in a large city. Queen’s College overlooks here with 2 very fine\n\n \n\n10\/1\/18 Oxford\n\ntowers but I did not go inside. Walked down to the Magdalen Bridge which gives pleasant views of the tree lined Cherwell and a big expanse of open grass land & meadows on either side. Entered Magdalen College and had a good look round the beautiful cloisters of its secluded interior. Being winter time the creepers have no leaves – when all is green these walls and towers must present a lovely sight. The Chapel dates from 1480 and is very lovely with a stone reredos. Some cadets were drilling in the garden & the paths to river side and the walks were not open. Passed University College & All Souls College without entering and next pulled up at the Church of St. Mary the Virgin. All turrets & pinnacles and a high tower. The door has twisting stone supports surmounted by a statue\n\n \n\n10\/1\/18 Oxford\n\nof the Virgin at which a Roundhead once fired a brace of bullets. Inside the church is divided almost in two by a big screen and doors. Some of the stained glass is very lovely. This is where Cranmer was sentenced with much ceremony and where Queen Elizabeth often came. Passed Brasenose College and turned down Grove St. – a narrow old street with overhanging gabled houses. Looked at Oriel and Corpus Christi colleges from the outside and came out in meadows and green fields. Tried to find the way into the Cathedral from here but was not successful owing to no thoroughfare. Saw some W.A.A.Cs driving and cleaning R.F.C cars & cycles – some pretty girls. Returned past Carfax where busy streets meet. Here there is a tall old tower, sole relic of an ancient church. Worcester College and\n\n \n\n10\/1\/18 Oxford\n\nBalliol College are both close to this hotel. Returned to the hotel tired out and rather \"engorged\" with colleges, towers, chapels &c. To see them properly would take months as the whole city is full of them. The number of pretty girls here is remarkable but they can’t dress as well of M’dlle. There is missing just that little touch of chicness that makes the Parisienne so tempting. But they are better looking than the French by long odds. After dinner walked down the street past Carfax and back. There were very few people about and the town was dark as pitch. On returning to the Hotel went to bed early. The number of flunkeys and servants here is large. I can notice no lack of food, comfort or of fuel among the upper class.\n\n \n","52":" Oxford\n\nHeavy rain was falling early but cleared off before breakfast. Walked down through the old walks to Meadow Fields and skirted a canal before reaching the main stream of the Thames – here called the Isis. Moored here are many old barges bearing arms of the different colleges. The river is tranquil and straight and boathouses are on its banks. The course seems ideal for rowing. Although bare and gaunt owing to winter the many trees were very pretty and in Springtime these walks must be charming. Returned to the Town, first taking a look back at its many towers and spires. To Christ Church College where there is a tall old tower called Tom’s Tower opening into a large quiet secluded quadrangle. Through two little arches into Christ Church\n\n \n\n11\/1\/18 Oxford\n\nthe Cathedral of the city. On entering one is struck by the beauty of the chancel – stone fan tracery ceiling and a round rose window of delicately coloured glass. The Church is small. The mural tablets almost without exception are in Latin. There are a number of old tombs one of a mailed warrior a comrade of the Black Prince. The Lady Chapel is remarkable. The framework of two old brick doorways partly below floor level attest the existence of a previous church. As usual in most of these places most of the floor stones are tombstones too and their inscriptions are gradually being worn off by the feet of passers by. Left the Cathedral and walked back to the Hotel there to read and write. After lunch walked down round Magdalen College and round the Mesopotamian\n\n \n\n11\/1\/18 Oxford\n\nwalk which borders the Cherwell. Got right out into the meadows here it is remarkable how close the scenes of country are to Oxford. Addison’s walk was unfortunately closed but I got a fair birdseye view of the old city with its spires and towers from a rising footpath. Soft enchanting prospect. Aeroplanes looping the loop overhead. Walked up to the Carfax and round the Turl. The streets very busy and many wounded & maimed soldiers. Noticed a number of foreigners – undergraduates I suppose – including a number of Indians. Before dinner became tete-a-tete with an officer of the R.F.C and one of the West Africa Regiment consuming several whiskies which may perchance account for any irregularities or uneveness in this handwriting!\n\n \n","53":" Oxford & London\n\nRose and breakfasted by 8.30 and then took a fourwheeler for the station catching a train leaving at 9.12. A pleasant swift nonstop run of an hour into London. Taxied from Paddington to hotel and then at once caught a ‘bus to the Bank. A fine day with a cold wind. The streets of London are weirdly twisty and irregular. A big proportion of the people are in uniform and many wear the blue armbands or carry some other evidence of being in hospital. The traffic is congested and some streets seem almost wedged with vehicles but it all flows smoothly on like a great river. About the Bank there is a great concentration of streets and the busses don’t linger long to let you off. Went into Bank and got a fair number of letters. Returned to hotel and\n\n \n\n12\/1\/18 London\n\nchanged into mufti and had lunch. Took ‘bus to Westminster Abbey and had a look inside. Certainly a dear old place – dark at this season. Walked up to Trafalgar Square and past Whitehall. The gorgeous horse guard sentries attract much attention. Had a look at the dingy No. 10 Downing Street and then made for Piccadilly Circus full as usual of people of fashion and ease and the rendezvous of officers. To Leicester Square and saw an exhibition of Will Dyson’s pictures. There seems to be a touch of caraciture(?)ist about them all. Figures too tall and features exaggerated. Wandered round aimlessly and then once more by ‘bus returned hotelwards. Left by tube at 5.45 for Blackfriars station and walked from there to Fleet St which was dark and quiet. To the\n\n \n\n12\/1\/18 London\n\nCheshire Cheese and had some of the celebrated pudding, pancake and a half of bitter. Cost 4\/6. evidently restrictions are touching them up and the place is going off. To Piccadilly and Leicester Square both dark comparatively and thronged with women. I should like to see all these places lit right up properly as in peace. The London policeman is a wonder and knows everything – streets tubes bus numbers and has a courtesy that is unfailing. Back to hotel about 9.15. The bus ran into station yard and it was the Devils own job finding the hotel.\n\n \n","54":" London\n\nAbroad before 10 and walked through to Buckingham Palace grounds past the Queen Victoria memorial to the Mall. Then to St James Palace to see the Guardmounting. The Welsh Guard relieved the Coldstreams. Drill very good but class of man poor. A fair sized crowd of spectators. A fine sunny day but cold. Returned to hotel and read. Lunched and then caught a bus for Wandsworth and there saw Thwaites and Woolf meeting lady friends of each. Back to hotel before dinner and then by tube to Blackfriars up a black Fleet St. to the Cheshire Cheese for dinner and an interesting yarn to a grousing Canadian. An old cockatoo here who draws corks and does other things too. An assignation with J. for onze houres which failed to eventuate at all. To quiet sleep at midnight.\n\n \n","55":" London\n\nA foggy morning. There had been a deal of snow and rooves and chimney pots were all white with it. Breakfasted in room and then bussed up to Ludgate Hill. Went to the Central Criminal Court No. 1 mainly to see Darling J. Very few other of the public here. And now comes the arm of coincidence. The case being tried was that of Jones (a civilian) and Sharpe & Maguire, two Australian soldiers who were charged with the wilful murder of one Imlay a soldier of the Canadian Forces. The man Maguire is a member of my own 22nd. Battalion!. To think of his Colonel in sightseeing chancing upon him in an obscure court standing his trial for his life. More than that the official witness was Clive Williams of the Staff, old Charlie’s brother. There was not much scope for the wit of Darling J.\n\n \n\n14\/1\/18 London\n\nCounsel for defence\n asked one witness: - \"Did accused look agitated or as if he had just come from a murder?\"\n\nAnswer\n : - Oh, no, not at all.\n\nDarling J. to witness\n \"Have you seen a great many men who have just come from a murder?\".\n\nDuring the lunchtime adjournment went into a Lyons cafe for lunch and had a splendid lunch of sausages, plenty of fine mashed potatoes, a cup of delicious tea & a roll for 11 pence! The Court adjourned at 5 p.m. Sharpe was found not guilty of murder & sentenced to 7 years penal servitude. Did a great deal of shopping round the Strand and Fleet St. and returned to the hotel shortly after 7.30. had tea in a restaurant in Fleet St. and then back to hotel and to bed.\n\n \n","56":" London\n\nBy tube to the Bank and got my letters and then bussed down to Ludgate Circus walking thence to Old Bailey. The trial of Jones & Maguire proceeded all day and culminated at 7 p.m. when the Judge (Darling) sentenced the latter to 10 years p.s. regretting he had not added a flogging too. Then he proceeded to sentence Jones to death. An impressive scene the court in \ndarkness\n electric light, the jury lawyers police and the lean scarlet gowned judge with a black cap on. A woman crying was ejected and the crier called out \"O Yea: O Yea O Yea\" as he delivered his cautionary word. The sentence \"to be taken \nback\n to the place from whither you came and thence to the place of execution there to be hung by the neck until your body be dead and may the Lord have mercy upon your soul!\"\n\n \n\n15\/1\/18 London\n\nLunched at Lyon’s shop on good fare for 11 pence. Dined at Ye Olde Cheshyre Cheese – a good dinner of the pudding and toasted cheese. Snow and a kind of sleet were falling afterwards and the pavements were very slippery and wet. On returning to the hotel found the good old Doc Craig had come all the way up from Weymouth to see me and we spent the evening yarning. Last time we were together was in that wretched slit of trench near the Zonnebeke Lake on the dawn we attacked Ridge. The doc. was very shortly afterwards cracked and has since got his D.S.O. and transport duty to Australia. It was good to see him and to chat about past horrors sitting snug over a cup of coffee in a hotel lounge in ease and comfort on this side of the Channel\nl\n.\n\n \n","57":" London\n\nWent out with Dr Craig first to the Bank by tube. Snow was falling, but not lying long on the ground. The press of traffic round here is something enormous. Returned to Leicester Sq where we met Harricks who joined us in a look at Dyson’s drawings. Then to Piccadilly meeting McKinnon and Archer en route and then to Regent’s Palace to drink coffee and aperitifs and watch the throng of the light and dark of this place. Walked down to Simpsons in the Strand for lunch and dined well there – it is a great place for the Army. Then left Harricks and returned to Victoria to see the Dr. off. Did some writing & left the hotel again about 5 going first to Piccadilly & then walking across to the Strand & up to Fleet St. Dined at the Cock Tavern and then tubed back to Victoria and went to virtuous more or less bed.\n\n \n","58":" London & Wakefield\n\nPacked up, settled up and taxied through snowcovered streets to Kings Cross there catching a train for Wakefield via Doncaster. The whole countryside was very deep in snow and it was fortunate for the journey’s comfort that all the trains are steam warmed and heated. The \"Vicar of Wakefield\" would likely find the place altered from what it used to be in his time for it is now an unlovely town in the Black Country. Dirty looking men with filthy faces, old caps & clothes about the streets and the grime and dirt of coal dust and smoke seemed to show up all the worse by reason of the white snow mantle. Located Jake at a nursing home and there saw her and the Baby as well. She is very beautiful sideface. The baby a tiny red bundle of utter helplessness. Waited about for\n\n \n\n17\/1\/18 York\n\nan hour or two and then caught another train this time for York to where we had a good quick run in the dark. Landed out of the dark station completely at sea – everywhere quite blacked out and in utter darkness. Dived into the first place, out of dark into a world of glare and glitter – the Royal Station Hotel. Put up here and had a good dinner. Feeling very tired tonight probably by reason of some late hours that one Julie could tell something about. This is a very large hotel and seems full. Noticed today in the Black Country, broad dialect, stunted growth, and the poorer fatigued looking women using the shawl for wrap and headcovering just like those of Glasgow and of Edinburgh. Met some English friends of Jake.\n\n \n","59":" York\n\nBeing extremely tired stayed abed until 9 and breakfasted in room. A raw day with dirty snow under foot and a fog wreathing the buildings. Walked up the town crossing the Ouse a fine wide river. An old fashioned town this and all the houses and buildings are dull with age. Could not see the Minster for fog until almost right on top of it but it then loomed into sight with its large central tower. Went inside and find it a very large place and a service was in progress with much chanting by choir which afterwards passed out in procession. Owing to the thaw the whole building outside was dripping, water gushing down every gargoyle & waterpipe. Intensely cold within. Many memorials old standards and much stained glass. Vergers alert for tips infest the place. Noticed many old Oxfordian looking\n\n \n\n18\/1\/18 York\n\nbuildings about. Returned to hotel for a read and a rest. Afternoon walked round the winding streets of the town finding them busy with good shops but hard to find – as tortuous and twisty as can well be. Some of the side streets resemble the Turl at Oxford. Old houses with bulging overhanging upper stories. These old places must be unhealthy and though some are fine big places I notice that the dwellers seem of the poorer class – laundries little shops &c. To the Minster from the tower of which an elaborate peal was sounding. Very dark inside and circular gas lights were burning like Notre Dame at Paris. A service commenced – a few priests and about 20 of a choir. No congregation to hear the mummery. Back to hotel, passed gardens (ad. 1\/-) and the old city wall & gates. Feel extremely tired and fatigued at dozed for a while at hotel.\n\n \n","60":" York Edinburgh\n\nAfter breakfast to the Minster but could not look round owing to a service being in progress. A crowd of surpliced people – clerics and choir but no congregation. Down to quaint old streets for a look round, noticing several queues of poor people. Today was evidently market day, booths being down the centre of the streets with wares for sale. Noticed a youth with an epileptic attack – nearly run over. A dull chilly wet day large blocks of ice coming down the Ouse. Had lunch at the hotel and then caught the Scotch express for Edinburgh having a quick journey. Arrived at Edinburgh at 7.30 pm and was met by Colonel Craig. We dined at the Station Hotel and then walked through icy streets to Abercromby place where we drank whisky and yarned till all hours.\n\n \n","61":" Edinburgh\n\nAfter breakfast with Colonel Craig went down to his office to see some specimens of old titles and then down devious paths towards the monument called \"Edinburghs disgrace\" – an unfinished thing. Arthur’s Seat and the picturesque crags were covered in snow and the old Canongate below us was covered in the same. The footways and streets were in an atrocious state. Walked down towards Holyrood and then up through the old Canongate and noticed the old closes. All the people and the kids were dressed up in their Sunday best and the town was fully in the grip of a genuine Scotch Sunday. Some of the places are ancient in the extreme and the accent of the dwellers fell most pleasingly on the ear. We came\n\n \n\n20\/1\/18 Edinburgh\n\nup past Tron church & John Knox’s house to the Law Courts & St Giles getting a glimpse of St Giles: We then did a promenade on Princes St. and returned to 27 Abercromby Place for lunch. All the afternoon and all the evening we yarned & drank wine and whisky. The Colonel showed me all his regalia and retailed stories of all the old judges and the Law of Scotland for ages past. Grand to get into the company of a chap like this among such refinement and the ease of a well lived life. Lord Young, the Lord Low, the leaders of the clans and all the leaders of everything that is Scotland, figured large in the Colonels yarns. The kilts, the sporrans and the many trophies of chase and fishing all furnished material for anecdotes.\n\n \n","62":" Edinburgh\n\nUp early and breakfasted with the old Colonel. A dull foggy day with snow piled up on the roads where it had been scraped from the footpaths. A cab called at 8.30 and we drove to the Caledonian station & through the streets of the sombre dull Edinburgh type. The passersby all serious people on business bent, their dialect broad. \"Ay\" instead of \"Yes\". 27 Abercromby Place belies its exterior and is splendidly comfortable. Much appreciated a hot water bottle in the bed. These are here called \"pigs\". Took train for Crieff at 8.55 and the journey lies through countryside all snowy. Condensed vapour on the windows prevents looking out and a mist is hanging over the landscape. Passed Stirling, the Bridge of Allan &c but could not enjoy the scenery unfortunately. The country does not look anything like as good as it did when I was here in the summer time of 1916.\n\n \n\n21\/1\/18 Crieff\n\nChanged trains at Gleneagles and had a rather wet wait there in an old carriage. Came into Crieff about noon and was met by Audrey Craig who drove with me to Benveula Ferntower Road and there we met Mrs Craig and Sheila. Most thoroughly kind and hospitable people who are free and unaffected. After lunch went for a long walk with the two girls on very slippery and icy roads. Snow over all and a chilly enveloping mist. Returned before dark and after dinner spent the whole evening in conversation and relating anecdotes and experiences. In the bed they very kindly put a pig – a hot water bottle and in such comfort it was not hard to get good sleep and to rest without disturbance until the knock of the bringer of the morning hot water.\n\n \n","63":" Crieff\n\nThe weather was quite beastly. In the morning with Audrey & Sheila Craig walked (or rather \nslid\n) along the frozen icy roads and did some shopping round the town – a typical Scotch dull grey and eminently respectable place. To Lady Mary’s Walk a pleasant path beside a stony rushing stream. This in fine weather would be a lovely spot but now is bleak and cold. Still we very much enjoyed our walk. Afternoon we sat round the fire talking and some local people came in to tea. The Revd Hunter Smith was there and his curious wife. After dinner the happy circle again sat round and we talked on every subject imaginable. To get into a home like this with a motherly woman like Mrs Craig and dear honest girls like these is a very true joy. I did enjoy it so much and we talked on until late.\n\n \n","64":" Crieff\n\nA rather finer day but still very Scotch misty. Walked with the two girls up to the Knock – a high peak just behind the town. Ordinarily from here there is a very fine view but just now it is all obscured by the fog & clouds and such little glimpses as could be got disclosed patches of vanishing snow among the little woods of fir and other trees. We were yarning after our lunch and did not move out until 4 when we went down to tea with the Hunter Smiths at the Manse. There seems a variety of churches here. (U.P. U.F Established &c) Spent the evening with the family round the fire. Later Dr & Mrs. Burnet came and we had some music. After they had left we stayed up talking until close on midnight and then turned in. Honest direct and straight out people are the Scotch. There is an absence of affectation and artificiality that is common to the English.\n\n \n","65":" Crieff – Perth Chester\n\nBade farewell to the Craigs at 10 am and took train for Perth. Today is quite the finest day since my arrival in this part of Scotland and some idea can be gained of what the country is like. Looking from the train there is to be seen a mixture of mountain and wood with many rushing little streams. It is only a short run to Perth a large place with many factories mostly dyeworks. At 11.40 caught the London train. A girl porter came running after me with my pocket book full of money which I had left lying on the seat in the other carriage. A long journey. Changed at Crewe and reached Chester at about 8.45 putting up at the Queen Hotel. The railway stations in England are the devil – badly lighted and no name board visible. If you ask anyone on the platform what the place is, the answer is usually indistinct owing to dialect.\n\n \n","66":" Chester\n\nDid not get up until late. A beautiful fine day with a pleasant sun. Chester is, I think, excepting Oxford the oddest and quaintest town that I have yet been in. The streets are full of old gabled houses with timbered carved fronts which project over the footways. In places the footpaths ascend stairs and there are two rows of shops and dwellings. The old city walls are in an excellent state of preservation & the many stairs leading up to them allow one to walk right along the top of \nthe\n them. Went to the Cathedral a fine quiet old building. Inside a service was in progress – all choir and no congregation. Some mosaic work on the walls and the usual old epitaphs and tablets. A grey graveyard surrounds the Church. There is a very fine carved wooden choir screen and the choir stalls are very fine indeed. Leaving here I\n\n \n\n25\/1\/18 Chester. Queen Hotel\n\nwalked down to the River Dee which here is a fine stream and turns mills. From the walls is a prospect of green fields and general trimness. A high tower on one part of the Walls is where King Charles viewed his troops defeated in a battle here. Where the wall spans the main street is an ornamental clock presented by a local bigwig. The peculiarity of Chester lies in its gabled houses with their carved fronts and many recent buildings erected have been modelled and built on the same lines. The physique of many of the soldiers going about is deplorable and many of the little rats are in hospital blue. Caught the Irish Mail at 1.55 and had a passable run to London. Taxied from Euston to Belgrave Mansions and there put up for the night.\n\n \n","67":" London\n\nFine and warmer but dull. To the Bank via Underground and got out at Mansion House. Walked up past the Bank of England and then right up Threadneedle St. A solid mass of financial houses and banks – not a pretension to beauty anywhere but solid wealth and stodginess. Seedy clerks wearing that emblem of respectability – the top hat. Crowds of people running in and out of those places so like rabbit warrens. Passed through Gracechurch St. down round Old Jewry and other side streets. To Cheapside down to St Pauls and found a service going on there. Read a few letters and then went down Fleet St and the Strand to Charing Cross. Caught tube there and so back to the hotel and one more meatless day. I grow sick of eggs and fish. Cawthorne rang\n\n \n\n26\/1\/18 London\n\nup at lunch and then called. We tubed to Piccadilly, crowded fashionably, and then \ndiv\n had some afternoon tea in that gay place, the Regents Palace, there was a \"queue\" of people waiting here for their admission! The place reeking with affluent Jews. Then to the Apian Officers Club where we met Braithwaite and drank cocktails. Great rumours of a number of officers and N.C.Os (mostly decorated) being sent to Mesopot. Embarking on Tuesday – a secret job for what no one knows. After leaving Cawthorne went to Harchett’s – a swell restaurant near Piccadilly and had a dinner at 5\/10. Could not get a second piece of bread here. This place (like my hotel) reeks with foreigners. Bussed back to Victoria, the streets viewed from bustop seemed alive with lights.\n\n \n","68":" London\n\nUp and walked to St Margarets Church Westminster. The streets crowded with soldiers – many Colonials among them. The old church soon filled. Over the altar is a plain crude window – stained glass would be better. Canon Carnegie officiated. Cleared out before the sermon and made for the R.C. Cathedral. A gigantic place of red brick and as ugly as sin – perhaps by the time all the interior is faced with marble it may begin to resemble St. Peters Rome. A priest preached an excellent sermon Mass followed but was disappointing as there was no music. Dined meatlessly at the hotel and then trammed and bussed to Wandsworth hospital. All the world and its wife out this afternoon. The little kiddies are amusing. At the hospital saw Thwaites and Woolf. The place is like barracks and the missing legs and arms are pathetic. Got back to Victoria about\n\n \n\n27\/1\/18 London\n\ndark. Round here is a great soldiers centre. Went up to Piccadilly by tube – the London tube is far worse than London and to get anywhere here it is necessary to change and go by indirect routes. The Strand was thronged with its usual crowd parading up and down in the dark. Met Cawthorne in the lounge at Simpsons and stood him dinner there. It was an off night and there were not many people there. We got an indifferent dinner at 10\/- each and I was disgusted with the whole thing. Then adjoined to the Strand Palace on the opposite side of the Strand and we found ourselves in a place like the Regent Palace. Crowds of people sitting round. Girls (some with their hair down) sitting round smoking and giggling. A great amount of gladeye. Left Cawthorne about 9.30 and went back to hotel and to bed very tired.\n\n \n","69":" London\n\nFirst tubed to the Bank and went from there by bus to Piccadilly Circus. Wren’s churches meet the eye everywhere. Watched the Guard mounting at St James’ Palace and then did a great amount of walking round various parts of the City, coming right back to Westminster near the Houses of Parliament and there lunching for 8d at one of Lyon’s cafes. Walked round the outside of the Abbey and round to the Commons. Returned to hotel and changed into uniform and then went along to Berkleys to get service stripes &c sewed thereon. Met a Rhodesian officer here who was in the guns on our left at Bullecourt. To the House of Commons and had to wait until 3.15 before getting admitted and had an interesting talk to an American doctor.\n\n \n\n28\/1\/18 London\n\nFound that beyond a few questions there was nothing interesting being done in the House and a debate commenced on National Registration which soon emptied the house and galleries. Dined at a little café near Victoria Station and then back to Hotel. About 9 p.m. an air raid commenced and the guns opened up briskly. The people in the hotel congregated on the stairs. No wonder they get the wind up – I looked out of my top window and a dud descended too close to be comfortable so I went down to the ground floor. Could hear the aeroplane engines quite plainly and also the sound of falling bombs. Turned in at about 10 p.m.\n\n \n\nIn Lone Pine in an angle of trench the withered wizened dead hand of a corpse protruded itself from its grave. To this hand some of the boys affixed a placard \"Give it backsheese\" and put a few piastres in the rotting palm.\n\nAfter Bullecourt. \"Coming out\". Our horses were waiting and we cantered back to camp. Later poor tired exhausted men just out of hell, started to come in one by one. Then one called out to others plodding in. \"There’s hot tea\". The pathos of it!\n\n"}}