{"Document Name":{"0":"Diary_0505","1":"Diary_0505","2":"Diary_0505","3":"Diary_0505","4":"Diary_0505","5":"Diary_0505","6":"Diary_0505","7":"Diary_0505","8":"Diary_0505","9":"Diary_0505","10":"Diary_0505","11":"Diary_0505","12":"Diary_0505","13":"Diary_0505","14":"Diary_0505","15":"Diary_0505","16":"Diary_0505","17":"Diary_0505","18":"Diary_0505","19":"Diary_0505","20":"Diary_0505","21":"Diary_0505","22":"Diary_0505","23":"Diary_0505","24":"Diary_0505","25":"Diary_0505","26":"Diary_0505","27":"Diary_0505","28":"Diary_0505","29":"Diary_0505","30":"Diary_0505","31":"Diary_0505","32":"Diary_0505","33":"Diary_0505","34":"Diary_0505","35":"Diary_0505","36":"Diary_0505","37":"Diary_0505","38":"Diary_0505","39":"Diary_0505","40":"Diary_0505","41":"Diary_0505","42":"Diary_0505","43":"Diary_0505","44":"Diary_0505","45":"Diary_0505","46":"Diary_0505","47":"Diary_0505","48":"Diary_0505","49":"Diary_0505","50":"Diary_0505","51":"Diary_0505","52":"Diary_0505","53":"Diary_0505","54":"Diary_0505","55":"Diary_0505","56":"Diary_0505","57":"Diary_0505","58":"Diary_0505","59":"Diary_0505","60":"Diary_0505","61":"Diary_0505","62":"Diary_0505","63":"Diary_0505","64":"Diary_0505","65":"Diary_0505","66":"Diary_0505","67":"Diary_0505","68":"Diary_0505","69":"Diary_0505","70":"Diary_0505","71":"Diary_0505","72":"Diary_0505","73":"Diary_0505","74":"Diary_0505","75":"Diary_0505","76":"Diary_0505","77":"Diary_0505","78":"Diary_0505","79":"Diary_0505","80":"Diary_0505","81":"Diary_0505","82":"Diary_0505","83":"Diary_0505","84":"Diary_0505","85":"Diary_0505","86":"Diary_0505","87":"Diary_0505","88":"Diary_0505","89":"Diary_0505","90":"Diary_0505","91":"Diary_0505","92":"Diary_0505","93":"Diary_0505","94":"Diary_0505","95":"Diary_0505","96":"Diary_0505","97":"Diary_0505","98":"Diary_0505","99":"Diary_0505","100":"Diary_0505","101":"Diary_0505","102":"Diary_0505","103":"Diary_0505","104":"Diary_0505","105":"Diary_0505","106":"Diary_0505","107":"Diary_0505","108":"Diary_0505","109":"Diary_0505","110":"Diary_0505","111":"Diary_0505","112":"Diary_0505","113":"Diary_0505","114":"Diary_0505","115":"Diary_0505","116":"Diary_0505","117":"Diary_0505","118":"Diary_0505","119":"Diary_0505","120":"Diary_0505","121":"Diary_0505"},"Date":{"0":"unknown","1":538.0,"2":540.0,"3":544.0,"4":545.0,"5":546.0,"6":547.0,"7":548.0,"8":562.0,"9":563.0,"10":568.0,"11":569.0,"12":570.0,"13":572.0,"14":573.0,"15":575.0,"16":580.0,"17":581.0,"18":583.0,"19":586.0,"20":587.0,"21":588.0,"22":592.0,"23":595.0,"24":596.0,"25":597.0,"26":598.0,"27":599.0,"28":600.0,"29":601.0,"30":603.0,"31":604.0,"32":605.0,"33":606.0,"34":607.0,"35":608.0,"36":609.0,"37":610.0,"38":611.0,"39":612.0,"40":613.0,"41":617.0,"42":621.0,"43":625.0,"44":626.0,"45":627.0,"46":628.0,"47":629.0,"48":630.0,"49":631.0,"50":632.0,"51":633.0,"52":639.0,"53":640.0,"54":641.0,"55":642.0,"56":643.0,"57":644.0,"58":645.0,"59":646.0,"60":647.0,"61":648.0,"62":649.0,"63":650.0,"64":651.0,"65":652.0,"66":653.0,"67":654.0,"68":655.0,"69":656.0,"70":664.0,"71":665.0,"72":666.0,"73":667.0,"74":672.0,"75":675.0,"76":676.0,"77":677.0,"78":678.0,"79":679.0,"80":680.0,"81":682.0,"82":683.0,"83":684.0,"84":685.0,"85":693.0,"86":696.0,"87":698.0,"88":700.0,"89":701.0,"90":702.0,"91":703.0,"92":704.0,"93":705.0,"94":706.0,"95":707.0,"96":708.0,"97":709.0,"98":710.0,"99":711.0,"100":716.0,"101":717.0,"102":718.0,"103":719.0,"104":720.0,"105":721.0,"106":722.0,"107":723.0,"108":724.0,"109":727.0,"110":728.0,"111":729.0,"112":730.0,"113":731.0,"114":732.0,"115":733.0,"116":734.0,"117":735.0,"118":736.0,"119":737.0,"120":738.0,"121":739.0},"Entry":{"0":"\n\n","1":" \n\n Troops embarked, horses and all equipment taken aboard in 2 hours. Left No6 wharf at Woollamaloo at 12.30PM. Great send off. Troops were ordered down below until away from wharf. Anchored in Athol Bight. Motor launches visited Suevic conveying friends. I sent 2 letters by launches to Liela. No body allowed on board.\n","2":"\n\nA busy day with friend in launches. Left Sydney harbour at 4 PM (Sunday). Rough weather outside Sydney heads. I was on main guard on ship on Forecastle head. Was ordered down from post owing to waves washing over.\n","3":"\n\nArrived at Adelaide 4 PM After a deal of trouble we obtained leave went into the city. Good walk round very quiet, but fed well, returned home to ship (late) and got aboard safely.\n","4":"\n\nVaccinated before arriving at Adelaide. Arrose at 4 oclock AM unclipped horses,(no breakfast) (Raining hard) Rode one and lead 3 took them about 14 miles, horses very frisky and almost unmanagable.Arrived at Remont Depot at 3 oclock PM (no dinner) still raining hard. Port lock to Suevic at 9.30Pm No tea. Had bread and Cheese for supper\n","5":"\n","6":" sick from vaccination, but not bad.\n","7":"\n\nFeeling worse off duty.\n","8":"\n\nCrossed the equator 3PM. Father Neptune was on board, I was on guard. One man met with accident (not serious)\n","9":" \n\nOne of the crew committed suicide by taking poison.buried at 6 oclock next morn. Was up and at service (buriel)\n","10":"\n\nEngllish destroyer passed after warning us. Fine weather still continues.\n","11":"\n\nNearing Arabian coast, battles. cruisers about. News signalled that we are just intime as the Turks were advancing on Aden.2Pm anchored in Aden harbour.Aden presented a wonderful appearance being in mountains and valleys. News from Colonel that we may be in action in a few hours, preparations made at once. 3 cheers went up at the news.\n","12":" \n\nSeveral transports in harbour. One battles. Indian troops. 10,000 Turks within 6 miles of Aden Forts. Came through from Suez Canal. Terrific heat here, almost unbearable. Many letters posted to Australia. Still wrapper and four also to Leila.\n","13":"\n\nHad a route march through Aden out to the forts about 5 miles each way,bad enough for 26, terrible heat. Returned nearly all knocked up. We were fully arrived.\n","14":"\n\nAden. Very sever short sand storm blotting out everything. Prevented ships getting out of harbour.\n","15":"\n\nLeft Aden Harbour 8 AM. I was on Sunday morn service at time. Destination still unknown\n","16":"\n\nPassed much traffic in Red Sea. One steamer blown on rocks on African Coast. Arrived at Port Suez at 4 PM. cool weather. Remained 2 days here.\n","17":"\n\nSteamed into Port Tewfik (Suez) and disembarked. Took train from wharf to Cairo, 61\/2 hours in train. Marched to Heliopolis late at night, slept on sand.\n","18":"\n\nNothing doing, so sneaked out of camp and got into Cairo. Cairo in parts very up to date. Fine City. Got back safely. A mail arrived but none for me.\n","19":"\n\nWent to Heliopolis. Walk around with friend (Seale). Being pay night soldiers became disorderly and set fire to street in Cairo. (Disputable street) was thrown on fire\n","20":"\n\nHeaps of letters and card posted to Australia.\n\nAug.1st\n\n All leave stopped owing to behaviour of soldiers. Some of","21":" rendered good service at fire. Brave fellows.\n","22":"\n\n Anniversary of beginning of war and Pay Day ( Great excitement)\n\nAug.6th\n\n2000 wounded from Dardanelles arrive at hospital. No leave yet.\n","23":" \n\nReed helmets today (very necessary).\n","24":" \n\nPut in pass for Cairo but declined. Rotten luck. Still patchy letter delivery.\n","25":"\n\n The 12 supplied guards for Cairo, hospitals, wireless station and Meadi Prison\n","26":"\n\nWent down to Meadi prison (Turkish prisoners taken to Dardanelles) Weather very hot. I was put in charge of posting\n","27":"\n\nB squad fell in 7.30 AM. For guard\n","28":"\n\nA report that Acka Baba had fallen to us with 35,000 casualties, went for walk with friend Pauls to native village and was not welcomed. Got reprimanded on return for going, as we were warned that the natives were not friendly.\n","29":"\n\nOur guard greatly complimented by imperial officers\n","30":" \n\nMahmud’s Xmas day, crowds od natives passing prison on camels, donkeys and carts of all description. Confined to camp owing to natives holiday.\n","31":" \n\nWent to Meadi picture show with Pauls (very poor, us too).\n","32":"\n\nWent to zoo with friend Seal was too hot to appreciate it. Our mascots were taken there (kangaroo) spent evening listening to excellent band in park in Cairo. Caught 9.30 train to Meadi\n","33":" \n\nReports of Seranic being sunk by Turkish Submarine. Col. Abbott says we are shortly to go to the front. Caught a spy took him to Alexandria.\n","34":"\n\nSeveral men down with Nile fever. I am OK at present. All leave stopped owing to our men noisily returning home to prison\n","35":"\n\nLeft Meadi Concentration Camp at 3.30 for Heliopoles. Upon arrival in camp we were warned that we were leaving for the front in two days time","36":" Went out late to cable the news to Australia, but could not do so.\n","37":"\n\n At 5.30 Am. Started off Seale and I to the Citadel by transport wagon, we were Guarding same. We had to fetch 80,000 rounds ammunition to Helinere station and remain there and guard it. Was relieved at 9.30 PM at night (no food all day). After getting back to Camp we had to pack all our gear for an early start next morning. No time for bed that night. \n","38":"\n\nWas up at 4AM. And after a sad farewell from Major Baker, started for station with a heavy kit. 3 hours train journey brought us to Alexandria where we embarked on ship bound for Lemnos (Dardanelles). There were 2 regiments on board packed terribly, small boat. Most unpleasant trip owing to scarcity of space. The journey occupied 4 days. Anchored off Lemnos \\Island, landed into 2 smaller boats\n\nContinued 4 hour trip brought us to Gaba Tepe there was terrible fire going on left flank, landed without mishap but awfully excited. A stray bullet fell between my legs after passing through the folds of another man’s coat (My welcome). We then marched along the beach (2.30AM. Sunday morn) into a place called Rest Gulley where we slept for a few hours on the ground.\n\nAug 24th \n\nMoved off in afternoon after speech from Col.Abbott. The 12th were split up into Squadrons ours (2nd) went to reinforce","39":" LH Regiment at Shrapnel Green (Gaba Tebe).\n","40":" 25-28\n\nSpent in trenches, behind firing line, 50 yds in rear, shells bursting all around us. No loss of life to us.\n","41":"\n\nB squad went into firing line at Lonesome Pine the worst place on the right flank. Stench from dead bodies (terrible). Shell 7.5 burst a few yards to rear of our troop enroute to trenches. It buried several men, killed 2 and badly injured one. Our troop Sergeant had a bad shock was hit by sandbag. Lonesome Pine was the scene of a vigorous attack by Australians few days previous to our arrival. Counter attack by the Turks. Dead numbered many thousands. Trenches full of dead. Spent 48 hours in trenches, heavy firing all through. These trenches are 6 yards from enemies, and in one place we have a sniping post absolutely in Turkish trench. I spent 48 hours there, but accounted for nothing. An 8 hour armistice to bury the dead. Maggots and flies terrible, scrawling over everything, including myself. A rotten place.\n","42":"\n\nHad 3 days spell from firing line. A few men wounded, but no deaths. We were on water fatigue every day while resting. Water has to be pumped from landing place 1 mile along beach and we go down to beach and carry it up the hills in Kerosene tins. Often under shrapnel fire. Many men get sniped at on beach by a Turk who they cannot locate. Everyday someone is shot. Burials every night. Plenty of lead flying about.\n","43":"\n\nSeveral of our men getting sick. Seale and another man sent off the Peninsular to recover. Men picked out to be sappers for tunnelling. This was very much against our liking for we had to leave the troop, but found we had by far the best time. We all (troops included) moved to another point called Holey Spur. We went into tunnel, others into firing line. First day Roberts (Solicitor of Sydney) was shot through the brain (our first Death). We were tunnelling to Turkish Trenches and heard Turks working underground making for our trenches to blow us up. We started to intercept them, we waited and blew up.\n","44":"\n\nStill tunnelling 8 hours per day have to guard tunnel at night in complete darkness and silence. (A great drain on nerves)\n","45":"\n\nSame as above except that I was able to get a whole nights sleep. The first for nearly a fortnight. In the afternoon our dug outs were holly bombarded with shrapnel, some narrow escapes. My waterproof sheet has several holes from shrapnel\n\nContinued but none touched me. 7 \naround\n casualties resulted. Several dug outs blown away one shell unearthed a dead Turk. Dug out 10 yds from me shattered some of the equipment found 100 yards away.\n","46":"\n\n Came of sapping duty and immediately had to go; into firing line at Holy Spur(Gaba Tebe) sniping all day with periscope rifle. Turks trenches about 100 yds away, but snipers everywhere. A few of our men wounded. More men sick (bad) leaving for Lemnos Island belonging to; the Greeks. Our gully hotly bombarded every morning and afternoon ,Thinking seriously of trying somewhere else. Cookhouse blown up by a shell. Several cases of shock (our Major McIntosh wounded during our first night in firing line) he has proceeded to England\n","47":"\n\nStill in firing line. It is impossible to leave it. What little sleep I get in the trench, meals are bought to me. Shall be in firing line about 7 days without spell.\n","48":"\n\nStill no move . In firing line .Snipers very busy. Rumours of Narrow\n\nFalling within a fortnight, sincerely hope so.\n","49":"\n\nMail arrived from Sydney conveying 5 letters for me (3 from L. 1 each from Hettie and The Glen. Start to reply immediately\n","50":"\n\nStill in trenches. Snipers very busy every night. In dangerous possy faulty sandbags.\n","51":" to 18 as above snipers day and night\n","52":" Last night barbed wire entanglements were thrown out. Snipers particularly active. No sleep at all owing to cold winds etc.\n","53":"\n\nStill sniping in firing line. Very cold day .Our portion of trench to be renovated tonight. Great care will have to be exercised.\n","54":"\n\nStill in firing line. At night-8oclock we had bright coloured flares lighted, the men in firing line had to keep waving their bayonets above the parapet to draw fire. At 8.10PM we fired off 10 rounds per man, which brought heavy gun fire bombs, we had a fairly warm time for an hour, when it gradually slackened off. Shells and shrapnel were bursting all around us. (7.5s)The idea of this demonstration was to tell the strength of the Turks in this particular spot. They imagine we are about to charge and being a bit nervous, which is a recognised fact they respond freely with every kind of fire possible. We had no casualties but 7 men were killed a little distance off.\n","55":"\n","56":"\n","57":"\n\nStill on duty in firing line.\n","58":"\n\nThis morning at 7AM the Turks attempted to blow up past our firing line, our underground tunnel, but misjudged the distance. They hurt no one in fact, did not injure our trench in the slightest. Ache Baba has been under a most heavy bombardment from our navel guns for the past 2 days. This morning an official cable came through from France\n\nContinued.. stating that 1700 prisoners had been taken from France and had gained a lot of new country covering a distance of 20 miles. The Col. had the cable read all along the firing line. I have bad cold \nam fairly rotten\n am feeling rotten\n","59":"\n\nStill in firing line with bad cold feeling very tired and heavy\n","60":"\n\nIn firing line, was relieved out of firing line for 2 hours in the afternoon. Shells bursting all around me. Heard news that morn from France that 20,000 prisoners had been taken and 4 miles of country 20 miles wide. Last night there was a lot of bomb throwing here.\n","61":"\n\nIn firing line our troops lost 2 men killed and 2 wounded lst night. Col. Rirey wounded slightly last night also.\n","62":"\n\nIn firing line, another one of our troop killed this morning by 7.5\n\nAche Baba being terribly bombarded etc. Good news reported from France, Germans in retreat.\n\nRelieved from firing line after 264 hours (11days) When in trenches we are not allowed to loose of boots or even our gear. Awake or rest up (about 50 hours sleep in 11 days and nights, the rest is duty) \n relieved\n A few hours rest and on duty again, listening in No 8 tunnel, at 11.30PM. Thursday night (Pauls with me,) this is a weird job, under Turkish trenches. Am on duty here until 2.30AM and then sappy from 8Am till 12.30 PM tomorrow. This constituted the spell from the firing line. SM Kells was wounded in left arm on","63":" whilst fixing up a sand bag at night in next possy. Recd news from our Asiatic flank that they had the Turks on the run and were making towards Bagdad. Posted letter to Leila yesterday.\n","64":"\n\nTaken out of firing line and put on sapping, a most welcome change\n","65":" and","66":"\n\nSapping 3rd night had a whole night off\n","67":" \n\nWas moved over to Gully for a rest which means no firing but many fatigues, all more or less under fire from Turkish gun. I was one of a party chosen to make a 6 ft.mule track out of a 2 foot wide tunnel. After working for about half an hour we were most severely bombarded. The worst we have ever experienced up to date. It was to cover their reinforcements who were going into their trenches. The shrapnel fairly rained on us. They did little damage we only lost 3 men near us. The first 6 shells burst simultaneously. The Turkish troops massed at Lonesome Pine ( about 1 mile to our left) (Holly Spur). We had to be in readiness as we expected something was doing, but nothing has\n\nContinued happened yet, except demonstrations. I think the enemy have exhausted their stock of ammunition, for they have been very quiet ever since, until last night.\n","68":"\n\nOn fatigue I have a cold and headache. Afternoon feeling much worse temperature rising. Paid a visit to the doctor thinking I had a fever. My temperature was 101° told me to get to bed, and keep quiet and see him in the morning.\n\nOct.6\n\nVery much better today. Temperature normal. Put on light duty. Went on guard at mouth of a tunnel at night. Put on light diet but preferred a feed if only Band B \n\nOct.7th\n\n On usual fatigues water at 5.45Am. We get the water from the \"beach \"and have a very hard climb on return. Another water fatigue at 9 o’clock then some days 2Ms fatigue 10.30 Mess orderly for dinner, water again at 2o’clock, clean up portion of trench. Tunnel guard at 6 o’clock PM until 6 AM next morning when I have to go straight down for water to the beach. This is what is known as Rest.\n","69":" 8,9,10,11,12,13 spent in similar manner as above.\n","70":" \n\nReturned to firing line.\n","71":"\n\nHad a big demonstration we used star shells over artillery bombarded enemy positions also gun boat. This was trying their (Turks) strength. They responded freely.\n","72":" 15,16,17,18 \n","73":" old day\n","74":"\n\nIn firing line. Demonstration at 4 o’clock Am A party of Queenslanders went out to draw fire. Turkish fire again feeble. A few days previous a small party went out but have never returned.\n\nOct.23\n\nWet morning, started raining but night got wet (little) and had to erect sheets to exclude water.\n","75":"\n\nRelieved from firing line to go on sapping\n","76":"\n\nJ Fitzpatrick caught asleep on post (listening in tunnel) Remanded for Court Marshall I have night off so wrote to L. Very cold night. Heavy bombardment in Narrows\n","77":" Our gun boats still bombarding the Narrows. Very cold day. Raining.\n","78":" As above\n","79":" Milder day. We recd. a very heavy shelling from Turks at \"Olive Grove\".4-6 shells bursting at a time. I thought my time had come was lying in my dug out but it only got stones and dirt.\n","80":" Not feeling too grand. Our part of fighting line being strengthened owing to expected attacks from Turks and Bulgarians. Deepening all trenches against enemies artillery\n","81":" Am better. I was nearly hit by 7.5 centimetre shrapnel. Turks have never given position. I find that there are only 2 of us left from original tent of 13\n","82":" Still holding same position. Last night a Turk came into our lines and gave himself up. J Kirkpatrick was found guilty today. Sentence will be shot or not less than 2 years, but an appeal is to be made by Major Westgarth.\n","83":" 3o’clock Am Listening at end of No 9 tunnels. At 5.45 Pm sent into trenches after 7 days sapping (some men sapping for 4 weeks) Very quiet day. This morning as friend and I went down to the beach for water we were 1 mile from Gaba Tepe a bullet passed between our two heads, and hit a bank a few feet in front of us.\n","84":" till 11 Nothing further than narrow escapes. A wounded man was declared dead grave dug and about to be lowered when he \nmoved an arm\n spoke and found to be alive was immediately sent down to hospital ship all I can recall until\n","85":" My friend Searle returned from Egypt.\n","86":" Cape Halles severely bombarded by our war ships. Trenches taken by French and British. Bad thunder storm at night.\n","87":" Relieved from firing line and went into dugouts on side of hill. I was on Ration fatigue (down to beach) at night, caught in heavy gale rain terrible and got drenched. Sea very rough washing up against cliffs we had to dodge waves to get along.\n","88":" Fatigues 2o’clockPm went into chathams Post (our lately taken trenches) was bomb throwing, and was complimented on good work. Spent very cold night, nowhere I could get a rest.\n","89":" Relieved at 2.30Pm returned to rest camp. On fatigues. Digging fatigues at night (new Divisional quarters)\n","90":" More fatigues\n","91":" Fatigues. Heavy bombardment by war ships and land batteries. On tunnel guard at night till 6.30Am next morning.\n","92":" Holdon was shot through head, died 2 hours later I was up Chathams Post at 4 o’clock Pm was on listening in concealed firing line relieved 8 oclock next morning\n","93":" Feeling rotten (exhausted) but had to do 3 water fatigues in afternoon. Tunnel guard all night.\n","94":" Day fatigues. Digging at night till 11 oclock. Feeling knocked up.\n","95":" Day fatigues. Ration fatigue at night. Terrible night. Severe thunder storms. So dark couldn’t follow the mules home, had to hold each others coats, soaked through. Had to sleep in wet cloths (very cold) and clothes still wet. Turks attacked here and were repulsed with losses. Orders, not to fire shot ( or big guns) for 3 days unless attacked.\n","96":" Cold all day raining. Fatigues as usual.\n","97":" Still very cold. Night and day fatigues.\n","98":" Fatigues and Chathams Post. Gas used my eyes very sore.\n","99":" A friend Ted West (Englishman) killed shot through the head.\n","100":" Very heavy bombardment by warships and land batteries at Cape Helles. Feeling rather off colour and weak.\n","101":" Returned to firing line, on the way I met Patterson an old Parmitarian. Had very interesting conversation about old times.\n","102":" Recd. letter from L, Albert and England. Quiet day in firing line. Weather warmer.\n","103":" My Birthday. Feeling excellent. Plenty bombs about, otherwise quiet.\n","104":" Quiet day\n","105":" My narrowest escape up to date. Our firing line swept by 7.5 centimetrer guns. Had just finished writing letter when a shell burst over my head. An oil sheet which was over my head only 1 foot away was blown to threads, my mess tins riddled and the possi in a fearful mess. A piece of my shirt (I was not wearing) blown to pieces a big hole blown in the wall of possi only 2 feet from me. Felt a little nervy for a couple of hours. Otherwise everything O.K.\n","106":" Dull day. News of our going off Peninsular to mount and go to \n","107":" Take up position lowere down the line 4th LH going away (unknown destination)\n","108":" Quiet day getting colder.\n","109":" 12.15AM to 12.45 AM Silent Demonstration. Drew heavy rifle and machine gun fire 2.15AM till 2.45AM Silent Demonstration. Turks were very nervie.\n","110":" Spy caught in our line last night spy also captured on","111":" last. On","112":" Lone Pine bombarded by Turks resulting in 200 casualties several men buried in tunnels broken in by shells. 2 men were found to be still alive the next day, others all perished. \nPrisoners stated\n that the Turks intended to charge at night but they all refused to leave their trenches.\n","113":" At 5 oclock PM evacuated Gallipoli Peninsular (First Party) our boots were muffled. Carried 80lbs pack left beach at 6.30PM without a shot from \"Beachy Bill\" which had been inflaming the beach for weeks. Spent night on S.S Abassia. Arrived at Lemmos at 3 oclock AM (I was on deck). Transhipped on to S.S \"Winnifredian\" at 12 oclock noon,and at 4 oclockPM again transhipped onto S.S \"Beltanna\" Remaining off Lemmos Island.\n","114":" Up early waiting for rear guard to arrive from the peninsular. Rear guard arrived during the morning. The evacuation was a complete success. All mines were successfully exploded the Turks opened up very heavy fire as a response. Mines were from the beach as last man was leaving . (4oclockPM) we are waiting to move off any minute. We have moved alongside the S.S \"Magantic\" Have been aboard her several times, and looked over her. She is a beautiful ship. She has been chased 3 times by torpedos. This morning I saw a cabin boy fall down the hatch (about 50 feet but he was not killed). The harbour is full of interest. Gun boats of all nationalities here. Am mess orderly today. Food fairly good after \nIron rations\n","115":" Still on S.S\"Beltanna\" anchored against S.S \"Magantic\" Changed our anchorage. Moved out the heads at 4.30PM. Sea slightly rough. (The heads are closed during the night with a line of mines and submarine nets stretched across) Ship is in total darkness. Every man has to carry a life belt with him day and night. (Am mess orderly)\n","116":" Full muster parade in morning with life belts and life boats allotted as we are in a very dangerous submarine\n\n \n\nContinued quarter. We are taking Zig Zag course. Every man has to remain at the life boat allotted to him until after 6oclockPM\n","117":" Still on S.S\"Betanna\". Dull day ship taking very eratic course (describing circles\n","118":" Wet day, Parade at 11AM\n","119":" \nXmas day\n Up at 6 oclock. Alexandria llight house sighted. Ship unable to enter harbour untilday light was circling about outside. Ship went in and anchored in outer harbour until 5oclock. We disembarked at 7 oclockPM . Entrained at wharf for Alexandria. Train left at 7 oclockPM arrived at Alexandria at 2 oclockAM Sunday morning. Marched into Lictown Camp (Heliopolis) and slept in mess sheds.\n","120":" (\nBoxing day\n Was up early and had a breakfast of doughnuts sold by the natives. Had a walk into Heliopolis and had dinner there. The afternoon was spent in distributing comforts from Sydney.\n\nMr Hampton (our troop officer) paid for a dinner for 10 of us at Heliopolis House (8oclock dinner). It was real excellent. The whole affair was under my direction entirely, and everything was successful. We all arrived home at camp horribly sober.\n","121":" Have had breakfast consisting of butter and jam cake (the comforts) and am now ready to move off to Meade Camp situated about 14 miles . I think it means a march too.\n\n"}}