{"Document Name":{"0":"Diary_0519","1":"Diary_0519","2":"Diary_0519","3":"Diary_0519","4":"Diary_0519","5":"Diary_0519","6":"Diary_0519","7":"Diary_0519","8":"Diary_0519","9":"Diary_0519","10":"Diary_0519","11":"Diary_0519","12":"Diary_0519","13":"Diary_0519","14":"Diary_0519","15":"Diary_0519","16":"Diary_0519","17":"Diary_0519","18":"Diary_0519","19":"Diary_0519","20":"Diary_0519","21":"Diary_0519","22":"Diary_0519","23":"Diary_0519","24":"Diary_0519","25":"Diary_0519","26":"Diary_0519","27":"Diary_0519","28":"Diary_0519","29":"Diary_0519","30":"Diary_0519","31":"Diary_0519","32":"Diary_0519","33":"Diary_0519","34":"Diary_0519","35":"Diary_0519","36":"Diary_0519","37":"Diary_0519","38":"Diary_0519","39":"Diary_0519","40":"Diary_0519","41":"Diary_0519","42":"Diary_0519","43":"Diary_0519","44":"Diary_0519","45":"Diary_0519","46":"Diary_0519","47":"Diary_0519","48":"Diary_0519","49":"Diary_0519","50":"Diary_0519","51":"Diary_0519","52":"Diary_0519","53":"Diary_0519","54":"Diary_0519","55":"Diary_0519","56":"Diary_0519","57":"Diary_0519","58":"Diary_0519","59":"Diary_0519","60":"Diary_0519","61":"Diary_0519","62":"Diary_0519","63":"Diary_0519","64":"Diary_0519","65":"Diary_0519","66":"Diary_0519","67":"Diary_0519","68":"Diary_0519","69":"Diary_0519","70":"Diary_0519","71":"Diary_0519","72":"Diary_0519","73":"Diary_0519","74":"Diary_0519","75":"Diary_0519","76":"Diary_0519","77":"Diary_0519","78":"Diary_0519","79":"Diary_0519","80":"Diary_0519","81":"Diary_0519","82":"Diary_0519","83":"Diary_0519","84":"Diary_0519","85":"Diary_0519","86":"Diary_0519","87":"Diary_0519","88":"Diary_0519","89":"Diary_0519","90":"Diary_0519","91":"Diary_0519","92":"Diary_0519","93":"Diary_0519","94":"Diary_0519","95":"Diary_0519","96":"Diary_0519","97":"Diary_0519","98":"Diary_0519","99":"Diary_0519","100":"Diary_0519","101":"Diary_0519","102":"Diary_0519","103":"Diary_0519","104":"Diary_0519","105":"Diary_0519","106":"Diary_0519","107":"Diary_0519","108":"Diary_0519","109":"Diary_0519"},"Date":{"0":"unknown","1":1538.0,"2":1541.0,"3":1542.0,"4":1543.0,"5":1544.0,"6":1545.0,"7":1546.0,"8":1547.0,"9":1552.0,"10":1553.0,"11":1554.0,"12":1555.0,"13":1557.0,"14":1565.0,"15":1566.0,"16":1567.0,"17":1568.0,"18":1571.0,"19":1572.0,"20":1573.0,"21":1574.0,"22":1575.0,"23":1576.0,"24":1577.0,"25":1578.0,"26":1579.0,"27":1580.0,"28":1581.0,"29":1584.0,"30":1585.0,"31":1586.0,"32":1587.0,"33":1588.0,"34":1590.0,"35":1591.0,"36":1592.0,"37":1594.0,"38":1595.0,"39":1596.0,"40":1597.0,"41":1598.0,"42":1599.0,"43":1600.0,"44":1604.0,"45":1605.0,"46":1606.0,"47":1607.0,"48":1610.0,"49":1612.0,"50":1613.0,"51":1615.0,"52":1617.0,"53":1621.0,"54":1624.0,"55":1628.0,"56":1629.0,"57":1630.0,"58":1631.0,"59":1632.0,"60":1633.0,"61":1637.0,"62":1638.0,"63":1639.0,"64":1640.0,"65":1641.0,"66":1645.0,"67":1652.0,"68":1653.0,"69":1654.0,"70":1659.0,"71":1660.0,"72":1661.0,"73":1665.0,"74":1667.0,"75":1668.0,"76":1670.0,"77":1671.0,"78":1672.0,"79":1675.0,"80":1676.0,"81":1677.0,"82":1678.0,"83":1681.0,"84":1682.0,"85":1683.0,"86":1684.0,"87":1687.0,"88":1688.0,"89":1689.0,"90":1690.0,"91":1696.0,"92":1698.0,"93":1702.0,"94":1704.0,"95":1708.0,"96":1711.0,"97":1712.0,"98":1713.0,"99":1714.0,"100":1715.0,"101":1716.0,"102":1717.0,"103":1719.0,"104":1720.0,"105":1721.0,"106":1735.0,"107":1736.0,"108":1737.0,"109":1739.0},"Entry":{"0":"\n\n \n\n","1":" Have just arrived back to canteen Corner from blighty leave. \n\nThe only things worth noting was the Brigade of Guard’s bands final full dress rehearsel before leaving for Italy. They were all in their peace time uniform, the drum-majors’ uniforms are said to be worth £125. The R.S.M. was giving them exercises in saluting, and he detected a slackness in\n\n \n\n \n\n \none of them (or fancied he did) and said to him \"That is the way the Anzacs salute\". This showed his cleverness, so he thought, but an American who was with us, was in full agreement with us in interpreting it as ignorance.\n","2":" Fritz is said to have put up a sign in front of the","3":" Div. \"Go to Italy or Palestine and we’ll sink you. Go to Australia and we’ll give you an escort\".\n\n \n","4":" Left canteen Corner for Red Lodge. They consist of long dug-outs 50 feet long in the centre of Hill 63. They are lit with electric light and resemble, though on a smaller scale, the catacombs, but are better known as rabbit burrows.\n","5":" We went up on to the top of Hill 63, which was the scene of some of the biggest battles in the early part of the war. We looked down on Warneton 4 kilos distant which\n\n \n\nis in the hands of the enemy. On our left is the famous Messines Ridge and a white patch of, what looks alike the floor of a quarry, which is all that is left of the village of Messines. The ground is pitted with shell holes, and here and there an outpost, or rather observation post, some camouflaged as trees. There is one large crater caused by the great explosion we can see\n\n \n","6":" Medals are the greatest honor sought after by the soldier, but in many cases it seems a farce, for instance - Pioneer Sergeant D.C.M. A.M.C. \" \" and others which I will remember, but not set down. M.M’s are said to be issued with the rations by which the soldier means, so many are issued to a battalion after each stunt, and in many cases the distributors have a \n\n \n\nstronger affection for some than others. The French authorities presented the","7":" Pioneers with 2 medals of the Legion d’Honor. They tossed up for them, and the cook’s won. A health to out gallant comrades.\n","8":" Our chaps are preparing for a big raid. We have received our Xmas parcels 3 months late, but very acceptable.\n","9":" The","10":" Brig raiders went over towards Warneton and did good work captur-\n\n \n\ning 1 heavy and 5 light machine guns.\n","11":" Another raid but not so successful. These raids earned the Aussies a column in the dailies.\n","12":" Review of raids by General Birdwood who came with a pocket full of medals and a cartload of B.S.\n\nRed Lodge is part of King Albert’s hunting grounds, and the trees are all dead, cause presumably gas.\n","13":" Went back from Red Lodge to Surques\n\n \n\none of the often described villages near Desvres.\n","14":" Played a program at Brig H Qrs with the Brigade Band.\n","15":" Shifted from Surques to Escoeuilles (any body who likes can have a try to pronounce it) 2 kilos distant.\n","16":" French life must be an equivalent to slavery. Every day we see an old woman nearer 70 than 60 carrying bundles of wood and buckets of water that I would think twice\n\n \n","17":" A monstrous Hanley-Page machine flies over us every day. It has 2 engines of 250 H.P. & carries 5 passengers.\n","18":" We are told we have to be ready to move at 6 hours notice. \n\nAll sorts of rumors as to the reason and destination are floating about, and some wag has brought one in that no one can can go in the line unless he has £ 10 in his paybook. We moved of at 6 pm and passing through\n\n \n\nQuesques we arrived at Lottinghem station at 8.30 pm. The train was 4 hours late so we had to stand about and freeze, now and again playing a tune to alleviate the monotony.\n","19":" At 2 a.m. the train started. We travelled in Horse trucks better known as dog-boxes 48 in each and after 7 hours packed like sardines, and aching with cramp we arrived at abele at 9 a.m. and marched 8 kilos to our billet at Watou. We\n\n \n\nhad practically nothing to eat for 36 hours. I have dealt with this at some length to show how things are worked in the military. Fritz is playing the devil (or trying to ) with 25 divisions on a 40 mile front and is not quite pleased with the result. Luckily we shifted from Red Lodge. It is now Red Ruin. Hill 63 is badly in need of repair. Armentieres is now a rubbish heap, Steenworck running a close second. Bailleul\n\nhas also stopped a few. The C.C.S. at Steenwerck has quitted. Fritz has dropped some rubber balls filled with mustard gas on the Americans who are now convinced that theory and reality in connection with winning the war, are not quite the same.\n","20":" Fritz has started his big push, which is thought to be his final effort, so we started off for the line (which took us 5 days) and got to Eblington on\n\n \n","21":" Then we left Eblington and marched to Steenbecque and entrained to doullens on our way to the Somme\n\n27th Bivouaced for the night. \n\nHere the densities of the traffic rivals anything I have seen in London. The thousands and thousands of ex-buses and motor transports, at times \nin\n three abreast in such narrow streets is simply marvellous. \n\nWe boarded some of these buses and went to Franvillers. All of our 3rd division\n\n \n\nare up here, the","22":" also. \n\nThat night it was bitter cold and we marched about or laid on the grass shivering up to 12 o’clock at night. We thought we we lost but we found out afterwards it was part of the game and we \nthought\n were waiting on orders from Brigade, and in case of a break through we were to be rushed up to the shooting gallery. We spent the night on the grass.\n","23":" The ground is covered with tank tracks and one of the latest went past\n\n \n\nwhere we were resting at about 15 miles an hour. \n\nHaving little to do we went on an expedition to the village as we had heard there were some fowls looking for a home. We got 3 and on coming out of the yard saw a tommy captain on horseback, and I laughed over it afterwards. Fancy me passing and saluting a captain with two chickens in a sack over my shoulder that were flapping all over the place with a sore throat. He returned the salute but I bet he said \"those ---- Australians again\".\n\n \n\nThen we went down the cellar of another place we were told was full of cider. Right it was. We got some and were seeing how many bottles our pockets would hold when in came 3 froggies one brandishing a waddy that would not have disgraced an Irishman. Those on top quit and the Froggies shut the heavy lid of the cellar and unfortunately myself and 2 others were shut in. We waited a minute until his attention was diverted then pushed up the heavy lid and remembered we had an\n\n \n\nappointment elsewhere & I am sure the language of the Froggies was not polite though we could not understand it. \n\nShifted to Bonnay. We are 11 kilos from Albert, where we are reserve for and the 3rd &","24":" Divvy are doing some good work and capturing some prisoners. \n\nWe have stored our instruments, and are \"dinkie die\" soldiers once again.\n","25":" More shifting. I suppose that is because we are a mobile division again. At 7.30 p.m. we got moving\n\n \n\norders at 15 minutes notice, and after 3½ hours marching we came to a village called Cachy. We passed through a large town called Corbie which was evacuated by the civilians and occupied by Australian & Tommy troops, and in one place the smell of spilt Champagne whisky etc gave one the impression that a distillery had broken loose. We were billeted in Cachy for the night, no more than 4 or 5 kilos from the bosch.\n","26":" The first thing we heard this morning was that some prisoners gave information that the Germans were advancing\n\n \n\nat 11 a.m. and that Cachy was the objective. At 9 a.m. while we were waiting for breakfast a squadron of hun planes came over flying low. There was a bit of a smash-up with a couple of ours, but none were brought down. They got away back to their lines, but the damage was done. They had taken their observations. We had breakfast, and about 10 minutes after a H.E. shell landed just outside our billets getting 2 tommies. Then they started to put over a lot of stuff, mostly shrapnel, but our crowd were exceedingly lucky and we never had any casualties. As no purpose could be served by \n\n \n\nremaining, all troops evacuated, our battalion making a beeline for a wood close by where we took up a position. All day long the Bosch dropped shells into Cachy, but our troops kept him back and his stunt was a failure. \n\nOwing to the shellfire it was raining pretty heavily so we made a tent out of our two waterproofs, lined it with straw from an adjacent haystack, caught the rain of the roof in dixies, and made tea, and lay back in comfort & enjoyed it. \n\nAt 4 p.m. the band were placed with the reserves and sent back to Blangy Tronville, a usual one-\n\n \n\nhorse French village. \n\nNo one will ever know what some of the men in the retreat have suffered. Some men in the Tommy regiments who have taken part, say they had only 2 meals in 11 days. Of some divisions only 180 were left, and wounded men could not be got out.\n","27":" The German method of attack shows how they regard the lives of their men. \n\nThey came over in waves shoulder to shoulder, with full packs, at a slow saunter, the second wave, Machine gunners who fired over the shoulders of the first wave. Our M.G’s\n\n \n\nmowed them down in thousands It was just slaughter, and if they turned back they would be mowed down by their own M.G’s in overlooking positions on the hills.\n\n31st All night the Gothas have been firing down round our billets. Presumably they had few bombs left as only 5 or 6 were dropped.\n","28":" Saw 2 tommies tied to trees as part of 28 days F.P. for being drunk. French & Australian inf. & British cavalry launched an attack, 60 aeroplanes firing M.G’s as advance guard\n\n \n","29":" Went to Glichy a nearby village where some American troops are billeted. \n\nVillers Bretonneux was ratted for souvenirs yesterday. To day we went for some but town was partly in flames and the rest occupied by the hun, a lot of the 35th who were billeted there were casualties. \n\nA 6? 2? German prisoner was brought back from the line by 2 little tommies. They had one rifle between them which was carried by the Hun, and they said they would march him all over France before they would go back to the line.\n\n \n","30":" Received orders for the line, which is at present just outside Villers Bretonneaux. \n\nOn our way we passed dozens of dead horses also some \nof\n Tommies who had got it. Round where two big navel guns had stood were scores of holes made by whizzbangs. \n\nThe bridges we passed were mined ready to be blown up in case we had to fall back Along a little further Fritz nearly caught us with a big shell. On entering Villers Bretonneaux we met with a continuous fusillade of whizzbangs and H.E. and the further\n\n \n\nwe got in the hotter it got. However we managed to get through all right, and billeted for a few hours right in amongst the H.E. \n\nShops & dwellings all round us were smashed to pieces but we still got through all right. \n\nThe fighting here is open warfare, rifle and M.G’s playing the biggest part, Fritz uses his mass formations & gets badly cut about. \n\nThe battalion has done great work, one one occasion it saved the town, but was greatly handicapped by\n\n \n\nthe windiness of the Tommies on the flanks, who will not stand up to Fritz. No less than 3 German officers masquerading as British officers were shot. One was dressed as an Australian Colonel, but made the mistake of carrying a pack. He gave the order to retire but one of our boys said \"Australians never retire\" and shot him. An English officer gave his unit, who were on our flank, the order to retire. One of our officers pulled out his revolver and got back in the trench\n\n \n\nwith him and demanded an explanation. He didn’t retire. The battalion did splendidly, casualties about 120. Relieved by 2nd Div. and spent the night in the mud.\n","31":" Still bivouacing. – a good deal of aerial activity. \n","32":" and a hell of a lot of shelling \n\nCannons to the left of us Cannons to the right of us Volleyed and thundered Fritz made an awful fuss Missed them and near got us Lord, how he blundered. \n\nThe French have pulled up\n\n \n\nrailroads leading to the line, and reserve trenches have been dug for miles back. \n\nA chap who had outgrown his hair removed his \"steel bun\" when a wag advised him to put in on again or the water would boil. \n\nFritz wants a lot of room for his fireworks, one would think round our little humpy was the only place he could give a display. \n","33":" Battalion went in again. Fritz came over sending\n\n \n\na lot of gas right behind our lines. The French 75’s and our 18 lb-ers gave him a hot reception and his attack came a gutser\n","34":" Some gas shells were put round our camp during the night and the alarm was given. \n\nThe French 75’s have done some good work and are used mainly for man-killing and not for destructive purposes. They sound almost like a machine gun when a battery is firing. A shell landed 5? from\n\n \n\nour cookhouse, no casualties.\n","35":" The Brigade major says that the 36th Battn. can afford to hold their heads higher than ever before on account of their good work at Villers Bretonneaux.\n","36":" The battn in support at Hangard Rt. of Villers Bretonneaux. On account of absence of C.O’s of English units our colonel took command of 9 batt’ns \n\nAfter a morning’s directing, he, Colonel Milne, together with Major Mc Dowell & Capt Macnee, our\n\n \n\nsecond in command & adjutant were having dinner in a dug out, and a German shell landed & all of three were killed. Major Grant of 33rd & late of 36th and a brigade major were rushed up to take charge. \n\nThis is the most drastic event in the history of the battn. As all three, especially the colonel were loved by the battalion as it is the fortune of few officers to be. For coolness, gallantry ability and consideration the colonel could not be excelled (Known as Billjim) \n\n \n\nThe Germans have taken all our old fronts, Armentieres, Neuve Chapelle, Estairs, Fleurbais, Jesus Farm, Rossignol, Canteen Corner, Steenwerck. \n\nWent into Gentilles and dodged round the shells looking for pomme-de-terres but got none \n\nSaw 2 planes brought down.\n","37":" Shifted to woods nr Boves, late in the evening and erected some sort of a shelter in the dark and rain. It sufficed\n\n \n\nbut we improvised it next day.\n","38":" In the words of the immortal M.W.T.Horan \"It is damnable cold\" \n\nDid Gas Guard and nearly froze. \n\nShell fire from the surrounding hills was a magnificent sight.\n","39":" Back to woods nr. V.B. Germans have extended their line through Merris and Meteren, and Neuve Eglise has been retaken by us. Camp shelled 2 cas. This morning. \n\nAppointment of Major\n\n \n\nWhite D.S.O. as C.O. 36th Capt. C. Doig second in Com. \n\nCapt Tedder, adjutant.\n","40":" News of Allied offensive gain of 12 miles on 40 mile front into Alsace. \n\nMade trench cooker. Req. a tin, candles melted down & bag as wicks.\n","41":" Battalion is now a counter attacking party stationed at V.B. sleeping by day & carrying on at night. 40 including 3 officers were gassed. It was sent over in shells and the constant replacing of masks carried a little gas\n\n \n\neach time so many were gassed in spite of masks. Being heavier than air, it collects in cellars where our boys were sheltering from shell fire.\n","42":" On gas guard. Our planes went over in relays and bombed the bosch. When they were finished he did ditto. 6 bombs landing round our dugouts, scattering dirt all round us. Then they put about 20 shells round us one landing about 3? from the head of a dug-out. \n\n(Reverse book & continue)\n\n \n","43":" Shifted back to La Houssoye a few kilos (12) from V.B. \n\nWe passed a vast number of guns and ammunition, a heavy bombardment was in progress and it is said 180 gas shells per gun were to be put over during the night. V.B. is the key of the whole western front as the capture would mean access to Amiens our chief railway centre & direct route of 55 miles to Paris. \n\nIt is said that when the 36th stopped the German advance & capture of V.B. this practically saved\n\n \n\nthe war. It is very improbable that they will ever take it now, as since that time batterys by the hundred have been brought up. The danger being past, they are sending the Australians to stem the tide of advance in the north.\n","44":" Baron Von Ritchhofen the greatest of German fliers was brought down close by, by machine-gun fire. ","45":" Aus. Div. \n\n£ 500 reward is offered by plane no 13, a British plane with a German pilot.\n\n \n","46":" On account of the failure of the conscription in Australia, and to conform with the new organisation order of 3 battalions to a brigade in the field, The last battalion in each brigade is broken up & distributed among the other battalions. \n\nThe Brigadier told us this afternoon that the 36th battn is to broken up and trans- \n\n but we improved it next day. ","47":" In the words\n\n \n\nfers are to be through by 4 p.m. to-morrow. Colonel, Major, Adjutant, H’dq’rs staff and a.b.c. Cos are to go to 33rd ‘D’ Co to be split up between 34th & 35th. A new 36th is to be formed in England to reinforce the other 3 battns in the field. Went to Pont Noyelles and saw a German Albatross brought down about 11 of our planes manoeuvred for positions and attacked him from 3 different directions\n\n \n\nThe German Pilot got a bullet in his leg and was forced to land, the machine being captured intact. This was carried out by Australian airmen.\n","48":" The batt’n has been broken up and the band has been placed on the strength of 33rd, 34th & 35th batt’ns for administration purposes 8 to each. I am allotted to 34th.\n","49":" We have been transferred to Brigade Hqrs as Brigade band and to do other duties that may be required of us\n\n \n","50":" Marched to Frechencourt where brigade is stationed but found them just about to shift. \n\nThere was a battalion of Americans in the town and we had a yarn to a few of them and voted them decent sorts. They had not been in the line, had never been within 8 kilos of it, but they were anxious to know when we thought the war would end. \n\nWe marched from here to Germaine Woods where Rear Bde Hqrs is stationed\n\n \n\nIt is a shooting box and a very pleasant spot & the birds are singing, to the drum effects by Fritz & Co. The Adv. Hqrs is at Heilly 6 kilos ahead.\n","51":" Went to dentist at Petit Camon 4 kilos past Quierrieu per Motor Transport.\n","52":" On a hill close by is a massive monumental column erected on the site of a great battle and to the memory of the French who fell in the Franco-Prussian war of 1870. Com. Batt of Pont Noyelles\n\n \n","53":" Shifted to Rivery a suburb of Amiens. \n\nThe Cathedral which is one of the largest and most beautiful in the world is about a kilo distant. \n","54":" German planes came over in relays bombing Amiens several of which landed very close to our billets which is an old hospital. We have souvenired a mattress from a brisé house and are very comfortable.\n\n \n","55":" In addition to band-work, the band has been detailed for duties which include, running, observing batmen, driving, bombing (work on supply dumps)\n","56":" Played at Amiens Ecole de Natation\" or Swimming School where the","57":" Brigade held a swimming carnival. Fritz is systematically strafing the town with shells and bombs.\n","58":" Went in charge of Reserve Bombing Dump just behind Villers Bret.\n\n \n\nI thought Brigade was a sweet cop also my job as bomber. We anchored just outside Villers Brett. 2 kilos fro the line, in a sunken road. We are surrounded by hundreds of camouflaged batteries. We were welcomed by a barrage of H.E. & Gas shells which lasted an hour. Then they turned off the gas but kept up the H.E. so although we were kept hopping a bit, we finished snuffling in our gas masks.\n","59":" I am beginning to think we are in a death\n\n \n\ntrap. One chap along side me got a blighty. I bandaged him up & off he went. \n\nThe stench of dead horses is also rotten.\n","60":" Going for rations we have to go along a road where the shells are pretty thick. 4 men were wounded and 4 dugouts were blown up which I had just managed to get past. \n\nWe are between V.B. & Fouilloy in a sunken road.\n","61":" On looking back over the past 4 days, the only thing I can think is that\n\n \n\nhell must be something like this Yesterday 312 shells landed round about our dug-out. The r.M. Officer was killed also 2 other officers were badly wounded, 3 cooks, one with his leg broken and the other 2 with as much shrapnel as they could carry splattered into them, one sig killed, 5 casualties at 34th Hqrs, 65 pioneers gassed & others that we perhaps don’t know of. \n\nWe were in our dugout up to the 198th shell and then we made a race for life to get out of the \n\n \n\nshelled area and managed to get out on time.\n","62":" 500 shells this afternoon gas, 5.9, armour piercing, high shrapnel and ground shrapnel. I have shipped a good bit of gas and am not feeling too good. I don’t know whether it will evacuate me, as yet. \nAll sho\n For 4 hours in the night he sent over gas. It smells like Fried steak & onions cooking and another sort smells like pineapples. Beside the strafes I have mentioned every now & again, perhaps when you\n\n \n\nare at dinner, he will send over a few salvoes. Even as I am writing this we are away on a hill about 200 yards from our dugout watching him shell it and we are looking for a better ‘ole in case he changed his direction.\n","63":" Shelled from 10 a.m. till 5 p.m. a constant bombardment.\n","64":" Wal and dave Oliver nearly got skittled by a 5.2. Wal got a lump in his hip and is now en route for Blighty. Although I\n\n \n\nmiss him, I am glad he is out of it for a while. Arthur Smith arrived to take Wallies place. \n\nWe have reinforced our dug-out with elephant iron so we may stand a chance with a small shell.\n","65":" Just now we are in his line of fire with armour piercing shells\n","66":" He has stopped sending heavy stuff just where we are camped but gives us plenty of gas every morning at 3 a.m. \n\n \n","67":" At present I am like the lily. \"I toil not, neither do I spin\" unless it is a few somersaults into a convenient shellhole when Fritz begins his fireworks display. \n\nAt times blighties are flying about like little wasps, but thank goodness they cannot penetrate 6 ft of earth. Often during the day you see blighties \nare\n hobbling out and others being carried.\n","68":" Last night our Little Grey home nearly went\n\n \n\nwest also yours truly. He mixed H.E. and Mustard gas and we were coughing and vomiting with red eyes and cursing lips until the wind took charge of it. I now understand what Shakespeare meant when he said \"Blow Blow thou Winter’s Wind\" \n\nTalking about us in the V.B. Stunt the \"Echo de Paris\" of","69":" says. \"That which our troops have done this week, assures to our children, the reason of being proud to call themselves Australians, for\n\n \n\nnever in the history of our army, have our soldiers made an example of valour and military science in a higher degree than to-day. If there was nothing else, that would suffice to the glory of the Australians\".\n\nThe article was headed \"The Australians have covered themselves with glory\".\n","70":" Fritz is still amusing himself at our expense. He went mad for a quarter of an hour with about 15 guns\n\n \n\nand out old dug-out was shaking so much, we thought it was getting trench fever. \n\nA lot of it was gas but at first we thought it was the explosive. The gas smarted our eyes and noses and we made a dive for our masks and damned if we could keep them on what with coughing, spitting and spluttering. we feel all right now though. About 50 of our planes came back from Fritz’s\n\n \n\nlines, where they had been bombing. \n\nSaw a ding dong aero fight of about 20 planes. 1 Fritzy was stonkered and the remainder got for the lick of their lives. Another of our planes brought one of Fritzy’s a \"gutser\" and one of his dominoed one of our Observation Balloons. \n\nJust now he is shrapping us for all he is worth.\n","71":" Fritz came over on the","72":" Brig. about 40 strong but none got back. Apparently they were after information\n\n \n","73":" Three men volunteered to go over and get a prisoner from Fritzy’s lines for information. The got 3 killed one & brought the others back. One of our 3 was also killed. \n","74":" Further details of the above are at hand. It was carried out at 5 pm daylight by Lt Widdy our","75":" M.M. who killed 5 germans and is rumoured to have been recommended for the V.C.\n","76":" Relieved by","77":" Div. and was chased all the way out by shells.\n","78":" at Hospital Rivery.\n\n \n","79":" Big stunt here by our army corps.","80":" ","81":" &","82":" Divs. Advance 2500 yds on a 5 mile front. 1500 prisoners & countless guns. T.M’s. & M.G’s. Our div in close support.\n","83":" Fritz counter-attacked on a large scale but was easily beaten back. \n\nPlayed at Aus. Army Corps H’qrs. Complimented by General Sir John Monash at Bertangles.\n","84":" Stand to 8.30 pm to 1 a.m. Fritz expected.\n","85":" Went into Line opposite Hamel In\n\n \n\ncharge of a dump. On the opposite Hill lie the German lines on the far side of Vaire Wood & Hamel Wood. Hamel is half way up the hill & before us lies the whole battleground of a week ago.","86":" July \n\nWe can see the bursting of our own shells and have to exercise the greatest caution or it means bombs and – Kingdom Come. Frankie says to put \"his cooking and\n\n \n\nis a good cook\".\n","87":" Fritz knocked 2 of our balloons.\n","88":" Fritz did ditto repeat with another. \n\nA Yankee who could speak German asked a prisoner if he thought they were winning the war. He said :Yes. God is with us\" The Yankee said \"That’s nothing, the Australians are with us\". Another: - A Chinaman said. \"One shell come, English soldier run away, two shell come Chinaman run away, Three shell come Australian say \"Bas ---d\".\n\n \n","89":" It is unofficially (very) stated that Gen’l Foch asked Haig for 40 divisions of British troops for a certain front. Haig said it was impossible as we had not the men. Foch said Never mind let me have the 3rd &","90":" Australian Divs.\n","91":" Shifted at 11 at night to a new position near Sailly le sec and fritz welcomed us with a barrage. One man was killed.\n","92":" barraged beaucoup. No more cas. heard of up to now.\n\n \n","93":" Our posy which was called sleepy Valley has been renamed ugly corner. We have been able to settle down into a trench (where we were O.K.) so far, but He caught us on the hop yesterday. We got down all right but had left our gas-masks about 15 yards away so we had to run the gauntlet to get them. C’est le guerre.\n","94":" Took over road dump near Aubigny\n","95":" Dump at Daours.\n\n \n","96":" Preparations for the biggest stunt of all so far is marvellous 12 inch Hows have been put in & the miles of transport. \n\nThe attack has started on a 12 mile front. Led by 3000 tanks and covered by the biggest barrage of the war. We were up very close to the hopping off point & last night was shelled & gassed\n","97":" Prisoners by the hundred were brought back. Some were from Stuttgart. Westphalia Berlin & were of the","98":" Reg Herwarth von Bittenfelds & \n\nThere were also a good few\n\n \n\nPrussians & Wurtenbergers. One officer had been through Oxford, spoke perfect English & on being questioned displayed little knowledge of hospital ship outrages & thought there were 400,000 Americans over here whereas there are over 2 million our brigade went 5 kilos without many casualties. The 4th Div. leap frogged the 2nd and that day we advanced 10 miles & captured 17,000 prisoners 400 guns & countless machine guns. We took We took Warfusie, Sailly, Laurette, Harbonnieres, La Motte on our sector and at present are on the outskirts of Proyat. The officers (artillery)\n\n \n\nare like little kids with new toys and delight in firing Fritzy’s 5.9’s back at him especially the toot-suiters as we call them. They had a go with an 8? how. The shell went all right but the hun had disconnected something & the barrel buried itself 3? in the ground. \n","99":" On going forward we were nearly bombed, shelled & shot to pieces with enfilading MG’s. but up to date are going strong. It is marvellous the way they get the guns up. The ammo goes up in supply tanks, we go up per boot. Fritzys, our boys, horses, all lie about \n\n \n\ndominoed. The tanks did good work.\n\n10th The tanks have let our boys down. They were to have led our attack & put the MG’s out of action. Their commander was killed & they turned back our boys carried on with the result that 2 batt’s of the 10th were cut to pieces Our attack has been held up for a day or two owing to the failure of the tommies to reach their objective. Blast the Tommies. Anyhow we put some of our 1st Div & Yanks in & they got their objective Chipilly & are now on the outskirts of Bray\n\n \n","100":" The 11th & 9th have straightened the line last night and all is ready to push out again. The Canadians on our Rt. are well ahead. \n","101":" Fritzies came over this morning & got a good eyeful of us. We brought down 3 new ones. Albatross type.\n","102":" Relieved by Lanc. Fus. of 17 div. Went back to Vaire\n","103":" Back to Sailly Sec. It is a marvellous difference to when we were here last. The line runs now approx Bray-Lihons-Roye-Noyon. Souvenired Pomme-de-terre. Among recent captures are 3 complete trains, hospital, 1 corps, 3 div. Hqrs.\n\n \n","104":" Well, I have been in the big push but owing to a G.S. Waggon running over my foot nr Bray I find myself in","105":" C.G.H. at Triport wondering if I will get to Blighty. Marked for Blighty\n","106":" Left Triport for Le Havre. S.S. \"Grantilly Castle\" to Southhampton\n","107":" Birmingham University,","108":" Southern Genl Hosp.\n","109":" Transferred to Rugby V.A.D. hospital \n\nTrés bon\n\n \n\n"}}