{"Document Name":{"0":"Diary_0474","1":"Diary_0474","2":"Diary_0474","3":"Diary_0474","4":"Diary_0474","5":"Diary_0474","6":"Diary_0474","7":"Diary_0474","8":"Diary_0474","9":"Diary_0474","10":"Diary_0474","11":"Diary_0474","12":"Diary_0474","13":"Diary_0474","14":"Diary_0474","15":"Diary_0474","16":"Diary_0474","17":"Diary_0474","18":"Diary_0474","19":"Diary_0474","20":"Diary_0474","21":"Diary_0474","22":"Diary_0474","23":"Diary_0474","24":"Diary_0474","25":"Diary_0474","26":"Diary_0474","27":"Diary_0474","28":"Diary_0474","29":"Diary_0474","30":"Diary_0474","31":"Diary_0474","32":"Diary_0474","33":"Diary_0474","34":"Diary_0474","35":"Diary_0474","36":"Diary_0474","37":"Diary_0474","38":"Diary_0474","39":"Diary_0474"},"Date":{"0":"unknown","1":1870.0,"2":1871.0,"3":1872.0,"4":1873.0,"5":1874.0,"6":1875.0,"7":1876.0,"8":1877.0,"9":1878.0,"10":1879.0,"11":1880.0,"12":1881.0,"13":1882.0,"14":1883.0,"15":1884.0,"16":1885.0,"17":1886.0,"18":1887.0,"19":1888.0,"20":1889.0,"21":1890.0,"22":1891.0,"23":1892.0,"24":1893.0,"25":1894.0,"26":1895.0,"27":1896.0,"28":1897.0,"29":1898.0,"30":1899.0,"31":1900.0,"32":1901.0,"33":1902.0,"34":1903.0,"35":1904.0,"36":1905.0,"37":1906.0,"38":1907.0,"39":1908.0},"Entry":{"0":"\n\n","1":" (62)\n\nA fine day.\n\nThis morning I received a packet containing 5 letters one from Cis dated Nov. 5, one from T Douglas Nov. 7, and 3 from my wife dated Nov. 3. (164) Nov. 8. (165) &","2":" (166).\n\nThis morning a new patient who came in last \n\nlast night has got the Measles. Sister Cann discovered it this morning, & the Doctor when he came round confirmed it. He was taken out of the ward to a special one. This Ward is isolated for 20 days, which means that we cannot go out of the camp, nor the orderlies either, they are to sleep in the Ward. We will therefore miss our chance of going on the Ulysses. All are greatly disappointed, for it may be 4 or 5 weeks, perhaps, before we can get away. \n\n(63)\nMonday\n Sunday Jan 12.1919.\n\nA fine day. The sun shines out bright from among the clouds and the wind has died away.\n\nNearly everyone is resigned to staying here for the period of isolation, a few hold out hopes of getting out in a week if the case turns out not to be measles, but it is a vain hope, the only colour lent to it is that the spots or rash on the patient has disappeared this morning so we were informed.\n\nWith others this evening I went for a walk to Chicherell, a village about a mile away & felt much better.\n","3":" 1919.(64).\n\nA beautiful day – bright warm sun, a clear sky no wind, & a clear healthy atmosphere.\n\nA new nurse is on for today. Sister Cann has a day off. I went for a walk along the road to Weymouth as far as the Aero-drome this evening.\n\nIt is a year ago today since I went on my first leave from France.\n","4":" (65)\n\nA wet cold miserable day, with light showers most of the time. I stayed in the ward all day reading “Mark Twain’s\" “Crossing the Equator a very interesting, amusing and instructive Book. 712 pages, illustrated printed in America. 69 chptrs. Le Brun returned from leave last night. He went away on the morning the measle patient was discovered so escaped isolation. He goes away on board the Ulysses. \n","5":" 66.\n\nFine but cloudy weather.\n\nI saw Bill O’Brien this morning. He was assistant armourer. He has been in this camp 4 or 5 weeks.\n\nOne of the Doctors in this Hospital is Captain Tageat, a T.B. expert. In Australia he discovered a new cure for Consumption, and in France was with the French Army a long time. I understand France & Canada intend to adopt his treatment. I hope he makes money out of it.\n\nA Canadian doctor, a Liet- Colonel – examined several of the patients in this ward this afternoon. He spent about an hour examining one. He was very thorough.\n","6":" (67).\n\nFine but rather windy. I finished reading Mark Twain’s “book\" Crossing the Equator\". The book written in a humorous style throughout describes the authors journey to Australia New Zealand, India and South Africa, finishing up at Southampton England. All through Mark Twain reveals his affection for democratic institutions, his hatred of shams and autocrasticy and his sympathy for the poor and opressed, though he says it costs him nothing.\n\nWith 3 other diggers, I walked into Weymouth this evening. We had a walk around the town had tea there and walked back arriving before dark. Weymouth is 2 miles away, and with the walk through the town we completed about 5 miles by the time we got back. I bought some P.C. views of Weymouth.\n\nWe saw a lot of Japanese sailors & marines. There uniform is made in the pattern of the British. The non-commissioned officers badges of rank are the same anchor & stripes in red. \n","7":" 68.\n\nA fine bright day.\n\nThe Ulysses will sail to morrow, at any rate all troops for her will leave here early to morrow morning. To day will decide whether I & some others in this ward will go with her. It all depends on the Doctor, as we are under Isolation.\n\nThis afternoon I walked to Wit which is situated on a high Hill on the road to Portland about 2 miles from MonteVideo. It is only a small village but has a 13 century church with a high square tower which can be seen from miles around. We were back in time for tea. \n","8":" (69)\n\nLast night there was great excitement & uncertainity in the Camp, concerning those who were to leave by the boat today. A large number of men were struck off the supplementary roll, & most hospital patients left on, including those in this ward. It was not until last night that we knew definately that we were not to go, on account of the isolation. One man last night was notified that he was to go to make one of the special duty staff. Later that he was not to go & about 10.30 that he was, and at 4. this morning he was woke up & informed that he was not to go.\n\nI finished reading “ The Autobiography of Mark Rutherford\" by Reuben Shapcott. – A tale of a very common place life perplexed by many problems that he never solved, disturbed by many difficulties he never surmounted, & blotted by many regrets and weakness. He started life as a Minister in an Independent Church strongly Calvinist, then a Unitarian, and finally as a reporter. He was always doubting and never knew his own view.\n\nThis morning Cpt. Pagett a lung specialist examined several of the patients, including myself.\n\nThree tests with 3 days between of the sputum of the patients in this ward were completed this morning. The tests were for T.B. (Tubercolous) and none were found. \n\nCpt. Paget has a new medicine (a powder) which is blown up the nose of the patient.\n","9":" (70)\n\nA showery day.\n\nThe World Peace Conference met yesterday and was opened by the French President M. Poincare. Sixty-seven statesmen were present from every quarter of the globe, and represented 29 nations.\n\nA large number of diplomats and military, naval & civil officials belonging to the allied nations were present, together with a \n\nsprinkling of the fair sex.\n\nBy 5 o’clock all the delegates & others privaleged to witness the memorable proceedings of the inauguration were in there places & 10 minutes later President Poincare arrived, being introduced into the Conference Hall by M. Pichon. The whole assembly rose as the President entered, and remained standing as he walked the length of the chamber to his seat at the head of the Conference table, President Wilson being placed on his right hand, and M. Clemenceau on his left.\n\nGermany having failed to complete the terms of the Armistice on the appointed date – Jan 17 – the Allies have granted a months extension. New and more drastic terms have been imposed – including the surrender of all U. boats and the destruction or dismantling of those under construction.\n","10":" (71)\n\nWind & rain in the morning finer in the afternoon. Today I finished reading a very interesting & thrilling story of travel, adventure & intrigue called “The Czar’s Spy\"\n\nI wrote to Kitty Martin today in reply to her letters of Nov 22 and Dec. 8, which I received a few days ago. \n\n20\/1\/19\n\nThe papers to day announce the death of Prince John the King’s youngest son at Sandringham on Saturday night at the age of 13. and a few months. The newspapers express the nation’s sympathy with the King & Queen.\n","11":" (72)\n\nDull & cloudy but no rain. \n\nI wrote to Lizzie this morning letter 154.\n\nThis afternoon I had a look through the brick works at Chicherell. I watched the operations from when the clay is shovelled into the crusher where it is ground into coarse powder and elevated to a loft, where it is fed into a machine mixed with water and carried on to another machine which presses it and feeds it into moulds where it is again pressed with a pressure equal to 10 tons. These moulds arranged in a circle on a revolving table are then automatically . This machine with a full gang of men is capable of making 1,300 bricks an hour. A 75 H.P. suction gas ingine drives the machinery. The bricks are wheeled to a shed for drying. The kill for burning the bricks is on the Hotman principle\n\nwith a down draft and will hold 25,000 bricks at once. As one side of the kill is being burned the other side is \nfilled filled\n emptied & filled one side at a time. The fire is going continuously and has only been once out in 20 years, and that was few week, when they ran short of bricks to put in the kill. owing to the scarcity of labour, & the slackness in the building trade. There is on hand about half a million bricks. A blacksmith is kept on the work, to do the repairs.\n","12":" 73\n\nA fine day.\n\nI went for a walk into Weymouth this evening & came back in the coach.\n\nI finished reading the “Woman in the Case\" by G. Ranger Gull. A novel founded on Clyde Fitch’s play of the same name. It is a rather sordid tale of Society life in London, in which two women are the heroine & villain respectively. The story teaches nothing except to keep out of mischief.\n\nThe air is cold & frosty this evening.\n","13":" (74)\n\nThere was a heavy frost last night and this morning there is ice on the water.\n\nA Sargeant told us this morning that all in this ward are on a boat roll, and we are to go by the\n\nThe period of isolation is just about expired.\n\nWith J. Haig (40 Battln) I walked into Weymouth. We got our hair cut, I also got a bottle of ink & a note book for the voyage home. \n","14":" (75)\n\nA beautiful day. There was another frost last night.\n\nThis morning we removed from our ward 44 to ward 41. This ward was empty since the Ulysses sailed. It was then a T.B. ward, but it has been cleaned and fumigated, and is now a convalescent ward. This evening I was in Weymouth and bought a knife 6\/6 and a shoe badge & stripes. I exchanged some pennies, for a Japanese coin with some Japanese sailors off the war ships.\n","15":" (76)\n\nCloudy with misty rain.\n\nThis afternoon some of us from this ward drove into Weymouth to see a play, “The Heart of a Thief\" Staged at the Pavilion Theatre. This Theatre is built on a stone platform on the pier, and is a fairly large building. The play was a very good one and being in blues we go in on the nod.\n","16":" (77)\n\nA fine day.\n\nThe ward next us (40) is isolated today for mumps has broken out there. I went for an hours walk this afternoon around Chicherell.\n","17":" (78)\n\nA fine day but cloudy.\n\nI finished reading “Private Spud Tamson\" a humorous tale of the in the early days of the war.\n\nThis is the ex Kaiser’s birthday.\n\nThis afternoon is showery so I did not go out. \n","18":" (72)\n\nA fine morning.\n\nA workshop has been established here in connection with the A.I.F. educational scheme. The garage has been cleaned up and fitted with a few tools such as vices, benches, a small forge and lathe.\n","19":" 80. \n\nA fine day but cloudy.\n\nI received a letter from Kitty Martin today dated Jan 26, 1919 which is a record for speed.\n\nI drew £ 0. 15\/- today.\n\nMy credit balance\n\nis 31\/1\/19 £ 6. 4. 5. \n\nThis afternoon was very cold so I stayed inside and spent the time reading and playing cards at night.\n","20":" 81\n\nCold and cloudy. I went for a walk into Weymouth this afternoon. When I came back there was a cable waiting for me from Kittson, Portland Victoria asking “ How Progressing.\" I have evidently been reported “seriously ill\" otherwise they would not have known I was sick. I have been worrying about these reports. They do no good, and only make my friends anxious. I will have to send a reply to this cable.\n","21":" 82.\n\nCold and cloudy, looks like snow, in fact a few flakes have already fallen.\n\nCaptain Pagett is now in sole charge of this ward. The treatment of the patients is vastly different to war time. Then they had difficulty in staying in the hospital when convalescent. Now they have difficulty in getting out. This morning several patients who have been up some time were ordered back to bed, & told to stay there. Others were told that they might not feel sick, but they were \n\nand must take things easy and take good care of themselves.\n","22":" (83)\n\nCloudy but fine. \n\nI sent a cable to George Kittson this evening in Weymouth when I was in there. I sent 6 words at 1\/6 costing 9\/-.\n\nLynch who was a patient with me was discharged several days ago and was brought back to 44 ward today suffering from a relapse, caused by a chill in a draughty hut.\n\nA patient in ward 44 died this afternoon from Pneumonia.\n\nSister McIlroy gave me a new pipe to night. She with Sisters Cann and Gaggan are leaving this hospital on Monday. \n\nMonday\n","23":" (84)\n\nDull and cloudy.\n\nThis morning two patients in the adjoining Ward 40 died from Pneumonia.\n\n Letter 156\n\nI have finished reading “Sketches of Characters\" by Charles Fleet.\n\nTuesday","24":" 85.\n\nCold and cloudy all day.\n\nI am reading a very\n\ninteresting book called \"Aylwin\" by Theodore Watts- Dunston, an original and interesting book, well written and of thrilling interest. \n\nI went for a walk to the brick works this evening.\n\nThe ships are indefinately held up owing to the big strike in Glasgow and Belfast. Only two ships are sailing in consequence and they are being fitted up elsewhere. A notice is posted up in the ward explaining this and asking the troops to be patient and cheerful. The food shortage is due to the food controller. The A.I.F. authorities are doing everything possible to improve matters.\n","25":" 1919, 86\n\nThis evening I walked to Wight which is a fairly large village situated on the top of a high hill, on the road to Portland. Further on there is the Whitehead Torpeder works, which covers 7 acres of ground and employs several thousands of hands. Portland is about 2 miles further on a high headland which was once an island but is now connect to the main land by a narrow strip of stones called chisel beach which is 16 miles long and encloses a narrow strip \n\nof salt water between the beach & the mainland for half a mile or more along the road near the Torpeder works are placed in rows side by side hundreds upon hundreds of mine sweepers. From the works I returned by a different road which afforded a fine view of Portland Harbour and the warships there, and took me to Weymouth Bridge and from there back to the Hospital at Monte Video. I must have travelled between 7 and 8 miles. I got back soon after 4 in good time for tea, which was an exceptionally good one provided by the red c ross.\n","26":" 87.\n\nA miserable showery day. I dont feel so well today and am staying in spending the time reading, writing & playing cards etc. Card games principally Bridge, whist, Cribbage or Rumey are the chief amusements in the Hospital. The Grammophone also gets plenty of use until everyone is sick of it. On fine days a few indulge in photography.\n","27":" 88.\n\nA dull cloudy day. The cold weather is having a bad effect on the patients. I finished reading Alywin this morning.\n\nThere were no papers this \n\nmorning and it is rumoured that the railway men are out on strike and all trains are stopped.\n\nI have been playing draughts this morning. We found a set of men in one of the cupboards.\n","28":" 89.\n\nMuch finer today. The sun is shining brightly this evening. Owing to the cold weather I have stayed indoors this past 3 days.\n","29":" 90\n\nA fine day.\n\nI am staying indoors today as I feel out of sorts. The papers came by motor last night. The tube strike promises to end in a fiasco, and the electricians fearing the stern measures adopted by the Government are afraid to come out. If they do they will be dealt with D.o.r.a.\n","30":" 91\n\nFine but cold. I stayed in the ward all day.\n","31":" (92)\n\nVery cold cloudy and windy. The wind is freezing and the water in the drains is frozen over.\n","32":" 93.\n\nA fine day. The Sun is shining out bright and warm, and the wind has moderated.\n\nDr. Tagett was late\n\nin coming round this morning, and marked 4 out of this ward. I am to be discharged\nthis m\n to morrow, but as I objected to doing guard duty, he marked me for indoor duties only. I have been almost two months in this hospital being sent in with Effusion and Pleurisey, and my temperature was 10 and remained over 100 for several days., and then gradually came down.\n\nI went for a walk to the brick kiln this evening to the smiths shop there. When I came back a new patient was in my bed, so I had to draw my kit, and hunt up a bed in No 4. Company.I was first put in a corporal’s bed there for the night as he is no leave. Previous to that I was allotted to a bed in No 50 ward but as that is an isolation ward I refused to go in it.\n","33":" 94\n\nA fine morning. I had a good bed last night. Capt Paget signed a form for me this morning stating that I was medically fit to go on 14 days leave and will make an application for same this morning. \n\n Letter 157\n\nI was at two lectures to night in the Y.M.C.A. Hall. One given by Mr. Norwood of the Y.M.C.A. on “some Aussies\" which was interesting & amusing. The other lecture immediately after to the same audience was by Mr. Tom Nyng M.P. on “From Jutland to Zeeburgr was illustrated and showed the work of the navy in the war. \n","34":" 95.\n\nA fine frosty morning. There was a big muster Parade this morning of all the companies , to make a search for a man who passed a crooked fiver on a motor car driver.\n\nTwo policemen and the driver and the boy inspected the lines and eventually identified a soldier as the culprit.\n\nI was transferred from No 4 Company to No 2 Company to day. No 2 Company is a duty Company so to escape guard and to make the certificate sure – For indoor duties – I made an application at the Educational office for instruction in aceyteline – oxygen welding and also offered my services as instructor in Blacksmithing. The officer in charge was glad to see me & gave me an application form for the M.O. to sign.\n","35":" 96\n\nThere was a lot of rain last night and this morning.\n\nis showery. There are no cold winds.\n\nStarted work today in the educational workshop. As the oxygen – aceteyline plant is not yet set up I was put on making irons for broken legs etc. This the first time I have done any surgical blacksmithing. It is all light and easy work. I also made formal application for sick furlough to Pettigo Ireland.\n","36":" (97)\n\nShowery this morning. \n\nI was again working in the shop making surgical irons and supports for broken legs.\n\nThis evening, being Saturday is a half holiday.\n\nThere is no work in the shop on Sundays.\n\nI volunteered for Canteen picket to night, owing to the shortage of men in No. 2 Company. There were 4 of us . The hours were from 6 to 9, and the duties were to see that no one made a nuisance.\n","37":" (98.)\n\nA showery day. A light miserly rain fell all the morning, and while we were on parade at 8.45. \n\nThe morning I spent in the cook house at No 4 Company and gave the cook a hand.\n","38":" (99).\n\nDull and cloudy. Much finer than yesterday\n\nIn the workshop I am on the same class of work making supports and leg irons for cripples of the ring pattern.\n\nI was at a lecture in the Y.M.C.A. hut to night by Mr Sayce on The History of Australia, which was very interesting and illustrated by 100 slides.\n","39":" (100).\n\nSnow is falling this morning. I was again on the same class of work today. Also made a clamp for a broken vapouriser on the oil engine. I am going on leave to morrow.\n\n"}}