{"Document Name":{"0":"Diary_0160","1":"Diary_0160","2":"Diary_0160","3":"Diary_0160","4":"Diary_0160","5":"Diary_0160","6":"Diary_0160","7":"Diary_0160","8":"Diary_0160","9":"Diary_0160","10":"Diary_0160","11":"Diary_0160","12":"Diary_0160","13":"Diary_0160","14":"Diary_0160","15":"Diary_0160","16":"Diary_0160","17":"Diary_0160","18":"Diary_0160","19":"Diary_0160","20":"Diary_0160","21":"Diary_0160","22":"Diary_0160","23":"Diary_0160","24":"Diary_0160","25":"Diary_0160","26":"Diary_0160","27":"Diary_0160","28":"Diary_0160","29":"Diary_0160","30":"Diary_0160","31":"Diary_0160","32":"Diary_0160","33":"Diary_0160","34":"Diary_0160","35":"Diary_0160","36":"Diary_0160","37":"Diary_0160","38":"Diary_0160","39":"Diary_0160","40":"Diary_0160","41":"Diary_0160","42":"Diary_0160","43":"Diary_0160","44":"Diary_0160","45":"Diary_0160","46":"Diary_0160","47":"Diary_0160","48":"Diary_0160","49":"Diary_0160","50":"Diary_0160","51":"Diary_0160","52":"Diary_0160","53":"Diary_0160","54":"Diary_0160","55":"Diary_0160","56":"Diary_0160","57":"Diary_0160","58":"Diary_0160","59":"Diary_0160","60":"Diary_0160","61":"Diary_0160","62":"Diary_0160","63":"Diary_0160","64":"Diary_0160","65":"Diary_0160","66":"Diary_0160","67":"Diary_0160","68":"Diary_0160","69":"Diary_0160","70":"Diary_0160","71":"Diary_0160","72":"Diary_0160","73":"Diary_0160","74":"Diary_0160","75":"Diary_0160","76":"Diary_0160","77":"Diary_0160","78":"Diary_0160","79":"Diary_0160","80":"Diary_0160","81":"Diary_0160","82":"Diary_0160","83":"Diary_0160","84":"Diary_0160","85":"Diary_0160","86":"Diary_0160","87":"Diary_0160","88":"Diary_0160","89":"Diary_0160","90":"Diary_0160","91":"Diary_0160","92":"Diary_0160","93":"Diary_0160","94":"Diary_0160","95":"Diary_0160","96":"Diary_0160","97":"Diary_0160","98":"Diary_0160","99":"Diary_0160","100":"Diary_0160","101":"Diary_0160","102":"Diary_0160","103":"Diary_0160","104":"Diary_0160","105":"Diary_0160","106":"Diary_0160","107":"Diary_0160","108":"Diary_0160","109":"Diary_0160","110":"Diary_0160","111":"Diary_0160","112":"Diary_0160","113":"Diary_0160","114":"Diary_0160","115":"Diary_0160","116":"Diary_0160","117":"Diary_0160","118":"Diary_0160","119":"Diary_0160","120":"Diary_0160","121":"Diary_0160","122":"Diary_0160","123":"Diary_0160","124":"Diary_0160","125":"Diary_0160","126":"Diary_0160"},"Date":{"0":"unknown","1":1860.0,"2":1861.0,"3":1862.0,"4":1863.0,"5":1864.0,"6":1865.0,"7":1866.0,"8":1867.0,"9":1868.0,"10":1869.0,"11":1870.0,"12":1871.0,"13":1872.0,"14":1873.0,"15":1874.0,"16":1875.0,"17":1876.0,"18":1877.0,"19":1878.0,"20":1879.0,"21":1880.0,"22":1881.0,"23":1882.0,"24":1883.0,"25":1884.0,"26":1885.0,"27":1886.0,"28":1887.0,"29":1888.0,"30":1889.0,"31":1890.0,"32":1891.0,"33":1892.0,"34":1893.0,"35":1894.0,"36":1896.0,"37":1897.0,"38":1898.0,"39":1899.0,"40":1900.0,"41":1901.0,"42":1902.0,"43":1903.0,"44":1904.0,"45":1905.0,"46":1906.0,"47":1907.0,"48":1908.0,"49":1909.0,"50":1910.0,"51":1911.0,"52":1912.0,"53":1913.0,"54":1914.0,"55":1915.0,"56":1916.0,"57":1917.0,"58":1918.0,"59":1922.0,"60":1923.0,"61":1924.0,"62":1925.0,"63":1926.0,"64":1927.0,"65":1928.0,"66":1929.0,"67":1930.0,"68":1931.0,"69":1932.0,"70":1933.0,"71":1934.0,"72":1935.0,"73":1936.0,"74":1937.0,"75":1938.0,"76":1939.0,"77":1940.0,"78":1941.0,"79":1942.0,"80":1943.0,"81":1944.0,"82":1945.0,"83":1946.0,"84":1947.0,"85":1948.0,"86":1949.0,"87":1950.0,"88":1951.0,"89":1952.0,"90":1953.0,"91":1954.0,"92":1955.0,"93":1956.0,"94":1997.0,"95":1998.0,"96":1999.0,"97":2000.0,"98":2001.0,"99":2002.0,"100":2003.0,"101":2004.0,"102":2005.0,"103":2006.0,"104":2007.0,"105":2008.0,"106":2009.0,"107":2010.0,"108":2011.0,"109":2012.0,"110":2013.0,"111":2014.0,"112":2015.0,"113":2016.0,"114":2017.0,"115":2018.0,"116":2019.0,"117":2020.0,"118":2021.0,"119":2022.0,"120":2023.0,"121":2024.0,"122":2025.0,"123":2026.0,"124":2027.0,"125":2028.0,"126":2029.0},"Entry":{"0":"\n\n","1":" (Paris. cont.)\n\nNew Year's Day -\n\nArmy & Navy Leave Club\n\nWindsor Hotel\n\nWith my friend I visit Bois-de-Boulonge, a reserve of 2.000 odd acres once used for hunting but now an immense park greatly frequented in summer. It has artificial lakes & cascades and is most popular with horse riding parties.\n\nReturn to town and thence to Wagram.\n\nA cold & rainy night.\n","2":"\n\nShopping - Purchase of Paris views & books which I send Home. Meet Miss Rout, a New Zealand Lady who is \"Bill jini's greatest friend while in Paris. Once again I visit Madame Monsieur & once again I recite Shakespeare - Afternoon chocolate - Entertainment in Paris and the Nationalisation of Opera & Drama - Georgette - Au Revour.\n","3":"\n\nMy last days leave in Paris. Being any\n\nthing but financial I am well content to re-visit the now familiar resorts - Garden of the Tiuleries- The Louvre (see Guide) Place de la Concorde - Champs Elysees - Port Alexandre III - Rue de Rivoli - Place de l'Opera (central spot in Paris) Boulevard des Italeens - Rue de la Paris (world famous for its Jewellers Shops) - Place de la Republique - Comedie Francais - Palais Royale & Place Vendome which contains Napoleon's Column - Paris - Its traffic\n\nits shops, cafes, hotels, restaurants. trams, trains lighting - & Its people - Early to bed, after partaking of supper with Madame.\n\nJan\n","4":"\n\nRise at 6 a.m. - and take train from Gare du Nord. A slow and a thoughtful journey. Arrive Aulnoye at 8 p.m - and spend night on the floor of a cafe - Such is the Army. It is always a case of going to or coming from the sublime to\n\nthe ridiculous.\n\nJan\n","5":"\n\nWalk to ov 11 k.m to Avesnes to rejoin \"the Coves\", most of whom have arrived back before me. Naturally things are rather unsettled, and news regarding the future refuses to be made known to us.\n","6":"\n\nCleaning up day. A number of cards & photographs posted Home - Avesnes quite as uninteresting as ever.\n","7":"\n\nParis Diary\n\nre-written - also letters and another start made in my study of French.\n","8":"\n\nFriends in Avesnes. French. Letters & cards. Cold but invigorating weather.\n","9":"\n\nA day of correspondence & studying - Before we can again make a start several of our members have yet to return from London.\n","10":"\n\nLetter writing and studying. In the afternoon the Camp Commandant arrives and after filling in our Demobilisation Papers we are told that for certain reasons \"The Anzac Coves\" are broken up & no longer exist as a Concert Party. We are then given a choice as to our next individual move - Application for \"Corner of Blighty\" - The spell is at last broken.\n","11":"\n\nSecond anniversary of my joining the \"Coves\" - Two years & what they meant. We are all light-hearted to-day - Letters - Emerson's Essays.\n","12":"\n\nReturn of Harry from H.Qs with mail - Many letters & parcels. These \nof\n are days of great excitement for our Party. Hughie Gannon. Jack Davey. Bob Roberts. Tom Sutherby. Cyril Jessop & others begin first stage of journey to\n\nAustralia - I just miss.\n","13":"\n\nMy 22nd Birthday - Our Party breaks up, some returning to their Units - others to 3rd Div. Artillery Concert Party while Harry, Frank, Les, Rupert & self leave for Aust. R.E. Workshops - where we are to reinforce a small entertaining troupe. Daily, good news is being received in regard to Australian & English Frulough.\n\nOur new residence.\n","14":"\n\nA day of letter\n\nwriting and parcel packing - Over 12 letters posted in the afternoon.\n","15":"\n\nThird anniversary of leaving Australia. Now entitled to four blue stripes. Preparations for \"R.E.\" shows.\n\nLetter writing and the study of French.\n","16":"\n\nA motor lorry trip from Jeumont to Home. The former is in France & the latter in Belgium. A very cold ride. Arrve at Corps H.Qs and meet many\n\nold friends. I am commissioned to collect the remainder of the Anzac Cove's costumes, curtains etc.\n\nSome disclosures concerning our late Manager.\n\nAn unprincipled being.\n\nReturn after bidding Cyril & others farewell (prior to their departure for Australia) to Jeumont.\n\nMore Australian mail.\n","17":"\n\nRehearsals commence once again. parcels & letters posted Home & to \nAustralia\n England.\n\nOur O.C. Lt Thomas his popularity -\n\nmy present Unit - \"Australian Corps Engineers Workshops\" - New faces - Duties practically nil.\n","18":"\n\nRehearsal - Reading - Writing.\n","19":"\n\nLiberal terms regarding \"Demobilisation\" - Expecting to leave France in April. Rupert's news regarding position at Drury Lane. The Peace spirit throughout France & Belgium. Soldiers entertain & are entertained by civilians.\n","20":"\n\nRead \"The Critic\" (Sheridans) and study Hugo's French.\n\nCorrespondence.\n\n- A mock court case.\n\n- An afternoon walk\ns\n & some evening chocolate.\n","21":"\n\nRehearsal.\n\nNews regarding personal leave to London.\n\nA stroll through \"Jeumont\" - Indescribable masses of wreckage on the railway line. Seventeen trains loaded with engines, dynamos,\n\nagricultural implements etc. etc. together with eight lines, crossings etc have been destroyed beyond repair by German \"kultur\".\n\nThe effect of explosions on the surrounding houses.\n","22":"\n\nLetters to & from Paris - Rehearsal with \"The Remnants\" -\n\nWatching and awaiting for events of interest.\n","23":"\n\nLast rehearsal, and opening night of the Workshop Concert Party - A good house,\n\nand a willing but inartistic lot of boys. The late \"Anzac Coves\" all acquit themselves excellently - Madame & Monsieur.\n","24":"\n\nThere are now but few of the \"1915\" men left in France - \"A hopeful outlook\". The weather bitterly cold.\n\nSecond night of programme. Owing to scarcity of khaki in this region there is a decided drop in the takings.\n\nAfter having previously played \"Knight\"\n\nin the sketch entitled \"A Tabloid\". I am now playing the more important part of \"Sherwood\".\n\nFrank Crossley the third member.\n","25":"\n\nA walk through, & beyond Jeumont.\n\nMeet, - McKenna from Balmain (Pal of Roy Mc's).\n\nLetters to Home & England - \"Rhymes of a Red Cross Man\" - third show.\n","26":"\n\nAnniversary Day - Sydney Harbour and its Regatta.\n\nBobby Roberts pays a visit. A dance in the Theatre. Attended by soldiers & civilians.\n","27":"\n\nDeparture for England postponed till Wednesday owing to two extra shows being decided on. Packing up in anticipation.\n\nA yarn with Stan Savage and some surprises regarding the past.\n","28":"\n\nWriting. Reading & final show. Pack up\n","29":"\n\nLeave Jeumont at 9 a.m. with Rupert Brown for London.\n\nFirst stage of journey in motor-lorry to Charleroi - where we spend afternoon in looking round town before entraining in the Evening.\n\nMeet Sid Alder, Capt. Potts etc. Entrain in Calais bourd troop train at 10 p.m. and leave Charleroi at midnight.\n","30":"\n\nA cold, slow, miserable, sleepless and practically a\n\nfoodless journey.\n\nWe pass through Mons, Tournai, Lille,Armentieres, Bailleul. Steenvorde. Hazelbrouck and other well-known towns & villages the majority of which are completely devastated. \"A cattle truck journey and what it is like!\" The Calais line being blocked our train makes for Dunkerque.\n","31":"\n\nArrive Dunkerque - Disentrain and at midday embark\n\nfor dear \"Old Blighty\" - Arrive at Dover at 3 p.m.\n\nAn incident concerning some Imperial Warrant Officers - as disgusting as it is contemptible. Arrive at Victoria and march to Horseferry Rd - after which I make for \"Elm Bank\" and arrive at my English Home more dead than alive. Mr & Mrs Scales are away but Alice attends to me like a true nurse and after medical attention I go to bed and sleep soundly.\n\nFebruary \n","32":"\n -\n\nAwake with nothing more than a cold to my credit or should I say discredit. Late breakfast. Return of Mr Scales with whom I journey to Wanstead for purpose of meeting my Dear English Mother - Happy meeting - A long conversation and much laughter. Return to Highgate.\n","33":"\n\nLetters & Parcels prepared. Afternoon visit to Wanstead. Mrs Scales and her\n\nwork in connection with the Womens Auxiliary Missionary. The poems of Christina Ros\ns\netti.\n","34":"\n.\n\nVisit to Australian Comforts Fund & Horseferry Rd. Meet Mr Gannon but fail to find Ralph. Lunch at Canadian Beaver Hut The Strand. Go to matinee at the Palladium where Fred Barnes, Alfred Lester, HettyKing & Mardie Scott are on the \"bill\".\n\nThe great Tube strike in London\n\nDisorganisation - Evening trip to Wimbledon and return to \"Elm-Bank\".\n","35":"\n.\n\nTaking things easy as a convalescent would do. Letters written & parcels posted.\n\nMatinee at the London Coleseum where I see and hear Russian Ballet (Daghlieff) . Mark Hambourg (Pianist) Vester Pilley etc. The London Tube strike and its effect on passenger traffic.\n\nSnow storms and black mists. Again\n\nvisit Mrs Scales at Wanstead and meet the Misses Nutter. Back to Home.\n\n5h Feb.\n\nA morning spent in the Library of Mr Scales. Upwards of 3,500 volumes.\n\nAftenoon visit to Mr & Mrs Matthews at Blackheath. A cold journey, during a heavy fall of snow, on the top of a London Bus. A hearty welcome and a very pleasant evening. Stay overnight. The hospitality of\n\nhost, hostess and their daughter Miss Honoui.\n","36":"\n\nReturn to town. Call on Mr Fitzsimmons who unfortunately is away from office.\n\nMatinee at the New Theatre. A thrilling and capibally acted play. \"The Chinese Puzzle\"- Ethel Irving, Lilian Braithwaite - Leon McLeon. Athol Stewart. Meet Rupert.\n\nIn the evening I see Charles Hawkey & Gladys Cooper at the \"Playhouse\"\n\na farce with \"C.H.\" the predominating feature.\n","37":"\n\nWriting & Reading. Mr & Mrs Scales return from Wanstead. Dinner with Mr & Mrs Harold at \"Westcott\".\n","38":"\n\nMorning, afternoon & evening at \"Elm Bank\". Such a way of spending the day holds a greater appeal and more charm than jostling along the busy London like so many aimlessly do.\n\n\n","39":" \n(Sunday)\n\nLetters Home. London in Winter. An afternoon of exercise and amusement. Walk to Parliament in the Fields, which lies adjacent to Hampstead Heath - and there I witness\ning\n the delightful recreation of tobogganing for the first time.\n\nGreat sport. Many laughs! Return to Elm Bank and spend the evening reading aloud to Mr & Mrs Scales.\n","40":"\n\nMiss Doris Scales (Niece of Mr & Mrs) arrives from Cambridge to spend week at \"Elm Bank\".\n\nMorning and afternoon in London. Booking for Theatres etc.\n\nVisit residence of Miss Fitzsimmons but have no luck as she is not at home.\n\nReading & writing.\n","41":"\n\nAnother walk to \"Parliament in the Fields\" which was the original meeting place of the .\n\n. More tobogganing & skating. A spectator only.\n\nMiss Doris Courtney & myself.\n\nA dinner & evening at \"Elm Bank\". Many guests - musical items etc (9 items).\n","42":"\n\nLetters. Matinee at the Savoy. A.E. Matthews & Kenee Kelly in \"Nothing but the Truth\". A farce which is both clever & mirth provoking. Much fun at Home.\n","43":"\n\nShopping in town. The Times Book Club claims most attention. Collection of War Poems.\n\nAfternoon & evening at \"Elm Bank\". Letters to Herb. Mail Home & Paris. Meet Mr & Mrs Bower. The delightful company of Miss Scales.\n","44":"\n\nMorning & afternoon in town; continue search for books.\n\nPay visit to National Art Gallery where I see many of the\n\nGreat Masters.\n\nVelasquez, Veronese, Michel Angelo. Tintoretto. Titian. Leonardo de Vinci. Turner. Gainsborough. Reynolds. etc.\n\nIn the evening Mrs. & Miss Scales & self greatly enjoy my first Shakespeare play \"The Twelfth Night\"- a record breaking production by James Bernard Fagan at the \"Court Theatre\". A most artistic show admirably acted throughout (see souvenir of same) Mary Grey. Arthur Whitly & Herbert Watson( ?).\n","45":"\n\nReading & Writing.\n\nMatinee at the Strand which features Arthur Bourchier. Noel Coward. Alex Scott Gatty & Kyrle Bellew - A poor play with no decent situation or dialogue and certainly no \noc-cup\n opportunities for good acting.\n\nReturn to Elm Bank and have very pleasant evening. Read \"Nonsense Novels\" & \"De Omnibus\".\n","46":" \n(Sunday)\n\nMorning of writing and preparation\n\nAfternoon with Miss Doris at Mr & Mrs Harold Scales' Home. Peggy & Phoebe, their pretty little children.\n\nA heart to heart talk with my dear English Mother - \"Elm Bank\" and my great love for it!\n\nA new Light!\n\nBed at midnight.\n","47":"\n\nArise at 4.30 a.m. - the parting. Take 6.18 a.m. train from Victoria to Folkestone\ns\nwhere we embark at 9.30 a.m.\n\nArrive at Calais & march to Military Camp. Back to the Army again.\n\n\"Night and the stars are gleaming\"! But not in France my dear. Under canvas we rest atnight and hear the gentle drip, drip of the \ndr\n rain drops, and wonder if the tram tickets in Sydney are still the same shape & colour as they used to be.\n","48":"\n\nEntrain for\n\nCharleroi - a journey which knows no joys. Night on the train.\n","49":"\n\nPass through Bailleul. Steenwench. Armentieres. Lille. Tournai & Charleroi. Walk with pack from Charleroi to Beaumont - a distance of 23 kilo-metres (15 miles).\n\nBillet for night at Beaumont.\n","50":"\n\nSet out from Beaumont and arrive at Jeumont.\n\nHearty welcome.\n\n- Make up for lost meals & sleep.\n\n- Begin to read \"World Builders All\".\n","51":"\n\nA long letter to \"Elm Bank\"- Diary for English furlough re-written.\n","52":"\n\nMany letters written. Complete reading of \"World Builders All\".\n\nPreparation of New Repertoire.\n","53":"\n\nSabbath - Future Plans & Hopes.\n\n- Walk to Erguillines. Receive Australian & English Mail. Commence replying to same.\n\n- New Testament (Second Reading).\n","54":"\n\nSecond reading of \"Palgrave's Golden Treasury\" - More letters written - New Repertoire -OXENHAM SERVICE \"AUSTRALIAN POETS\" - etc.\n","55":"\n\nSecond reading of \"World Builders All\".\n\nLetter writing - Rehearsal - Learn new numbers.\n","56":"\n\n\"Palgrave's Golden Tre\naa\nsury of Verse\"-\n\nDiary - \"World Builders All\"-\n\nCompletion of replies to letters.\n","57":"\n\nAdditions to repertoire - Bad weather. A show that has a good reception \"Lichtenberg\" & \"Ma..Poo\" - Golden Treasury of Verse.\n","58":"\n\nSitting & waiting for a last trip across the Channel.\n\nPeace Conference - M. Clemenceau. Pres. Wilson's return to U.S.A.\n\n- New items prepared.\n\n- Further unpleasant weather. Commence reading \"Pilgrim's Progress\" - The Faith grows - absence of melancholia.\n\nMarch - 1919\n","59":"\n\nA morning walk - German destruction - \"Pilgrim's Progress\".\n\nReceive letters from London & Birthday Parcel from Home - a huge cake and its \"baptism of fire\".\n\n- A Cinema show that proves a failure.\n","60":" \n(Sunday)\n\nContinue reading \"Pilgrim's Progress\". Learn poems from \"Golden Treasury\".\n\nWrite letters to Home & \"Elm Bank\".\n","61":"\n\nMarch rains & winds - Present months sailings to Australia clear the air a little. Jeumont as uninteresting as ever. The \"Daily Mail\" affords a little diversion. More letters - and \"Pilgrim's Progress concluded.\n","62":"\n\nThe \"Mardi-Gras\" or \"Shrove Tuesday\" - Pre-war celebrations cancelled. Prepare new items. Write \"final\" letters to friends\n\n\"old & new\" - Dinner at the house of Monsieur la Chasseur.\n","63":"\n\nInvestigations reveal the fact that I am not on the \"demobilisation list\". Such is the organisation of the \"R.E.W.\" Having given particulars for third time I now find myself in the next draft - this going to leave, when?\n\nA morning walk and a French \"dejeuner\" .\n\nOnce again I break forth into a \"writing\"\n\nmood and write three poems.\n","64":"\n\nCommence reading \"Book of Snobs\"\" (Thackeray).\n\nHeavy rainfall\ns\n - Frank leaves for Blighty. For first time I become \"Cashier\" and Box Office Man.\n","65":"\n\nStill busy with \"repertoire\". Letter to Madame Griffie. The waiting game begins to pale. Peace Conference and its successful issue\n","66":"\n\nNew members join \"Remnants\" - Two new poems written - Box Office duties.\n\nLong letter from Elm Bank.\n\n- \"Book of Snobs\".\n","67":"\n\nSabbath - Letters - Reading - Writing.\n","68":"\n\nBox Office & Cashier Duties - \"Book of Snobs\".\n","69":"\n\nLetters written - New & original poems. Ralph Sawyer reports\n\nfrom Horseferry Rd. for duty at Aust. C.R.E. Further news of R. Carlisle.\n","70":"\n\nRain & wind - wind & rain - Scarcity of letters. \"The growing Faith\". The absence of melancholia.\n\nUsual duties.\n","71":"\n\nThird anniversary of leaving Egypt for France on the \"Minneapolis\". A visit to the Ambulance - Old faces & old memories.\n\n- An endeavour to return to 7th for purpose\n\nof early demobilisation.\n\n- Charleroi - Jeumont.\n","72":"\n\nLetters to and from Blighty. News of R. Browne & Mark.\n\nComplete book of \"Snobs\" - New poem.\n\nShipping troubles interfere with embarkation.\n","73":"\n\nStill Cashiering!\n\n- Oh! the monotony of sitting & waiting.\n\n- Washing-day - Energy & Sunligh soap.\n","74":"\n\nSabbath -\n\nA long walk -\n\n\n\n\n\nThe New Testament.\n\nA Universal Religion.\n\nIts possibilities.\n\nLetters to English & Australian Homes.\n\nApplication for return to the Ambulance.\n","75":"\n\nBooking during the day. Letters written. Times are very dull, but I am not discontented.\n","76":"\n\nDiary - A canal-side walk with \"Digger\" - The New Repertoire\n","77":"\n\nThird anniversary of arrival in France - Box Office Duties. \"The impending strikes\" - Letters.\n","78":"\n\nAnother anniversary. Two parcels posted to Home.\n\nNews \"re\" Unit & demobilisation. Last day at Corps Workshops. Preparations for the morrow.\n","79":"\n\nReveille 7 a.m. - Leave Aust Corps Workshops at Jeumont\n\nfor 7th Fld Amb. at Charleroi. Pass through Beaumont & Charleroi and complete the journey at Mont sur Marchienne where I rejoin the Unit after an absence of two years.\n\nOnly a few old faces remain - \"5th & 7th\" Ambulances amalgamate. An argument with the Q.M.\n\nJack Davey. Stan Capper. Bob Weir. Ern Goddard etc. etc.\n\n- Search for a billet - The result\n","80":"\n\nA \"snowstorm\" repeats itself. Memories of Morbecque in 1916 - English Leave and Australian drafts cancelled indefinitely. Miners troubles. Meet more old acquaintances.\n\n- A \"Re-union Evening\" of 7th F.A. Musical Items. Dancing. Refreshments. Many civilians present. Before coming to Charleroi I heard a good deal concerning the kindness and hospit-\n\nality of the Belgian people. Now I am personally having experience of their many good qualities, for I am in occupation of the finest billet in & around Charleroi. But then all of our\"Boys\" say the same. Monsieur & Madame Hiernaux and little Maria. Their love for the Australians. My appreciation of these new made friends and my \"new home\" .\n","81":" \n(Sabbath)\n\nLetters to London - On \"picquet\" duty - The Motor transport lines. A soiree given by 5\/7th F. Amb. A better & brighter evening.\n\n\"The spirit of Belgium\" - The house of Monsieur Hiernaux - \"et la chambre de Jim.\n\nBack in Blighty - or perhaps Australia!\n","82":"\n\nPiquet-duty ends - Prospects of an early move - our disapproval - \"Choc.\n\nalate au lait\". My approval!\n\nAn afternoon spent with the pen.\n","83":"\n\nNew Poem. No duties. \"The good & bad in races - Unfounded stories of the Belgians. The news regarding a move from Marchienne to Marcinelli fills the \"troops\" with dismay - Monsieur Hernaux and the petition -\n\nHis father a professor of Engineering - Himself a commercial man & a gentleman -\n\nSupper nightly.\n","84":"\n\nFatigue duties - Another Poem - A parcel from Home.\n\nThe stir caused by Sydney and \"Our Harbour\"- Reading writing & walking.\n\nAn evening with my new friends - Monsieur as a linguist - French. German. Spanish. Italian. English. Dutch. Flemish. etc.\n","85":"\n\nOfficial news of departure to \"England\"& thence \"Australia\" - Hurrah!!!\n\nMadame et Monsieur sont tres triste! Another poem written, entitled \"Australia\".\n\nTalks with M. Hiernaux.\n\nLetter and book from \"M.D.E.M.\". Writing & Ambulance Duties.\n","86":"\n\n5\/7th Fld. Amb. Final Dinner. Verses written.\n\nOthers posted to Australia - Piquet duties - The Boarding of the Draft. Mont-sur-Marchienne - Its people \"His House in Order\" (Pinero)\n","87":"\n\nParade.\n\n\n\nClothing particulars.\n\nHeavy snowfall.\n\nMedical examination.\n\nLetters to Home.\n\nAn agreeable break in the weather.\n\n\"Thanks, Australia, for lending us the Sun for a couple of hours\".\n\nQuiet, enjoyable evening.\n","88":"\n\n(Sabbath) Dinner with Monsieur & Madame. Preparations for departure. In marching order we leave M. & M. after being \"farewelled\" by troops & civilians\n\nHeavy fall of snow.\n\nArrive Marchienne-au-Pont - then to Charleroi. Necessary demobilisation cards \nreturne\n obtained.\n\nReturned to Mont-sur-Marchienne for the evening and night.\n","89":"\n\nReveillez 5.30 a.m. Early breakfast. Tearful farewell. Leave Monsieur & Madame whose generosity & kindness will always bring pleasant memories of Belgium - Charleroi - Speech by General. Our quota \"No 23\" (1,000 strong Infantry & Details 2nd Div).\n\nentrain at 10 a.m. & as the train draws out from Charleroi an Australian band plays \"Auld Lang Syne\" and \"Home Sweet Home\".\n\n- Troops well provided for - Food & comforts.\n\n- Pass through Mons & Arras. etc.\n\nApril - 1919\n","90":"\n\nLight hearts & good fellowship. Glorious weather which improves as we go South.\n\nA long day in the train - Incident concerning a Chinamen - Arrive at Harfleur (Le Havre) at midnight. Sleep in the train.\n","91":"\n\nDisentrain at 6 a.m. March to A.G.B.D. Meet old friends - Norman Frettell. Billy Dick. Disappointment through not seeing Herb\n\nMedical inspection of \"23\" quota. Bathing & disinfection. Return of equipment.\n\nLetters written. Diary.\n\nMake the acquaintance of Frank Johnson the \"South St\" Elocutionist & Blue Ribbon Winner, who is showing with \"Wattle Birds\". The Frank that \nwas\n and \nis\n!\n","92":"\n\nFrom one camp to another. A dancing lesson (?)\n\nSeveral parades.\n\nPerfect weather .\n\nA very interesting talk \"re \" Repatriation of A.I.F. Members.\n","93":"\n\nClothing issue - Rations - Parade at 12.30 and move out of camp in motor lorries - to the harbour of Le Havre.\n\nEmbark on the St David and set sail for Southampton at 5 p.m. Military band plays the \"Marseillaise\" and \"Good-byee\" as our vessel leaves the land. A last long view of France\n\non a Sunny day. It is when we love France best. The sun is now bathing with its warm flood of light the early Spring flowers that grow wild in the wheat & corn fields and the vines that \ngrow on\n creep over rustic village cottages.\n\nThe little white crosses that adorn the graves of our brave comrades seem bigger, brighter & bolder when skies are so blue and sun so golden. To all & everything in France & Belgium, my parting blessing & my tears!\n\n\n\n1919\n\nDiary. O.A.S.\n\nfrom","94":"\n\nto\n\n\n\nJune 16th\n\nRead \"The Pocket Thackeray\", which consists of popular excerpts from the works of the novelists - Note book entries - The \"Rio Negro\" is now reported to be 350 miles behind our ship. A nasty cold causes discomfort. A \"home remedy\" is brought to light.\n\nJune 17th\n\nNearing the \"Cape\" - four days sail to Cape Town. Will we be allowed ashore?\n\n\"Quiet Talks about the Tempter\". (S.D. Gordon.)\n\nDeck sport semi-finals - \"B\" deck reduces \"D\" deck's lead. Bible Class. Discussion on the Master's indignation in regard to our present day social, political and religious life.\n\nStudy of a \"Short History of Australia\" (SCOTT)\n\nJune 18th\n\nLetter writing - Reading - Life-boat drill. Finals of deck sports. \"C\" Deck, the winners with 39 points our own deck second with 37.\n\nA stiffSouth West wind has now been blowing many days and is apparently impeding our progress - our average is growing lower each day.\n\nNotes from \"Thackeray Book\" - Australian History provides interesting study.\n\nJune 19th\n\nThe usual morning parade and inspection - A talk about Cape Town (which we expect to make by Saturday).\n\nThe Sports Prize giving Concert on the Aft Deck - \"Carry On!\" and the \"Gas Helmet\" given for first time. A beautiful moonlight night, and midnight meditations on the deck. The humours of the day: A digger is discovered playing \"patience\" at two o'clock in the morning.\n\nJune 20th\n\nDiary - Continuation of the long letter to \"Elm Bank\". \"Australian History\".\n\nsewing and washing.\n\n- Late this evening we enter Table Bay and cast anchor.\n\nJune 21st\n\nSteam across Table Bay at dawn and witness a beautiful and inspiring sunrise - My final glimpse and impressions of Cape Town - Far above us and stretching away for miles is \"Table Mountain\" (3,500 ft. high) so called because its top is flat and resembled a huge table. Below this table -\n\nlike formation is Table Bay which takes its name from the mount. Table Mountain with its precipitous cliffs has its long level summit hidden by dense white clouds, which gives it the appearance of being cloth-laid, while out of the valley the morning mists rise along the sheer side of the mountain. Likea lion crouching in an attitude of watchfulness, another section of the hills (appropriately termed \"Lions Head\")\n\nrises (like Table Mountain) far above the City of Cape Town, which nestles at their respective bases and along the shores of Table Bay, while in depth it stretches from the shore to the Kloof.\n\n- Docking & berthing facilities which are very good are in an artificial harbour, the numerous piers and break\nways\n(waters) forming a system of wharfs and mooring places which are connected with the Town by a railway service.\n\nThe \"Rio Pardo\" is moored alongside of the Australian Transport \"Aeneas\" (which sailed from England four days after our departure and reached the Cape two days sooner). Greetings & \"sarcasms\" are exchanged.\n\nAt 11 a.m. the personnel of our vessel is granted leave for the day.\n\nUnfortunately I am one of the few who are detailed to remain on duty. Apart from occasionally viewing Table Mountain. Table\n\nBay, Lions Head and the red roofed houses of Cape Town, I see nothing of the City, and so pass a quiet and rather a slow day.\n\nIn the afternoon mail is despatched to London & Sydney. At midnight Roy & Alf return with great reports of Cape Town and its people. A midnight meal of cakes and pastry is much enjoyed.\n\nJune 22nd\n\n(Sunday)\n\nA wet day! Malteureusement!(?)\n\nAt 11 a.m. Roy & I leave the Rio Pardo and walk into Cape Town. After a stroll along the main thoroughfare (Adderley St) and a spell in the Anzac Lounge (an institution which is under Y.U.C.A. supervision) we spend an hour of observation.\n\n- Cape Town and its inhabitants. The Black & White Races and their divisions. The colour distinction as applied to the Kaffins.\n\n- The White & Native\n\nQuarters. A quaint church and its simplicity of style and architecture. We take a Camp Bay Car from the City in response to an invitation of yesterday and are shortly in the home of Mr Higgo - an old Cape Town resident. This part of the District is called the Kloof which is the Boer or Dutch equivalent of our word \"Cleft\".\n\nIt is actually the dip or valley which was between Table Mountain\n\nand Lion's Head. The Kloof is clothed with pines and poplars out of which the mist can be seen rising to join the clouds above Table Mountain - Vegetation very similar to what may be seen in parts of Australia is also growing in the bed and on\ne\n the sides of the Kloof.\n\nMr & Mrs Higgo. Mr & Mrs de Villiers and the sons & daughters of the former. In the home of Mr Higgo - \"Kloof\n\nCottage\", we are made very welcome by newly-made friends and we sample throughout the day pure, free & unadulterated hospitality as dispensed by \"South Africa\". A long talk with Mr Higgo who has resided in Kloof for twenty-eight years, and who for many years has been a health inspector\ns\n on incoming vessels etc reveals much of interest.\n\nSuch\n \nA great deal information is gained about the\n\nS. African War - Cape Town and the surrounding districts. The natives, and S. Africa in general.\n\nA self-supporting country - its achievements during the recent war.\n\nAfter an \nh\nearly \nmid-day \nmeal, which is sucha welcome change after Ship's food, we take a walk \na\nover the hill and down the road - in the direction of \"Camps Bay\" . Later in the evening a different road is taken and we\n\napproach\ning\n by mean of a zig zag course, \"Table Mountain\".\n\nThe scenery (so different from England or France) is big, bold and in no less a degree \ninviting\n inspiring. Far away like a miniature city lies Cape Town on the shores of Table Bay.\n\nWhile doing both walks we pass and are overtaken by numerous men & women who are on their way to and coming from the mountains. In\n\nfact mountaineering appears to be a most popular past-time in the Cape Town District.\n\nAfter tea Alf joins our party and we have a final stroll, followed by a musical evening.\n\n\"Lichtenberg\"- brings together the names of S. Africa & Australia. Much fun & laughter.\n\nS. African sport. Yarns about the famous \"Springboks\" and the \"googly bowlers\".\n\nGood night and goodbye to Mr Higgo and family. These good people are friends of only a few hours acquaintance but we are not likely to forget them.\n\nBack to the \"Rio Pardo\".\n\nDuring the day the \"Aeneas\" has left for Australia (bearing our mail) and the \"Beltana\" has arrived in Cape Town.\n\nJune 23rd\n\nThe day of our departure -\n\nNews of the uninterrupted success of the Australian A.I.F. Cricket Team.\n\nLancashire defeated by an innings and 157 runs.\n\nBrookes & Patterson are successful in the Doubles Final at Kent.\n\nOn the 15th inst. there has been a great \"air flight accomplishment\". Capt. Alcock makes the flight in 16½ hours.\n\nPeace Terms are revised and submitted to Germany - and an acceptance is expected this day.\n\nAt 10 a.m. we have\n\na short route march returning to the ship at 11 a.m.\n\nAt mid-day the \"Rio Pardo\" is towed into \"Table Bay\", and then we commence in earnest the last stage of our voyage to Australia. Table Mountain & Lion's Head seen for the last time as our vessel draws away from land are indelibly printed in my mind.\n\nFarewell \"S.A.\"!\n\nJune 24th\n\nA heavy sea is fortunately with us - and our transport makes good progress.\n\nFurther study of Australian History.\n\nMess Orderly duties taken up for four days.\n\nJune 25th\n\nDuties on Troop Deck - Night recreation.\n\nA skipping rope and a little deck space provides good exercise. Study of\n\nAustralian History.\n\nJune 26th\n\nHeavy seas compel us to close all port-holes and to make preparations for battening down the hatch. Clear nights enable us to search the myriad-starred heavens in search of our Southern Cross.\n\nReading - The game of \"Rummy\".\n\nJune 27th\n\nConclusion of mess orderly\n\nduties. The very interesting \"History of Australia\" draws to a close during the day. Much information regarding Australia from the days of Tasman, Dampier and Cook down to the Age of \"Federation\" and finally the Great War is gained by the perusal of this book.\n\nGetting into form.\n\nProspects of a Physical Class being formed.\n\nGrowing tired of the\n\nhammock life.\n\nJune 28th\n\nThe study of new items - Heavy seas cause the boat to roll more than what personal comfort calls for. During the day we ship many waves and the boys fight shy of the low open decks.\n\nWashing day, but soon 'twill be no more!\n\n\"Old clothes, new clothes, boughtor souvenired clothes,\n\nWe have washed them cleanand washed them dirty,too, at times,\n\n\"Toilet soap or sand-soap,oft times do without soap,\n\nWashing is as popular asthese unprinted lines\n\nIn the evening the glad tidings are brought to us (as per \"wireless\" from Durban) that Germany has signed the \"Peace Terms\" and we are at last truly the Victors \nof\n\nJune 29th\n\nSunday -\n\nMorning church service.\n\n- A strong and telling Sermon by the Padre\n\nVivid illustrations.\n\nAfternoon Bible Class - Battles of the Old Testament. Evening Hym & Lantern Service.\n\nThe reciting of \"Not Understood\".\n\nAnother long letter to \"Elm Bank\" is commenced.\n\nFruit suppers are a welcome diversion from army issue and ships' food.\n\nJune 30th\n\nReading & writing. The last day of the second last month. We\n\nhave now been on the water 33 days and are growing happy with the knowledge that we have done a good deal more than half the voyage.\n\n\n","95":"\n\nJuly 1st\n\nThe last month in the Army!\n\nTuesday evening class. A new book commenced: \"Our Boys Beyond the Shadow\" by noteworthy clerics of England proves good reading and is productive of much thought.\n\nThe second stages of \"deck sports\".\n\nOfficers triumph in tug of war.\n\nJuly 2nd\n\nNews of the Aeneas, Beltana & Durham. These three vessels are ahead of us and are experiencing rough weather.\n\nConclude \"Our Boys Beyond the Shadow\" .\n\nThe growing popularity of our Wednesday evening hymn service is well marked on this day, when despite the bitter winds, rough seas and failing light a good number of the \"boys\" sit out the service on deck.\n\nStudy of new items.\n\nJuly 3rd\n\nWe wake in the morning to find a rough and angry sea tossing our boat contemptuously, with its huge rollers. As the hours pass the waters become more tempestuous, and it is neither comfortable nor safe to move about.\n\nFinding the troop-deck rather crowded and stuffy (with all portholes closed) I climb the steps in search of fresh air. A glance to windward warns\n\nme of approaching danger, and by natural impulse I dart into the hatchway just as a mountain-like wave crashes on to the \"Pardo\" sweeping its fore-deck and smashing the wash-house and rafts almost beyond recognition. At the same time the water finds an entrance to our troop-deck giving the boys a bath which was quite uncalled for. The whole action takes but three or four seconds, the noise and effect being not unlike the climax\n\nto that sound which:-\n\n \"Growing louder, shriller, clearer,Proclaims the heavy shell as it draws nearer.\"\n\nThis huge wave merely proves to be the first of many which sweep our decks throughout the day.\n\nNight approaches, but the anger of the sea does not abate. Strange though it may seem, it is the same vast stretch of water.\n\n\"That running by the Castle of Old Windsor, reflects mirror-like the trees that line the river's banks.\n\nThus truly may we say with Byron -\n\n\"Thou glorious mirror,where the Almighty's form\n\nGlasses itself in tempests; in all time,\n\nCalm or convulsed - in breeze,or gale, or storm,\n\nIcing the pole or in the torrid clime\n\nDark-heaving - boundless, endless, and sublime.\n\nJuly 4th\n\nAmerican Independence Day, and the anniversary of\n\nan eventful wedding.\n\nAs a result of the storm which still continues, our boat has lost many miles on the previous day's sailing, and is still doing so.\n\nSports, games, debates etc are cancelled.\n\nThe Study of the \"Grammar of Elocution\" (Millard).\n\nJuly 5th\n\nAllocation of Army Pay. The heavy seas greatly subside. We are now in wireless commun-\n\nication with Australia.\n\nIn the evening (while doing a little physical exercise) I skip in a single attempt 2,200\n\nJuly 6th\n\n Sunday\n\nSunday morning service - the latter end of which is carried out in the rain. Another very forceful sermon by our Padre. Continuation of second letter written while at sea to \"Elm Bank\".\n\nSunday afternoon Bible class & evening hymn service.\n\nAnniversary (nineteenth, I think) of Eva's birthday.\n\nJuly 7th\n\nConclude \"Grammar of Elocution\" (Millard) and commence \"Principles and Practice of Elocution\" (H. Innes).\n\nIn the afternoon some sporting events, and in the evening a very interesting Debate.\n\nThe subject is \"Should the R.S.A. be a Political body or not?\"\n\n\"C\" Company (with the negative side of the question),\n\ndefeat the Officers (affirmative).\n\nMessages (per wireless) sent to Australia. News from Sydney & Melbourne. Sporting results and a threatening strike.\n\nJuly 8th\n\nA ships'concert on \"D Deck\".\n\nA message of welcome to the \"Rio-Pardo\" and her troops, is received by W.A. Holman.\n\nSome of the boys also receive personal messages from Australia.\n\nJuly 9th\n\nThe sports are continued - Tug o' war competitions - A ship of 3,200.\n\nFurther study of \"Principles and Practice of Elocution\".\n\nPerfect weather becomes our lot as we draw nearer to our native-land. Our position on the map is conducive to much good humour amongst the troops.\n\nEvening hymn service proves highly popular.\n\nMany are the conjectures now made daily as to\n\nwhen we will make Melbourne. Friday July 18th is the favourite day.\n\nJuly 10th\n\nContinuation of the second stage of \"ship's sports\". Success of Sergeants in the tug-o'war. Is it due to superior food?\n\nCan sea-pie possibly cope with eggs & bacon?\n\nDuring the day many eyes are rivetted on the ships chart, for the indicator is now travelling from West to East at an interesting rate.\n\nAn hour in the \"Literary Class\". An interesting paper on Charles Dicken's by Pte Fowler, after which we discuss authors and their work.\n\nBy common consent I represent our deck on the committee which is to consider a token of appreciation and esteem to be given to the Padre.\n\nJuly 11th\n\nWireless news from Australia.\n\nThe Seamens Strike in Melbourne threatens to develop into a Nation-\n\nDebate\" (Should drink be nationalised?)\n\nal disorganisation of industries. During the afternoon I have no difficulty in winning the ship's skipping contest (348 in 2 minutes). In the evening the Padre\nthe\n gives a very interesting lecture on his travels in 1911 to London and then to France. Germany. Switzerland. Italy. Greece. Palestine. Egypt. etc.\n\nJuly 12h\n\nFurther news makes the outlook in Australia anything but hopeful. As a consequence the \"Rio\n\nPardo\" will now disembark all S. Australian & Victorian troops at Adelaide and will then proceed to Hobart. From there we will make for Sydney.\n\nAn essay on \"Affection\" written for tomorrow's class.\n\nOur boys are daily growing more high-spirited, and good feeling rules each day.\n\nJuly 13\n\nSunday -\n\nChurch Service\n\n\n\nAn excellent sermon!\n\nDeath of the ship's mascot - The monkey dies after eating an indelible pencil.\n\n£40 collected between the decks for the Padre's presentation - and a wireless is sent to Adelaide to order the article.\n\nAfternoon Bible Class & Evening Hymn Service during which I recite for the first time \"Jim Baxter'.\n\nContinuation of \"Elm Bank\" letter.\n\nA paper on \"\nAffection\n\" given at \"afternoon class\".\n\nJuly 14th\n\nSecond meeting of our \"Literary Class\" at which Private Loam gives an interest digest on a book entitled \" Can we set the World in Motion? (Enock).\n\n\"A & B Decks\" defeat \"C & D\" in a Debate the subject of which is Should Bachelors be Taxed?\n\nPreparation of a paper on \"The Newspaper\".\n\nJuly 15th\n\nWe are now crossing the \"Bight\"\n\nand the seas are considerably rougher than what they have been for the past week.\n\n- The whole of the day is spent in preparing my paper for the Literary Class.\n\nOfficers & Sergeants defeated by the Privates in a debate:- \"Is the League of Nations Practicable?\n\nJuly 16th\n\nA days sail from Adelaide!\n\nVictorians & South Australians spend the\n\nday in polishing boots, button, badges etc. Letters written to Home.\n\nIn the evening a Concert and Prize-giving takes place.\n\n\"A Fantasy\" (one of my War poems) gives delight to the \"boys\" and satisfaction to myself.\n\nJuly 17th\n\nOn rising we see Australia, under an Australian blue sky. It is three and a half years since I last sailed through this Gulf and four years since I donned\n\nkhaki. It seems like a lifetime! - it seems but yesterday! All men who are to disembark this day are wildly excited and we can but look on with envy, and of course a great amount of joy. After we are cleared by Customs & Health Officers we put into the Outer Harbour of Adelaide. A letter from Mrs Bice is brought to me, but unfortunately I am unable to comply with what it contains.\n\nA cheer goes up as\n\nthe \"Rio Pardo\" hits Australia. The Sth Australians & Victorians land and others of us \ngoe\n go ashore to stretch our legs. Roy, as usual, provides \"home comforts\" and after supper we turn in and sleep nearer to Home than we have been for a long, long time.\n\nJuly 18th\n\nLetters & telegrams have been sent from Adelaide - and so the news will be there today.\n\nAt 7 a.m. we are piloted\n\nout of the Harbour and set sail for Tasmania (we know not which Port).\n\nA great day with plenty of warm, bright sunshine. If this Winter, it is going to be dreadfully hot in Summer.\n\nI am now in charge of the Isolation Hospital, but luckily there are no patients.\n\nJuly 19th\n\nWith strong wind behind us we put up our greatest mileage - 275 for the day. Two patients\n\ncome under our care. Luckily they are bound for the \"Spec\" - and so up-to-date our chances of being quarantined are \"nil\".\n\nJuly 20th\n\nAnother good days sailing takes us further away, but brings us nearer Home.\n\nIn the afternoon I give a paper which constitutes a Literary digest of a book entitled \"The Newspaper\".\n\nOur Literary Class is considerably depleted but\n\na good number assemble on the sergeants' deck.\n\nIn the evening a \"digger\" who was a prisoner of war in Germany for two years gives \na\n a very interesting account of his imprisonment.\n\nThe work of the \"Red Cross\" and German cruelty are the outstanding features of his experience.\n\nA short concert programme is given in addition.\n\nJuly 21st\n\nAt an early hour we enter the Port of\n\nHobart and anchor in Barnes Bay. From\ne\n there all Tasmanians are taken to the \"quarantine station\" in a very small launch. The water is rather rough and great amusement is afforded us by the attempts of the \"Tassies\" to get from one boat to the other. Unfortunately (for them) it will be necessary to do 7 days in quarantine.\n\nOne of the ship's boats gets adrift and causes more merriment\n\nAfter all the \"Tassies\" have left the Rio Pardo, quite reluctantly, I am sure! - we steam out to sea once again.\n\nOf course the anchor is lifted before doing so.\n\nA very rough sea proves friendly after we turn North.\n\nJuly 22nd\n\nA bright, sunny day! At noon we have 411 miles to travel to \"Our Harbour\".\n\nWe now number 150 N.S.Welshmen and 40 Queenslanders.\n\n\"World Builders All\" is read for the third time. The \"diggers\" start cleaning up.\n\nKiwi is discovered in the bottom of old kitbags.\n\nA yarn with the Padre. Final Active Service Pay called in the evening.\n\nJuly 23rd\n\nThe first sight of \"Sunny New South Wales\". On a glorious morning we cruise within two miles of the South Coast,\n\nand throughout the day we sail quite close to the blue-enveloped shores of the \"Mother State\".\n\nIt is just eight weeks since we set out from Devonport. What promised to be a slow & monotonous voyage, has certainly been slow but (thanks to the Padre) far from monotonous.\n\nIt is now over, save for the all-important arrival, and we are all grateful for the protection, guidance & salvation which He has given us.\n\nDuring the day, \"discharge & furlough\" papers are filled in - and general preparations made for the morrow.\n\nWe expect to disembark at 10.30 a.m.\n\nThe sea is wonderfully calm, and strange to say, so are the troops.\n\nJuly 24th\n\nThe evenful day is very eventful, if not altogether pleasing. At day break we sight the \"dear old Heads\" and while our hearts\n\nare leaping with joy we behold the \"Captain Cook\" (pilot ship) coming out of the harbour to meet and escort us.\n\nAs it draws alongside the Commander, through a trumpet is heard to say - \"The Rio Pardo will sail around to North Head for purpose of quarantine.\" The whole ship then waxed wrath and for a short time I must confess the air was \"blue\".\n\nAfter casting anchor, the very pleasing\n\nnews is told us that we one of the men who left our vessel at Hobart had been taken ill and we were all suspected contacts of small pox.\n\nBut a word about our beautiful Harbour. It is a veritable paradise; a gift of Nature of which we may well be proud. It is the only Harbour I have seen for 3½ years.\n\nWe could appreciate it more, and rhapsodise at greater length, only for the thoughts of North Head!\n\nBut then are we not privileged in being allowed there? It is not everybody that can go to North Head - and I am sure it is not everybody that is anxious to remain there after a few hours have passed. On going ashore we have hot baths and all clothes and belonging are cleansed and fumigated.\n\nThen we graciously retire to our huts.\n\nBefore leaving the Pardo I am\n\nmost fortunate in seeing for the first time my loved ones - who have come from Home in a motor launch.\n\nJuly 25th to July 28th\n\nAfter spending five days in the quarantine station our vaccination marks are examined and we are then classified.\n\nThe food during these days is very poor and the life is frightfully slow. Our great consolations\n\nare in the forms of newspapers and a public telephone, around which the men swarm about fifty strong and await their turn.\n\nOn Sunday evening we have our final Service and the Padre gives good advice.\n\nOn Monday morning, much to our great relief a number of our party leave the \"Station\" for our Homes.\n\nWe travel to Woolloo-\n\nmolloo in a ferry-boat and find it particularly rough crossing the \"Heads\" . From Woolloomolloo we are carried to the Anzac Buffet in motor cars, and after a great deal of trouble owing to wretched weather and congestion we become finalised and then after joyful meetings we go\n\n\"H O M E \"\n\n\"Home Sweet Home\"\n\n\n\n\"Then Investment of Influence\".\n\n Newell Hillis\n\n(Oliphant Anderson & Ferrier)\n\n\"\nAnzac Coves\n\"\n\n\n\nMess Book\n\n\n\nDiary -\n\nApril 5th 1919 to\n\nApril 5th\n\nArrive Southampton 1 a.m. - Night passed on deck owing to the overcrowding of sleeping apartments down below.\n\nAnchored in Southampton Harbour till 6 a.m. when we steam into the wharf and there immediately disembark. A free breakfast and a train ration. Entrain and leave Southampton at 10 a.m.\n\nThe pleasant land of England in Spring -\n\nBursting through the dead brown leaves which cover the woody country, little green leaves & creepers are to be seen. The bare branches of the trees show signs of returning life, and the early Spring flowers \nand\n are budding and nodding in the sun-lit fields -\"Oh to be in England now that April's here!\"\n\nPass through Salisbury Wilton etc and disentrain at Warminster\n\nMarch to No. 6 Camp Sutton Veny. This district and surrounding country have many Australian Camps for War-time training purposes & for convalescents - Medical Inspection. Allotted to Huts - Liberal issue of blankets - food etc.\n\nApril 6th\n\nSabbath\n\nInoculated once again.\n\nLetter writing.\n\nVisit Y.M.C.A. & other Huts - Marked\n\nsuperiority of these institutions in England over those in France. A walk to Warminster on a particularly fine day.\n\nApril 7th\n\nMorning & Afternoon parades. Routine orders etc. More letters written. Again Meet Bob Roberts. Ern Payne. Ben Davies etc. Mr. John Goddard Entertainer.\n\nApril 8th\n\nParade. Diary. A break in the weather.\n\nRaining throughout the day.\n\nApril 9th\n\nVisit 1st Aust. General Hospital with Ben Davies. Afternoon tea with the Sisters.\n\nMusical items etc. \"Greenhill\" & \"Manor House\".\n\nApril 10th\n\nAgain meet Keith Harris.\n\nPreparations for furlough. For first time we have to pay for Railway Tickets. \"An injustice or not\"- Army masqueraders - and a \"camp robbery\". Meet Mrs Wighram of Manor House and give a few items. The village of Sutton and the Cemetery.\n\nApril 11th\n\nReveille at 5 a.m. Leave camp at 7 a.m. for Warminster\n\nStation where we entrain. - How different from proceeding on leave in France! On the journey we pass the factories of \"Huntley & Palmer\" - and \"TIcklers\" - Scotts Emulsion - Victor Tyres - \"His Master's Voice\" etc.\n\n- The White Horse and the Rising Sun on the Hillside.\n\nArrive Paddington 11 a.m. \"Elm Bank\" mid-day.\n\nAfternoon with the pen. Evening with Mr & Mrs Scales & friends - The Misses Sargent.\n\n- A late return to Hornsey Lane.\n\nApril 12th\n\nLate breakfast.- A run into town.\n\nPersonal purchases.\n\nBook at Theatres.\n\nSpend afternoon at Mme Tussaud's famous Wax Works and evening at the \"Court Theatre\" where we\n\nsee \"The School for Scandal (Sheridan) by the \"Twelfth Night\" cast. A great play with Herbert Waring the outstanding feature.\n\nApril 13th\n\nSabbath\n\nLetter-writing - Diary.\n\nMeet Bert Chesters. A long talk about old times & coming events. Afternoon & evening spent with Mr & Mrs Harold Scales - Elm Bank.\n\nApril 14th\n\nParcels made up & posted. More letters written. Poems copied. A busy day. Spend evening at Wimbledon where the great Tennis Courts are - Wimbledon Common.\n\nApril 15th\n\nMorning in town. Book buying. Parcel posting. Visit the Canadian Beaver Hut.\n\nGo to Hammersmith (A.I.F. Kit stores) but am not successful in obtaining old kit bag. Return to Elm Bank. Discuss future plans. A quiet, happy conversation.\n\nGarrick Theatre in the Evening - \"Cyranode Bergerac\" by the French Dramatist Edmond Rostand and featuring Robert Lorraine late B.E.F. in the name part\n\nAn excellent play with a weak cast and some faulty production. Stage too small for spectacular effects - Amateur acting - a great last act.\n\nApril 16th\n\nParcels - Letters - Diary - Kings Cross - Drury Lane - \"Samson & Delilah\". An Australian in the audience. A hurried departure, and a night in the corridor\n\n(Edna Thornton, Frederick Blaney)\n\nof the Scotch express.\n\nApril 17th\n\nArrive Waverley Station at 8 a.m. Again meet all at \"59\" - where I am made a guest. A morning in bed - an afternoon in \"Auld Reekie\" and an evening of music\n\nApril 18th\n\nMeet \"Bert\" the American brother and David. A visit to the Leith Docks where we see the\n\ninterned German Vessels. A \"picture house\" - D. Fairbanks.\n\nLast hours at \"59\" . Take train at Waverlry for London 10 p.m.\n\nFarewell to my Scotch friends.\n\nApril 19th\n\nAfter a nights travelling I arrive at Kings Cross at 7.30 a.m.\n\nGo to Waterloo for purpose of enquiry.\n\nReturn to \"Elm Bank\" - Australian & other\n\nmail. Leave Waterloo 12.30 - after a pleasant journey and a change at Brochenhurst. I arrive at \"Mentone\" Milford-on-Sea at 3.30 a.m. Milford overlooks the Sea and in the hazy distance lies the Isle of Wight.\n\nA jolly walk along the cliffs with Mr Scales, Mrs Matthews, Honor and Joyce. Much talk and laughter.\n\nA game of whist!\n\nApril 20th\n\n\"Sabbath\" - Church Service - an hour on the beach - Ducks and drakes on the water. Rhymes of a \"Red Cross Man\".\n\nLetters written. Diary.\n\nBeautiful Milford - spring weather.\n\nEvening service at the Milford Church. Several Recitations.\n\nApril 21st\n\nAn early morning walk along the sea-cliffs.\n\nThe fascination of the Ocean. Read & conclude book of \"Prayer\".\n\nA very enjoyable & interesting motor excursion. Starting from Mentone we pass along the Sway Road through Lymington & Lyndhurst. At Lyndhurst (20 miles from Bournemouth) we enter the local church famous for the fresco behind the Altar painted by Lord Leighton.\n\nA beautiful modern Church. An organ recital.\n\nResuming our journey we pass several old inns including \"The Wheel Inn\" & \"Ye Olde Servants Inn\" - and arrive at the New Forest famous for\n En \nearly English Hunting - Roman Roads. In the \"forest\ns\n\" we see the \"Rufus' Stone\" on whose three sides are inscribed:\n\n(1) \"Here stood the oak-tree on which an arrow shot by Sir Walter Tyrell at a stag, glanced and struck King William II (Rufus)\n\nin the breast of which he instantly died on the 2nd day of August anno 1100. King William II being slain, as is before related, was laid in a cart belonging to one Purkess and drawn from thence to Winchester and buried in the Cathedral Church of that city.\n\n(II) That where an event so memorable had happened might not hereafter be unknown, this stone was set up by Lord Delaware, who had seen the tree growing in\n\nthis place anno 1745. This stone was repaired by John Richard, Earl of Delaware anno 1789.\n\n(III) This stone having been much mutilated, and the inscriptions on each of its three sides defaced, this more durable memorial, with the original inscriptions, was erected in the year 1841 by William Sturges Bourne, warden.\n\nThe New Forest and its resemblance to parts of Blue Mountains\n\nReturn to the car and commence the return journey. After a run of a mile we stop at Minstead and enter the most quaint little church I have yet seen. The structure is of the 13th century, being restored 100 years ago. Private family pews - A double gallery - and the \"old three part pulpit\" provide an interesting inspection. The run back to Milford-on-Sea\n\nalong the Sway Rd and on towards the Mount past The Wheel Inn & Wain's Ford Bridge past Col. Cornwallis-West's House - A great trip! After dinner we take a walk along the cliffs and then indulge in a game of cards. Much amusement & hilarity - Bed.\n\nApril 22nd\n\nEaly morning walk on the\n\nseashore. Mrs Matthews, Mrs Scales, Honor, Joyce and self leave for Isle of Wight.\n\nMr Scales returns to London & Mr Matthews cycles to Southampton.\n\nOur party take the motor bus from Milford to Lymington Station then walk to Lymington Pier. From there we board a steamer and sail across to Yarmouth in the Isle of Wight.\n\nHonor Joyce & myself then set out on our walking excursion. Passing along beautiful country roads and lanes whose hedges trees, vines & creepers are smiling with the advent of Spring we soon make the cliffs of Alum Bay overlooking \"The Needless\". The blue waters of the Solent on such a bright sunny days present a fascin-\n\nating aspect.. Leaving Alum Bay we stroll to Freshwater Bay & rejoin Mrs Scales & Mrs Matthews on the beach. After a repast we return to Yarmouth in a brake and there take the ferry back to Lymington and a conveyance to Mentone - a day which will be forever remembered.\n\nHonor & Joyce - two English girls\n\nwhose unaffected good-nature and whose high spirits make them such jolly companions and good friends. Diary. Cards.\n\nApril 23rd\n\nA morning walk along the cliffs.\n\nShopping in the village with Mrs Scales.\n\nAn hour on the beach. A very precious hour indeed, during which I have my last long\n\ntalk to my \"dearest friend\" - Soul communion in the presence of Christ.\n\nAfternoon of letter-writing and reading on the cliffs.\n\nPoems read to my friends - Evening, while the twilight lasts is spent in the \"Pine Wood\" - Barry Pain causes laughter.\n\nLast game of cards. Much hilarity!\n\nBed.\n\nApril 24th\n\nEarly breakfast.\n\nMake preparations and set out for the village. My brave \"English Mother\" - Our sad & painful farewell.\n\nBid \"good bye\" to Mr & Mrs Matthews, Honor & Joyce whose great kindness is beyond my poor expression.\n\nMotor bus to Lymington - Train to Paddington (changing at Brockenhurst)\n\nShopping in town.\n\nReturn to Elm-Bank.\n\nEvening spent in making up parcels, writing letters etc.\n\nApril 25th\n\n\"Anzac Day\" - Anniversary of the Glorious Gallipoli Landing - Australians march in the City. Decorations, speeches etc. Shopping. Final business.\n\nFarewell to Mr & Mrs Harold Scales & the children.\n\nDiary - letters & preparation for to-morrow's departure.\n\nApril 26th\n\nMost reluctantly and with a sad heart I leave \"Elm Bank\" - and later in town I bid farewell to Mr Scales.\n\nTake 10.15 a.m. train from Paddington to Warminster. Return to Sutton Veny Camp.\n\nReport to Orderly Room & take up new quarters. Blanket\n\n& ration issue. The end of a perfect furlough.\n\nEarly to bed.\n\nApril 27th \n(Sabbath)\n\nThe Anniversary (51st) of Mrs Scales' Birthday. A mail received and many letters written.\n\nA walk around the camps. The lonely feeling - Past memories & future prospects. The New Testament & its friendship.\n\nApril 28th\n\nStormy weather.\n\nDespite \"time & season\" we have a heavy fall of snow.\n\nCommence reading \"Wuthering Heights\".\n\nMore letters received & written. Receive pay-book. Evening stroll.\n\nApril 29th\n\nMuch appreciated letters from Mr & Mrs Scales. Obtain my old sea kit bag which I have not seen for over three years.\n\nThe atomizer in good order.\n\nMajority of possessions missing. Morning parade. Warned for an early move to Fovant. Conclude \"Wuthering Heights\" and read a short book on Christianity & the War.\n\nLetters. Diary.\n\nApril 30th\n\nAnzac Sports day in the grounds of \"Greenhill'. Letters received & written. Commence copying\n\n1917 Diary. Many are the rumours concerning early embarkations etc.\n\nGreenhill Y.M.C.A.\n\n\n\n- 1919 -\n\n- May -\n\nMay 1st\n\n\"May-day\"\n\nRead & copy excerpts of \"God's Right of Way\". My growing interest in books of Christian knowledge. Unsettled weather. Keith Harris - now a father.\n\nMay 2nd\n\nA cold hot shower - Copy 1917 Diary - Afternoon fatigue duty. The unloading & stacking of 20,000 blankets.\n\nThe first chapters of a new book \"The Christian Message\" - Happy days. The value of earnest prayer.\n\nMay 3rd\n\nAt 1 a.m. the greater part of our 23rd Quota leave camp for London to take part in the \"Dominions March\".\n\nComplete reading of \"The Christian Message\".\n\nBooks bought & boxed from the Education\n\nal Library. Letters from London & Belgium.\n\nThe daily refreshments.\n\nMay 4th\n\nLetters to Home & \"Elm Bank\". Read \"Fight for the Future\" (E.A. Burroughs). Yesterdays injustices to Australians in the march and the result. Ration duties. An afternoon walk along a country road in the direction of Heylesbury - and\n\na bright \"Evening Service\" in \"Greenhills\".\n\nMay 5th\n\nFatigue duties.\n\nConclude \"Fight for the Future\". Resume transcription of 1917 Diary.\n\nCommence study of \"An Introduction to Study of English Literature\" (Hudson).\n\nMovement orders. Preparation for departure.\n\nMay 6th\n\nEarly reveille.\n\nMove out of Sutton Veny\n\nto Warminster. Entrain for Fovant. Pass through records office. Camp greatly over crowded. Many \"old faces'. Old tales re-told.\n\nMay 7th\n\nMorning parade. Tent erecting duties. Letter writing. A walk to the village of Fovant - Tipperary Hut - New & old friends.\n\nMay 8th\n\nFatigue duties.\n\nDiary & Letters.\n\nCamp Life monotony. Evening at the Garrison Cinema.\n\nMay 9th\n\nThe art of missing parades. A long walk, through Hurdcott and to the little English village of \"Barford St. Martin\". Letter writing & 1917 Diary.\n\nMay 10th\n\nBoat roll for the \"Nestor\" (previous trip H.R.A.). 54 men\n\nchosen. Not amongst the fortunate. Bag re-packed. Letters written .\n\nA woodland walk - Spring and its effect.\n\nMay 11th\n\nLetters written. More walks. Still waiting & watching. Some men I know in camp:- Sgts. Spain-Davey. Steele. Hand. Troup. Godfrey. Nugent. Eric Mills & Pres O'Brien. Murray. Roy McLaren. Hugo Robinson. Lenehan. Wasson. Doig\n\nHarden. Campbell. Zarka. McMillan. Hatchet. Ritson. etc. etc. \"Durham\" & \"Themistocles\" to leave very shortly.\n\nJack Davey departs for Port Napier.\n\nMay 12th\n\nMorning parade - white washing duties!! More men march into Fovant. Correspondence.\n\nMay 13th\n\nMy woodland haunt! In the midst of primroses and a violet coloured flower with the perfume of wisteria\n\nI read & write. A beautiful spot in a beautiful island breaks the camp life monotony.\n\nMay 14th\n\nMorning showers & evening walks. A new poem entitled \"Spring\" - Preparation & study of additional items. Letters.\n\nMay 15th\n\nAnother boat roll - the \"Durham\" to sail via the Panama.\n\n\"The Crucifix\" \"Edith Cavell\" & the \"White Cross\" written.\n\nAustralia plays cricket.\n","96":"\n\nMail from Home (March 31st). An erroneous address! Influx of A.M.C. men.\n\nMore old friends arrive.\n","97":"\n\nGreater ease in verse writing. The value of practice in rhythm and rhyming. War poems. Letter & some delicious chocolates from \"Westcott\".\n\nThe Benjamin.\n","98":"\n\nThe Peace Terms &\n\nthe German resentment. Marshall Toch goes to the Rhine. Parades & duties. Sunny days & fair flowers!\n","99":"\n\nOur Australian airman Hawker leaves America for the Trans-Atalantic flight.\n\nAt last I am placed on a boat-roll. Our vessel the \"Rio Padro\" is to leave Devonport on the 27th inst.\n\nMeet George Chapman\n\nFifth Division Quotas arrive from Weymouth.\n\nAlexander Watson in camp.\n\nMore verses and also letters written.\n","100":"\n\n\"Rio Padro\" - a vessel of 8,000 tons, which will carry 750 men. Farewell letters. Glorious weather. Washing day.\n","101":"\n\nNo news of Harry Hawker. The worst is feared. Australia predominates in Sport.\n\nMore farewell letters.\n\nNews from Harold.\n\nTwenty poems written in 9 days. Archie Martin & other friends now in camp.\n","102":"\n\nPay-day.\n\nRalph returns with surprising news. Complete letters. \"The Australian Rag\".\n\nWorld-wide sympathy for the lost heroic airmen.\n\nThe Diggers feel it very much.\n\nCourage of aviators wife!\n\nS. S. \"Rio Pardo\"\n","103":"\n\nFinal preparations - at 3.30 p.m. the A.M.C. quotas for the \"Bremen\" & \"Rio Pardo\" march out of Fovant Camp. Train to Salisbury then to Waterloo.\n\nNight at War Chest Club.\n","104":" \n(Empire Day)\n\nOur quota for \"Rio Pardo\" leave town for the Surrey Docks.\n\n\"Good bye big smokey London with its millions of people and its very happy memories!\n\nFirst impressions of our transport. They are\n\nnot over agreeable!\n\nAfternoon and evening in Bermondsey - A dirty district - Back to hammock-life.\n\nMeet a very old pal. Roy Cooney from North Sydney & S.H.S.\n\nI am delighted to have his companionship.\n","105":"\n\n(Sunday) - Draw out from Surrey Docks & down the Thames.\n\nMess Orderly duties. Good meals, and a clean vessel\ns\n.\n\nGreat news!- Harry Hawker & Commander Grieve saved. Letter written to my \"English Lady\". We are allotted to life-boats. Old days recalled with Roy.\n","106":"\n\nMond\n Cruising from the Thames to Devonport. A run along the South Coast of England in fine weather.\n\nCarrying duties.\n\nIn the evening we make Plymouth and\n\nanchor in the stream.\n","107":"\n\nPlymouth Harbour. Natural beauty. Not unlike Farm Cove in parts. The Rio Padro passes up stream and is moored to a wharf in the naval docks\nyard\n. The troops for the Pardo arrive per train. They consist\ns\n chiefly of 3rd Div. Infantry.\n\nBand selections by 39th Battalion. A last letter!\n","108":"\n\nReveille 6.30.\n\nAccount of Hawker''s & Grieve's rescue & return.\n\nAustralians to the front!\n\nStirring scenes.\n\nAt 11 a.m. we draw out from the wharf at Devonport and sail slowly down the harbour of Plymouth. While our band plays patriotic airs - \"Auld Lang Syne\" . \"Good-byee\" and lumps rise in our throats (for after all we are human & have human sympathies).\n\nThe Commanders, officers and crews of Britains Iron-clads stand-to and give us rousing cheers. By submarine destroyer. cruiser & battleship bearing the \"Jack\" and in some cases the \"Stars & Stripes\" we are truly honoured in a British manner and given a farewell so sincere & spirited that the passing years cannot possibly efface its stirring memories.\n\nWith a stilled tongue\n\nand a heavy heart I watch dear old England fade from view. There is but little more to be said. I am thinking deeply and my thoughts are fashioned into prayers.\n\nGod bless all & everything in the greatest island in the universe! Australia is a continent.\n\nThe letter is read; the sun sinks in the west - our ship draws nearer Home. Night covers it in the\n\nbroad expanse of sea.\n\nMay God watch over and protect us now and at all times!\n","109":"\n\nIn the Atlantic - The Rio Pardo rather exceeds our expectations in regard\ns\n to speed & sea worthiness.\n\nWe have a mascot on board - \"Ginny\" the monkey.\n\nY.M.C.A. & Canteen opens. A game of crib. Night in a hammock.\n","110":"\n\nThe introduction off a chart marking our daily course and rate of travelling proves very popular. At mid-day we are 510 miles from Devonport after having passed the Bay of Biscay.\n\nRead \"The Regent\" (Arnold Bennett).\n\nKeeping fit! How it is accomplished on a transport.\n","111":"\n\nLast day of\n\nthe month. At noon we are lying due west from Cape St. Vincent.\n\nPunching balls, gloves & medicine balls introduced. The weather hotter & finer and the sea a good deal calmer.\n\nFavourable winds prove most welcome.\n\nDuring the day I read & much enjoy\"Echoes of the War\" (J.M. Barrie).\n\nRecite at a \"Sing Song\" on \"A\" Deck.\n\n1919\n\nJune -\n","112":"\n\nSunday. Church Service on the \"Rio Pardo\". Our Padre a very popular man.\n\nThe boat shows a daily increase in speed. We are now approaching the Canary Islands. The first instalment of my long \"English\" letter is written and it will be continued on subsequent Sundays.\n\nDuring the evening\n\nI obtain & commence reading the Holy Bible - also a small book entitled \"How to Master the Bible (Gray).\n\nA Sunday night \"hymn service\" is a fitting & happy conclusion to the Sabbath.\n","113":"\n\nMorning parade & physical exercise.\n\nThe \"Rio Pardo\" stops in mid-ocean and drifts for two hours. Roy, Alf & self resort to dominoes & \"rummy\"\n\nWindsor Castle (Ainsworth) from Y.M.C.A. Library provides interesting reading. A concert on the aft-well deck.\" \"Suri Bair\" & \"Polyglot\".\n\nNightly study of the Bible. In the tropics. The sun is now getting well overhead and is intensely warm.\n","114":"\n\nMorning parade & inspection. Two small canvas swimming baths are erected near\n\nthe forecastle (pardon - foc 'sle!) - and afford much comfort and delight to the diggers.\n\nAfternoon deck sports.\n\nEvening card tournaments.\n","115":"\n\nComplete the reading of \"Windsor Castle . Evening song & hymn service.\n\nCommence the study of English Grammar.\n\nThe deck baths provide much fun. The book of Genesis - Story of \"Abide with me\".\n","116":"\n\nTropical weather does not appeal to the men after leaving the pleasant clime of England. A growing friendship gives much enjoyment and relieves the days of monotony.\n\nDolphins & porpoises racing with the boat and leaping from the water and flying fishes skimming above the waves provide a little diversion.\n\nMorning parades & inspection\n","117":"\n\nBefore noon our \"transport\" passes beetween Cape Verde & C. Verde Islands. Unfortunately we see neither - nor have we seen land since leaving England. The study of \"English Grammar\".\n\nIn the evening we are very happy to behold the \"Southern Cross\"in the sky.\n\nBefore turning in I havea little relaxation in the deck swimming tank.\n","118":"\n\nTrouble brewing! The fireman are apparently shorthanded and are being over-worked. In the forenoon we pass Sierra Leone.\n\nThe weather grows more oppressive daily - and we are not yet to the \"Line\".\n\nCommence \"Society & Solitude\" (Emerson).\n\nAcquatic sports. More dolphins and a shark.\n","119":"\n\nSunday -\n\nWhile on deck reading an essay on \"Eloquence\" by Emerson, a great change takes place. From afar, a storm can be seen sweeping up from the South, and shortly after we are passing through torrents of rain and the oppressive air grows cooler, as the seas grow more tempestuous.\n\nHow wildly, madly eloquent is a storm\n\nat sea and how attentive we become to the voices of the elements. The deep vibrato of the thunder and the shrill piping of the overhead winds are strangely contrasted yet it is one & the same voice with its great range and its wild threatening speech.\n\nAs the day draws into \nint\n night the storm clears and we have a bright service on deck.\n\nAlso some \"lantern slides\"\n\nand a \"request poem\".\n\nSecond instalment of my letter to \"Elm Bank\".\n","120":"\n\n\"Society Solitude\" (Emerson) - \"Outline of English Grammar\".\n\nThe Boxing tournaments commence. Short-lived bouts. Band recital. Draughts. cards & discussions.\n\nI make a new friend - Corporal Dubois and memories of Ballarat in 1913.\n\nJune 10th\n\nDeck parades and ship's inspection.\n\nFirst comes the ship's Commander dressed in white, closely followed by the O.C. of the troops.\n\nThen a retinue walking in the rear and halting. smiling & frowning when the \"Captain & Colonel\" halt, smile & frown. They proceed in this order:- Ship's mates 1st &","121":" - Troop's & ship's doctors. orderly officer. orderly sergeant. ship's\n\nO.M.S., Orderly Corporal and a few \"spare parts\" - numbering in all 12 men drawing \nabout\n more than £15 a day for their great responsibillities or £900 for the trip.\n\nWho pays?\n\nSecond day of boxing. Short fights with tragic endings.\n\nA Bible class under the Padre.\n","122":"\n\nFinals of the Boxing - A small\n\nman beats a big man and gains much applause.\n\nCorporal Brown hits out and Private Giles lays out.\n\nOur deck \"B\" gives a popular concert. In addition to reciting I make my initial effort to \na\n jazz accompanied ragtime.\n\n\"Solitude & Society\". An interesting & absorbing book by Emerson.\n","123":"\n\nDeck quoit.\n\ncompetitions. Complete reading of \"Society & Solitude\".\n\nEnglish Grammar proves hard reading & study.\n\nThe Southern Cross still beckons us on to a Southern land and a Southern sun.\n\nOur ship turns and apparently goes N.W. for a few miles then turns again to her old course.\n","124":"\n\nMorning study. Preparation of lessons\n\nfor afternoon.\n\nA long talk with our Padre. Read \"Poems of Optimism\" and \"Kingdom of Love\" (E.W. Wilcox). The troop-ship \"Aneas\" which left Devonport three days after the \"Rio Pardo\" is now only a short distance behind us. Daily our vessel registers shorter distances.\n\nAs we draw away from the Equator the weather becomes\n\ncolder and the sea rougher.\n","125":"\n\nA day spent chiefly with book and pen. A chapter by Donald Haukey.\n\nA new book \"Quiet talks about the Tempter\" (Gordon). Owing to certain throat troubles all the troops undergo a throat spraying operation.\n\n\"B\" Decks adds points to their aggregate.\n\nin point score competition.\n","126":"\n\nSabbath.\n\nMorning Church Service. Afternoon Bible Study. Third part of the \"Elm Bank\" letter is written.\n\nOur vessel is now only 1,400 miles from Cape Town. Is the Southern Cross shining more brightly as we draw nearer Home - or does that fact make it appear so!\n\nTo-morrow is the 16th.\n\n\n\nJune\n. Cook holding 30 francs\n\n\" We owe H.R, 20 francs.\n\n"}}