{"Document Name":{"0":"Diary_0185","1":"Diary_0185","2":"Diary_0185","3":"Diary_0185","4":"Diary_0185","5":"Diary_0185","6":"Diary_0185","7":"Diary_0185","8":"Diary_0185","9":"Diary_0185","10":"Diary_0185","11":"Diary_0185","12":"Diary_0185","13":"Diary_0185","14":"Diary_0185","15":"Diary_0185","16":"Diary_0185","17":"Diary_0185","18":"Diary_0185","19":"Diary_0185","20":"Diary_0185","21":"Diary_0185","22":"Diary_0185","23":"Diary_0185","24":"Diary_0185","25":"Diary_0185","26":"Diary_0185","27":"Diary_0185","28":"Diary_0185","29":"Diary_0185","30":"Diary_0185","31":"Diary_0185","32":"Diary_0185","33":"Diary_0185","34":"Diary_0185","35":"Diary_0185","36":"Diary_0185","37":"Diary_0185","38":"Diary_0185","39":"Diary_0185"},"Date":{"0":"unknown","1":536.0,"2":537.0,"3":538.0,"4":539.0,"5":540.0,"6":541.0,"7":542.0,"8":543.0,"9":544.0,"10":545.0,"11":546.0,"12":547.0,"13":548.0,"14":549.0,"15":550.0,"16":551.0,"17":552.0,"18":553.0,"19":554.0,"20":555.0,"21":556.0,"22":558.0,"23":559.0,"24":560.0,"25":561.0,"26":562.0,"27":563.0,"28":564.0,"29":565.0,"30":566.0,"31":567.0,"32":568.0,"33":569.0,"34":570.0,"35":571.0,"36":572.0,"37":573.0,"38":574.0,"39":575.0},"Entry":{"0":"\n\n","1":"\n\nTurks Sunday\n\nVery early this morning our patrol of New Zealanders on duty on our extreme left wing encountered a patrol of Turks. When a sharp engagement ensued, our men killing most of the Turks and chasing the rest with the bayonet and on finishing they found they had gone to far and were unable to get back as they would be exposed to heavy fire from Machine Guns & Rifle fire. So they had to take cover and remain there for the day. Turks poured a lot schraphnel on our firing lines this afternoon but did very damage. Our Artillery responded on every occassion. About 10.30 pm a rescue party went out to get the patrols in and succeeded with only losing 1 killed & 3 wounded. 12.30 pm Turks attacked on our left wing but were easily repulsed, leaving a lot of dead & wounded on the field. Towards morning things became very quiet again.\n","2":"\n\nFiring line during the morning very stale, hardly a shot being fired,\n\ngetting monotonous. Schrapnel very heavy from the Turks right through the day. Infaladedthe beach killing 4 & wounding several. Snipers also have the range of the beach. Sniping all day. One chap killed while swimming with us. Shot through the head. Needless to say we did not stay in long. About 8 pm we had a sharp engagement on the left wing lasting about two hours. Our casulaties were light. Enemy losses not known. The remainder of the night was very quiet.\n","3":"\n\nThings were very quiet during the morning, nothing doing. Schrapnel started to come into our Camp just at lunch time, they had a good range and succeeded in killing & wounding several of the Indians;also 10 mules; but before three o'clock we had their gun out of action. Went for a swim. Really enjoyed but the snipers seem to object so we do not stay in very long. Towards evening their was a great fusilade of Rifle fire but nothing came of it. We are still in the Rest CampWalkers Gulley.\n","4":"\n\nHeld Church Service at 9.30 am on the slope of a hill just at the back of the firing line. The Rev. Col. Wray assisted by Rev Capt. Gillison held the service;it was lovely to be able to sing the old hymns once again and the sermon was beautiful;it seems so strange having Church on the battlefield while bullets are whizzing all round. About 12 pm the Turks started throwing more schrapnel but the only damage they done was to kill 6 mules, seems such a shame. During the afternoon things became very quiet nothing doing in the firing line at all. Bombs seems to be fighting munition during the night.\n\nAt 6 pm our aeroplane returned after a long absence and flew over the Turks positions dropping three highly explosive bombs and also firing with her machine gun;would like to see what damage she did.\n","5":"\n\nThings very quiet all along the line, nothing doing except for a little\n\nschrapnel, but no damage was done. Still in RestCamp, having an easy time;had a good swim.\n","6":"\n\nVery sick today, can't eat or do anything. Doctor gave me a dose of medicine may do me good. Nothing startlingalong the line.Aeroplanes and Sea Planes very busy all the morning trying to locate a gun of the Turks. Schrapnel was not plentiful today, one mulebeing the only victim.\n","7":"\n\nStill crook but not so bad;firingline rather brisk early in the morning, but there's no change on either position, about ten o'clock Turksstarted to infalade our Rest Camp with shrapnel and Ledite. They were puting them right amongst our boys but still they did very little damage. Killing 3 three and wounding 3 on our side. On the beach schrapnel was very lively they put one right into the 4th Field Hospital cuting one chaps (who was already wounded) head clean off. Another instance they hit a mule and all that was left was his head tied up. During the evening things became quiet and was quiet right through\n\nthe night. \n","8":"\n\nAeroplanes started very early this morning having a look. Very amusing watching the Turksfiring at her; none of the shots going within miles of her. Schrapnel started very early this morning all along theline and alsoin our Camp.Casualties very rather heavy, one of our A.M.C was wounded but not too bad. The 9th Battn (Queenslanders) seemed to get more than their share of it, but our Artillery opened out and very soon quietenedthem. Aeroplanes very active again this afternoon dropping twovery high, explosive bombs.\n\nSchrapnel again before dusk came very suddenly and got quite a number of L. Horse boys and New Zealanders in the firing line. Bombs are doing all the damage not muchRifle Fire. Just on six o'clockP.M. one of destroyers got quite close into shore and opened up terrific fire all along the Turks trenches with ledite, most have done a lot of damage, as the Turks seemed to be demoralized runningabout every where, and then our machine guns opened up and simply mowed them down; a glorious sight to see, quite exciting, everything quite during the night.\n","9":"\n\nHeavy artillery fire starting very early this morning. Noise deafening fromthe shells whizzingand burstingover head,the fire kept up for some hours but very little damage was done. For some 500 shells which were thrown into our Rest Camp only two casualties was the result, the way they came everybody was expecting to be knockedat any minute.Down at Cape Hellis the Indianshad severe hand to hand fighting with the Turks against\n\nsevere odds. The Turks started to push the Indians back, but they rallied and after two or three hours hard fighting they pushed them back, inflicting heavy loses on the enemy and gained the positionthey wanted. The French did some lovely workwith their Artillery, from lunch time till about 4 P.M.things were very quiet, and then another large battle ensued and kept upright through the night.Casualities not knowthis morning, everything on our side is very quiet, the only thing our Boys sapping under the Turks and the Turks are sapping under us, its a case of who gets done first.\n","10":"1915\n\nBattle waged heavily from early morning right up till Midday on the right flank (Cape Hellis) our Boys attacking the Turks covered by French Artillery, they advanced, and captured two lines of trenches, position unchanged on the rest of the line nothing but schrapnel doing any damage. Aeroplanes are very busy this last few days always dropping a few highly explosive bombs. One flew over one of the Turks batteries and dropped two bombs on it. Damage not knowotherwise things very quiet all along the line.\n","11":"\n\nOnce more we had Church Service. Seems nice to be able to go to Church once a week and to be able to sing some of the good old hymns. Reminds one of home. Sunday morning was very quiet except for an occasional shot be fired but during the afternoon things became very active and you could hardly hear yourself speak for the noise of rifle shots and schrapnel. Aeroplanes went up to see what was doing and droppedthe usual couple of bombs about 10.30 PM. The Turks attacked ourleft flank but were repulsed leaving a number of dead on the field. At Cape Hellis the French and 29th Div. kept up a heavy bombardment right through out the night.\n","12":"\n\nOn our position things are quiet andunchanged; nothing doing. But at Cape Hellis the French advanced and captured one line of trenches, they were then reinforced and continued the assault taking the second line of trenches, then with the aid of the Battleships and their own artillery they again advanced\n\nthe time being then 11 AM.Aviators reported that the Turks were moving in large masses in a North Westerly direction under heavy fire from the Frenchartillery. Other parts of the line very quiet, we are still in the Rest Camp and enjoy a good swim every day. Received mail from home today.\n","13":"\n\nEarly this morning a report came through that the French had wiped out a whole Turkish Batl. with 75 MM guns killing the lot before they had time to scatter. Positionmuch better and stronger than before. Schrapnel was thrown in large quantities from the Turks but did very little damage. Otherwise things very quiet.\n","14":"\n\nTurks evidently have a new gun in position infalading the beach and also our camp. Casualties amounting to about 30 killed and wounded. One of our Boys was in swimming and a shell hit him blowing his arm clean off;another Boy was blown out of hisdug out in pieces. Destroyers did a lot of\n\nbombarding during the afternoon. Firing line very active for about two hours;remainder of the night very quiet.\n","15":"\n\nEverything very quiet this morning hardly a shot being fired. About 11.30 AM things livened up a great deal; shells and schrapnel flying in all directions. One of our destroyers werehit but not damaged very much and one of our water barges full of fresh water was sunk. Schrapnel did not do so much damage during, only about 20 casualties being recorded. The Battleship (Monitor) did a good deal of firing during the afternoon completely wiping out a transport train of provisions at Gapa Tepe . Towardsmidnight the firing line was very active keeping upfor about twohours, after that things became very quiet.\n","16":"\n\nMy birthday\n,quite a strange place to have a birthday but Abduldid not throw muchschrapnel during the morning - so I had quite a nice and quiet time but at lunch he\n\nmust have woke up for he started throwing shells of all sorts and sizes but our destroyers went in and returned the fire blowing in part of their trench and then six of machine guns started firing and they must have done a great damage. At three o'clock the Lord Nelson and six other battleships accompanied by about a dozen destroyers also a big observation balloon started a big bombardment and 4 PM Chanak was in flames, then they came up after receiving a report from the balloon and put about 30 shells in atGaba Tepe were the Turks were reinforcing,quite like old times to see them bombarding. Received mail from home which was another good thing to have on my birthday.Zepelins was sighted on Thursday night but up to the present they have not been over our position. At 7 PM last night a German Aeroplane flew over our position at Popes Hill dropping paperasking them to surrender or else they would drive us into the sea. Quite a joke amongst the Boys. Rifle fire was very heavy during the night allalong the line. The French in their\n\nlast charge captured 5 square miles after a heavy bombardment. They put 5,000 of 75 S.M. shells into they piece and when they advancetheir was not a living soul left, but they infaladed on both flanks by Turkish machine guns.\n","17":"\n\nThe day started very lively, schrapnel coming from all directions on to the beach and into our Rest Camp. Casualties through the day was very heavy on the beach, rifle fire was very slack during the day but towards evening there was a greatfusilade of fire,Artillery and destroyers doing a damage on the Turkish trenches blowing them in in places. About 4 PM the Turks made an attack with bombs on our left flank but were repulsed. We then counter-attacked them. These casualties were about 400 killed &wounded including the Colonel wounded and Major & Adjuant killed belonging to8th LH. Everything then quietened down.\n","18":"\n\nThe Turks suprised us this morning by opening up a heavy fire from howitzers in new positions. They did an awful lot of damage on the beach killing and wounding about 50, two chaps had just finished swimming when they were blown absolutely to pieces, horrible sight to see. Our gunners know where the the gun is but it is impossible to get it with our artillery or the gun boatssovolunteers were called from the Infantry to go out and try and capture it,result of the expedition not know. Bombs were freely used during the afternoon doing a great deal of damage. Swimming in the day time is not allowed now so we go down after dark. Aeroplanewas very busy out scouting yesterday very amusing to watch the Turks firing at him never going miles of him.\n","19":"\n\nThe ninth Batl. &11th Batl.made an attack first thing this morning capturing 3 lines of trenches also the gun that was doing all\n\nthe damage. We lost pretty severely, the casualties being something like 300 killed & wounded but the Turks lost heavier. The attack was princably to keep the Turks engaged while another Brigade landed and which also advanced 1,000 yards. The Turks infiladed the ninthfrom both sides with machine guns but after a furious counter attack from the Turks which was repulsed with severe loses to them we made another advance capturing their firing line &also Communication trench. The firing continued right up tillmidnight when they quietened down.\n","20":" 1914 \n\nWar waged heavily right from early morning, the French and Tommies making numerous attacks which were all successfultaking and holding threelines of trenches. We also have our position right across Krithiaroadwhich cuts off all reinforcements & supplies from the south, during the afternoon a heavy bombardment from French Artillery & Boats started on AchiBabaand last night the French\n\nadvanced again taking two more lines of trenches and capturing about 500 prisoners. On our position the Turks charged between Quinns Post and Popes Hill but our machine guns got every one of them. It was a most weird sight. Schrapnel flying in all directions and it was dusty windy night. I was glad when morning came. Schrapnel through the day hasnot been quite so bad.\n","21":" \n\nThe Turks made an attack on our right flank about 3.30 AM this morning and were repulsed leaving 180 dead in the valley between Fishermans Hut and Walkers Ridge. They also made a charge across a valley at Popes Hill. Something like 100 was killed and several prisoners were taken. The prisoners were in a awful state, old clothes, no water in their bottles and they were only issued with 1 Biscuit & 1 small onion to last them 24 hours. On our right heavy fighting still continues. We keep gaining ground and strenghning our position, our position atQuinns Post and Popes Hill is\n\nwonderfully strong, secret saps and trenches all over the position. Cannot see a Turk for hours at time. After their last charge they must be getting downhearted. Schrapnel was thrown practically all day but there were very few casualties.\n","22":"\n\nWoke up with a heavy cold andtoothache but I went to the dentist and had it out so I will soon be A1 again. About the quietest day that we have had for some time, not a shot or a gun being fired. It seems weird nothing doing. They are evidently preparing for another attack. We expect to make an big advance onleft flank in a few days. I wish we would hurry up, amsick of staying in the one place.\n","23":"\n\nEverything was very quiet through the night but early in the morning the French and Tommies at Cape Hellis opened up a heavy bombardment assisted by the Destroyers causing the Turks to become\n\ndemoralised. Their dead for the last few is over 1400 killed without wounded. The ninth Batland L. Horse encountered a regiment of Turks who were evidently a Regiment of the Sultans, as their uniforms were very gaudy being trimmed with Red Plush and Gold Braid but we accounted for nearly every one of them. We had a few casualties during the day caused by schrapnel,a New Zealand Major being severely wounded and another chap being killed. The sea at the beach is very rough, impossible to land, anything wounded or sick cannotgo away.\n","24":"\n\nThings fairly quiet this morning but got rather heavy with schrapnel about midday. 500 Manois landed at our position during the morning, fine big chaps. During the afternoon, rifle fire in the firing line was very heavy but nothing came of it. On the extreme right heavy fire and a very heavy bombardment was going on right throughout the day and night.\n","25":"\n\nVery early this morning schrapnel was poured in at water supply killing 1 and wounding fiveof the","26":" Batl. A similar number of the 16th was also wounded. The Turks blew up a supplytrain belonging to the French in the afternoon doing a lot of damage. During the afternoon things were very quiet but towards morning a big artillery battle was raging lasting for about 6 hours but no damage was done. The Turks evidently have a new gun inposition as they were throwing large shells over into the sea. One Transport Boat was hit about 5 o'clock. She had to leave for Lemnosstraight away.\n\nMonday July 5th 15\n\nFiring very heavy this morning but very little damage. A French Transport was sunk with shell fire from Turks. Our Fleet captured 2 hostile submarines during the day which have been doing a lot of damage. Turks brought a 14\" gun into position\n\nduring the night but only fired 4 shots before she was put out of action. Firing line very quiet. Turks losses from 28th June till 2ndJuly amount to 20,000 killed and wounded.\n\nTuesday","27":"\n\n16th Batl. went away last night for a spell,don't know when wewill be going. The Turks threw schrapnel at them from the time they left until they got out of range. One ofsubmarine went for a 24 hourtrip up the Sea of Marmaraand sank altogether 18 boats including 2 transport supply ships. Everywhere else things are very quiet.\n\nWednesday","28":"\n\nNews through from Cape Hellis. French advanced under cover of their heavy artillery fire capturing 3 lines of trenches and the British captured 2 lines of trenches. Our casualties wasfairly heavy but the Turks lost heavily, some 400 being killed alone. During the afternoon a German aeroplane was brought to earth. The Turks made desperate counter attacks to retake their positions but\n\n\n\n\n\nwas easily repulsed on every occasion. The Battleships still continues heavy bombardments down at Helles.\n","29":" 15\n\nDuring last night the Turks made numerous counter attacks on the French and British trying to retake their position as it isa most valuable one; but each time they were repulsed. The 9th and 11th Batl and 8th Light Horse were attacked by the Turks but were repulsed and were demoralised by our Batteries and machine gun fire. Our boys then made a counter attack capturing 1line of trenchand a Communication trench. Our chaps lost heavy from enfilade firebut still they hang on and they have now consolidated their position. The Turks threw a fair amount of schrapnel into our Bivouacduring the day but only wounded two men. They also bursttwo our water supply tanks.The Destroyers came in a put about 30 shells into the Turks position,we got a good view from Walkers Ridge, our machine guns then played on them doing a lot of damage.\n","30":"\n\nThings are fairly quiet this morning barring a little schrapelthere'snothing of value. About dinner time everybody seemed to be lively. The Turks opened up a heavy fire with Artillery, our chaps replying but I don't think much damage was done to either side. One piece of land where the destroyers always shell is very flat and itis impossible for the Turks to come out onto it as our guns would get them and if we go out their guns could get us, which they have on ridges further back. Two batteries,Howitzers from Malta, arrived today and are put into position on our right wing where our last troops landed between Gaba Tepe and Cape Helles and where we hopeto shortly join up firing line up right across the Peninsulars.\n","31":"\n\nHeavy bombardment still going on at the Camp,we blew up threeof their guns, also a transport supply column during the\n\nmorning and they kept up a heavy fire all day blowing up a French magazine and spilling some 2,000 gals of wine. We are still making a steady progress and after AkiBaba has fallen the worst of the war will be war , amost valuable position. Our chaps made another attack (the 8th LH)they made an advance and our Casualties were 40killed andwounded, mostly from bombs while some 100 dead Turks were left lying on the field. Enva Pasha was in the trenches.\n","32":"\n\nChurch service this morning. The Turks threw a lot of schrapnelinto our Bivouac without doing any damage. Heaviest bombardment during the day since we arrived. Aeroplanes and balloons all over the place. We landed a 4.7 gun this morning which ought to do a lot of damage whenin position. One Cruisercame into our bay and opened up a heavy fire, evidently on Turkish Reinforcements, firing some 100 shells,grand sight\n\nto watchthen went for a swim today which was glorious. Turks seem to be very nervous of a night always opening up a heavy rifle fire but doing no damage. Being inocculated forCholera. Prisonerscaptured within the last week or so amount to about 1,500.\n","33":"15\n\nWar waged heavily very early this morning, our Boys on the right wing went out and gave a demonstration to see what forcethe enemy was in front of them and they found them in great force. They stayed for three hours in front of their trenchconcealed by sand bags but on having to retire they lost some 120 men killed &wounded. The Turks shelled Courtney's Post with 11.2 shells doing a lot of damage blowing our trenches about. The New Zealanders lost a large number of men through being buried and killedfrom the shells. The Turks threw a lot of schrapnel into our Camp through the day but did no damage\n\nworth speaking of.Aheavy bombardment still continues down at Cape Helles but no news through yet. Went for a swim last night butsnipers still busy along the beach. They come out of a night and have chance shots. Destroyers did some great shooting yesterday afternoon.\n","34":"\n\nNews came through from the Cape that the British and French under cover of artillery fire had advanced 250 yards but on accountof a heavy bombardment of bombs they had to abandon 50 yards of trench, but they still hold 200 yards. Numerous counter attacksfrom the Turks were easily repulsed with heavy losses to the enemy. Our Casualties were fairly heavy. We also received news that the Germans had surrendered unconditionally in South Africa,hope its true. News that the fleet aregoing to force the narrows and areprepared to lose any of the ships inactionas they are all obsolete. Last night the Turks seemed to be very nervousin front of our\n\nposition, expecting an attack from our chaps at any time, and kept on sending up star rockets lighting up the whole position which was very pretty, like a big fireworkdisplay. Nothing came of it and the firing line was quiet. They still bombarded Courtneys Post yesterday and killed and wounded some 20 men. Bombs were thrown very much from both sides.\n","35":"15\n\nThings fairly quiet this morning, nothing much doing during the morning but towards evening the Turks opened up a heavy fusilade of Artillery fire,Courtneys Post suffered very much, some 40 men being killed &wounded. They opened up 8\" shells doing a gret deal of damage to the trenches. The Beach suffered heavily from schrapnel, one shell blowing the head off one man, both legs of a Doctor, a leg off another man,alot of damage for one shell. Others parts did not suffer so heavily. Aeroplanewent up this afternoon and\n\ndropped a highly explosive bomb evidently on their gun.The Turks fired about 43 shots at her but never hit her.\n","36":"15\n\nA heavy bombardment still continuesat Cape Hellis but up to the present we have not heard any results. Ourdestroyer came in and shelled the Turks position very effectively during the afternoon. Schrapnel was poured into our bivouacwithout results. Turks opened up the heaviestbombardment for some time at about 6 PM, concentrating all the fire onto one spot evidently hoping to locate one of our Batteries. Went for a swim about 8 PM. Very nice.\n","37":"15\n\nNews came through from the Cape this morning that the Turks had made an attack but with the aid of the fleet and our Artillery, machine Gun and Rifle Fire, they were easily repulsed suffering heavy losses.\n\nOur troops then made a counter attack carrying two lines of trenches with the Bayonet,our losses were insignificant, we now have quite a strong position. Heavy shelling \nwas\n from the Turks on Courtneys Post did a lot of damage,some thirty casualtiescoming down within half an hour. We had quite a number of Schrapnel Shells into our Bivouactoday but nothing to speak of happened.\n","38":"\n\nHeavy artillery bombardment from both sides started at day break this morning and keeping on for about two hours. Destroyers and Monitors were also throwing a lot of Lediteshells. After that Rifle & Machineopened up right up tillmidday. During the afternoon, Aeroplanes were very busy dropping bombs on the Turks position, also they reported that 100,000 fresh Turks were on the march from Constantinople towards our position, so we are expecting a big attack.\n","39":"15\n\nTurks shelling Courtneys Post with 8\" shells did a lot of damage killing 8 and wounding about 20 besides knockingin the trench. The Doctor and myself was very busy helping to get the wounded out when one shell knocked the part of the trench in, covering me and the Doctor. About 2.30 PM was taken bad from the result vomiting continually. Must have hurt my inside. Atnight I was sent to Field Hospital, from there I was taken to Hospital Ship,was on the hospital ship twodays. I was then transferred to Lemnos Field Hospital. I was kept there tilthe 26th still feeling bad. Left Lemnos by hospital ship and arrived at Malta July 31st. I am nowin the hospital here felling a good deal better.\n\nJust had a big dose of Castor Oil to start with.\n\n"}}