{"Document Name":{"0":"Diary_0198","1":"Diary_0198","2":"Diary_0198","3":"Diary_0198","4":"Diary_0198","5":"Diary_0198","6":"Diary_0198","7":"Diary_0198","8":"Diary_0198","9":"Diary_0198","10":"Diary_0198","11":"Diary_0198","12":"Diary_0198","13":"Diary_0198","14":"Diary_0198","15":"Diary_0198","16":"Diary_0198","17":"Diary_0198","18":"Diary_0198","19":"Diary_0198","20":"Diary_0198","21":"Diary_0198","22":"Diary_0198","23":"Diary_0198","24":"Diary_0198","25":"Diary_0198","26":"Diary_0198","27":"Diary_0198","28":"Diary_0198","29":"Diary_0198","30":"Diary_0198","31":"Diary_0198","32":"Diary_0198","33":"Diary_0198","34":"Diary_0198","35":"Diary_0198","36":"Diary_0198","37":"Diary_0198","38":"Diary_0198","39":"Diary_0198","40":"Diary_0198","41":"Diary_0198","42":"Diary_0198","43":"Diary_0198","44":"Diary_0198","45":"Diary_0198","46":"Diary_0198","47":"Diary_0198","48":"Diary_0198","49":"Diary_0198","50":"Diary_0198","51":"Diary_0198","52":"Diary_0198","53":"Diary_0198","54":"Diary_0198","55":"Diary_0198","56":"Diary_0198","57":"Diary_0198","58":"Diary_0198","59":"Diary_0198","60":"Diary_0198","61":"Diary_0198","62":"Diary_0198","63":"Diary_0198","64":"Diary_0198","65":"Diary_0198","66":"Diary_0198","67":"Diary_0198","68":"Diary_0198","69":"Diary_0198","70":"Diary_0198","71":"Diary_0198","72":"Diary_0198","73":"Diary_0198","74":"Diary_0198","75":"Diary_0198","76":"Diary_0198","77":"Diary_0198","78":"Diary_0198","79":"Diary_0198","80":"Diary_0198","81":"Diary_0198","82":"Diary_0198","83":"Diary_0198","84":"Diary_0198","85":"Diary_0198","86":"Diary_0198","87":"Diary_0198","88":"Diary_0198","89":"Diary_0198","90":"Diary_0198","91":"Diary_0198","92":"Diary_0198","93":"Diary_0198","94":"Diary_0198","95":"Diary_0198","96":"Diary_0198","97":"Diary_0198","98":"Diary_0198","99":"Diary_0198","100":"Diary_0198","101":"Diary_0198","102":"Diary_0198","103":"Diary_0198","104":"Diary_0198","105":"Diary_0198","106":"Diary_0198","107":"Diary_0198","108":"Diary_0198","109":"Diary_0198","110":"Diary_0198","111":"Diary_0198","112":"Diary_0198","113":"Diary_0198","114":"Diary_0198","115":"Diary_0198","116":"Diary_0198","117":"Diary_0198","118":"Diary_0198","119":"Diary_0198","120":"Diary_0198","121":"Diary_0198","122":"Diary_0198","123":"Diary_0198","124":"Diary_0198","125":"Diary_0198","126":"Diary_0198","127":"Diary_0198","128":"Diary_0198","129":"Diary_0198","130":"Diary_0198","131":"Diary_0198","132":"Diary_0198","133":"Diary_0198","134":"Diary_0198","135":"Diary_0198","136":"Diary_0198","137":"Diary_0198","138":"Diary_0198","139":"Diary_0198","140":"Diary_0198","141":"Diary_0198","142":"Diary_0198","143":"Diary_0198","144":"Diary_0198","145":"Diary_0198","146":"Diary_0198","147":"Diary_0198","148":"Diary_0198","149":"Diary_0198","150":"Diary_0198","151":"Diary_0198","152":"Diary_0198","153":"Diary_0198","154":"Diary_0198","155":"Diary_0198","156":"Diary_0198","157":"Diary_0198","158":"Diary_0198","159":"Diary_0198","160":"Diary_0198","161":"Diary_0198","162":"Diary_0198","163":"Diary_0198","164":"Diary_0198","165":"Diary_0198","166":"Diary_0198","167":"Diary_0198","168":"Diary_0198","169":"Diary_0198","170":"Diary_0198","171":"Diary_0198","172":"Diary_0198","173":"Diary_0198","174":"Diary_0198","175":"Diary_0198","176":"Diary_0198","177":"Diary_0198","178":"Diary_0198","179":"Diary_0198","180":"Diary_0198","181":"Diary_0198","182":"Diary_0198","183":"Diary_0198","184":"Diary_0198"},"Date":{"0":"unknown","1":498.0,"2":500.0,"3":513.0,"4":514.0,"5":601.0,"6":610.0,"7":621.0,"8":654.0,"9":659.0,"10":691.0,"11":718.0,"12":719.0,"13":720.0,"14":800.0,"15":832.0,"16":834.0,"17":861.0,"18":872.0,"19":880.0,"20":895.0,"21":913.0,"22":914.0,"23":915.0,"24":920.0,"25":921.0,"26":922.0,"27":924.0,"28":937.0,"29":938.0,"30":940.0,"31":953.0,"32":960.0,"33":961.0,"34":1013.0,"35":1014.0,"36":1036.0,"37":1039.0,"38":1042.0,"39":1043.0,"40":1044.0,"41":1048.0,"42":1050.0,"43":1051.0,"44":1052.0,"45":1053.0,"46":1055.0,"47":1057.0,"48":1058.0,"49":1060.0,"50":1061.0,"51":1075.0,"52":1086.0,"53":1087.0,"54":1088.0,"55":1090.0,"56":1093.0,"57":1096.0,"58":1097.0,"59":1099.0,"60":1100.0,"61":1101.0,"62":1102.0,"63":1106.0,"64":1119.0,"65":1129.0,"66":1132.0,"67":1133.0,"68":1136.0,"69":1217.0,"70":1244.0,"71":1248.0,"72":1250.0,"73":1252.0,"74":1253.0,"75":1262.0,"76":1272.0,"77":1286.0,"78":1291.0,"79":1310.0,"80":1313.0,"81":1317.0,"82":1318.0,"83":1319.0,"84":1330.0,"85":1331.0,"86":1332.0,"87":1340.0,"88":1341.0,"89":1342.0,"90":1352.0,"91":1358.0,"92":1365.0,"93":1367.0,"94":1380.0,"95":1383.0,"96":1387.0,"97":1389.0,"98":1403.0,"99":1426.0,"100":1440.0,"101":1453.0,"102":1473.0,"103":1477.0,"104":1478.0,"105":1480.0,"106":1484.0,"107":1485.0,"108":1486.0,"109":1489.0,"110":1490.0,"111":1491.0,"112":1492.0,"113":1493.0,"114":1494.0,"115":1498.0,"116":1499.0,"117":1512.0,"118":1517.0,"119":1568.0,"120":1569.0,"121":1570.0,"122":1571.0,"123":1572.0,"124":1573.0,"125":1579.0,"126":1580.0,"127":1590.0,"128":1592.0,"129":1593.0,"130":1597.0,"131":1601.0,"132":1602.0,"133":1603.0,"134":1604.0,"135":1605.0,"136":1606.0,"137":1607.0,"138":1608.0,"139":1612.0,"140":1615.0,"141":1618.0,"142":1621.0,"143":1622.0,"144":1636.0,"145":1637.0,"146":1643.0,"147":1657.0,"148":1678.0,"149":1689.0,"150":1691.0,"151":1692.0,"152":1693.0,"153":1696.0,"154":1697.0,"155":1705.0,"156":1709.0,"157":1714.0,"158":1715.0,"159":1716.0,"160":1717.0,"161":1718.0,"162":1720.0,"163":1721.0,"164":1728.0,"165":1730.0,"166":1731.0,"167":1732.0,"168":1770.0,"169":1771.0,"170":1774.0,"171":1786.0,"172":1787.0,"173":1789.0,"174":1790.0,"175":1815.0,"176":1819.0,"177":1822.0,"178":1843.0,"179":1844.0,"180":1845.0,"181":1846.0,"182":1849.0,"183":1850.0,"184":1895.0},"Entry":{"0":"\n\nMy Diary of mychief events during my Soldiering on Active Service.\n\nEnlisted in the A.I.F. ","1":" Went into camp for training","2":" & was placed into the Depot N 1 company infantry Transferred to the A.M.C.","3":" & was placed as orderly into the Sergeant's Mess. Was chosen as a member of the","4":" Field Amb on","5":" 1915,was one of the Advance party to Queens Park Waverly Sydney\n\n\n\n\n","6":" Took on Cooking down there & was appointed Corporal Cook","7":" left Queens Park on Final leave","8":" went to Melbournerejoined Unit at Albert Park on","9":" We left Melbourne to embark on Troopship A 11 S.S. Ascanius,","10":" had a great send off. Thousands were on the Pier amongst them being Aunt Jennie, Esther & Warwick, Mrs Jacobsen of Sydney & several of my friends. Passed through the Heads about 6.30 PM & arrived at Suez ","11":" after a pleasant but uninteresting trip, as we did not call into any ports after leaving Melbourne. We anchored in the bay at Suez for one day & then went alongsidethe Wharf at 1.30","12":" Was one of the advance party toleave for\n\nour own quarters, & we left by train at 4 PM for Heliopolis we saw many interesting sights during our Journey Natives shouting Backsheesh which means money or Souvenirs we ran almost parallel to the canal for about 20 miles saw a big P & O Liner going through the canal & it looked fine to see a Ship going through the desert, perhaps to England with some of our mails aboard. arrived at Zeitoun 12.30 AM","13":"& camped at the Aredrome camp for that night, went to Cairo same day & found it at first sight to be a wonderful dirty city, also had a tour around with a guide & my first impressions were confirmed We stay at Heliopolis only five days & then we left for\n\nsomewhere down the Canal which turned out to be Sepereaum during our journey we passed through a pretty french town Ismalia which is well protected from the Sun by big trees & its very clean to Cairo. its quite nice to be camped on the Bank of the canal as we are able to enjoy a daily dip & its interesting to see the Ships pass through. we generally cheer them & they throw us cigar & cigarettes, Biscuits & etc. all days seem alike here & to day 12 of our men left for outpost duty 12 miles out intothe desert they go for a fortnight & are then relieved by another section for a period. The Indians are camped near by & we have great fun their Mules. The British Tommies\n\nare also hard by & we all pull very well together & bathe together in the canal. Our Rations are weighed out to us by the lbs & one has to economise in everything just now.Fresh water is also very scarce & the boys are only allowed two water bottles a day as it has to come up from Suez in Barges 38 miles away. But they have started to build Reservoirs & we may get more later on.we live a very simple life here & prefer it to Cairo solong as we are able to get a swim They are also building a light railway the other side of the canal as they expect to be off out that way before long perhaps for action On Sunday we generally amuse ourselves with the\n\nIndians Riding mules but its generally us who get all the exercise picking ourselves out of the sand of course we ride bare back & they think us great sports. I received some parcels for Christmas from Australia contents & consumed thereof & enjoyed same. We left Serapeum camp 1 PM","14":" arrived Tel-el-Kebir 7 PM same day. Visited Cairo from here & went to Pyramids & found same very interesting Left Tel-el-Kebir","15":" for a 40 mile route march to Ferry Post the other side of the canal, we left camp about 7.30 AM with full packs up on a cool morning & marched about six miles & then had the luck to catch up with one of thetransportsresult\n\nPack for rest of the Journey arrived Maksama2.30 PM & Bivouack for the night left 7 AM next day for Moascar where we arrived same day at 5 PM after a fearful Journey in the Blazing sun over soft sand. Transports got stuck in the desert for the night left Moascar 9 AM for ferry Post where we arrived about noon","16":" Stayed here about two days & then left for Rail head seven miles out in the desert. left rail head same day for Duntroon Plateau & camped above in the desert -","17":" celebrated Anzac day by having sports & a real good feed & finished up with a concert We spent a quiet time out here & we used\n\nto walk about ten miles to go into Ferry Post for a bathe in the Canal. we also had a fearful sandstorm which lasted two days sand was every where & its not very nice to eat along with your food. left Duntroon Plateau","18":" for Rail head at 5 PM arrived Rail Head about 6.30 PM. left Rail Head","19":" for Ferry Post where we arrived same day. Left Ferry Post","20":" & arrived Moascar same day. Heat is awful at times can hardly stand it. left Moascar 11.30 PM","21":" for Alexandria where we arrived 8 AM next day","22":" embarkedaboard Troopship S.S. Tunisian 11 AM left Alexandria","23":" 6.20 AM for Marseilles where we arrived\n","24":" morning","25":" left Marseilles","26":" 2.30 AM arrived Steinbeck near St Omer 10 AM","27":" after a pleasant trip in the cattle truck. We were Billeted in a pretty Village of Morbecque 3 miles from Hazebrock, left Morbecque 9 AM","28":" Marched to Estaires 3.30 same day left Estaires 1 AM","29":" & arrived 5 PM at Erquinghem Sur Lys warm day left Erquinghem 9.30 AM & arrived 12 noon at Fort RompuJuly","30":" 19.20. Very Busy Action Battle of Fromelles Saw my brother","31":"in Belgium","32":" crimed for the first time Result Reprimanded ","33":" Celebrated my 25 birthday Aug 4, left Fort Rompufor\n\n\n\nDoulieu arrived there same day left Doulieu Aug14for Estaires where we spent a pleasant time if a quiet time, we left Estaires on","34":" for Armentiers & we took over a dressing station at another school","35":" visited the trenches & went into the front line & saw the German Trenches 250 yards away through a periscope, found the trenches very interesting indeed but things were very quiet in this sector. left Armentiers","36":" & arrived Strazeelein Motor Lorries & Ambulances we had some great feeds of Blackberries which were very plentiful about here left Strazeele for Baillieul\n","37":" for the Somme by train Travelled in horse boxes with plenty of Straw raining very hard. Arrived Longpre next morning marched to Ergines & had dinner in record time Rained all the time. next morning up at three & had great difficulty in getting water out of a well & yet the rain was simply pelting off us got wet through twice in an hour left Ergines \n","38":" Arrived Dernancourt same day during the Journey which was in french Motor buses we passed through Amiens left Dernancourt","39":" arrived Mametz wood after a rough journey through the mud & sloshleft\n\nMametz Wood","40":" for the Advanced dressing Station which was at Thistle Dump and took over from a Lancashire F. Amb. Plenty of Bombardments going on. Visited the Famous High Wood which is one mass of shell Holes saw two tanks out of Action went inside one which is very interesting.\n","41":" Stopped Raining quite achange sunk up to my knees in mud crossing the road must have been a shell hole. Mud is everywhere & its awful. The nights are very cold & frosty Stretcher bearers are having a rough time here. we are between high wood & Delville wood saw a horse sunk up to his bellies.In high wood there\n\nis a Cross to the Memory of the 47 London division who captured it also many others for men who fell arround it we slept in a dugout which was once used by the Germans & it was not as clean as it might have been as regards to creeping things. ","42":" Rainbow over Battle field a contrast of Gods work & mans ","43":" Rained nearly all day got wet through fixing up our dug out which almost colapsed & let the water in. Also fixed up an unknown soldiers grave which was getting knocked about made a wooden Cross as the other one was broken also drained the water off & mounded\n\nit up a bit,","44":" a beautiful fine day. put our blankets out to dry & mended our dug out counted 24 observation Balloons & 30 Aeroplanes in the air at the same time spent a good nights rest in spite of the bombardments","45":" rained during the afternoon saw several fights in the air & two were brought down dont know whos they were but reckon they were old Fritzs J Lilly got badly wounded yesterday","46":" fine day for a change counted 73 Aeroplanes in the Air & saw several fights. one brought down in flames & four in one fight. He sends a few around about us at night & High Wood gets\n\na dose every day expect to be relieved tomorrow am not sorry. Left Thistle Dump","47":" & slept in Albert that night then went toBelle Vieu Farm","48":" but didnot take over the rest station & left for Buire stayed at a farm & had a quiet day went to the pictures at night what a change after all the mud Saw Gen Birdwood to-day. he spoke a few encouraging words to us. German Areoplanes dropped bombs near us & got a dump which went off with some bang. Bombsare worse than shells left Buire","49":" for Ville sousCorbie where we got wet through waiting for\n\nMotor busses & after a cold Journey we arrived at Vignacourt. Got lost & arrived at our billet a chateau at 12 midnight wet to the skin & fed up.","50":" got caught by the C.C. Pinching apples he made me ringleader & confuscated the apples resultOfficers Stewed apples for dinner us Bully Beef Slept in a fowls house here & its fairly comfortable place with plenty of straw for our bed we had our first fall of snow here","51":" Visited Amiens & had a good days enjoyment its a fine French town the biggest we have been in up till now. it\n\nhas a beautiful Cathedral left the Chateau for leave to England","52":" left 8 PM & waited all night long for train to Havre on Amiens Station the train eventually arrived at 8.45 am & then I nearly missed it as I was having some breakfast at the time","53":" Arrived at Rouen which we all thought was Havre so we had to go back to our carriage which wasto hold eight & really carried thirteen & we took it in turns to sit down got a little sleep as I was very tired. arrived at Havre","54":" 9.30 am. after a fearful Journey of 25\n\nhours which should have only taken six at the most we arrived at a rest camp & left again same evening for the boat three & a half miles from the camp & they marched very fast everybody was happy & singing. got aboard after a lot of pushing & shoving & there is a chance of getting Torpedoed still we got over all right & reached Southampton 6.45 am then there isa rush for the first train I got on the first & arrived at Waterloo Station 10.30 & left for Horseferry Rd in a taxi & arrived home about twelve thirty after a Journey I shall never forget went to Brighton\n","55":" I was indeed glad to see Mother once again. Left Brighton","56":" & stayed in London till","57":" & went back to Brighton again \n\nLeft Brighton","58":" for London & was sorry to Leave London on","59":" for France arrived atWaterloo station & left at 3.40 for Southampton no one was in a hurry to catch the train & no one cared if he got on board or not we had a smooth Journey back to France & no one was in a hurry to leave the boat & no one was in a hurry to go to the rest camp where we arrived early on","60":" had to go on sick parade as I felt very queer I was placed in a warm place which was very much better than sleeping in stables on cobble stones left for Amiens on","61":" we were all afraid of the train Journey back & I took good care to get into a horse van where one could get a good sleep The Journey back was done at an amazing speed compared to the Journey coming over I got a bucket made a few holes in it got wood & coke & got a fine fire going & the Journey back was good. we had tea\n\n\n\nat a kind of half way house back plenty of it also a dose of medicine for my cold Arrived Amiens","62":" 1.30 AM we overshot the station & had to walk back along the metals. Arrived back at the Chateau 1.30 AM with a bad cold & cough was not sorry to get back again spent a quiet Xmas 1916 as two of our boys were killed on","63":"had a good dinner & tea & finished up with a concert\n","64":" Visited caves at Naours found them very interesting they date back to 850 AD. I saw several good concerts including\n\nour own concert party left the Chateau","65":" for the line entrained at Flesselles detrained along theline near Heilly & marched to Ribemont where we stayed at the Mills. left Ribemont","66":" for Becordel left Becordel","67":" & arrived Bernafoy Wood & were attached to the 15 Field Amb at the Advanced Dressing Station Its a much better place than Thistle Dump where we were last at the A.D.S. Visited Delville Wood","68":" the Snow is all arround & things are quiet except for a few shells now & again went to the YMCA in the\n\n\n\nfor over three months. arrived at Belle View Farm Visited Amiens","69":" & spent a great day & sent home several presents & walked a great deal of the way home again. ","70":" visited Thistle Dump where we put in a bad 15 days last October. I marked the Cross I made over again as the writing was getting worn off. also went to High wood which was covered with wild Flowers. left the Farm on","71":" for Vaulxhere the shell fire was rather hot & we were obliged to get out of main dressing station & go further back to a safe spot. on","72":" left to go out with the Stretcher bearers","73":" for Lagnicourt. was posted at ADS Terrific bombardment taking place here Went to B Sections\n\nA.D.S.","74":" & then reported back to the Main Dressing Station as they were shorthanded there left for Bapaume","75":" ","76":" another day in Amiens left Bapaume by train on","77":" Passed through A le Grand. detrained at Vaprennes Marched to Senlis a pretty little Village we took over a rest station on a hill overlooking the village only 6 kilos from Albert. Visited Amiens","78":" also Alley sur Somme & spent a pleasure day on the Banks of the Somme which was indeed very pretty. We almost know Amiens from end to end as we are given so much leave there. 5,000 Francs must be spent every day by the Australian\n\nVisited Amiens","79":" The King inspected the Division","80":" at Heincourt The Boys gave a greatdisplay & seemed pleased at what he saw ","81":" Visited Amiens again for the last time before going North again spent the usual good day in there. \n","82":" Started a Route March. went to Corbie & the boys were in great form & marched really well bathed in the famous River Somme. returned to our camp","83":" in good form Left Senlis","84":"Marched to Avelay entrained there for North. Arrived St Omer","85":" Marched to Racquinghem stayed at our usual farm Celebrated my","86":" birthday on","87":" in the usual\n\ngood way ","88":" Aire & had a good afternoon ","89":" Visited Hazebrouck Arrived in time to hear old Fritz at it again. So I went to Morebecque & spent the afternoon visiting friends \n","90":" Visited Hazebrouck for school of Cookery walked nearly all the from Hazebrouck to Estaires about 18miles saw my friends & came back on a lorry Via Aire.","91":" visited StOmer\n","92":" Visited Estaires a fine day in the School","93":" Visited Cassel also Arneketo see my brother. Saw him at\n\n\n\n \n\nRecquinghem walked back to Arneke with him & spent the rest of the day with him. we had plenty of leave from our billets here to various towns, but all good things come to an end sometime & we left Recquinghem","94":" for Belgium. I went in a Ambulance car arriving at a Rest Station near Poperinghe & took over Visited Poperinghe","95":" \n","96":" Visited Ypres but soon cleared out as he was shelling theplace. our boys are having a rough spell this time & we have lost several killed & wounded","97":"\n\nVisited Bailleul & spent a quiet time in town \n","98":" Visited Poperinghe. heard Sam was only a few miles away so Iwent & saw him.\n\nDuring our stay at the Divisional rest station we spent a quiet time except for Fritz dropping bombs occasionally also went several concert partys which were exceedingly good. left Recquinghem","99":" in a car & got lost & did about five hours touring France & Belgium we eventually arrived at the main dressing station near Kemmel Hills long after the men who marched. rather a quiet front to what our boys have been having lately\n","100":"Visited Wyscheate Ridge & saw several of the Hugh mine craters which were exploded by the British last May. ","101":" Visited Kemmel Hill & had a glorious view of the surrounding country including Villages behind Fritz's line left the Main dressing station","102":" on a MotorLorry & had a long Journey very cold & arrived at an unforsaken hole of Wirwignes near Boulogne Desvres\n","103":" left Samerfor Boulogne to go to Blighty Stayed the night in a Rest Campon rotten billets\n\n\n","104":" arrived London 4.30 PM one days leave wasted Travelling. left London for Brighton","105":" left Brighton","106":" for Newhaven left Newhaven same day for London left London","107":" for Glasgow Arrived Glasgow","108":" left Glasgow","109":" for Edinburgh left Edinburgh same day for Aberdeen went over the forth & Tay Bridges arrived Aberdeen same day left Aberdeen same day for London Arriving London","110":" left for Brighton same day left Brighton","111":" for London\n\nLeft London","112":" for Folkstone. Left Folkstone for France arrived Boulogne 7 PM & left straight for home & arrived back in camp 8.30 PM after a good holiday with a heavy cold","113":" Stayed in bed all day to get over my holidays\n","114":" Started work once again & feel A 1. ","115":" Visited Boulogne for half day rather a compact town plenty of Waacs & Nurses there rather a cold day so I had a good bath & clean change to add to the excitement Canteen Broken into on","116":" & £19 worth of goods stolen ","117":" Visited Boulogne & had a fine time in\n\nthere as it was a beautiful day also a bright moon - light evening withthe result they were bombed at 11.30 PM. Left Wirwignes","118":" at 5 AM in a Motor Lorry & arrived at St Omer at 8 AM for breakfast - owing to food restrictions we were obliged to proceed with our Journey without breakfast we passed through Hazebrouck & Baileull & arrived at Locre in Belgium at 1 oclock noon & took over a rest Station from the third field Amb in a convent, which seems to be a good place our new billets are good & we are having a fine time here with plenty of football & plenty of good concerts\n\nparty we also get of leave to Balieull places. lost the Dog Jack in Balieull Pte found him three days later. Spent a quiet time here","119":" Paraded sick evacuated to C.C.S.","120":" to under go an operation\n\nArrived","121":"C.C.S. 11 Godewaersvelde Marked Base. ","122":" Volunteered for Blood Transfusion so I had my Base Ticket taken off","123":" Saw a few of the boys of the","124":" before they parted for the Somme ","125":" We to Remy Siding to have my blood tested & same was found to be universal good\n\nfor transfusion. since I have been at the","126":" C.C.S. I have had a good rest & have helped to paint out some of thewards & assist in the preparation ward.","127":" - 11 - 12 very busy indeed plenty of wounded coming in","128":" got orders to Evacuatedthe C.C.S. so started to strike camp I was evacuated to No 10 C.C.S. Remay Siding. ","129":" was Evacuated to the Base arrived Hospital Train 10 PM at No 46 General Hospital hospital Etaples. \n","130":"Visited Etaples Cemetary saw Waacs attending the soldiers graves & saw a burial of a Soldier Left No 46 G Hospital","131":" & went to the Medical Board camp to go before a board Visited Etaples & Paris Plage & spent an enjoyable afternoon there in spite ofthe fact that I was hard up for cash \n","132":" Went before my first Medicalboard & was marked A. other wise brought a gutzer \n","133":" 8 PM left the camp for train for Le Havre arrived on station about 8.30 & got aboard the train at 8.30 next morning passed the night in a II class carriage. left Etaples","134":" arrived Le Havre","135":" after a long & tiresome Journey\n\nwent to our base ","136":"Inoculated","137":" in bed all day with bad arm. Thereare plenty of YMCA & other huts here","138":" Visited Havre & spent a good time in the town \n","139":" Visited Havre once again had a good time & paid for a few hours\n","140":" left Havre for Unit in charge of three men entrainedat Marchandises. Arrived 6 AM & went to Reinforcement Camp ","141":" got Flooded out & had to get up at 2AM wet through \n","142":" Rejoined unit went back by Ambulance near Amiens Arrived back\n\nat 7 PM to unit at Daours ","143":" taken on strength & given back my old Job. plenty of shelling going on weather simply beautiful plenty of swimming in the Somme feel A1 Fritz bombs arrived here almost every night this weekMay 24, had a letter from my sister informing me of the sad news of my brother Sam being reported killed in action ","144":"received news from that Sam was reported K in A on","145":" \n","146":" left Daours & arrived Amiens same evening left Amiens & we camped out in the open near\n\nRivery its just like a but too far away from any swimming still we are having a quiet time plenty of sports & etc left this camp on","147":" & arrived at a camp on the Amiens Road to Albert same day & we are in a good place here we get plenty of Sports & leave to various towns went to see some friends amongAilly Sur Somme on","148":" & spent a pleasant time there. Came home decorated with boxes& filled with fruit \n","149":" Evacuated to C.C.S. to undergo an operation for internal operation hope to get fixed up this time\n\nsorry to leave my dog behind who showed signs of being as good as our old Jack. left C.C.S. No 30 about ten AM & arrived at No 5 General Hospital Rouen 6.30","150":" No 4 ward, ","151":" left No 4 ward 5 AM for Hospital No31 train to go to blighty Arrived Havre 10.30 AM & went aboard the St David which however did not leave Havre till the evening about 10 PM arrived Southampton after a very smooth journey I was put on No 11 A.T. Midland Railway for London","152":" Arrived Paddington at 2.30 & went by car\n\nto Fulham Military Hospital where I was placed in C 3 Ward\n\n & came and saw me hereonSunday 21, Tuesday 23 went on a trip up the river Thames to Kew Gardens & had a bontea I was then prepared for my operation to take place on the","153":"\n","154":" went to the Theatre for operation. Went down at a little after ten, came round about 1 pm for a couple of days I had a rough time & only got fluid diet. \n","155":" stitchestaken out feel A1 & glad I had the operation performed \n","156":" still in bed\n\n\n\n\n\n\n\n\n\nbut feel champion & expect to be up very soon. got out of bed on the 15 day after theoperation \n","157":" went home for half day \n","158":" Took the girls to Richmond \n","159":" went on river excursion to Kew & spent a quiet afternoon. \n","160":" went out for a Row on the Serpentine & to Australia House finished up with a tea & pictures \n","161":" transferred to Harefield Hospital Arrived Harefield same day a very pretty place but dull. Saw the Major on","162":"\n\nwho marked me B. 2. A1. & I am to take lessons in massage as there is prospects for a trip to Australia in ten days time. left Harefield for a leave days to \n","163":" I had a good time in Harefield got another days leave.","164":" Went to see Becky on","165":" left Harefield for Weymouth","166":" and arrived at an outCamp at Westham left Westham camp next day","167":" & arrived Monte Video Camp same day. Was taken on Staff & placed in the Massage department stayed on this job for about a week\n\n\n\n& was then put on the Gymnasium Staff prospects of Australia seem miles awayJust now. Weymouth is a very nice place & have a beautiful front which we take walks every evening\n","168":" left Weymouth on four days leave to Brighton & London. arrived at Waterloo after a very long Journey of 6","169":"hours. Went to Brighton Saturday & Sunday & spent Monday & Tuesday in London saw two plays & enjoyed myself A1 Arrived back in Weymouth 12 PM.","170":" was put on Board Roll\n\nleft Weymouth","171":" for Boat & arrived Plymouth same day got a good reception all along the line embarked 2 PM & Went out into the Stream on","172":" left Plymouth on","173":" for Aussie, from","174":" till Nov reached Cape Town we had a pleasant but uninteresting trip as we saw no land at all We lost two men on board through sickness. \n\nWe heard the good war news by Wireless\n\n& expect the War to be over any day now Arrived Cape Town early on","175":"Anchored in Bay & went along side to coal on","176":" owing to the Influenza ashorewe were not allowed off the Ship Still we had a fair time all the same bought plenty of fruit & etc & had a welcomed rest left Cape Town","177":" at 6 PM Struck heavy weather right away which lasted five days. We had several Concerts on Board but from Cape Town to\n\nAussy the Weather was not too fine & we rolled quite a lot. But Still we had Whist drives Draughts Chess & the boys are getting all their best clothes out for Aussy & all seems in good Spirits. Sighted land on","178":" & Arrived off Semaphore the same afternoon. on Monday evening","179":" we went along side the Outer harbour & had a good teagiven by the Vad & a good concert ","180":" A days leave in Adelaide What a day Lovely weather & a royalWelcome from the people. Free rides Dinners & Teas Pictures & etc so\n\n\n\nWe were sorry to leave for the boat again\n","181":" we had friendsaboard from the VADs & then we left for Sydney at 12.30 PM after a rousing send off Band playing & flag waving Arrived Sydney","182":" at 6.30 AM Discharged Munday","183":" but my discharge dates","184":"\n\nFinis\n\n"}}