{"Document Name":{"0":"Diary_0128","1":"Diary_0128","2":"Diary_0128","3":"Diary_0128","4":"Diary_0128","5":"Diary_0128","6":"Diary_0128","7":"Diary_0128","8":"Diary_0128","9":"Diary_0128","10":"Diary_0128","11":"Diary_0128","12":"Diary_0128","13":"Diary_0128","14":"Diary_0128","15":"Diary_0128","16":"Diary_0128","17":"Diary_0128","18":"Diary_0128","19":"Diary_0128","20":"Diary_0128","21":"Diary_0128","22":"Diary_0128","23":"Diary_0128","24":"Diary_0128","25":"Diary_0128","26":"Diary_0128","27":"Diary_0128","28":"Diary_0128","29":"Diary_0128","30":"Diary_0128","31":"Diary_0128","32":"Diary_0128","33":"Diary_0128","34":"Diary_0128","35":"Diary_0128","36":"Diary_0128","37":"Diary_0128","38":"Diary_0128","39":"Diary_0128","40":"Diary_0128","41":"Diary_0128","42":"Diary_0128","43":"Diary_0128","44":"Diary_0128","45":"Diary_0128","46":"Diary_0128","47":"Diary_0128","48":"Diary_0128","49":"Diary_0128","50":"Diary_0128","51":"Diary_0128","52":"Diary_0128","53":"Diary_0128"},"Date":{"0":"unknown","1":1286.0,"2":1287.0,"3":1288.0,"4":1289.0,"5":1290.0,"6":1291.0,"7":1292.0,"8":1293.0,"9":1294.0,"10":1295.0,"11":1296.0,"12":1297.0,"13":1299.0,"14":1300.0,"15":1303.0,"16":1304.0,"17":1305.0,"18":1311.0,"19":1313.0,"20":1314.0,"21":1315.0,"22":1325.0,"23":1328.0,"24":1333.0,"25":1338.0,"26":1344.0,"27":1345.0,"28":1346.0,"29":1347.0,"30":1348.0,"31":1367.0,"32":1388.0,"33":1389.0,"34":1390.0,"35":1391.0,"36":1392.0,"37":1402.0,"38":1405.0,"39":1406.0,"40":1407.0,"41":1411.0,"42":1413.0,"43":1416.0,"44":1421.0,"45":1423.0,"46":1424.0,"47":1425.0,"48":1428.0,"49":1429.0,"50":1430.0,"51":1431.0,"52":1432.0,"53":1433.0},"Entry":{"0":"\n\n","1":"\n\n9.30 pm\n\nAbasan el Kabir\n\nThere is no doubt that my nerves are not all that they should be. Tonight I am very apprehensive of gas as the wind is just right for it.\n\nIt is probably very unprobable but I can’t get the idea out of my head.\n\nVery welcome rumours though unfortunately only rumours, that we, that is, all first contingent men are going to be relieved this summer.\n\n The day after tomorrow we go down to the beach so will be packing up tomorrow.\n","2":"\n\nI finally retired to my bed at about 9.45 pm last night but could not sleep, so I got up again at 11.30 & agreed to do another chap’s picket then & he to do mine in the morning. So stayed out on the horseline until 2.30 & then went to bed deciding not to take off any clothes as I had to get up again at 5.30.\n","3":" I went to sleep in full war paint until 7 am this morning when a fellow woke me up & said that the morning parade was over!\n\nFortunately my absence had not been noticed.\n","4":"\n\nNow we are down by the sea, an excellent camp, not 60 yds from the water’s edge on clean white sand.\n\n Thank God we shall be able to keep clean while we are here at anyrate.\n","5":"\n\nJust at present war seems very far away indeed. It is now half past six of a beautiful evening. A gentle breeze, gradually dying away, comes in from the sea. In a few minutes the sun, in a sky devoid of clouds will cut the clear cut, blue horizon of the sea. Meanwhile a path of golden glory stretches\n\nfrom the horizon to within 50 yds of where I lie, \nunless\n broken only by long lines of creamy rollers washing onto the white sand.\n\nAway to the right, riding on the horizon close in shore, lye the supply ships, but for these the sea is empty. All the sky is palest blue deepening to orange round the sun.\n\n There is no sound but the ceaseless crash of the rollers on the sands & now & then a faint rattle of chains from the horses. . . \n\n Now the sun is nothing but a globe of molten gold\n\nswimming in an efflorescence of salmon pink.\n\n Ah! Old Sol is taking the plunge, and the sea has turned an unsympathetic indigo, the rollers have lost their graceful outlace & \"tender curving lines of creamy spray\". Hope is fading from the world & our pipers’ gone out.\n\n\" \" \" \" \"\n\nNow, about twenty minutes after the sun has disappeared has come the finest part of all, what the natives call the false sunset a sort of afterglow which lights up the western sky, while the rest of the world is\n\nenveloped in the gloaming. The sky & sea are now dark deep blue while the direction of the Happy Isles is a deepening crimson emerging into orange which gradually melts into the all pervading blue, \njust above the\n Low in the west twinkles a solitary star, early as yet a lonely harbinger of the myriads of the night, while a little to the left & yet higher up a crescent moon sails serenely to its bourne.\n\n In the twinkling of an eye the glow fades, the stars rush out & the velvety\n\ndarkness of an eastern night descends on land, sky & sea.\n\n That is all very well in its way but now by the light of a prosaic candle (tallow one) let me detail the happenings of the last day or two.\n\n To begin with the day before yesterday, a rapid course of mental arithmetic denotes the","6":" as being the most probable date, there were alarums & excursions & much cleaning of horses, saddlery & stall, for Major General Chauvel ex brigadier 1st LH Bgde. was C in C of Desert Column\n\nwas coming to inspect everybody & everything.\n\n Thus at the appointed hour of 10.10 on the morning of the","7":" not without much agony & tears of blood, was each man in full regalia standing behind his horse with all his saddlery & steel (bright side upper most) laid out on a blanket in front of him. Along came Chauvel with the usual train of sycophants & satelites trailing along after him & on my being pointed out as a noble example of the 1st Contingent we had a heart to heart chat. At least\n\nit went this wise \nwise\n:\n\n \"Oh - er - you came over with the first contingent\"?\n\nME. \"Yes sir\".\n\nM.G.: \"But did you get on the Peninsular?\"\n","8":" \"Yes sir\n\nM.G.: \"You went there with Col Sutherland?\"\n\nME: \"Yes sir\"\n\nM.G.: \"And - er - did your health stick to you all right\n\nME: \"Yes sir with the exception of dysentery on the Peninsular I have been all right\".\n\nAfter which burst of eloquence I took a long breath. \n\nHe replied \"Ah well you got \n\na bit of a spell that way then\". \n\n It was on the tip of my tongue to say that I would rather go without than have another like it, but I thought that might be ruled out of order so I kept quiet & he passed along.\n\nThe next news item is that Jimmy James, a young fellow in this corps went, as they say, \"on the shikar\" the other day. The immediate result being that he has been a little peevish lately; also by the way is going deaf rapidly.\n\nThere when\n A rather thick\n\nheaded individual called Molden went to James this morning for his bread issue – They are in the same mess. Now Molden is also a bit deaf & that is the funny part of it for, when Molden asked for his bread, James thou’ght (he had not drawn it) that Molden was accusing him of pinching it, and promptly offered him out (i.e to fight him). Thus Molden of course did not hear him, and you never saw such a surprised man as Molden was when Biff! bang! & he was knocked up against a waggon.\n\nAfter that a desultory scrap started but neither hurt each other much, and as for Molden he hadn’t the faintest Idea, I am sure, about what he was fighting.\n\n Thank goodness at last we have something here in the Aeroplane line which will beat these enemy planes. This afternoon our latest type of monoplane went up and engaged a taube, flew rings round him & sent him back with a bee in his ear, though not succeeding in bringing him down.\n","9":"\n\nDuring the last day or two, apparently out of the void, has come upon us a plague of black crickets.\n\nWe had them at Romani I remember about the same time last year. They are quite harmless, but are the devil of a nuisance, for they sing all day & night in bursts, in season & out of season. And one finds them swarming in boots, saddle & blankets.\n\nThis is roughly their appearance only a little larger \n\nand jet black. In reality rather handsome insects.\n\n No enemy planes have been over since they encountered our monoplane.\n\n Today I trimmed Bernard’s tail, but he would not keep still during this delicate operation the result being that I took a little too much off & it (the tail) bears a faint resemblance to a mule’s. However Rome was not built in a day; and it will improve.\n\n Two fowls and a rooster are now on the strength of the corps - the property of \n\nof a couple of attached fellows belonging to the sanitary sect.\n\nThe day before yesterday A.K.M. went into his dugout after tea, only to find that one of the hens had been before him & neatly laid an egg alongside his pillow. Now several fellows have made nice little grass nests in their dugouts in the hope of catching the obliging \nfow\n biped in a like unguarded moment. But I have not heard of any treasure trove as yet.\n\n Some wild talk in the \n\nBrigade now, springing from God knows where, of our going up to Khartoum. It would be very nice next winter, but just now I have no desire to go 2000 miles nearer the Equator. \n\n Anyway it is all rot. They want all the troops they can get here. \n\n As I commenced the day today at 2.30 am I think bed would be an excellent idea now.\n","10":"\n\n\"We drank the Libyan Sun to sleep\n\nWe lit lamps which outburned Canopus \n\nOh! My life in Egypt, Oh! The\n\ndalliance and the wit!\n\nThe flattery and the strife!\"\n\n \"Oh!!!\" indeed.\n\n Well, despite the monotony & the general unpleasantness of war & conditions I suppose some day I shall look back with pleasure on my life in Egypt. But \nI shall\n it will only be, I think, after an exceptionally good dinner.\n\n By the way, I don’t think I mentioned it at the time, \n\ntwo fellows deserted from the machine gun Sect. They have just been found - in Minia of all places. \n\n They must have been clever fellows. \n\n They left their Sect. one evening without any gear or food & even without tunics to go over to the first reg. They were there until 10 pm that night & then simply disappeared! And were found in Minia with a full rigout & pots of money.\n\n They deserted at Shellal about 7 miles from any railway or anything. How did they do it\n\nI think the macuna & quails must have been on issue. There was another cheeky gentleman from the 2nd Reg when we were at El Arish Past, who put a loaf of bread in his haversack & said goodbye & told his \"cobber\" he was going to walk home. He started too, along the wire road, but only covered about 10 miles when he was brought back & put in hospital; he turned out to be slightly mad, so got home after all & much quicker too.\n\n We have a surf club here now\n\nSix of the best swimmers of the bgde have been exempted from pickets & fatigues & esconsed on the beach. Their stock-in-trade consists of a life buoy with \"Palestine Surf Club\" neatly painted on it, and about half a mile of telephone wire. They have rescued several men already.\n","11":"\n\nIt is very curious what boys we’ve become, when thrown together under a common law such as we are.\n\nI have been amusing myself by watching the antics\n\nno other word can express it, of the drivers. They are all men ranging from 20 to 38 in age I suppose. They are grouped in & around their wagons in every conceivable posture & dress. One is sitting on the sand with a pair of shorts on, his sole claim to civilization, hammering a piece of wood in the sand. Others are amusing themselves throwing shells at one another & then dodging behind the wagons; for all the world like little kiddies of 10. Every successful hit is greet with a shout of laughter. . .\n\nUniversal joy has just been caused by one little short chap, who, being seated on a saddle on the pole of the waggon, has just suffered what the French would call a \"bouleversement\" \n","12":"\n\nThis week it is my turn to be in charge of the sanitation of the camp. It is rather a sinecure as I have a native to do all the work and at nine o’clock (essa’al tisah fis subh) in the morning I may be seen walking round the camp with the native follow\n\ning with a sack. I indicate a piece of paper with a lordly air, he pounced on it & puts it in the bag & so the war goes on.\n\nTalking of natives, they are a wonderful people they will always carry out your commands, but their methods often will not bear a too minute inspection. When HSt & I were with the camel corps, a notable instance of this occurred. The officer in charge of the section wanted some tea. So the cook, one Ahmed Mohammed Moussa el\n\ntabakh, to give him his full name & titles, appeared. An ugly looking scoundrel black as the ace of spades but a fair cook. The officer wanted tea; Ahmed, with \nman\n much gesticulation, explained volubly that there was no tea but would the Presence have cocoa. \n\n The Presence would!\n\n In due time the beverage arrived. The officer & his subaltern by the light of a candle poured it out and commenced to drink it. After a few sips the \n\nofficer remarked.\n\n \"This is very poor cocoa\".\n\n\"It’s not cocoa, it is tea\", said the subaltern who had arrived after it had been order.\n\n\"Oh!\" said the officer and put down his cup abruptly, for he knew something of the oriental \"Give Ahmed a call will you\"?\n\n On his arrival Ahmed explained that he had found some tea that had been used for lunch that day; he was careful to explain that it had been quite dry not standing\n\nin water, and to this he had added a pinch of new tea which he had found, made a mixture & made the tea with that since the Presence had asked for tea.\n\n \"Well\", said the officer curtly \"now go & empty this out & make us some cocoa\".\n\n Fourteen of our planes went to Jerusalem yesterday & dropped 96 bombs. All returned except five whose petrol gave out. However three others landed with these & took off three\n\nof the pilots & the mounted troops went out & rescued the remaining two pilots & brought back the machine guns, and since the planes were a very decrepid pattern it is perhaps just as well that they have been destroyed. \n\n On the","13":" to relate we leave the sea & go Ibilia back to Abasan el Kebir where we were before.\n\n","14":"\n\nWe are back at Abasan el Kebir now in another orchard about quarter of a mile from the first. They say that we are moving out again in a few days.\n\nOne of our fellows has been indulging in extremely luxurious pastimes lately. The other day he was on a fatigue party to Khan Yunis & whilst there he nipped off for a swim. He was discovered & details of the event were made known to the O.C., The result being that that swim cost him 35\/- shillings.\n\n Again he was sent a few days ago to take some fellows over to the Clearing Station. They all rode over, the sick men having horse holders to take their nags back to the \n\nregiment. On their way they passed a melon field whereupon some of the horse holders descended upon the melons. Presently the officer rode up & wanted to know who was in charge.\n\n I will continue in the unfortunate fellow’s own words.\n\n \"They all said that I was in charge of them & so he took my name, and, though I only had one slice of the melon which these other chaps went in and got it cost me 15\/-shillings, when it came to the knowledge of the old man\".\n\nThere are occasions when amusements in southern Palestine are undoubtedly expensive.\n","15":"\n\nTomorrow I believe we go out on a stunt of what nature I cannot say, some say to escort Allenby – the new C in C. I don’t think we are out after ber-lud or there would be more preparation than there seems to be as yet.\n\n Saw Vance again informally about my lumbago & asked him if I could do anything more for it as it \nwas\n is getting\n\nworse.\n\nHe offered to send me over to the Clearing Station, but in such a way as to make the offer very difficult to accept by practically asking me to stay here as long as possible. He then told me all about it as a sort of for not being able to cure me & also to demonstrate that I might wake up any moment to find it gone. As I have had the damned thing since April, this view did not meet with an enthusiastic endorsement on my part.\n\nI am beginning to long for home & a quiet life intensely now. It takes the form of a vision of myself, seated in a comfortable chair, knocking out my pipe into a good fire.\n\nHorses can show marvellous intelligence at times. Last year, par example, we were chasing the Turk on the 5th August after his abortive attack on Romani & about 10 am we halted for breakfast.\n\nNow for a slight digression on the subject of our W.O. or Serg. Major. (It is full\n\nmoon & I can hear a ‘plane). This estimable Segt Major of ours was an old man very fat & very fond of his food & rather a glutton to boot. Incidentally he used to wear one shirt ad nauseaum. This little foible has been epitomised by the boys under the title of \"From Sohag to Sinai\" or \"The Mystery of the dirty shirt\".\n\nTo return, this particular morning he had no jam for his breakfast so he comes up & seats himself with us & begins after saying I’ll ave a (lights out owing to the taube continue later) \n","16":"\n\n\"I’ll ‘ave a little of your jam if you don’t mind\". He promptly begins to hog into our jam when Bernard, who was also having breakfast near by, neatly, deliberately & with no little aplomb, kicks him in the back of the neck. Wonderful horse!\n\n Apparently it must have been a caterpillar which disturbed us last night as no one got bombed.\n\n I am a back number now I am afraid. I got orders last night to go over \n\nto the Clearing Station in the morning & now here I am. It is a good job. I have sole command of a contingent of some 14 camels & their attendant native drivers. I is I think though, the beginning of the end. I am on the shelf, shop soiled. Well, I have seen Sari Bair, Romani, Katia, Bir el Abd, El Arish, Magdhaba, Rafa and they will do me for the rest of my life quite well.\n\n Vance must have changed him mind, it was quite a surprise for me to come here. \n","17":"\n\nAfter taking my command down to the rest camp on the beach the other day, I came back via the Khan Yunis station and the canteen.\n\n There I was amused to see the personnel of the Camel Transport Corps undergoing an operation known in the vernacular as \"being loused\". Their clothes, what little natives are in the habit of wearing, were in the railway truck being steamed while they, about 300, were squatting in rows, stark, \n\nstripped, mother naked. They were being dipped in what appeared to be a particularly strong solution of creosol just like sheep. After undergoing the ordeal they were to be seen running about evidently desirous of shedding their stinging skins, while others were engaged feverishly fanning their more tender portions. . . It was a sight for gods & men, there were all colours from a jaundiced white to the dark hue of pure ebony. . . and towering above the bath with a big whip to urge \n\non the timorons, like Eblis incarnate, stood a huge Sudanese Bash Ryce or native Sgt Major, naked like his brethren.\n\nSuch a varied assortment of moths flies & wogs are fluttering around by humble candle that it is impossible to write.\n\nI will make a cup of tea & so to bed.\n","18":"\n\nQuite a miniature tragedy has occurred. I have lost Ahmed from amongst the number of my Black Command. He was a genial youth with a wall eye \n\nwho preserved on his countenance an expression of placid simplicity. His centre of gravity was, I think in his feet, which were abnormally large & flat.\n\nI was much amused the other day to hear him relating to Hassan – a staid old boy who should have passed such frivolities – what I mean sure was a ribald story of some sort, my Arabian ear was not skilled enough to pick up more than the barest outline, but the climax of the story came when the heroine presented someone with twins!\n\nAnyway it all sounds grand in Arabic.\n","19":"\n\n To continue my conversation of \nto\n my black levies there are also in addition to Ahmed Hassan, Mahmoud, Guirnar Abdallah and Hamid. Mahmoud should have been a rajah, being of a fleshy disposition with a beautiful moustache\n","20":"\n\nThis morning the Turks are said to have attacked out at Shellal under cover of the fog & nearly caught the 2nd Bgde. Anyway today the Division back in reserve went out at half an hour’s notice, and\n\ntonight – it is now 10 pm there is tremendous rifle fire in front of Gaza. So something is doing all right. I am completely out of it here – so far, at any rate. We are merely waiting now before we take over the rest camp form the","21":" Amb on the beach\n","22":"\n\nStill here at Beui Sela with absolutely nothing to do, waiting to take over the rest camp on the beach.\n\n The other night I woke up in the middle of the night and massacred a big scorpion, & \n\nlast night I was assailed by a Trantula some 4 inches long. They are unpleasant beasts however \"da mortuis nil nisi bonum\". However he gave me the horrors all right directly after the candle was out. I could see in my fertile brain about five crawling steathily onto me, & I would break into a cold sweat & light a match. After about an hour & a box of matches were gone, I arose, took up my bed & walked & now I live on top of a table in the open.\n\nRumour is very rife concerning the evacuation of Bir Saba. All rot I think, for if they evacuate it we could surround Gaza. Anyhow all the Salonica force has now arrived I believe in Egypt, some five divisions or so. There will be an unholy scrap soon.\n","23":"\n\nBeui Sela\n\n This morning, I had my first sick parade, Abdullah being very \"musquyis\". Having regaled me with a resume of \nof \n his symptoms in rapid Arabic, I took his\n\n \n\n","24":"\n\nYesterday 20 camels & 14 natives turned up here & were put on our strength & apparently we own them body & soul now & have to pay them & everything. Hence much heart burning. \n\nToday one of our chaps has gone mad & no one knows whether it is real & whether he is \"working his ticket: This afternoon he got a shovel & started digging holes all over the place. One old chap here is very frightened of him as he has marked out a\n\n grave 2’ x 6’ just behind his dugout. This fellow carries a shovel with him wherever he goes & he has it still. This afternoon the W.O. recommended another chap to give him a cup of tea, to see if it would do him any good: he took the tea & then poured it over the man who gave it to him.\n\nHis eyes are most artistically bloodshot. If he is shamming he is doing it well.\n\nIt will be interesting to see what happens.\n","25":"\n\nAt present I am in the throes of making a groom out of very raw material indeed. One Mohammed Hussain Abu Bakr. to give him his full name, is trying hard to assimilate all I tell him but with no full results. Yesterday he took both horses to water, put the bridle on back to front so that the curb chain was on the horses nose of course the horses bolted, & fell off & nearly killed himself with the chain of the led horse. They are a wonderful people. However I think\n\nhe will improve.\n\nThis time the last two years I have been in the middle of battle murder & sudden death. But It looks rather as if August will pass fairly quietly this year.\n\nTel el Marakeb\n","26":"\n\nNow we are running this rest camp by the sea. Not a bad job at all.\n\nThere is a band here who play every night so that I at any rate am quite happy.\n\nMy job is the water. I\n\nFetch it every day from Bela. Some week ago they peppered Bela & the aerodrome with a long range naval gun & one shell hole is close beside the road. I hope they don’t do it again that’s all.\n","27":"\n\nQuite a number of more or less exciting incidents have happened lately. To start with, one night there was a murderer loose around the camp somewhere. He belonged to the B.W.Is. A rather poisonous crowd\n\nof negroes who speak English as their mother tongue & are all well educated, which I think is a mistake.\n\nI prefer a native who is a native to a native who thinks he is a white man. Anyway one of these charming people shot his officer dead while he slept & got away himself plus a rifle & ammunition & sniped at all who followed him. The next day search parties were sent out but failed to find him. The day after that he was found dead\n\n & is supposed to have shot himself, which is at any rate the most charitable thing to say. On the 17th I had to go to Weli Sheikh Wuran for new cacolets for my ten camels. It was a bilely hot day & clouds of dust & when I got there about lunch time Bernard shied at an Engine & got caught in a wire & came over the top of me. The first spill I have had in the army. I was thrown quite clear fortunately & caught him\n\neasily & got back about 6 pm without further mishap.\n\nMohammed is gradually becoming quite a good groom now. He is trustworthy fairly intelligent & quite willing. He even started to clean up my steel on his own initiative. This sort of thing must be encouraged.\n","28":"\n\nEvents have been moving rapidly in my little world. Three days ago I was \nat\n abruptly told to rejoin the mobile section\n\nof the unit & take my camels over too.\n\nWhen here – a mile further down the beach – I handed over my camels to the corporal who is in command of them. Thus ends the history of my Black Command.\n\nIt is rather typical of this corps for although the corporal & a man look after the camels neither can speak a work of Arabic they would not put me on the job.\n\nAnd then this morning they made me a Lance Corporal!! \n\nI can assure you I am overwhelmed especially as I \n\nrefused a corporals job back in Xmas 1915.\n\n31st August\n\nWell, today I had intended to write long & pithily \nto night\n , my theme being the innocuous passage of the Month of August of which I believe was rally superstitious \nover\n . It is not to be wondered at for in Aug ‘14 the war broke out & so did I. In Aug ’15 – on the morning of the 8th to be exact – I ran without being touched through a concentration of shrapnel which killed Threllfall\n\nAnd Jimmie Mcgowen & wounded Stanger Leathes & Grey amongst others. That was during Sari Bair on the \"Dards, a regular nightmare from the 7th –","29":" In","30":" at about 6.30 am at Romani I had to galop over a ridge into what I firmly believed was the end of all things. Enough to make anyone superstitious.\n\nAs I say I was going to write in a sparkling etc manner, when they decided to inoculate me for all kinds colours & species\n\n Of Typhoid this afternoon which was the end of it. For who can write with an arm that aches abominally & a head that feels as if Rachmaninoff were playing his ‘Prelude’ inside it? We lead a very quiet & peaceful life here. The only incidents being more or less domestic so to speak.\n\nPar example this morning a youth who evidently aspires to the stripes of the Farrier Corporal & is now diligently\n\n leaving to shoe a horse with that end in view; while using the rasp, rasped a large piece out of his knee owing to an unforseen (& uncalled for) movement on the part of the horse ….. I was pleased no ladies were present, he is a boy who, is not, perhaps, as polished as one could wish at times.\n","31":"\n\n Last night about 10 oclock just as I was crawling into bed I heard a phot & also heard - or fancied that I\n\nheard the whine of the bullet, thinking it was someone accidently firing his rifle or a cartridge carelessly put in an incinerator. I murmured to myself \"Damn silly trick\" & went to sleep. Thus do we comment upon tragedy unknown.\n\nThe results of that solitary shot – so common a sound – were a number of men digging on the hill above our camp this morning and this afternoon, a burial party, three tolleys, the glint of bayonets at the \"present\"\n\nand then the slow dispersal of those attending; and, before nightfall a fresh grave upon the hill.\n\nIt appears that a Sgt Crompton shot himself last night with a revolver, for what cause no one knows some say a combination of too much desert & drink.\n\nHowever there he lies on a hill said to be erected by the Romans 2000 years ago within sight of their old road by the sea by which they marched from Egypt upon\n\nGaza.\n\n A man dies in good company hereabouts, fabulous adventurers from Egypt under the Ptolemies, heroes with Alexander the great , grim legionaries of Antony & Ceasar.\n\nAll fought & died before Gaza. During the Crusades 30000 Knights Templars were slain in a battle which raged for 5 days in the Valley of Gaza. While later still Napoleons army toiled along these inhospitable shores.\n\nIf only it were permitted one to see again these days in which Gaza flourished, a Royal City & men from the furthermost East & West of the known world came to far \nto \n Universities & Temples, to learn the highest Arts & Crafts of the time.\n\nFor Gaza, in her day was what Athens was in 600 BC & Rome in 50 AD; The seat of the Learning and Art of the world.\n\nAnd now they say that we have blown up the last\n\nremaining work of art there the mosque (they had an ammunition dump close to it).\n","32":"\n\nJust returned yesterday from a week spent in Port Said.. Not much to do there, but played a good deal of tennis & bathed & mirabile dictu \nthough very strongly tempted refrained from \n \n\nOn Saturday I went to the Casino Palace Hotel & danced there. On Sunday night we went to a not very pretentious\n\nPalais de danse. Admission 1 franc. Quite a sprinkling of females were there, not evening dress of course they being daughters of the French & Italian Shopkeepers I should imagine. I had my eyes on a little Flapper who danced well & asked her in my best French but got turned down, \"mademoiselle\" apparently being frightened of soldiers.\n\nHowever the third shot I picked a winner, who gave me two dances\n\nand who curiously enough could Boston like a bird!!\n\nBut even she would not have a conversation but fled inconveniently directly the dance was over, no blandishment of mine either in French or English being of any avail.\n\n The journey up & down kills it though.\n\nImagine 33 men put in a truck about 20’ x 8’, a truck without springs, on a badly made railroad & spending 12-15 consecutive hours there \n\nIt is absolutely the limit. Two cases of whiskey materialised in our truck on the way back. Wonderful fellows some of these men are!!\n\nNow we are at Abasan el Kebir again, first reserves, but there is a very strong rumour that we are going back to the beach again as the horses are in extraordinarily poor condition & are not fit for work.\n","33":" ‘17\n\nTonight there is a beautiful full moon.\n\nI wonder how many people are watching it rise & saying the usual inanities concerning it?\n\nA few days ago we were issued with six donkeys! We are becoming more & more a cross between a farm & a circus. We have now some 80 white men, 30 natives, 100 horses, 35 camels, six donkeys, four fowls, two pigeons & two dogs to say nothing of the usual chorus\n\nOf Lizards, chameleons, scorpions, tarantulas etc which are not on the strength of the corps. The fowls came back in company with a dead man in an ambulance wagon belonging to two enterprising drivers after a stunk near Beersheba.\n\nI believe we are moving back top the beach at Rafa on the 2 or","34":" in order to spell the horses, instead of going into the front lines with the Division.\n\nNow they have made me gas man, that is to say\n\nI am now versed in the arts of poison gas & have to teach the young idean fresh from innocuous Australia how to put on & frighten him into a proper & wholesome \nrep\n respect for the gas.\n\nBeach at Rafa\n\nJust a bit peevish tonight owing to the crackling of fires everywhere denoting tea & such like comforts in the making while we have no sugar or milk. All things considered we did quite a good move, down here to the beach. Thank goodness\n\nOne can keep clean down here on this clean sand and as for ones clothes, it is literally possibly to wear one shirt almost ad infinitum. I really cannot complain if hardships this summer; compared with last summer this has been a picnic. None of those horrible rides all night followed by a blazing day spent trekking over interminable sand while one’s water gets lower & lower, lips crack & mouths begins to feel like the exhaust pipe of a twin cylinder Indian motor bike.\n\nNo, this summer I have always or almost always had enough water, & practically no stunts \n\nFrom April to June I was with the CTC near the sea\n","35":" in reserve with the Unit At Abasan el Kebir, July \n wi\n at Beui Sela with the Clearing Station doing in a trip to the sea every day\n","36":" & September on the Beach with the Unit resting. Then a week only in the dust at Kilo 9 & now on the beach again\n\nHow long we are here for I don’t know, Public opinion\n\nseems to favour a fortnight only & then out in the front line with the division. But there is also another school of thought which teaches that now we are detached from the Division – certainly an English Brigade took over our camp at Kilo 9 – and we shall be here sometime. However I favour the former, though I prefer the latter.\n","37":" \n\nThe \n\nto be improving - \n \n\nFor the rest, nothing happens We are stoking the horses up in fine style now they get five feeds a day & we almost live on the horselines\n\na bagfeed at 6.30, \n\nwater & feed at 8.30\n\nwater & feed at 12.00\n\nwater & feed at 4.00\n\nand a feed of \"drees\", which is a sort of dried compressed lucerne at 8.00.\n\nI think Charlie Cox – the Brigadier expects the horses to put on condition in a fortnight. What they really want is a complete rest\n\nturned out to grass for three months & then fed up.\n\nThey have been doing solid work ever since the beginning of June last year when we came down \nof\n on this front.\n\nSome enterprising individual has resurrected the \n thredb\n threadbare old rumour about Upper Egypt again now!\n","38":"\n\nAvaunt ye Fairy tales!\n\nI hear now that our Dump at Rafa is going out to Gamleh which is on the Wadi Ghuzzeh some miles beyond Tel el Fara. So\n\n \n\nwe shan’t be going to El Arish or anything like that.\n\nWars & Rumours of wars. – especially the latter – just now. The party from this brigade who were sent out on construction work here returned now – the work being presumably finished – full up to the brim with tales of wonderful big guns miles upon miles of light railways for shell carrying hundreds of guns, millions of gas shells, dozens of tanks flame throwers galore etc etc\n\nSeriously though I think something big is coming off very soon, I believe this bgde is sin reserve – A nasty place – you get all the carefully ranged heavy guns onto you & try & sit still under it & then as a climax you are sent (naturally) at a furious gallop into the hottest part of the line. It is, I think an attempt to take Beersheba or rather Bir saba as it is now. We shall probably go round the back somewhere while the infantry make a frontal attack.\n\nThe Colonel had all the NCOs paraded before him today & told us he was disgusted with us all, warned us that he could break us without a court martial & said if there was not a marked improvement he would do it too.\n\nAll this without even a hint before. Encouraging sort of man. He reminds me very strongly at times of the odious Tate Sutherland with whom we left Australia\n\nJust had a good strong nip of whiskey, I really must put it on record, as it is of such rare occurrence. This from one of the cooks. How they got it God Knows. Guns going very strong at 8 pm tonight in the Gaza direction.\n","39":"\n\n Spent all day today at the Gas school at Div H.Qs. the Gas Officer was not very cheery as he said that the most likely gases we shall probably get on this front are the Lachrymatory\n\nOr Tear shell gas & this new \"mustard oil\" Gas Both of which are the only two gases against which we have absolutely no protection!\n\nHowever the long journey & general tiresomeness of the day was amply made up for by having a good view of an enemy plane which was brought down. The first which I have ever seen. It was great to watch.\n\nThe fight started right above our heads about 10000 feet up I suppose & for about \n\n4 mins the Turk fled outmatched with ours rising & diving at him. Then he slowly keelled over & came straight down nose first slowly twisting for all the world like a piece of weighted paper. Halfway down several clouds of smoke burst from him, & then finally, nose down & tail up he disappeared below the farthest ridge. He must have smacked down close to Abu Sitta No sooner was he fairly down than, apparently from nowhere, the place was\n\n black with horses & men galloping hell for leather towards Abu Sitta.\n\nI thought of going myself but we had a six mile journey back to camp & I thought that the plane would probably be burnt pretty well up & so gave up the idea. This was between 3.30 & 4 pm It was a fair fight between one of ours & theirs. This makes the second in seven days. Which is excellent\n","40":" pm.","41":" ‘17\n\nAnd so another day is done which pretty well chrystallizes our mental attitudes at the end of each day, - If we think about it at all – Far happier is he, indeed who thinks not at all these days.\n\nFor what is there to think about? Each day passes by in colourless monotony exactly as its predecessor & its predecessors innumerable since the time when we last experienced some sharp emotion, as change of scene or a battle etc.\n\nEach day we do the same things at the same time under the same conditions. Nothing happens, This man goes to hospital that man horse’s fetlock has filled up.\n\nThere is nothing new under the sun. Other armies in years & centuries gone by have boiled on these sands & under this sun here at Gaza The sun sand & Gaza are still here only the men & the time differ.\n\nWhats the use of anything, Why nothing.\n","42":"\n\nYesterday was the third anniversary of our departure from Australia. And what remains of the first contingent here resolved to make it known \n\nWherewith they fared forth & bought a case of whiskey & two of beer.\n\nI was in charge of the picket last night & so had to be careful not to drink too much. However I went along soon after the –what shall I call it – perhaps \"bout\" is the best, – after the bout started & thus from about 7 until 9.30 I drank neat whiskey\n\nWe put several people to bed & at half past nine when it had developed into a perfect Saturation & I had had all I could carry & crept away changed into pyjamas \nto night if the drink - again\n & went to bed.\n\n \nBecomes either good temperedly dangerous by waving tables & things in the air, or else go quarrelling in earnest one fellow made me laugh \n\nBefore he became incapable he confided to me that he used to say \" --- you Bill I’m all right\" but since he met the refining influence of this unit he says \"you be dammed William Im fairly fit\"\n\nBefore they finished up Im told that they nearly wrecked the place.\n\n The latest job that they have given me now is\n\nthat of instructing the natives in the use of the gas helmet which is rather a poser For what is the Arabic for a Strombos Horn? However I had the ryce up tonight & gave him a priliminary course in it with quite satisfactory results & Tomorrow I intend to drill them by numbers \"on the command one\" \n\nLannua ana agool wahid \nKat\n Khod el Burnita min el Kees etc etc\"\n\n It will be quite funny.\n","43":"\n\nMy last night in pyjas & comfort, we move out at dusk the day after tomorrow I believe on a big stoush. All moving to be done at night henceforth which is particularly uncomfortable. I am getting too old for war.\n","44":"\n\n\"Essani\"\n\n We are at the second stage of this adventure now.\n\nWe left the beach three days ago at 5 pm reached Abasan el Kabir at 9 pm stayed there until yesterday at 4 pm when we moved out here arriving here \n\nwhich is a place about 15 miles down the Wadi Ghuzzeh from Abasan – at midnight Tomorrow we move on to Asluj \nat\n a further 20 miles when we shall be right out on the right. This is I believe to be our base to attack Bir Saba. Very dull looking tonight and I am very much afraid of rain: but unless it puddles I ought to keep fairly dry. More anon\n","45":"\n\n\"Khalassa\"\n\n The last stage has been split into two & we are now half way to Asluj. The rain did\n\ncome the other night but I managed to keep quite dry. But what did give me a most unpleasant surprise was a gruff voice saying \"stand to\" at 3.30 a.m.. I suppose that will be a regular thing now.\n\n This place Khalassa has evidently been a large town some centuries ago probably in the time of the Byzantine Empire as all the ground round here is scattered with huge blocks of faced stones, Keystones, bits arches etc etc\n\nNow there is \nsto\n just a stone house or two vaultlike in appearance which has, I think\n\nbeen built by the Turk for his Frontier defence. \n\n At Asluj I believe there are Turkish Barracks which have been evacuated.\n\nAsluj","46":" ‘17\n\n This is a queer little place ringed in with hills it has walls, barracks & a small mosque. The Railway (Turkish) from El Wadia to Beersheba passes through here, or I should say, used to pass here, for last March the Div. stunted out here & blew up the bridges & also the viaduct at this place.\n\nWe move out of here tonight and\n\n(I believe) attack Birsaba from the East in the morning. Having to circle the place to do it. An Army Corps is attacking I believe and we have only two days rations + iron ones & are relying almost entirely on Turkish dumps being captured, so if the matter proceeds badly we shall starve as far as I can see. Kismet.\n","47":" Beersheeba Road opp. Tel es Saba\n\n9.30 pm.\n\nWe attacked this morning about 10 oclock & got into Beersheba late in the afternoon attacking from SE direction & Infantry making Frontal attack from W, As soon\n\nas it was dusk the Turks fired all their dumps & about an hour ago blew up something I think the railway line. How we shall do for rations I don’t know. We started with less than a sandbag full of grain for the horses each & two days for ourselves. The first reg. is camping in Beersheeba tonight I am told. Now for the first sleep since yesterday morning.\n\nBeersheba\n","48":"\n\nWe got Beersheba late on the night\n\nOf the","49":" after a moderately easy scrap. As for us with the exception of nearly being scotched by some big shells - shrapnel - which fortunately burst into the ground we had a very easy time. I went into Beersheba next morning while the turkish fires were still smouldering. It is quite a small place, with the exception of two big buildings & a mosque there is nothing of any size. One of these buildings was Turkish – now our s – headquarters and in their hurry they had simply chucked all their maps & correspondence out of the \n\nwindows with the result that all around was a mass of \npappe\n papers in turkish. The other building was the Hospital the Turks used evidently it used to be a hotel & has quite a good flower garden & fountain around it. There is a light railway, gauge about 4 feet and some rolling stock which was mined. In fact the whole place was a mass of \ncon\n cunningly contrived mines & I had to be very discreet in my search for horse feed for Bernard. However I got a sand bag filled safely though while I was in\n\nthe town – about an hour – two went off.\n\n Then for two days we did nothing but recuperate and finally at midnight on the 2\/3rd Nov moved out about 10 miles to where the turks were making a stand at a watering place called Bir el Khuwrilfeh. Here the brigades went into it & \nmet\n the first regiment met an enfilading fire & got badly cut up & were kept very busy all day under an intermittently heavy & fortunately erratic shellfire. And fortunately the only shell which burst all\n\nover me must have been a bad one for the pellet hit my hat & never went through it or Bernard.\n\nThe turks were deliberately sniping at us all day & we spent a very unpleasant day one man being wounded five horses killed & two injured & two sandcarts smashed & about four or five put out of use.\n\nWe finished up at about 11 pm & got back here & watered the horses for the first time since 2 pm on the","50":" & turned in about 3 am this morning. Got up again about 9 am & then at 5 pm got orders\n\nto be ready to move out again at a moments notice. All who were \nread\n fit to go out got ready amidst a perfect deluge of bad language & then just about half an hour ago the order was cancelled, great rejoicings. Though it is quite on the cards that we shall have to go notwithstanding.\n\nWhat the position is out there now I don’t know, when we left things were in statu quo ante. As to Gaza I am ignorant also we are said to have attacked successfully all along & to have taken\n\nGaza the first day but I don’t know.\n\nThere are an enormous number of troop up here now & our communications lie along the main Hebron road, a really splendid metal road, which runs past were we are camped & while I have been writing \nau our\n a neverceasing stream of big motor lorries with stores & munitions, batteries of guns, long lines of motor ambulances have been passing by. And so, with a fervent hope for an undisturbed night, to bed.\n","51":"\n\nAt Present I am sitting swathed in a greatcoat on the desert or rather open ground about halfway with a dash of north in it between Beersheba and Gaza.\n\nWe went out on the evening of the","52":" after standing to all day & just about dusk travelling in a northwesterly direction from Beersheba carrying only the \"unexpired\" portion of that day’s rations & our one days emergency ration. Having reached the front line instead of \n\nof merely doing an outpost as we had been told, the orders were changed – we had to take up a position & \"Box on\" at dawn in company with the rest of the division which was being hurried out. Just at dawn I boiled a billy & made myself a cup of tea & had just drunk half of it when the turks began to shell us pretty heavily the result being that we had to run for it. Scalded my throat trying to drink the rest of my tea & then galoped away holding\n\nmy mug in one hand & trying to hold Bernard with the other. That over we proceeded to attack Tel esh Sharia which is the junction of the Jerusalem Beersheba-Gaza railway. This we got with some guns & a dump of about 3000 shells & pushed on Northwards running a big wedge into the turks.\n\nWe captured a lot of brand new equipment dump & a couple of hospitals & more shells this morning. But most of today I believe the turks have held us up.\n\nAnyway yesterday the","53":" we ate all our iron rations & today we are living on the & scraps & praying for the ration convoy. I haven’t had a wash or had my clothes off for three days & though this is very interesting I would rather have peace.\n\n \n\n"}}