{"Document Name":{"0":"Diary_0386","1":"Diary_0386","2":"Diary_0386","3":"Diary_0386","4":"Diary_0386","5":"Diary_0386","6":"Diary_0386","7":"Diary_0386","8":"Diary_0386","9":"Diary_0386","10":"Diary_0386","11":"Diary_0386","12":"Diary_0386","13":"Diary_0386","14":"Diary_0386","15":"Diary_0386","16":"Diary_0386","17":"Diary_0386","18":"Diary_0386","19":"Diary_0386","20":"Diary_0386","21":"Diary_0386","22":"Diary_0386","23":"Diary_0386","24":"Diary_0386","25":"Diary_0386","26":"Diary_0386","27":"Diary_0386","28":"Diary_0386","29":"Diary_0386","30":"Diary_0386","31":"Diary_0386","32":"Diary_0386","33":"Diary_0386","34":"Diary_0386","35":"Diary_0386","36":"Diary_0386","37":"Diary_0386","38":"Diary_0386","39":"Diary_0386","40":"Diary_0386","41":"Diary_0386","42":"Diary_0386","43":"Diary_0386","44":"Diary_0386","45":"Diary_0386","46":"Diary_0386","47":"Diary_0386","48":"Diary_0386","49":"Diary_0386","50":"Diary_0386","51":"Diary_0386","52":"Diary_0386","53":"Diary_0386","54":"Diary_0386","55":"Diary_0386","56":"Diary_0386","57":"Diary_0386","58":"Diary_0386","59":"Diary_0386","60":"Diary_0386","61":"Diary_0386","62":"Diary_0386","63":"Diary_0386","64":"Diary_0386","65":"Diary_0386","66":"Diary_0386","67":"Diary_0386","68":"Diary_0386","69":"Diary_0386","70":"Diary_0386","71":"Diary_0386","72":"Diary_0386","73":"Diary_0386","74":"Diary_0386","75":"Diary_0386","76":"Diary_0386","77":"Diary_0386","78":"Diary_0386","79":"Diary_0386","80":"Diary_0386","81":"Diary_0386","82":"Diary_0386","83":"Diary_0386","84":"Diary_0386","85":"Diary_0386","86":"Diary_0386","87":"Diary_0386","88":"Diary_0386","89":"Diary_0386","90":"Diary_0386","91":"Diary_0386","92":"Diary_0386","93":"Diary_0386","94":"Diary_0386","95":"Diary_0386","96":"Diary_0386","97":"Diary_0386","98":"Diary_0386","99":"Diary_0386","100":"Diary_0386","101":"Diary_0386","102":"Diary_0386","103":"Diary_0386","104":"Diary_0386","105":"Diary_0386","106":"Diary_0386","107":"Diary_0386","108":"Diary_0386","109":"Diary_0386","110":"Diary_0386","111":"Diary_0386","112":"Diary_0386","113":"Diary_0386","114":"Diary_0386","115":"Diary_0386","116":"Diary_0386","117":"Diary_0386","118":"Diary_0386","119":"Diary_0386","120":"Diary_0386","121":"Diary_0386","122":"Diary_0386","123":"Diary_0386","124":"Diary_0386","125":"Diary_0386","126":"Diary_0386","127":"Diary_0386","128":"Diary_0386","129":"Diary_0386","130":"Diary_0386","131":"Diary_0386","132":"Diary_0386","133":"Diary_0386","134":"Diary_0386","135":"Diary_0386","136":"Diary_0386","137":"Diary_0386","138":"Diary_0386","139":"Diary_0386","140":"Diary_0386","141":"Diary_0386","142":"Diary_0386","143":"Diary_0386","144":"Diary_0386","145":"Diary_0386","146":"Diary_0386","147":"Diary_0386","148":"Diary_0386","149":"Diary_0386","150":"Diary_0386","151":"Diary_0386","152":"Diary_0386"},"Date":{"0":"unknown","1":1488.0,"2":1490.0,"3":1491.0,"4":1492.0,"5":1493.0,"6":1500.0,"7":1501.0,"8":1507.0,"9":1519.0,"10":1520.0,"11":1521.0,"12":1522.0,"13":1523.0,"14":1524.0,"15":1536.0,"16":1550.0,"17":1551.0,"18":1552.0,"19":1553.0,"20":1554.0,"21":1570.0,"22":1571.0,"23":1572.0,"24":1573.0,"25":1574.0,"26":1575.0,"27":1577.0,"28":1578.0,"29":1579.0,"30":1582.0,"31":1583.0,"32":1584.0,"33":1585.0,"34":1586.0,"35":1588.0,"36":1589.0,"37":1594.0,"38":1595.0,"39":1596.0,"40":1597.0,"41":1598.0,"42":1599.0,"43":1600.0,"44":1603.0,"45":1608.0,"46":1619.0,"47":1621.0,"48":1626.0,"49":1628.0,"50":1630.0,"51":1631.0,"52":1633.0,"53":1636.0,"54":1637.0,"55":1638.0,"56":1642.0,"57":1643.0,"58":1644.0,"59":1645.0,"60":1646.0,"61":1647.0,"62":1648.0,"63":1650.0,"64":1651.0,"65":1652.0,"66":1653.0,"67":1654.0,"68":1655.0,"69":1656.0,"70":1657.0,"71":1658.0,"72":1662.0,"73":1665.0,"74":1666.0,"75":1667.0,"76":1672.0,"77":1674.0,"78":1675.0,"79":1677.0,"80":1678.0,"81":1682.0,"82":1683.0,"83":1684.0,"84":1687.0,"85":1688.0,"86":1689.0,"87":1696.0,"88":1698.0,"89":1705.0,"90":1706.0,"91":1707.0,"92":1708.0,"93":1709.0,"94":1710.0,"95":1711.0,"96":1712.0,"97":1713.0,"98":1714.0,"99":1715.0,"100":1716.0,"101":1717.0,"102":1718.0,"103":1729.0,"104":1731.0,"105":1736.0,"106":1738.0,"107":1740.0,"108":1741.0,"109":1742.0,"110":1743.0,"111":1746.0,"112":1747.0,"113":1748.0,"114":1761.0,"115":1764.0,"116":1769.0,"117":1770.0,"118":1771.0,"119":1772.0,"120":1773.0,"121":1774.0,"122":1775.0,"123":1776.0,"124":1778.0,"125":1780.0,"126":1785.0,"127":1786.0,"128":1790.0,"129":1796.0,"130":1797.0,"131":1799.0,"132":1805.0,"133":1808.0,"134":1810.0,"135":1815.0,"136":1816.0,"137":1817.0,"138":1818.0,"139":1819.0,"140":1830.0,"141":1838.0,"142":1839.0,"143":1840.0,"144":1841.0,"145":1844.0,"146":1850.0,"147":1851.0,"148":1852.0,"149":1853.0,"150":1854.0,"151":1855.0,"152":1859.0},"Entry":{"0":"\n\n","1":"\n\nOur Division is out resting in villages between Devres, Samer & Etaples. 14 Field Ambulance is at Cormont. We saw the New Year in and turned in about 2 a.m. Two adventurous chaps managed to get inside the village church at midnight & rung in the New Year to the astonishment (& alarm of some) of the local civilians. To-day we had a sports meeting on a large snow covered field.\n","2":"\n\nThe past week has been devoted to sports, dull route marching etc. I managed to get into Boulogne (25 kiloms.) & Wimereux (4 kiloms. further on) a couple of times.\n\nOn ","3":"\n Sunday afternoon four of us got leave to go to Etaples (10 kiloms.). We walked in and later in the afternoon\n\ncaught the tram out through Le Touquet Forest to Paris Plage – a seaside place about 5 kiloms. from Etaples. There appears to be no fear of enemy aircraft at Paris Plage. In the evening the numerous shops of all kinds were brilliantly lighted; quite different from Etaples, Boulogne, Calais, St. Omer, Bailleul or other northern towns where all is inky black after nightfall; the lighting restrictions & precautions being very much in evidence. Paris Plage was a very popular tourist resort before the war – now khaki is the prevailing colour in this attractive little place. Numerous Belgian refugees have established themselves here. We walked the 10 kiloms. back from Etaples to Corment along a road slippery as glass with frozen snow; we all had several falls on the homeward journey.\n\nEtaples is not a very interesting place, especially in winter. On the outskirts of the small town are British Hospitals, base camps, Y.M.C.A. huts & canteens; also several American, Canadian & New Zealand hospitals & camps. There are plenty of W.A.A.C. girls in their brown uniforms in the place as well as 120 navy-blue clad English women who are driving motor ambulances in the area. (Note – Australians get on pretty well with the abovementioned.)\n\nYesterday & to-day I have been running round the villages with a motor ambulance, collecting sick from the Units of our Division, and taking them to Etaples hospitals. Yesterday my car did the 13th & 14th Field Artillery Brigades &","4":" Div. Am. Column. To-day we did the 53rd & 56th Inf. Battalions. It snowed heavily last night and kept it up this morning with\n\nthe result that the roads were almost impassable. We started off with a regular blizzard raging & perishingly cold. The rounds were done alright although many snowed up lorries & staff cars were passed. We took some patients from one of our own ambulances that was in a “bogged\" condition, and started off to take them to hospital. However between Neufchatel & Dannes a three ton lorry ran into the Ambulance buckling a splashboard & both front wheels as well as bending the axel – fortunately no-one was hurt. We pushed the damaged Ambulance clear of the road & left it there with the driver. Soon afterwards I secured a Red Cross car from Etaples and dropped the patients at Camiers (20th Brit. Gen. Hosp.) & Etaples (24th Brit. Gen. H.).\n\nThe Australian Divisions in France are evidently going to melt away as the\n\nresult of the “NO\" vote at the referendum. From the 1st January 1st Anzac Corps, to which we belong (1st, 2nd & 5th Divs.) is to be known as the Australian Corps. Evidently the 3rd & 4th Aust. Divs. are being transferred out of","5":" Anzac Corps to us and the New Zealand Div. will probably go to a “Tommy\" Corps.\n\nA notification has just appeared in A.I.F. Orders of the award of one Military Cross, one Meritorious Service Medal & 4 mentions in despatches to Officers & N.C.Os. of","6":" Field Ambulance.\n","7":"\n\nLast night the Sergts. & a few others held a Dinner at a Tearoom in Etaples in order to congratulate the N.C.Os. who received M.S.M. or were “mentioned\". The affair commenced at 5 p.m. and finished at 9. There were 24 present.\n","8":"\n\nExtract form an article in a French paper with the heading “LES ANZACS\". La premiere fois que j’ai vu le nom des Anzacs dans un journal, j’ai ouvert de grands yeux. Qu’etait-ce que ce peuple venu des Indes sans doute ou d’Extreme Orient, a moins que d’Amerique pour combattre a nos cotes le bon combat! Dans mon ignorance j’ai interroge. On m’a repond:\n\n“Ce sont des Australiens\"; ce sont des Neo-Zelandais.\n\nPourquoi les nomme-t-on Anzacs?\n\nAh ca! vous m’en demandez trop!\n\nJ’ai mis deux ans et demi (avec patience on arrive a tait) a savoir que Anzac etait l’abreviation de “Australian New Zealand Army Corps\";\n\nle corps d’armee des Australiens et des Neo-Zelandais. Oui, en prenant la premiere lettre de chacun de ces mots et en reunissant le tout, on arrive a Anzac. C’est la nouvelle maniere de forger des mots!\n\nLes Anzacs n’ont pas attendu que je comprisse leur nom pour l’illustrer. Au lendemain de la declaration de guerre ils sont montes par milliers dans des navires qui les commenerent loin de leur sol natal. Ils ont traverse les mers, defendu le canal de Suez, bitte contre la Turquie aux Dardanelles ; contre les Arabes fanatiques qui voulaient s’emparer de l’Egypte; ils ont verse leur sang en Picardie; ils sont aujourd’hui parmi les plus heroiques soldats de la bataille des Flandres.\n\nEn tous, une centaime de mille environ, sont des volontaires de guerre. Pas un qui fut soldat dermetier. Comment ont-ils pu arriver a ce degre de resistance et d’entrainement sand quoi le courage le plus magnifique ne peut rien ?\n\nOn les a soumis, des le debut aux plus rudes epreuves. Comme point de concentration, Heliopolis, pres du Caire; comme champ d’exercice la lisiere du Sahara. En depit de la temperature qui regne en Egypte pendant l’ete on debuta, en placant sur le dos de chaque homme un equipement de 25 kilos ; puis sous un soleil torride on les fils marcher, multiplier les etapes dans un sable mou, fuyant sous les pas et qui double la necessite de l’effort. Passe encore aux premieres\n\nheures du jour. Mais quand aux heures chaudes, le soleil brule armes et souliers, quand le nuage des sables monte toujours plus haut, que la soif grandit, que la fatigue s’exaspere, il faut succomber ou sortir de la plus fort et extraordinairement aguerri.\n\nLes Anzacs resisterent, acquirent les plus merveilleuses qualites du soldat et si l’expedition des Dardanelles n’a pas eu des resultats aussi funestes qu’on a pu le craindre un moment, c’est en grande partie a eux qu’on le doit.\n\nLeur conduite en la circonstance ayant attire sur eux l’attention du haut commandemant, on les jugea murs pour le front occidental. En","9":" ils avaient l’honneur de conduire l’offensive de Picardie que\n\nles tanks accompagnerent pour la premiere fois; en juin 1917 ils eurent la gloire de prendre d’assaut le village de Messines, lors de l’offensive des Flandres; en oct. ils participerent a la prise de Passchendaele.\n\nOn peut louer, n’est ce pas ? tels combattants sans faire tort aux autres, qui meritent tous notre admiration. C’est pourquoi je ne saurais marchander les eloges a cette armee des antipodes, formee d’hommes qu’une distance de 20,000 kilometres et la nature meme des choses pouvaient tenir en dehors de nos conflits. La collaboration des Australiens s’explique encore par les liens de famille, d’interet, qui les unissent a la Grande-Bretagne. Les Australiens venus a la rescousse sont tous plus ou moins descendants des Anglais.\n","10":"\n\nWe stayed six weeks at Cormont and had quite a decent time there. For the first three weeks I was route marching, drilling etc., with the bearers but during the latter half of our rest I was collecting sick from various Units of the Division in surrounding villages and evacuating them daily to Etaples, Camiers and Boulogne.\n\nOn Tuesday 29th Jan. we had reveille at 1 a.m. and marched out at 2.15 a.m. After a ten kilometre march we arrived at Samer and boarded a troop train soon after. We ran through Desvres, Hazebrouck & Bailleul and detrained at Dekennabek Siding in Belgium. From this point, where there were several thousand 2nd Div. men waiting to entrain – going out of the lines for a rest, we marched through the remains\n\nof a bombarded village – Kemmel and billetted for the night in huts at Rossignol Camp. The next morning a couple of us climbed up to the top of Mount Kemmel where, notwithstanding the mistiness of the morning, a few view of the surrounding country was obtained. The top of the mountain is honeycombed with old trenches, dugouts & observation posts. At 2 p.m. same day B Section tent division received orders to go up to Kandahar Farm about 5 kiloms. away and take over right sector Advanced Dressing Station from 2nd Aust. Field Amb. who were going out for a rest with 1st Div. We found the A.D.S. a nice little place consisting for the most part of heavily sand-bagged shelters. There was practically nothing doing as the sector is so quiet. The following morning I was ordered to\n\nreport for duty to A Section of the Ambulance which was running the Main Dressing Station on the Gordon Road halfway between Kemmel & Wyschaete. On arrival I found that the M.D.S. was much larger than the A.D.S. I had just left and was a collection of huts and gasproof shelters covered with concrete & sandbags with saps running between them. The Messines sector which we are in, is very quiet and there is very little work to do – very few gassed & wounded and not many sick. I have been \njust\n put on nights with a Cpl. & 2 men. Yesterday afternoon two of us went down to Locre where we ran the Div. Rest Station last time the Division was in the line. We got a ride down on a motor lorry but walked the 6 kiloms. back along muddy roads. It was a frosty day with a bitterly cold wind blowing.\n\nThis afternoon I went up to the left sector Adv. Dressing Stn. that C Section is running at Wyschaete – two kiloms. closer to the line. The A.D.S. is a collection of strongly cemented pillboxes and is quite a decent little “home\". The camouflage screens in front give it quite a village inn appearance. On the left of the road going up there is a great exploded mine crater evidenty sent off when the 3rd Div. & N.Zs. took Messines & Wyschaete. Several notices show the positions of unexploded mines surrounded by wire fences. The country, of course, presents a desolate appearance with plenty of shellholes & a few shattered treestumps. To-day has been sunny & clear and increased aerial activity was noticeable. Several of our big guns were busy pounding away at Fritz.\n","11":"\n\nThe following extract taken from an article in “Aussie\", the new A.I.F. paper, shows so clearly the difference between Paris & London that I am quoting it in full:-\n\n“Paris is magnetic – electric. It thrills. London impresses the visitor by its immensity, the density of its crowds, its complexity, its stolid commercial air; its beauty, its art, its lighter side must be sought. But from the first glimpse of Paris one is strongly influenced by its beauty, its vivacity, its spirit of camaraderie. Immense, commercial London interests & bewilders. Pleasure loving, artistic Paris charms & elates.\"\n","12":"\n\nThings are very quiet in the sector. Practically\n\nnothing doing for us in the way of casualties. It is pretty slow up here. We are too far up for civilians & villages and the weather is cool, cloudy & rainy.\n\nI am just about due for my second leave to United Kingdom now increased to 14 days. However I have applied through usual channels to G.H.Q. to take the 14 days in Italy commencing 1st March. I only know about six words of Italian & have no friends down there but it is a good opportunity to see this sunny land.\n\nThursd. 14th Feb.\n\nThe 3rd Division is on our right and the 4th on the left","13":" in the centre). A few evenings ago, after a short, sharp artillery bombardment, a big raiding party of the","14":" Div., hopped over\n\nand took about 40 prisoners. The Germans also lost about 100 killed. Our casualties were 20 killed & wounded. The communiqué of the affair was in yesterday’s English & French papers.\n\nAs things are so quiet we have a fair amount of spare time on our hands. I have just started taking a small French class in the evenings in one of the dugouts, and am slogging into Flemish again. We are of course beyond the civilian zone so that conversation is not possible, making the language harder to get a grip of.\n\nEveryone is heartily sick of this un-natural sort of existence but nobody has any idea when the war will be over.\n","15":"\n\nThe weather is now sunny although sharp with cold, moonlight nights. The boche is taking advantage of the latter and his taubes are coming over us. Yesterday he put over some long range stuff. The weather is good for observations and our kite balloons are keeping well forward.\n\nI have heard unofficially from Div. H.Q. that my leave to Italy is alright (from","16":" March.).\n\nLeave to Italy:\n\nHearing rumours about leave to Italy being available and getting a clue from some G.H.Q. Routine Orders, I put in an application for leave to Rome from 1st to","17":" in lieu of 14 days to England which was already overdue. My passport in English, French and\n\nItalian came through alright and I got away from the Main Dressing Station on the Wyschaete Road on the afternoon of 27th Feb., doing the 10 kiloms. across the frontier to Bailleul in a motor ambulance. I found a billet in the town for the night, a little place on the Meteren Road occupied by two old ladies who gave me an interesting account of the German occupation of Bailleul in 1914 and the subsequent withdrawal.\n\nLeft Bailleul at 8 o’clock the following morning, arrived at Calais at midday and Paris at 8.30 p.m. – the evening before my leave started. I didn’t feel too good on leaving the Unit and was no better on arrival in Paris. (Was determined that a touch of trench fever or\n\nsomething would not prevent me taking the leave.)\n\nOn arrival at the capital I had to go to the Canadian Report Centre & register and then went to the British Leave Club, Place de la Republique where I put up for the night. This evening there was a dance in full swing at the club. This centre which has been organized mainly by English residents of Paris, is quite a live institution and is doing good work for chaps going to Paris on leave.\n\nThe following morning I spent in the city and tried to make arrangements when booking a seat on the train, to get to Rome via Switzerland wearing plain clothes while traversing a neutral country. The railway authorities informed me, however, that the Swiss frontier had \n\nbeen closed the previous evening and that I might be delayed a couple of days as the result, a loss of time which I could ill afford. In the afternoon I went out to Auteuil and dined with friends. Armed with a couple of Baedekers guide books on Italy I returned to the Leave Club and left by the 8.30 p.m. train for Modane & the Italian frontier. I did not like the look of the weather – it was cold & windy with a few flakes of falling snow.\n\nThe next morning the countryside was covered with snow and the train made slow progress. Finally through an accident on the line or a block of snow, we had to go back some distance and go on again from Macon through Bourg, Amberieu, Culoz, Aix-les-Bains\n\n(N.B. Noted holiday resort – American M.Ps. on station) & Chambery to Modane. The crowded train drew into the frontier town at 6 p.m. – eight hours late. The country between Paris and Modane was not very interesting being mostly under snow, but we passed through some very rocky country with great mountainous peaks towering up on either side. After leaving Aix-les-Bains the train ran for some distance round the edge of a lake, a fine stretch of water. The railway tunnels in this part of the world are innumerable. At Culoz we were only 67 kiloms. by rail from Geneva. On the journey several trainloads of Italian troops were passed going up to the French front. Battalions of Italians are now being placed in between French units – evidently the result of the\n\nrecent big Italian setback. The first thing to be done at Modane was to put my watch forward one hour, central European time being one hour ahead of French time. The frontier station was one confused mass of French & Italian troops and civilians and a few British & Americans. Customs officials of both nationalities were present and went through all baggage. Passports had to be stamped and railway tickets bought. A good meal was ready in the buffet and we left again at 10 p.m. Woke up 3½ hours later and found that the train was at Turin (Torino). I was fortunate in finding two French officers who were going to a hotel so tramped with them through the broad, dark streets to the “Metropole & Bonne Femme\" in the Via Pietro Micca near the Piazza Castello.\n\nI spent a day and a half in Turin – a large town with broad, cobbled streets (no foot pavements) & covered galleries and with a population of 500,000. The afternoon was bright & sunny so I paid a visit to Mount Superga. Went by tram through the city (via Po & Piazza Emanuel) across the river Po at Sassi and on for some distance. The tram then became a fununculaire railway and we climbed gradually up and up. At the terminus we got out and walked up a winding path to a fine, big white church & convent. A splendid view of the town and winding rivers (Po & Dora Riparia) was obtainable from this lofty eminence. Turin, the capital of Piedmont is built on a plain surrounded by high mountain peaks. I had a good look round the town – the broad crowded streets with their ringing trams, churches, squares, theatres & castle were\n\nvery interesting – this my first glimpse of Italy. I had to take things fairly quietly as was still feeling a bit groggy.\n\nThe train arrived at Milan (150 kiloms.), my next “port of call\" at 7 p.m. and I put up at the Hotel Cavour, via Alessandro Manzoni close to the Public Gardens. After a good dinner I made tracks for the Teatro Lyrico, crossing the Piazza Duomo and getting a first glimpse of the magnificent Cathedral. At the theatre I secured a good seat and saw “Cavalleria Rusticana\" followed by a splendid ballet (storica allegorica fantastica) “Excelsior\" which lasted fully an hour and a half with constantly changing scenes and magnificent costumes.\n\nThe following morning I went first through the Cathedral and down into the crypt, and then visited the world famed Scala Opera\n\nHouse. The castle (Castello Sforzesco) public gardens (Parco) Peace monument (Arco Pace) & arena followed. I had dinner in a Ristorante in the Piazza Duomo and at 3 o’clock was lucky enough to hear the massed bands of the British Guards, French Garde Republicaine, Italian Carabinieri & American 18 Infantry Rgt. which played in front of the Cathedral before a tremendous and enthusiastic audience. The great piazza was absolutely packed with cheering people while a big Caproni plane flew round overhead dropping war loan leaflets. Your ‘umble servant being the only Australian in the crowd came in for a good deal of attention and I was soon yarning to all & sundry in English & French, a mixture of both and a few words of Italian thrown in. When the big gathering broke up I went and had a look at the old columns of\n\nSan Lorenzo with the Milan manager of the Nestles Swiss Milk outfit as a guide. This chap, who spoke fluent French & English, wanted me to come round to his maison for dinner but as I was leaving early there was nothing to do but decline the invite. Pop. of Milan 650,000.\n\nAfter travelling all night I arrived at Florence at 6.30 a.m. & after a rest and petit dejeuner at the Hotel S. Marco, via Calzaioli, started out to see something of the place. My morning’s programme included the Cathedral in the Piazza Duomo, Piazza Pitti & Royal Place with the finest collection of paintings in the world, Dante’s House, S. Croce Church, Medicci Chapel & a walk along the river bank with its curious little art shops where many thousands of tourists must have bought various odds & ends. The old Vecchio bridge makes a quaint & pretty picture and every artist who comes to Florence paints it from the edge of\n\nthe river. An interesting place I had a look at was a manufactory of Florentine Mosaic and various kinds of artistic work in hard stones, both ancient & modern styles. In the afternoon I jumped on to a tram and ascended the Viale du Colli to the Piazzale Micael Angelo. Again a beautiful Italian town, the capital of Tuscany, lay at my feet with the river Arno winding through it. In the distance \nof\n the snow-clad peaks of Mont Rosa, the Apennines & Alps were pointed out to me. I only went to one picture show in Italy and that was this evening. It was a kind of continuous show – one long picture being put on time after time. I saw this picture and there and then made up my mind to bother no more about Italian cinemas. After dinner I strolled round to the Gambrinus in a galleria by the Piazza Vitt. Emanuele, a great café with\n\ndozens of little tables round which people were smoking, chatting & sipping coffee. A splendid orchestra was playing on an artistically decorated raised balcony at the far end of the room.\n\nThe following morning I went looking for some English people whose address had been given me, but I found they had moved to Naples, so I kept along the river into the fine public gardens.\n\nDuring the afternoon I packed up my scanty belongings and left for Rome (316 kiloms) arriving in Italy’s capital, the Eternal City, at 1 a.m. After trying a couple of hotels both of which were full, an Italian officer finally guided me to the Britannia in via Quatro Fontane. The next three days passed rapidly. Rome is not nearly as big as Paris or London (pop. about …) and it is very easy to \n\n“get the lay of the land\". The 72 hours were spent mainly in seeing St. Paul’s, the Vatican, Piazza Venezia & Vitt. Emanuel Statue, Forum, Coliseum, Palatine; visiting British Club, Italian & English people, Scouts, restaurants & cafes, Mefistofele (Opera) at Teatro Constanzi and a musical concert at the Quirino Theatre.\n\nAt 11.5 p.m. on the third day in Rome two of us (picked up an Aust. 3rd Div. Sergt. for this trip) left for Naples – 250 kiloms. where we arrived the following morning at 7.30. After breakfast at the station buffet a horsed carriage was secured and we had a look round the town – a fairly dirty place from what we saw of it. Six hours before our arrival a zepp. had been over and dropped bombs for the first time on the town but we saw no evidence of\n\ndamage. At 9 o’clock on a beautiful morning a train took us round the pretty Bay of Naples to Pompei. The country passed through was being worked by women, children & old men – all of a marked southern type. Plenty of small shipbuilding was going on round the bay. Making up a party of 4 with a Canadian officer and American Red Cross Commissioner we had a good look over the old city of Pompei and after dinner left to climb Vesuvius. After a journey of two hours in stages, first in a light carriage, then on a mountain pony and finally a short stiff climb on foot, we were looking down on a sulphurous mass into the crater of the famous mountain. It was active in one corner and was emitting clouds of smoke and steam. On the return journey down the mountainside we had a great view of\n\nthe bay with Naples on the right and Castellammare, Sorrento & the isle of Capri on the left. We caught an electric train from Boscotrecase back to Naples and straightway made for a “show\" to fill in the evening. We found a Music Hall and after seeing a third rate performance right through, went back to the railway station, had a feed, a sleep, and caught a train at 4 a.m. back to Rome.\n\nAfter a wash, brushup & breakfast I was ready at 10 a.m. for some sightseeing so went out through the old wall, along the Appian Way to the Catacombs of St. Callixtus on the way having a good look at the old Roman baths of Caracalla which are in an excellent state of preservation. There are ten miles of these catacombs, some being seventy feet below the surface.\n\nThe bodies were placed in niches hollowed out of the rock on either side of the tunnels as well as in family vaults. There are enough of these galleries and chambers to shelter the whole population of Rome. The place is looked after by a religious order, the members of which act as guides. The afternoon was spent visiting people and in the evening I went to the Apollo – a big café chantant in the via Nazionale.\n\nOn Wednesday morning an Australian lady, Italian girl & 2 Aussies made up a party and went out in the campagna li Frascati, 27 kiloms. for Rome. There we were shown over a beautiful Italian villa & grounds and after a nice little Frascati lunch, returned to Rome. A drive through the pretty Pincino Gardens between the fashionable hours of 4 & 5, visits to the Piazza\n\nPopulo, street markets, an Italian residence, Boy Scout meeting, dinner and La Traviata at the Costanzi finished a very enjoyable day.\n\nThursday was my last day in the capital. Commencing with a carriage drive up to Genicola & the Garabaldi Statue, we subsequently dismissed the driver in the Piazza de Pietro and climbed right up into the Dome of St. Peter’s (splendid view). This strenuous exertion was followed by a cup of chocolate & biscuits under an awning outside a little caffe (Italian spelling) with the people passing by in an endless stream, casting curious glances at the Australian uniform. Went to a very nice afternoon tea, purchased a big bunch of post cards, packed my kit, had dinner & made for the station where I was agreeably surprised to find our energetic Australian\n\nlady friend waiting to see me off.\n\nThe train arrived at Pisa during the night and I missed seeing the leaning tower. At 9 a.m. we steamed into Genoa (Genova) – two hours late. Here I had to change & found that there would be no train until 6 p.m. leaving me the best part of a day to look round this French Italian port. The morning I devoted to a trip out to the famous cemetery – Campo Santo – with its beautiful statuary in marble and bronze, long galleries and imposing monuments; the most celebrated burial ground in the world. At dinner in a smart restaurant in via Venti Septembre I chummed up with a French Naval officer on his way to Toulon from the Adriatic. We went for a stroll down to the docks and around the town which is busy, prosperous and clean.\n\nI got to Vintimiglia (French – Vintimille) at 1 a.m. Here I changed my Italian money, bought a ticket to Paris and put my watch back one hour to French time. At Mentone everyone had to get out of the train to have passports stamped. I left the station and walked out in the early morning to the splendid British officers’ convalescent hospital that has been established near Mentone (Cap Martin). Finding that the chap I wanted to see had not arrived I took the Monte Carlo tram back to the gare and left by the rapide at 10 a.m. passing through Monaco, Monte Carlo, Nice, Cannes, Toulon etc., reaching Marseille at 6 p.m.\n\nI had purposely left Rome a day early to enable me to spend 24 hrs. in Marseille and I was soon busy looking up friends that I had not seen for two \n\nyears. France’s chief seaport and second largest town is looking better and more prosperous than ever. The streets were thronged with people and the cafes crowded. The population is now supposed to be about 1,000,000 (1,000,000) having nearly doubled since the war.\n\nPassing through Fontainebleau-Forest, Paris was not reached until 6 o’clock the next evening and after putting up at the Hotel Montana I went to the Comedie Francaise and saw something very good in the “barbier de Seville\".\n\nSpent the following day in France’s capital and arrived at Bailleul, via Calais about 5 o’clock the following evening. With the assistance, first of an A.S.C. horse waggon & then a staff car, I was soon back with the Ambulance at Dranoutre after an absence of exactly three weeks.\n\nI thoroughly enjoyed my fortnight in Italy. Of the 21 days away from the Ambulance, 6 or 7 were spent in the train. The weather in Italy was splendid – much better than in France. I found living cheap. The lire, which in normal times has about the same value as the French franc, has dropped considerably in value and is now only worth 6d. English or about","18":" of a franc. A considerable profit is therefore realised on changing your money (600 francs = a little more than 900 lires).\n\nThe towns in the centre and south are well lighted and entertainments commence at 8, 8.30 or 9 p.m. In the north lights are extinguished early, probably on account of enemy aircraft visits.\n\nThe Italians are of quite a different type to the French. The majority of the\n\nmen one sees are in the grey-green uniform of the Italian army (private’s pay 5d. per diem). There are some very pretty women but they do not dress as well as the Parisiennes. I was surprised in Turin & Milan – we do not associate red hair & blue eyes with this country. The Romans are dark and the Napolitans darker still.\n\nFood seems fairly plentiful in hotels & restaurants although I noticed people lining up in food queues in different places (there is not too much bread & sugar available). The Italian meal consists of fewer courses than the French but each is more plentiful. Plenty of macaroni & spagetti, of course, although other dishes can be substituted if one does not fancy these more or less tasty edibles. Wine, fruit, nuts &\n\nraisins were included in practically every meal.\n\nThe towns & railway stations and trains were crowded with troops in their grey-green uniforms with silver starred collars & short cape. Rome appeared to be full of officers clad in smart “avant guerre\" uniforms & wearing many decorations. Saluting is carried out very strictly,","19":" Lieuts. saluting Lieutenants, Lieutenants Captains & so on.\n\nThe Italian language much resembles French and would, I feel sure, be very easy to pick up if one were living in the country for a short space of time. I managed to get hold of a few words and could catch fragments of conversation. French is spoken a great deal and is extremely useful in hotels, restaurants, shops & theatres as well as in social circles.\n\nI travelled a few hundred kilometres and found the Italian trains nearly as comfortable as the French but always crowded. They are fairly slowly with a long string of carriages to cope with the heavy traffic – mostly military of course. I did a lot of travelling at night to save time and found the carriages fairly stuffy. Continental people don’t like too much fresh air.\n\nThere are numerous British residents in the various towns. In Florence I met an Australian lady and her daughter. In Rome there are numerous officials connected with the Embassy, passport control and other government offices as well as priests & students in the Roman Catholic churches & schools. I ran against an Australian (civilian) in Genoa who had a brother in the A.I.F.\n\nThe Italian Boy Scouts are much in evidence and have been organised on\n\nBritish lines. There are two associations – Giovanni Esploratori and Associazone Scoutistica Catholica Italiana.\n\nThe climate of middle and southern Italy is dry and healthy and I found it quite a pleasant change from northern France & Belgium. The north is colder and the climate more changeable.\n\nI saw practically no British military activity although there were R.T.Os. and A.P.Ms. at Turin, Milan, Rome, Genoa, etc. The English Divisions are well up north with their base near Padua (Padova).\n\nItaly is busy raising a war loan (Prestito Nazionale) and attractive posters, large & small, are everywhere inviting the people to subscribe.\n\nThe towns contain numerous caffes & “bars\"; not the drink shops as we know\n\nthem in Australia but the real continental style of drinking a little and taking a long while to get through it. The Italian “bar\" is a little place with no tipping where drinks of all kinds including coffee sometimes chocolate are sold at the counter. The “caffe\" may be large or small and has the usual little tables where you sit down & order what you want, not forgetting to tip the waiter before leaving. Tipping, by the way, is a continental curse.\n\nAustralians visiting Italy are assured of a cordial reception – in fact the majority of the people did not know what nationality I was. Very likely an Americano they surmised until a glimpse of the metal shoulder badges put them on the right track or I was able to enlighten them. Australia is the same word in Italian but to say Australian one must add an –o.\n\nAs far as I know there have only been nine Australians so far on leave to Italy, four of whom were officers. Your ‘umble is probably the first","20":" Division representative to visit Italia. I brought back a great supply of guide books & post cards from the different places visited and intend to digest the former when opportunity offers.\n","21":"\n\nBack at work again with plenty to do. The Ambulance is running a Scalies and Rest Station at Dranoutre, a small village in Belgium about 4 kiloms. from the frontier. During the night and to-day the enemy, who is shelling the back areas, put over several round about our village\n\nresulting in a fair number of casualties in surrounding camps. The wounded were soon dressed and evacuated.\n","22":"\n\nMore shelling during the night and pretty close to us. Another rush of wounded was followed about 11 a.m. by a shell in our own camp which killed one of our men, wounded another and knocked a horse rotten! Another shell followed and burst about 30 yards from me, wounding 4 and shattering a hut. The next dropped short of the Ambulance & got a few Tommies who came in soon after for treatment. No more damage was done until about 10 p.m. when a shell wrecked portion of the Q.M’s. store and wounded \none\n four Corporals. Two men were evacuated with shellshock. During the night the camp\n\nwas cleared out and the majority of the patients sent to C.C.S.\n\n23rd \nApril\n","23":"\n\nWe occupied several old houses on the outskirts of the village about 3 or 4 hundred yards from the old spot.\n\nTo-day we evacuated the remainder of the patients and removed equipment from the shelled camp.\n","24":"\n\nFritz kept putting stuff over but none on us, although it meant work for all.\n\nNews has come through that the Germans have commenced a big attack on the Somme and are forcing the British back. We are getting ready for an early move.\n\n25th March 1918 (Mond.)\n\nWorking hard to get things fixed up for an early push off. The 3rd & 4th Aust. &","25":" N.Z. Divisions have already left to lend a helping hand.\n","26":"\n\nThe Ambulance moved out at 10 a.m. & marched about 5 miles to Van Sohier farm where we stayed until the evening of the following day. The weather has changed and is bitterly cold. What a difference from my Italian leave.\n","27":"\n\nWe fell in at midnight and marched out with packs up through Remy Siding (the C.C.S. had gone – shelled out) to Hopoutre Siding where we entrained at 2 a.m. in\n\ntrucks (32-40 men or 8 horses). There were several trainloads of troops on the move. One in front of us was hit by a stray shell which killed & wounded a fair number. The train passed through St. Pol & Doullens and at 2 p.m. we detrained at Mondicourt. Here rations were served out to us & a twelve kilom. march through the driving rain followed to Louvencourt via Pas-en-Artois and Authie. In the distance we could hear the boom of the guns while on various hills we passed British & Canadian troops hastily digging trenches. In and around the villages passed through were civilians either packing up or already on the move. \n\nThe Tommies we passed seemed to be muchly cheered on seeing Aust. troops arriving on the scene. The majority of the civilians did not seem to look too cheerful, most of them going the opposite way to us.\n\nOn arrival at Louvencourt we found the village full of troops belonging to our Division. The personnel of the Ambulance went into billets in the schoolroom and a few surrounding houses. Vague rumours keep reaching us; some are reassuring, others are just the opposite. We have seen no papers since Sunday when the Germans had advanced as far as Bapaume.\n","28":" (Good Friday)\n\nTo-day has cleared up although there is a cool breeze blowing – reminds me of the weather we experienced at Marseilles on arrival from Egypt exactly two years ago. We are ready to move off again at a moment’s notice but no orders have yet been received. There are still some civilians in the village; they don’t know how things\n\nare going; no newspapers have arrived since the attack commenced. We know that the enemy has now taken Albert, Dernancourt, Mericourt so that he cannot be too far away.\n","29":"\n\nDuring last night the enemy from his new advanced positions fired a number of shells into our village with not a single casualty. (Louvencourt is crowded with our chaps & the civilians are clearing out rapidly.) One shell lobbed in the roadway 50 yards to the right of our billets but fortunately did not burst. Various other whizzbangs fell near us and in various parts of the village.\n\nThe day has been wet & miserable. The battalions in the village marched out during the evening to take up forward positions. Our Division has been attached to the","30":"\n\nBritish Corps and is available for mobile work with the","31":" Army. We are dumping as much equipment as possible in order to travel light. The Germans are still attacking and have occupied Montdidier after heavy fighting with the French.\n","32":"\n","33":" was the second anniversary of my arrival in France. Two years that have passed very quickly.\n\nWe stayed 8 days at Louvencourt doing little other than clearing sick. A few stragglers from the retreat drifted in. Fritz continues to advance in parts but very slowly. Our village seemed to be on one of the routes to the line as large bodies of Troops, mostly British, passed through every day, both going in and coming out. The\n\nbattalions of our Brigade established strong posts around the village in case the enemy should break through. On the evening of the","34":" the Brigade received orders to move out early the following morning and that night we saw the","35":" Brigade go through in dozens of motor lorries & busses bound for “somewhere\". Next morning reveille was at 4 o’clock, breakfast 4.15 and move off half an hour later. The 5 or 6 thousand of us boarded motor lorries and the long string of vehicles ran through Acheux, Lealvillers, Arqueves, Puchvillers, Rubempre, Pierregot & Raineville through the barrier into the old city of Amiens. We passed through the outskirts of the town seeing practically no civilians while the many shuttered windows of the houses were an omnious sign. Soon we left Amiens behind with its great Cathedral towering above\n\nthe houses. Just outside a village the busses came to a halt and the troops formed up in nearby fields, trampling underfoot the young crops coming up in early spring. We marched along the slushy road through drizzling rain into the village (Daours – pronounced Door) where the column was halted for a “light luncheon\" of tea & bully beef. The place was full of troops; there were practically no civilians left – they had cleared out at a moment’s notice. At the next village, Aubigny, 2 kiloms. further on and 14 from Amiens, we went into billets in a big farm. I turned in in the loft of a barn, the floor of which was covered with newly threshed wheat. At 4 a.m. we were turned out and C Section went up to an Advanced Dressed Station, sending out its bearers, while the other two Sections had to stand to. It is now 4 p.m. and\n\nwe are still here awaiting orders. Battalions of our Brigade went into the line last night and relieved British troops who came out this morning covered with mud & slush.\n\nI am writing these notes in a little sitting room of the farmhouse. The photos and ornaments are still on the mantelpiece and books on the table. The people have left practically everything. In some houses in the village the crockery had been left unwashed after the meal, in another the table was set ready. Little shops and estaminets were fully stocked – until the troops found them. We have found fowls, pigs & pigeons in plenty. Some of the Units have hay carts & horses in their transport. In \nour\n farm which was the residence of the local Mayor, supplies of wood, coal, potatoes and wheat are plentiful. Everywhere we see evidence of the hurried flight of civilians – poor unfortunates,\n\nmany leaving their homes for the second time. I have spoken to several of them.\n","36":"\n\nYesterday morning we received orders to move back to \nAubigny\n Daours and went into billets at the Chateau, a fine place still occupied by the owners, with an old mill at the back. A walking sick & wounded station was immediately opened in the Mairie & School in the centre of the village. C Section, who were clearing for the British Cavalry & Artillery, rejoined us during the evening. The two buildings in use as an Evacuating Station had been left very hurriedly by the civic authorities. In one, various notices were still on the wall and supplies of official forms and bundles of documents had been left in the cupboards. In the\n\nother were blackboards, books, maps, etc. The usual paraphernalia of a schoolroom.\n\nThere are only 50 civilians (mostly old men) remaining out of a population of about 500. An old chap told me that the evacuation took place about a fortnight ago – when the Germans were making good progress. I have been in various unoccupied shops & houses and they are all in a state of wild confusion – clothes tumbled out of boxes and drawers, crockery smashed, cupboards ransacked etc.; looting by the troops for the most part I am ashamed to have to say. There are two or three estaminets – it is needless to describe their condition.\n\nWe have been busy to-day evacuating British & Australian sick & slightly wounded to the railway near Amiens – 12 kiloms. back. Amiens, a busy & prosperous city, is not\n\nnot yet entirely deserted although the boches are less than 9 miles away in one part and must bomb & shell the town heavily if they are not driven back. Numbers of people have left the town and various shops have been closed. The French people who are left in the villages we have been in the Somme district all seem glad to see the Australians.\n","37":"\n\nThe Ambulance is still running the walking sick & wounded station. Fritz has put a fair number of shells in and around the village; he is evidently searching for a big gun battery not very far away. There has been plenty of activity in the air. On Friday I saw a German ‘plane brought down by our airmen. The pilot & observer were brought in an hour later both badly damaged. One died on the stretcher. The enemy is now attacking\n\nup north and has captured Laventie and Armentieres. He was beaten back in our old sector, Messines & Wyschaete the 51st (Scottish) Division being mentioned for their splendid fighting.\n","38":"\n\nFritz put a number of high velocity shells into Daours last night with very few casualties. Several came pretty close to us but a few broken windows was all that resulted.\n\nThe enemy put over a lot of gas shells this morning and accounted for a number of Aussies. We put through plenty to-day. The boches have taken Bailleul & Neuve Eglise after hard fighting.\n","39":"\n\nThe past 8 days have been strenuous and\n\nthis is the first opportunity I have been able to get to write a few lines. On the 22nd our Walking Wounded Station was converted into the Divisional Main Dressing Station and Gas Centre and the following night the Germans attacked in great force on our front, taking the village of Villers Bretonneux from the Tommies. We were shelled & gassed heavily and early the following morning shells were rained into our village. Our billets near the Chateau were evacuated just \nto\n in time to dodge a shell that came through the roof while numerous others burst in the vicinity. One shell burst in the village square a few yards from our M.D.S. in the schoolroom with a few casualties. Two of our men were wounded during the day. At midday while the Sergeants were feeding in an evacuated civilian residence a shell burst in the street outside shattering our windows.\n\nLast night the 15 Bde. of a Division retook\n\nVillers Bretonneux from the Germans and captured a lot of prisoners. We put a number through the Dressing Station to-day. So far since the commencement of the stunt we have put through about 1200 cases.\n\nTo the 14 Aust. Art. Bde. falls the credit of bringing down Baron von Richtofen, the famous German aviator who had accounted for 80 of our machines in the air. He came down in our sector on the 22nd.\n\nDaours as yet has not suffered very heavily from the shelling although practically every civilian has gone. Numerous houses are at our disposal for billets. At present the Sergeants are occupying a furnished cottage not far from the Square; not a very healthy position when Fritz is shelling, otherwise quite O.K. Our house is in good orders but others that have been entered by\n\nlooters are in a disgraceful condition, sheer wanton distruction in many cases.\n\nMond. 29 April\n\nFritz is pushing hard up north and has taken Kemmel Hill and Dranoutre from the British & French allied forces. The French have rushed up large numbers of troops & plenty of guns to aid the British in Flanders.\n\nWe, of course, are still down on the Somme. As far as I can make out the","40":" Aust. Brigade is on the right of \nthe\n our Division and on the right of the 13th is the world famous French Foreign Legion. Australians & Foreign Legion evidently are the connecting link between British & French, a link that the enemy is trying hard to break. He has made continued attacks on Hangard on the right of Villers Bretonneux. These two villages bar the \n\nshortest routes to Amiens. The French are by no means exhausted yet and are throwing large numbers of troops into the struggle. I consider their effort splendid and in my opinion they are much better fighters than the British and on a par with Canadians, New Zealanders, Australians & South Africans.\n\nI have spoken to several tommies who were in the 5 Army retreat on the Somme at the commencement of the offensive. They had the “wind up\" before the attack, knowing that he was coming over. Everyone retreated, from headquarters down, without giving much fight to the enemy. Thousands of pounds worth of stores, large numbers of guns & 100,000 prisoners fell into fritz’s hands while a large area of country has been lost. No wonder the French are wild. British prestige has come a severe “gutser\". And yet in England the\n\npeople think everything is alright. They are completely blinded by their daily papers and by their belief that one tommy is worth 2,300 more foreigners.\n\nWe have seen a fair number of tanks lately passing & repassing through the village. The ordinary tanks are big, heavy, clumsy things. The ordinary male tank can not do more than 6 miles an hour, has a crew of 8 including an officer, carries two six pounder guns and cannot turn round corners without first stopping its engine & restarting after the turn. The tank weighs 35 tons & is heavily armour-plated, which plating however is not proof against a direct hit nor will it always keep out fragments of a bursting shell. The female tank carries 6 machine guns instead of the 2 heavier guns of the male. Yesterday\n\na string of 6 “wippets\" passed us. The wippet is a small, light tank which travels at a good speed and can turn quite easily. I have not much faith in the tanks as an effective weapon against the Germans, unless they are used in large numbers and as a surprise to the enemy.\n\nHave just witnessed a combat in the air. A fritz plane came over a few minutes ago, flying low and evidently taking photos. The air was full of the rattle of our Lewis guns and anti-aircraft shrapnel bursts when 3 of our machines came out of the clouds. The hardy taube saw them coming and turned to fly but too late. Our foremost machine was after him, firing as it came. I saw the stabs of flame spurting out from the ‘plane. The German circled and circled, coming down all the time, with our ‘planes following vengefully in his\n\nwake. And then they went out of sight behind the trees – the boche must have crashed. Three more British machines turned up at the last moment and seeing that they were not needed, flew off again.\n\nHeavy fighting is continuing up north on & over the ground where the Ambulance was a month ago. After being repulsed three times fritz succeeded in taking Locre, the village we were occupying in Dec. last, from the French. Our allies, however, counterattacked later in the day and re-took the place, the fighting being very heavy in and around the hospice & out-buildings where our Rest Station was.\n\nWed. 1st ","41":"\n May\n\nThis afternoon I had to visit the","42":" Field Ambulance which has a station in a\n\nfine chateau at Les Alencons. Incidentally we went through Amiens. And what a change! No longer is it the busy, prosperous town of yore – a city of the dead. We traversed street after street entirely deserted save for a few odd British & French military policemen and 2 or 3 old civilians. The place has been heavily shelled & bombed and numerous houses are in ruins or have been damaged by shellfire. The Cathedral has not escaped; a shell having gone through the roof. The place has quite a depressing effect on one – a great city deserted by its population of many thousands. Will it follow the fate of Rheims? I hope not. About a dozen shells fell in the town this morning, killing a couple of tommies.\n","43":"\n\nOn Friday the weather suddenly changed and we had a hot sunny day. Yesterday and to-day have both been mild with a few showers of rain. The trees and shrubs are rapidly bursting forth into leaf and I think summer has come to stay. The change in the countryside is remarkable – everything is beginning to look so pretty & green. Fritz hasn’t done much damage about here yet. He put a few shells into Daours last night. Sooner or later I think he will shell us out of the place.\n\nWe have put through a lot of cases lately – from noon","44":" to noon","45":" (5 days) no less than 1629 sick, gassed & wounded.\n","46":"\n\nWeather good, plenty of work, plenty of artillery activity but no big “hop over\" from fritz. The \nlatter\n last mentioned is expected at any time.\n\nThe “tommy\" in a Labour Company of the B.E.F. gets a rough spin. Every man to qualify for this Corps must have some disability, flat feet, defective vision, hernia, bad teeth, etc. The result is that they are always ailing and large daily sick parades result. He is a despised man, rarely receives decent medical attention & is usually a down-at-heel looking individual as no-one worries about keeping up his equipment. We feel sorry for these poor beggars straggling along the roads in bunches of 30 to 60 with pick or shovel on shoulder. And yet they do good work. Some-one must make & repair roads & bridges, and dig trenches\n\nin the mud & rain when fritz masses his countless hords against us. Often they come under heavy shellfire and when the Company straggles home to its billets after a day’s work there are some who never come back.\n","47":"\n\nThis evening after tea I wandered along by the river for a few minutes – the little river that winds through the village. It was beautifully quiet & peaceful strolling along the narrow path by the river spanned by a couple of stone, ivy-covered old bridges. The tall trees & thick masses of undergrowth are now bright green – and such shades of green! On my right were two pretty little meadows. The first looked ideal for a game of cricket or something but the second was rendered hideous by a\n\ngaping hole in the centre of this expanse of turf with still another by the pathway. This suddenly brought back to me the fact that we were at war and that an enemy plane had dropped these two bombs a few days ago. Better that he should drop them here in this little nature’s paradise than in a camp full of men in the prime of life. Providence!\n\nThe Australians are barring the Germans’ way to Amiens. We are the connecting \nlike\n link between the British & French forces and on our right is the Foreign Legion. The papers, both French & English, have been dealing out plenty of praise to the Australians during the past few days. The Americans are beginning to arrive slowly but surely. There is a company of their Engineers\n\nworking close to us. We have French troops also with us for the first time – artillery.\n","48":"\n\nEvery precaution is being taken against shell gas attacks by the enemy. After a busy day’s work we have to go through drill with gas masks on for at least half an hour in the dark (commencing 9.30 or 10 p.m.). The British respirator is a very uncomfortable thing to wear. The French have recently adopted the type of mask worn by the Germans. It is much lighter than ours & the eye pieces do not dim.\n\nYesterday & last night we admitted \nquite\n 118 gassed, wounded & sick patients in 24 hours. These were made up of Australians (practically all), British, French, Americans & German prisoners.\n","49":"\n\nTo-day has been the hottest we have yet had this spring. Everyone is shedding as many clothes as possible. We evacuate a number of Trench fever, P.U.O. & influenza cases daily – these sicknesses are probably caused by the change in the weather.\n\nWe have seen a large amount of aerial activity the last few days with several “scraps\" in the air. Fritz did a lot of shelling close to the village this morning, evidently searching for the big gun batteries, both French & English, which are in the near vicinity.\n","50":"\n\nOur village was bombarded last night and early this morning. A big shell burst not far from the\n\nDressing Station & blew a “tommy\" about 30 yards. One of our men was wounded. No change in the weather.\n","51":"\n\nFurther bombardment of Daours this morning with two direct hits on our Dressing Station which had to be evacuated at 9 a.m. Two officers & 2 men, 14 Field Amb. wounded but all slightly. We moved to our post in the village of Bussy-les-Daours, a kilometre away and opened here. In the afternoon the Dressing Station & Gas Centre were moved another kilometre; this time into tents on an open field, most of the personnel remaining in Bussy. After tea a hostile bombing plane came over Bussy & dropped 4 bombs. One burst next\n\nto the building occupied by us & killed one of our men & wounded 2 others – two bombs completely demolished the adjoining house & the fourth burst further away. We evacuated this village next day.\n","52":"\n\nThe weather is keeping extremely hot & I am getting about in an old pair of khaki shorts and thin shirt.\n\nOur dressing station and gas centre are in an open field by the side of the road running from Daours to Amiens. The tents are banked up with earth outside and hollowed out inside. There are no tents available for the personnel – everyone is living in dugouts. Two of us dug hard last night and the previous evening and have succeeded in making a good little shelter in the side of a bank not far away. Water is scarce and only obtainable from our three water carts.\n","53":"\n\nGreat activity on our right last night. The French seventy-fives were flashing briskly along the line. Our position here is fairly elevated. Behind us is the Cathedral of Amiens, in front Villers Bretonneux village and Hangard on the right. Things are very quiet in our sector.\n\nI see from the French papers that Paris is now having three meatless days in the week. No long range guns have fired on Paris since","54":" May; the French counter-battery work has evidently been effective.\n","55":"\n\nLast night an enemy plane came over our camp & dropped six bombs, luckily only one of our men was wounded. I was in my dugout at the time (4 p.m.)\n\nCont. from previous page.\n\nand the nearest bomb dropped 20 or 30 yards away.\n","56":"\n\nYesterday two of us went over to visit","57":" Field Ambulance (3rd Div.). We found them running a walking wounded\n\nstation outside the village of Lamotte. This afternoon Fritz is putting over a lot of shrapnel near us. He is evidently searching for some big guns in a small wood on our right.\n\nThe Somme is looking very pretty round Lamotte, the surrounding meadows being green & fertile. Lamotte is further back down the Somme than Daours where the Halluc branches off. The Somme & Ancre divide further up at Corbie.\n","58":"\n\nYesterday we handed over the Main Dressing Station to","59":" Field Ambulance on the 4th Division relieving ours in the line. We marched out at 1.30 p.m. through Allonville to the Bois de Mai (10 kilometres) where we have taken up our quarters. The bois\n\nde Mai is a large wood between the villages of Cardonnette & Querrieu. We are living a really open air life. There are no tents or huts and we have constructed little bivouac shelters under the trees with our groundsheets. Fortunately the weather is fine and sunny although the nights are sharp.\n","60":"\n\nCanteens are few & far between and it is very difficult to get writing paper, envelopes, biscuits, chocolate, cigarettes, etc. which are now only coming forward in small quantities through the Exped. Force Canteens in the base towns. Sometimes we run a small canteen ourselves in the Ambulance.\n\nThe Bois de Mai is surrounded by 4 villages – Allonville, Cardonnette,\n\nSt. Gratien & Querrieu. Practically all the civilians have left these villages which are too small to have shops in them. On Monday evening two of us went over to St. Gratien & last night we walked right through the wood to Allonville.\n\nThurs. 6th June\n\nI see from the “Matin\" some marvellous increases in the populations of large French towns since the war. I notice that none of the northern towns nor Paris are mentioned. At the outbreak of hostilities Marseille had a population of 600,000. Now it is approximately 1,000,000.\n\nLyon (France’s 3rd largest town) has gone from 530,000 to 740,000 not including the suburbs and surrounding villages which had 65,000 inhabitants at the time of the mobilization and now have 100,000.\n\nBordeaux has gone from 262,000 to 325,000 & neighbouring districts from 89,000 to 121,000.\n\nThe pop. of Nantes was 171,000 and now it is 20,000 more not including troops in the town. Included in the 20,000 are 10,000 refugees from invaded districts & munition workers.\n\nToulouse had 150,000 in 1914. Now there are 210,000 as well as 10,000 refugees & foreign workmen.\n\nNice has now 180,000 (not including numerous foreigners). Commencement of the war the total was 168,000.\n\nLe Havre has a pop. of 160,000 not including the garrison, and 30,000 foreigners (mostly British). There are 80,000 refugees in this town which by the way is the Australian Base Depot in France.\n\nToulon has 120,000, Bourges 110,000, Poitiers 51,000, Brest 100,000, Dijon 90,000,\n\nOrleans 110,000, Tours 100,000, Cherbourg 41,000. The pop. of St. Etienne is 212,000. Refugees, French colonial munition workers and Allied troops & war workers have caused the increase in pop. of these towns.\n\nThe Germans are still pushing in their third big attack this spring from Rheims to Noyon. They are now only 43 miles from Paris but are meeting with stubborn resistance from French & British Troops.\n\nThings are quiet in our sector. General Foch guaranteed the safety of Amiens and put 4 divisions of Australians in front of it. The enemy has not advanced a yard. Our 1st Division is up north with a British Corps; it was sent up at all speed when the Germans commenced their second attack, and has not yet rejoined our Corps.\n\nThere is plenty of aerial activity. Planes\n\nboth enemy & our own seem to be passing over the wood the best part of the night.\n","61":"\n\nI have just read a 400 page history of France that I found in the school we took over for an A.D.S. at Daours. The following interesting extracts are taken from it:-\n\nThe Gauls, the first inhabitants of France, came from the east in 700 B.C. They were in two families, Celts & Belgians and were tall fair men, barbarians practising druidism.\n\nThe Greeks established themselves along the southern coast of France in 600 B.C. The Romans conquered “la Provence\" between 124-118 B.C.\n\nThe Germans (then barbarians) crossed the Rhine and established themselves for the first time in France during 1st century B.C.\n\nGaul was occupied by the Romans in \n\nA.D. 58 & invading Germans & Swiss driven out. The Gauls quickly adopted the language, customs & ideas of their conquerors. Christianity made its first appearance at the end of the","62":" century.\n\nIn 375 A.D. the Romans were attacked & finally driven out in the following century by barbarians who occupied various portions of the country, Visigoths, Alamans (Germains), Burgondes & \nFrancs\n.\n\nIn 732 the Arabs who had come from Africa and advanced through Spain over the Pyrenees were driven back out of France.\n\nAfter numerous wars with the Germans they were finally subdued in 804. Charles the Great was king at this time & he had a very extensive empire including France, north of Spain, large portion of Germany & of Italy.\n\nThe feudal system came in about the end of the","63":" century and was abolished 5 centuries later when a period of absolute monarchy followed.\n\nThe Renaissance took place in","64":" cent. with a massacre of Protestants on St. Bartholomew’s Day, 24th Aug. 1572.\n\nFrancis I gave Henry VIII a magnificent display at the Camp of the Cloth of Gold in the north. (I visited this field some months ago.)\n\nThe town of Corbie on the Somme was besieged by the Spaniards in 1636 in the 30 years war against Spain & Austria.\n\nBy the treaty of Utrecht in 1713 France had to give to England Newfoundland & her Hudson Bay Territory. By the same treaty England became the greatest naval power of Europe. In 1761 Britain captured France’s colonies in India (except 5 towns). In 1761 France lost her last Canadian colonies, Cape Breton Island & left bank of the Missisippi .\n\nIn 1777 France assisted the Americans in their war of Independence and on\n\ndeclaration of peace obtained several small English colonies.\n\nThe great French revolution commenced in 1789. The taking of the Bastille took place on 14th July of same year.\n\nPrussia, Austria, Spain & Piedmont declared war on France in 1791 to upset the Revolution & uphold King Louis XVI. All were defeated.\n\nLouis XVI was executed on 21.1.93 and another coalition against France was formed – Prussia, Austria, Piedmont, England, Holland & Spain. To meet these enemies France raised a conscript army of 300,000 and 6 months later called up everyone between 18 & 25. At the end of 93 there were 600,000 men in the field and this number was doubled early the following year. \nThough\n France fought vigourously against all Europe and the coalition (except Austria & Piedmont) asked\n\nfor peace in 1795; \nand\n concessions were obtained from Holland, Prussia & Spain. Napoleon Bonaparte captured Piedmont, entered Milan & afterwards Venice. He marched on Vienna and the Austrians capitulated. Napoleon took an army to Egypt and marched to Cairo. He then made an expedition into Syria but had to evacuate both countries.\n\nIn 1799 Austria, England, Russia & the Bourbons of Naples declared war against France. Austria was subdued and asked for peace in 1801. The King of Naples had to hand over the Island of Elba. England made peace soon after. Bonaparte was made life Consul of France in 1802. The same year he was elected President of the Italian Republic & the following year Protector of the Swiss Republic. \nHis expedition against\n In 1804 Napoleon was made\n\nEmperor of the French – a hereditary title.\n\nHis expedition against England in ’03 did not realise. In 1805 Austria, England, Russia & Sweden united against France and were badly beaten (except on the sea – Trafalgar). Napoleon gave Holland to one of his brothers & the King of Naples to another. He formed a new Rhine Confederation with himself as Protector.\n\nIn 1806 Prussia, England, Sweden & Russia attacked France and were so roughly handled by Napoleon that they had to ask for peace when he entered Berlin in ’07 & followed up with a crushing defeat of the Russians at Friedland. Prussia had to pay all costs of the war, an indemnity of 100,000,000 francs and was reduced to 4 provinces. Nap. established the kingdom of Westphalia & gave it to his brother Jerome. He added Varsovia to the Rhine Confederation.\n\nIn Portugal & Spain Napoleon was un-successful and had to give up the crown of the latter country.\n\nThe Austrians attacked in force in 1809 but Nap. gave them a good hiding and took some territory and an indemnity of 85 million francs. He then deposed the Pope, who had helped Austria, and added the States of the Church to France.\n\nIn 1812 the great leader made his ill-fated expedition into Russia followed by a disastrous retreat & the loss of 250,000 men.\n\nThe following year Russia, Prussia, Sweden, England & Austria united against France & succeeded in entering Paris early in 1814, forcing Napoleon to abdicate.\n\nLouis XVIII then became king of France but was deposed by Bonaparte on","65":" The kings of England, Holland, Prussia, Austria & Russia sent armies against Napoleon\n\n& he was decisively beaten at Waterloo by the English & Prussians. The famous Emperor was sent to St. Helena where he died 5.5.1821.\n\nFrance had to pay an indemnity of 700 million francs & lost a lot of territory. Louis XVIII re-entered France in 1815.\n\nThe second Republic was declared in 1848 and the second Empire in 1852 with Louis-Napoleon as Napoleon III.\n\nIn the Franco-Prussian War Napoleon capitulated to the Prussians on 2nd Sept. 1870 and two days later the 3rd Republic was proclaimed. After the fall of Paris the treaty of Frankfurt took place \nin\n (10.5.71) in which France ceded Alsace (except Belfort) & a part of Lorraine to Prussia and paid an indemnity of 5 \nmilliard\n francs. The amount of territory taken was 14,500 sq. kilometres & 1,600,000 inhabitants. The indemnity was paid in full 14 months after the declaration of peace showing the splendid patriotism of the people…….\n","66":"\n\nI have just been reading the “Gazette des Ardennes\" of","67":" which was dropped over our lines by an enemy ‘plane. The paper is printed in French & illustrated and contains discouraging news & articles written up by Germans for the French people who are still living in the invaded department of the Ardennes. It is rather interesting to read news from the other side as well as your own. Captured German newspapers & documents sometimes fall into our hands but I don’t enough about the language of the “boches\" to be able to read them.\n","68":"\n\nOn Tuesday evening went for a walk to the village of Raineville, 5½ kiloms. away. Quite a decent little place.\n\nYesterday evening we took\n\nFrench system of evacuations from front line to the interior.\n\na stroll over to the next village St. Gratien. It is very nice in the evenings now. Good weather and dark about 9.45 p.m. Milk fresh 50 cents per litre.\n","69":"\n\nAfter a fortnight’s stay in the pleasant Bois de Mai we moved up yesterday when our div.\n\ntook over from","70":" Div. We had reveille at 4.30 a.m. and moved out at 6 o’clock taking the St. Gratien road. Turning to the right before reaching the village the Ambulance went through Querrieu across the river to Pont Noyelles and along the splendid Amiens-Albert-Bapaume Road bordered with tall trees which are now covering ammunition dumps, guns & lorry parks as well as small signboards indicating numerous zigzag reserve trenches. We kept on through Lahoussoye as far as Franvillers and then turned off to the right down the Bonnay-Corbie Road where the Advanced Dressing Station we were to take over, was situated – only a couple of hundred yards from the Amiens Rd. The sector is very quite and the taking over from the","71":" F. Amb. went off smoothly. The A.D.S. consists of a large underground dressing station, dugouts\n\nfor the personnel and several stained tents. In the afternoon C. Sect. went a kilom. further up the Amiens Rd. and took over an Advanced A.D.S. The villages passed through on the way up had all been shelled more or less heavily.\n","72":"\n\nOur sector is very quiet except for occasional outbursts of shelling. So far he has left us alone probably because there are no big guns close to the dressing station which is on the right side of the road running to the village of Bonnay and consists of dugouts & tents sunk into the ground. We are at the head of a long valley which winds forward in the direction of fritz’s line and we stand and watch the shells bursting further up this valley round our Advanced A.D.S., along the ridge in front as well as in & near the villages on our left & right. The soft “plop\" made by some show them to be gas shells.\n\nAbout a kilom. from our A.D.S. is a great bomb or aerial torpedo hole, the biggest I have yet seen. It is 16 feet deep and 40 feet across and close to a reserve trench into which\n\na bomb has been dropped.\n\nA little further along, the road winds down the hill to Bonnay in the hollow with Corbie shelled & gassed standing out clearly \non both\n beyond. Along the ridge on the right is Villers Bretonneux. To think that in July of last year we came over the Bonnay road to Corbie from Warloy-Baillon on a practice stunt in which was then the quietest of back rest areas.\n","73":"\n\nYesterday leave in the French Army, which was suppressed during the recent offensives, was re-established, the number absent from their Corps at any time being limited to 8%. Foreign leave is restricted to England & Italy. English leave has been off for Australians since the commencement of the offensives – end of March, but extremely limited leave in France is about to commence & only those who have been back 6 months from previous leave will be eligible.\n\nThe life of Paris is proceeding with normal calm, undisturbed so far as regards the bulk of the population. The pop. of the capital incl. outlying suburbs is now about five million. In view of the proximity of the enemy (39 miles) large numbers of the inhabitants are being sent into the interior and quantities of art treasures removed. Everything, as regards theatres, restaurants, cafes, shops, etc. is still going strong.\n\nAmiens which is distant now from the enemy lines about 9 miles, is suffering a grievous martyrdom. It is estimated that about 10,000 shells have been thrown into the town since the shelling began. The damage is incalculable. One house in every 27 has been hit and one in every 7 demolished. The Cathedral has been struck for the seventh time. St. Omer, Boulogne & Abbeville are being heavily bombed.\n","74":"\n\nThe sun went down on","75":" officially the longest day of the year, although it will be a week before the time of sunset is shortened by a full minute – in a wild sky flecked from horizon to horizon by filmy clouds.\n\nIn accordance with the new system in Paris the Prefect of Police has again fixed meat prices for the current week. Last week there was a reduction only of the price of beef, but it has now been extended to veal, mutton & pork, following the fluctuations which have taken place in the wholesale quotations at the cattle market. The prices are fixed for first, second and third qualities of every known cut. The choicest steak from the middle of the fillet, stands at 5 fr. a pound. “Rumsteck\" ranges from 4 fr. 40 c. to 4 fr. 10 c. and “tender rosbeef\" from 4 fr. to 3 fr. 60 c. The best cuts of veal run to 4 fr. 50 c. & 4 fr. a pound.\n\nThere is an epidemic of mild influenza throughout the continent. Spain was the first to experience it but now the sickness has spread through England, France & Germany. The quietness on the enemy front is attributed to this influenza. We are evacuating large numbers of our own men daily who are down with it. I have so far escaped an attack, although am only just getting rid of several weeks of hay fever followed by a touch of asthma.\n","76":"\n\nThe front still continues very quiet with occasional short bursts of shelling and raids by our Infantry. Three days ago a daring “fritzer\" plane brought down one of our observation balloons in flames in full view and then flew low over the A.D.S., firing his machine gun as he came. We all ducked. Rumour hath it\n\nthat the “antis\" brought him down near Bussy. We saw one of our balloons burst into flames and come down about a week ago. In each case the observers hopped out and came down in their parachutes.\n\nWeather is keeping fine although not too warm. Everyone is feeling fed up with the war although the good defence put up by the Italians against the recent Austrian offensive and the news that large numbers of Americans are arriving daily in France are good to know.\n\nMaterially strengthened our dugout this afternoon. We are now having moonlight nights and enemy planes are over every night dropping bombs round about.\n\nThe number of patients put through the Ambulance during the month of June has been 1050.\n","77":"\n\nTo-day is American Independence Day and is being feted as such throughout both France and England. The Americans are very much in the public eye now and probably will continue to be for more weary months yet. As I am writing now there are several “Yanks\" talking to some of our chaps close by. We get on very well with the Americans. They seem to be a mixture of nationalities. A fritz prisoner was brought in a few minutes ago and turned out to be a Pole. One of the Yanks was talking to him in German and another in Polish. Two Poles – one on one side and one on the other.\n\nOur Division attacked this morning & we advanced 500 yards on a front of 1200 yards. Our casualties were fairly light – less than 200 wounded going through our Dressing Station\n\nincluding about 15 Germans most of whom came from 52nd Res. Infantry Regiment. The prisoners were well equipped, in good condition and of a very good type.\n\nThe","78":" &","79":" Aust. Divisions together with a bunch of Yanks hopped over at the same time between Villers-Bretonneux and the Somme (on our right) and advanced about 2000 yards capturing Hammel village & Hammel and Vaire Woods. In both operations 1500 prisoners & numerous machine guns were captured.\n","80":"\n\nFritz counterattacked last night in a vain endeavour to re-capture the ground we took from him during the early morning. He came a complete “gutser\" and was beaten back leaving a few prisoners in our hands. The artillery bombardment was fairly heavy\n\nand the flashes from the guns together with the coloured flare and rocket signals gave quite a “4th July\" effect to the grim scene.\n","81":"\n\nYesterday I managed to get away from the A.D.S. for a day collecting drugs & medical stores from the Base Depot. It was a pretty warm day although we did not notice it so much on the Ambulance, on which we ran through village after village, getting further & further away from the line. The country looked very fine – numerous fields covered with ripe wheat and others one mass of flowers of different colours blue, red, white, pink & yellow - the pretty wild poppy being much in evidence. The villages further back were full of civilians, many of them refugees from evacuated\n\nvillages. It was quite a treat to be \nabout\n among civilians again and have a chat with some of them. The Australians are extremely popular with the French and many of us have made friends in more than one little village. The Americans are gradually coming to light and we saw a fair number of them during the day. They are rather interesting (& amusing) to yarn to and are extremely confident of winning the war.\n","82":"\n\nMeat is not too plentiful now in Paris and horseflesh is being sold in butchers’ shops at 2 francs 20 a kilo. Three days of the week are meatless ones.\n\nIn the past three months the Australians have taken prisoner 85 officers & 3,700 men\n\nand captured 38 trench mortars and over 400 machine guns. Some of the Americans who fought with us on","83":" got into the fight by exchanging tunics with Australians or taking colour patches of Australian units or taking sergeants’ stripes off their arms. The troops that have been doing all the fighting lately \nare\n on this front are the French, Australians & Americans.\n","84":"\n\nYesterday evening we saw a good (or rather bad) sight. Two daring fritz planes came through the clouds bent on bringing down some of our observation balloons. Notwithstanding the perfect rain of anti-aircraft shrapnel and lewis gun bullets we sent up, one plane soon had a balloon in flames – the two men in it\n\njumping out in their parachutes. The plane then flew straight at another balloon firing as he came. The observers in this balloon also jumped out in their parachutes. The second plane followed in the wake of the first and gradually the big bag of silk became envelloped in flames. The men in a third balloon also hopped out but theirs was safely pulled down to earth. The two daring raiders made off in different directions for their lives, flying very low and absolutely untouched by our fire. A few days ago we saw one of fritz’s balloons brought down in a cloud of smoke.\n","85":"\n\nYesterday after a german plane came over our secteur flying very low and amid a terrific hail of lead brought down a\n\nballoon near the A.D.S. The observers came down to earth successfully in their parachutes. This is the fifth balloon we have seen fritz bring down since our arrival,","86":" To-day we saw one of our planes bring down a fritzer balloon in flames (the second since we arrived). The day is clear and sunny and there is tremendous aerial activity. 36 of our planes in one bunch passed overhead a few minutes ago.\n","87":"\n\nFritz brought down another of our balloons yesterday & we saw one of his own come down. The French have done wonderfully well in their brilliant counter-attack against the Germans who were making their fifth great onslaught of this year. So far 20,000 prisoners & 400 guns have been\n\ntaken by our allies. Our chaps have a very good opinion of the French as fighting troops and we are glad to have Foch as “boss-in-chief\". We are all feeling confident and expect to see the war over sometime next year.\n\nI have come into possession of two very ancient French books. The first was published in 1630 – nearly 300 years ago. The following is the inscription on the title page:-\n\nDiscours des Miseres de ce Temps\n\nPar P. de Ronsard\n\nGentil-homme\n\nVandamois\n\na Catherine de Medicis\n\nReyne mere des Roys Francois II, Charles IX & Henry III\n\nTome IX\n\nA Paris\n\nChez Samuel Tibout & Rolin Baraigne\n\nau Palais\n\nMDCXXX\n\nThe second book appears to date back\n\nto 1560 and this is on the title page:-\n\nPropheties\n\nPerpetuelles\n\nTres anciennes & Tres certaines\n\nDe Thomas-Joseph Moult\n\nNatif de Naples\n\nGrand Astronome & Philosophe\n\nCes propheties si curieuses, si rares, si recherchees & si utiles au Public principalement aux Laboureurs, Vignerons, Jardiniers & a ceux qui commencent en Grains & Vins, ont commence en 1560 & dureront a jamais.\n\nElles furent traduites de L’Italies en Français avec grande exactitude environ 300 ans apres & verifiees par le fameux Nostradamus, Prophete Philosophe.\n\nBoth books are in good condition. The prophecies in the second book re the war are very interesting.\n","88":"\n\nLarge numbers of Americain Troops are being brigaded with the French & British – partly to strengthen the Allies and also to let the new men get some experience. Last night an officer, 2 sergeants & 30 men (stretcher bearers) arrived and were attached to our Ambulance. They belong to 33rd Americain Division (National Guard) and are from Chicago. They seem a very decent lot of chaps and are getting on well with our “guys\".\n\nWe saw a big barrage with smoke screen put up on our left front this morning. Understand the “tommies\" on our left went over the bags.\n","89":"\n\nOn the afternoon of 28th July we heard that our Division was to attack early the following\n\nmorning and extra bearers were sent forward & preparations made for the reception of plenty of casualties. Did not get much sleep and was up at 1 a.m. when our bombardment commenced. Three Bns. carried out the attack, \nand\n took all objectives and advanced our line 500 yards on a 4000 yard front! Our casualties were not heavy – we put through about 170 wounded as well as 31 Germans. Prisoners taken amounted to 400, I believe. Our","90":" Division is active too. I have just seen in the French paper that they have taken Merris (near Bailleul) up north & a couple of hundred prisoners.\n\nAfter 46 days at the Adv. Dress. Station the Division came out of the line yesterday. A tent sub-division of our Amb. has opened up in a Boys’ Primary School on the outskirts of Amiens. The remainder of the Amb. has gone into a copse near Poulaineville,\n","91":"\n\nThe tent sub-division is still at the Ecole Primaire des Garcons. There are only about a dozen of us here including one officer, a very decent chap. The work is very light and consists of doing sick parades, clearing local & Brigade sick & supplying drugs. While up at the A.D.S. I succeeded in salvaging a nice light French bike and am finding it very useful. Every evening two of us bike down for a swim to the fine Amiens muncipal baths on the Somme where there is always a goodly collection of Australians.\n\nWe are in the town of Amiens (St. Pierre Quarter) on the Route d’Albert. The streets are practically deserted save for the heavy military traffic running to & from the line. There are numerous evidences of the boche’s activity with his long range guns – whole houses having been demolished by shellfire and others flattened out with bombs.\n\nOn Thursday night & the following morning a lot of big stuff came into the town & the noise of the bursting shells made quite a roar through the deserted streets. We are on the side of the town nearest the line and the shells all passed overhead. There are still civilians living round about notwithstanding the fact that Amiens has been declared evacuated. These people are very plucky to stay on in the shelled town – they all seem to have agricultural permits but a number find it much more profitable to sell wine & champagne to the troops at pretty high prices, 5 & 15 francs per bottle respectively. The city is full of French & British Military police mainly to prevent looting by our troops.\n\nThe French with American & British Troops & N.Z. Division are steadily driving the Germans back between Soissons & Rheims. We expect a big stunt on our front very shortly. Yesterday was the 4th anniversary of the war and the tide has turned at last in our favour.\n\nThe upper & lower houses of the French parliament have unanimously passed a bill calling up their 1920 class, i.e., boys who become 18 this year. They will not be sent into the line until the spring of next year unless urgently required. Wonderful speeches were made in the house during the passing of the Bill showing the splendid solidity & patriotism of the French nation.\n\nFrom 1st Aug. it is proposed to increase French rates of pay as follows:- Privates from 25 cent. to 50 cent. per day, Corporals from 42 cent. to 75 cent. per day. Sergeants’ rates are also being raised.\n\nThe number of sick, wounded & gassed cases evacuated by the Ambulance during the month of July was 2376. While running the A.D.S. we had of our own personnel 1 killed & 3 wounded (all forward). The Lance Corporal killed was an old","92":" A.G.H. man & very popular. He was awarded the D.C.M. during Paschendale last year when he was wounded.\n","93":"\n\nGuns & stores are being continuously sent forward and our Division, only out of the lines on 31st ult. is moving up again. Sudden moving orders came for the Ambulance yesterday afternoon. 27 squads of bearers were sent forward from the main camp (108 men) and the tent sub-division at the School loaded equipment & joined the Ambulance at the Amiens-Paschendale Road. At 7 p.m. the three tent divisions – 3 officers & 50 other ranks marched out to join","94":" Field Ambulance at St. Acheul on the outskirts of the other side of the city. We kept along the Boulevard Alsace Lorraine into the battered and silent town until the railway station was reached where we swung off to the left. What a fine place Amiens was 12 months ago. I pointed out to the chap next to me the corner opposite the station entrance where I bought icecreams exactly one year ago when\n\nenjoying a day’s leave in this gay “petit Paris\". About 8 o’clock we arrived at our destination to be the Main Dressing Station in the big stunt coming off in a few days. The place has been already occupied by 6th Field for several weeks and is a fine big pile of buildings. Originally the St. Acheul Civil Hospital it became Temporary Red Cross Hosp. No. 10 (French) during the war and was of course evacuated entirely during the bombardment of Amiens.\n\nTwo new Arty. Corps have just arrived in the 4th Brit. Army which now contains the following – Australian Corps, Canadian Corps, 3rd &","95":" British Corps.\n","96":"\n","97":"\n\nThe offensive commenced yesterday morning and we were hard at it all day. Our station was for stretcher cases only although a few walkers struggled in including two riflemen from a French colonial regiment that hopped over on our right. Things\n\nare very quiet to-day as a new M.D.S. has been established further forward leaving us clear. We have put through 275 Australians, 120 Canadians, 80 British & 120 German Prisoners making a total of 600.\n\nSat. 10th Aug.\n\nThe attack was on a 20 kilom. front from Albert to Montdidier & was carried out by 4th British & 1st French Armies under Gen. Sir Doug Haig. The former Army includes the Australian & Canadian Corps as well as Scottish & English Troops. Up to 3 p.m. on Thursday 7000 prisoners had been taken and a general advance made varying from 3 to 5 miles & in some places to a depth of 7 miles. In our sector lines of communications are being hurried forward & the road we are on (Amiens-Villers Bretonneux) is alive with traffic. We are no longer the M.D.S. which is now further forward & \nfew\n very few casualties\n\nare coming through us – 100 during past 24 hours. We are expecting to be sent forward any time. A bunch of French wounded came through yesterday – 2 officers & 23 other ranks from 55 & 112th Inf. Regts. & 1 Moroccan Tirailleur. The Canadians are on our right & the French on the side of them.\n","98":"\n\nSudden orders received to move off at noon. 6th Field packed their waggons & moved up to M.D.S. We marched off ½ an hour later out of St. Acheul, on through battered Longerau where we turned off the Roye Road on the fine route leading to Villers-Bretonneux. Near Blangy Tronville we reached the camp occupied by our C Section where we had tea and then continued our journey to Villers-Bretonneux 6½ kilometres further on. The road was alive with traffic &\n\nwe passed numerous Australian lorries taking back numbers of captured field guns & quantities of material that has fallen into our hands. New railways are being built, signal wires put up & roads mended. We marched into Villers Bretonneux which has of course suffered pretty badly and turned off to our camp site in an old shell-hole besprinkled apple orchard on the road to Corbie. Here we ran up several tents and dug out some shelters to sleep in. About 9 p.m. some taubes came over dropping bombs round about but none close to us.\n\nWe are continuing our push along the line. The prisoners taken now number 24000 & the French have taken Montdidier.\n\nWed. 14th Aug.\n\nWe stayed two days in the old apple orchard at Villers-Bretonneux awaiting orders. Except for\n\nvisits in the neighbourhood of bomb-dropping taubes both nights, we had a quiet time, the weather being splendid. On the evening following our arrival several of us went for a tour of inspection over our own & Fritz’s old front & support lines from where our chaps hopped off on the 8th. We saw very few unburned dead and all captured guns had been transported further back. There was plenty of German equipment, ammunition, trench stores etc. etc. lying about. Dead horses were very much in evidence & several winged planes. Our old front line is about two miles the other side of the village. Near Villers-Bretonneux we saw twelve of our big supply Tanks in a burnt & useless bunch with bombs, cartridges, wire, petrol tins etc. lying everywhere. One shell from Fritz did all this damage on the eve of the offensive.\n\nWe moved off at 5 o’clock yesterday evening through the villages of Marcelcave, Ignacourt, Cayeux\n\n& Caix to a place just outside the last named village. We arrived after dark and occupied an old German trench for the night. Notwithstanding shelling & bombing & a pretty cold night I slept fairly well after the march of about 16 kilometres. On the way up we passed through numerous old enemy positions, past old trenches, dumps of ammunition, & material, railways, notice boards in German etc.\n\nWe stayed about all day with one of the battalions of our Brigade going into the line and at 5 p.m. went 4 kiloms. further forward to Pozieres where our Ambulance is establishing an A.D.S. in a brick factory still in fairly good condition. We are fairly close to the line & Fritz is occupying the next village, Chaubrers, an important railway centre. The place is under shellfire and some very heavy stuff has been coming over during the evening. Prisoners taken during the advance now total 28000 & guns 500.\n","99":"\n\nThe day after arriving at Pozieres orders were suddenly changed and we came back during the afternoon to the fritz trenches outside Caix. Instead of marching out at 10 p.m. we were instructed ½ hr later to make ourselves comfortable (?) for the night. Back three of us went to the trench we had occupied two nights previously with a pile of refuse at one end and a dead fritz covered over with loose earth at the other. The night was pretty cool & to add to the discomfort a lot of shrapnel came over, followed by the drone of the taubes and the accompanying search lights and anti-aircraft fire. We are on the edge of a valley full of artillery, cavalry & infantry and fritz knows it too. The Amb. moved out at 8 next morning back through Caix, Cayeux & Ignacourt, skirting Marcelcave, crossing the Vil. Bret. Rd. in front of Warfusee, through a mass of bricks & debris (Hamel village) to\n\nan open field where a Main Dressing Station was taken over from 51st Brit. Field Ambulance. The march was fully 18 kilometres & the day one of the hottest this summer. Owing to the absence of rain the roads & dry weather tracks are thick with dust. At 2 p.m. we took over from the tommies & commenced to receive & evacuate straight away. I slept like a log \nlike\n last night and am feeling alright to-day. The Dressing Station consists of tents & dugouts in the fields just outside Hamel the village taken on 4th July by our","100":" Div.\n","101":"\n\nWe handed over M.D.S. to 3rd Field Amb. last night on","102":" Division relieving ours in the line. At 2 p.m. to-day we moved across into the river flats by the Somme outside the village of Vaire-sous-Corbie. To-night I am\n\nwriting up my diary in a well sandbagged, camouflaged dugout which three of us constructed this evening. Our chaps hopped over this morning & stiff fighting is still going on judging from the rumble of the guns. The weather is beautifully mild to-night. It has been hot & dry for some time past – quite a record for this part of France & a great help to Foch & the numerous attacks he is making.\n\nFor the last three days I have made periodical trips down to the river (twice to-day). It is great in the water and the majority of the chaps are taking advantage of the proximity of the Somme. We are all getting round in thin shirts & shorts and are as brown as berries.\n\nHad a visit from a taube last night & he dropped a couple of bombs pretty close – I saw the sheet of flame go up from our dugout. We lead quite an underground life now. So far I am proud to be able to say I have escaped being “chatty\".\n","103":"\n\nOur pretty position by the river has one great disadvantage – it is too well known by enemy aircraft. Last night in the brilliant moonlight a number of taubes came up the Somme valley systematically bombing on both sides of the river. It is pretty nerve-racking to hear the crash, crash of bombs bursting in the neighbourhood with the whirr of plane engines overhead & the crack, crack, crack of lewis guns firing up at them. Finally two light bombs of the “grasscutter\" variety dropped right in our camp, the only damage done being one horse \nslightly\n wounded which had to be shot subsequently.\n","104":"\n\nYesterday morning we got sudden orders to move forward on 5 Div. relieving","105":" Div. in the line. The three days spent near the river were very pleasant. Swimming three\n\ntimes a day in beautiful weather & no work to do. The night bombing was the only uncomfortable feature. We went up to the A.D.S. in cars, through Hamel & Cerisy, up to main Amiens-St. Quentin Rd. The place we took over is a captured Fritz field hospital and is full of German stuff - uniforms, helmets, gas masks, equipment, drugs, books, bandages. No lack of souvenirs.\n\nWas off colour last night & to-day but am feeling better to-night.\n","106":"\n\nWe did not reign long in our position on the Amiens-St. Quentin road opposite Harbonnieres. The Ambulance after being A.D.S. for a couple of days became M.D.S. and then closed down as the line moved forward. We remained inactive for a couple of days during which time I made strenuous efforts to get my correspondence up to date, washed some clothes & had a look over Harbonnieres.\n\nThe village is a fair size and is not too badly knocked about. The local cemetery is crowded with graves of French civilians, French soldiers, Germans & now British. The whole countryside is honeycombed with fritz dugouts, some real underground cottages & splendidly constructed. The dugout three of us are occupying is solidly built and we are pretty comfortable. The weather has suddenly changed and became quite chilly with cool winds. Yesterday morning we had reveille at 4.30 and moved out at 6 o’clock through Prozart, along the Somme valley into Cappy & then up the hill to an old orchard where we took over the M.D.S. at noon from 8 Field Amb. We have had some casualties lately – three killed & 2 wounded. One of our motor ambs. struck a fritz mine on the road & went up – only two slightly injured. Several military medals lately for the bearers – a motor driver scored a bar to his. Our old orchard\n\nstands in a lonely spot and is at present holding two complete Field Ambulances minus bearers, our own & the","107":" which is awaiting orders to move. There is a fine view forward over a sweeping expanse of country – the old Somme battlefield, a dreary waste for the most part. On our left and across the river lies Bray the big Somme village that took so much taking but fell to our chaps. The Australians have made, and are still making a splendid name for themselves – proved themselves second to no troops fighting among the allies.\n","108":"\n\nM.D.S. in the orchard near Cappy closed down at midnight Thursday, the","109":" Div. took over our sector and M.D.S. was re-opened further forward. We loaded our waggons and were then taken in lorries to the sector on the right passing through Cappy and pulling up at the M.D.S. near Estrees Deniecourt which had just been taken over by 15 F. Amb. that morning. After some dinner here we went forward straight along the main St. Quentin road and over the old Somme 1916 battlefield, kilometre after kilometre of desolate waste full of weed grown old trenches & shattered\n\ntree stumps. All this country we have just retaken from the Germans. At last we arrived at the Somme with Peronne on the left and made a cautious crossing over the string of three temporary structures which replace the bridges blown up by the enemy at St. Brie. We continued on through Mons-en-Chaussee where","110":" F. Amb. have established the A.D.S. and bivouacked in the open near the neighbouring village of St. Gren. Strict orders have been issued that no-one is to enter any fritz dugout nor handle any stuff that he has left behind, so much of it has been mined and he only evacuated the village the previous day. We had only been in the place a few minutes when fritz put over 3 or 4 shells pretty close to us. We had one chap wounded & he was immediately evacuated to Adv. Dressing Station. When shall we see civilisation again? Mons & St. Gren are over 50 kilometres from Amiens.\n","111":"\n\nWe stayed 4 days at St. Gren near the A.D.S. doing nothing as reserve Ambulance when the whole Division pulled out for a few days rest. We thought we were going right back near civilisation again but great was our disappointment to learn that we were not even going to cross the Somme. We left the comfortable dugouts we had constructed and marched out in the driving rain yesterday morning back to Le Mesnil on the outskirts of Peronne. Fritz bombing planes are over nearly every night so everyone had to set to work and build dugouts – a rottenly monotonous job but very necessary. The days are now cold, windy & wet and it looks as if winter had commenced. The enemy is still being driven steadily back towards the Hindenberg line which he is now occupying in parts.\n","112":"\n\nThere have been quite a number of changes in the Unit during the past few days. Our O.C. is away on leave & so is the senior Major. Another officer has gone to","113":" C.C.S. and a new chap arrived, very decent & one of the boys. New Q.M. & W.O. have come along & our W.O. & a Staff Sgt. have left us for elsewhere. Yesterday a Sergt. & 5 men –\n\nall 1914 men left for 2 months leave to Australia.\n\nWe have made a start on the new A.I.F. Education Scheme in the Unit and the chaps are coming forward well to join the classes. I have taken on teaching French with the assistance of two “offsiders\" and we have fully 60 officers, N.C.Os. & men who are taking it up. It is surprising the very few Austs. who know anything about French although the fact of being so much away from civilization has a lot to do with it.\n","114":"\n\nThe Ambulance is still near Le Mesnil but an early move is expected. Another ten 1914 chaps have gone & I expect to be away within a fortnight. Our camp is on the side of a sloping rise and about 4 kilometres away from us across the marshes is Peronne with the famous Mount St. Quentin in the background. A few days ago I walked along the Somme bank into the old town which has of course been considerably knocked about. Railways & bridges had been blown up by the Germans before they fell back and British, Canadian & Australian Engineers & railway troops are busy on reconstruction work. The broad gauge railway now runs further forward than Peronne and several C.S.Ss. have been established in the locality. Fritz planes come over practically every night bent on bombing, but we have a very good system of searchlights & anti-aircraft guns to keep them off. I have seen several enemy machines brought down in flames lately. Our Educational Scheme is still going strong – classes & lectures are taking the place of some of the parades. The A.I.F. is putting the scheme on a sound basis with officers to act as organisers. Several of us in the Ambulance have applied for these commissions.\n","115":"\n\nOn Friday night we received orders to move forward with the Brigade, Rumours were afloat that the Australians & Americans were going to have a go at breaking the Hindenburg line. We moved out at 6.30 p.m. and marched 16 kilometres arriving after numerous halts along roads crowded with transport, outside the village of Hervilly about midnight. The night was pretty cold & 4 of us slept in a gravel pit with the sky for a covering. We stayed all the next day here being considerably cheered up by good news from Palestine, Salonica & French fronts. Last night we had a tent to sleep in. It was as cold as billyho and fritz planes were over bombing around about. At 5.50 a.m. a terrific barrage opened & we knew the stunt had commenced. A few big guns on railways near us were firing too. At 9.30 a.m. we moved further forward about 5 or 6 kiloms. to Templeux-Le-Guerard. Yanks are everywhere and the roads crowded with guns & transport moving forward. News from the line is good & big batches of prisoners are coming through. They are a pretty poor looking lot, mostly young chaps.\n","116":"\n\nOn the afternoon of the day we arrived at Templeux, fritz put over a lot of big stuff into the village & some distance from us. We opened up an Adv. Dressing Station two villages forward at Bellecourt, the H.Q. of the Amb. with transport still remaining at Templeux. On Tuesday I took over the job of acting Sergt. Major vice the W.O. on leave to England. Progress along the line is very slow on account of the enemy’s strength and the Americans we are supporting have lost heavily. Orders had arrived for the remainder of our 1914 men numbering 17, to get on the homeward track & we had just shaken hands all round this morning prior to moving off when a big shell came over & burst in close proximity to the camp. This was followed by another while we were moving out, which lobbed right in our lines on a G.S. waggon, wounding two men & doing other damage. Our little party of home-ites hastily got a move on\n\njust in time to dodge a few more “gazumpers\" which appeared to also drop in the camp. We hopped on to lorries bound for Peronne and not too soon either. Fritz’s big guns were systematically shelling down the road looking for troops & transport on the move. Yesterday he had two balloons up in front of us which had evidently been watching our movements. We dropped off the lorries opposite what used to be the railway station in Peronne and made our way to 5th Div. Nucleus Camp at La Chapellette, about 3 kiloms. away, where we had to report.\n","117":"\n\nAll the 1914 men in the 5 Div. collected at the Div. Reinf. Wing 200 strong (3rd batch) and marched out this morning to Bray, 15 kilometres further back where all 1914 men from the 5 Divisions are collecting. I believe that the number going back on this trip will be 60 officers & 1700 W.Os., N.C.Os. & men. Bray has been pretty badly knocked about but there are enough buildings left to accomodate us all. Our contingent is occupying an old Brasserie & 5 of us are very comfortable in a room \nwith fireplace\n. The nights are very cool now and one blanket does not keep a chap too warm. This coming winter promises to be colder than the last & we shall all be glad to miss it and get back to our own sunny land.\n","118":"\n\nTo-day we had particulars taken re our service & clothing requirements. No-one is allowed to leave the vicinity of his billet without permission the penalty for disobedience of this order being immediate return to your unit & no trip home. There are 60 officers & 1700 other ranks going back to be divided into two parties – the first to leave Bray on the","119":" & the second on the 10th. Practically the whole of the village is occupied by the 1914 men. The houses are in fairly good condition and so is the church,\n\nSt. Nicolas, which two of us wandered through this evening. It had been used for an ambulance station by the Germans & has two large red crosses painted on the roof. The statuary & pillars in the church are untouched although the stained glass windows have suffered pretty badly from shellfire. There are a few French military representatives in the village but the civilians have not started to come back yet. We are about 45 kiloms. behind the line.\n","120":"\n\nAt 1 o’clock this morning all clocks & watches throughout France were put back to midnight (winter time) and to-night it was dark at 6 o’clock. We are marking time doing practically nothing although quite comfortable in a room of an old Brasserie (brewery). There is a fair amount of wood lying about – shattered out – houses principally – and we have a fire going all day. The chaps are all in good spirits although naturally anxious to get away. Everyone was jubilant to hear to-day that the central powers have thrown out peace feelers.\n","121":"\n\nThe “Anzac Coves\" Concert Party is holding two shows daily in the village for the 1914 chaps and I went yesterday afternoon – jolly good show. This crowd, which is the Aust. Corps Concert Party, toured England some time ago. Following the concert was an address by our old chief “Birdie\" in the village square. Not a sound was made while he spoke and said goodbye to us all. He could hardly finish so overcome was he with emotion. There is no doubt that Gen. Birdwood has real affection for our boys and he has endeared himself to us. A big, rough looking “digger\" stepped out of the crowd & asked him to autograph something. The “boss digger\" was then carried shoulder high down the street to his fine staff car and here he stood for\n\nsome time shaking hand after hand & signing autograph after autograph with a ready smile for everyone, until finally after a hurried goodbye to the officers who had until now been in the background, Lieut. Gen. Sir R.S. Birdwood, G.O.C., A.I.F. and G.O.C., 5 British Army saluted, stepped into his car and drove slowly away.\n","122":"\n\nWe heard yesterday that there was to be no move the following day as expected, and everyone was terribly down in the dumps as the result. We had been here 6 days doing practically nothing, all on our own in a shattered village and miles from civilisation. The latter is what we are all longing for. The Corps has gone right out for the long waited rest and a long string of","123":" Div. transport passed through the village yesterday. To-day our spirits were considerably raised to learn that we are definitely going to-morrow. Alternative leave is now available – 70 days in England instead of two months at home. Not for mine!\n","124":"\n\nWe were due to leave Bray at 9 a.m. on Thursday but through a train derailment we were told to “stand by\" much to everyone’s intense disappointment. However we were finally marched down to a train standing near Bray Station and entrained in the rain in cattle trucks – there being 36 in ours. We pulled out at 1 p.m. and moved slowly back over the old battlefield through Villers Bretonneux to Amiens, standing some time in the station and allowing all to hop off & get newspapers, etc. There were quite a number of civilians on the station showing that the fine city is rapidly returning to its former state of activity. Pulling out of Amiens about 4 p.m. we journeyed on through Saleux, Namps, Abancourt & Buchy the countryside presenting a pretty picture. After leaving Amiens the ugly signs of war disappeared and there was nothing to mar the calm beauty of the surrounding countryside. Autumn is beginning to show itself and great patches of red, brown & yellow stood out from the surrounding green in its many shades. Often the train passed\n\nbetween great banks thickly covered with ferns & shrubs and would then emerge into open country with a little village nestling in a hollow and a few country people industriously toiling in the fields. When it got too dark to see any longer we lay down on the floor of the truck for a bit of a snooze – as far as our cramped condition would allow. At 1.30 a.m. we were aroused and detrained in the drizzling rain at Harfleur. From here it was only a short march to the Aust. Gen. Base Depot at Rouelles, our destination. It appears that no-one knew we were coming and no accomodation was ready for us. Two of us managed to find a temporary home on the stage of the big Y.M.C.A. theatre in the camp. Next morning I was able to see how beautifully situated the camp was. About 6 or 7 kiloms. inland from the busy seaport of Le Havre to which it is linked by train & tram the huts & tents stand on the side of a pretty valley – the cream coloured tram wending its way along the opposite slope \npassed\n past attractive looking chateaux & detached cottages. Leave out of camp being unfortunately extremely restricted I was unable to get into the town yesterday.\n","125":"\n\nWe moved out of the A.G.B.D. at 4 o’clock on Sat. afternoon and marched through Harfleur into Le Havre passing numerous French, British, American & Belgian munition & ordnance works on the 10 kilometre track. Le Havre is a very busy city with plenty of shipping in the port. The town, being practically outside the bombing zone, is well lighted. After hanging about the wharf for some time we were marched on to a steamer that lay alongside. At 11 p.m. we started on the channel trip with the chaps so tightly packed aboard that there was not sufficient room for everyone to lie down on the decks for a sleep. Everyone was moving about fairly early after a chilly but calm night and the Isle of Wight passed about 7 a.m. Two hours later on a fine morning we brought up at the docks and disembarked, to march straight on to the railway platform. A very pretty little part of the country was then traversed in the train when we travelled through Andover Junction & Ludgershall to Tidworth – the big Australian camp centre. Here there was a big mob of Australians from the English front, W.A.A.C.S., nurses, Y.M.C.A.-ites, civilians, etc. etc. to greet the heros from the war, a brass band blared something or other and there was a general\n\ndistribution of lukewarm weak tea & war-made biscuits. A \ntwo\n 5 mile march (or more) by a circuitous route brought the fed up warriors to No. 2 Camp, Parkhouse. It is now 3.30 p.m. on the following day and we have so far had a most exciting (?) time attending various parades in the rain, scrambling for food and visiting a couple of Y.M.C.A. & Church Army huts. It is raining steadily and the joyful (?) news has been circulated that there will be absolutely no leave in England before sailing. It is rumoured that the 1914 batch leaving before us has been torpedoed but nothing is definitely known. Everyone is generally fed-up and more chaps are taking the 75 days in England instead of going home. It is a jolly shame that we are being so fooled about that men are taking their leave in England to get away from it all. There are a couple of spare Generals knocking round the camp somewhere inspecting the 1914 men. A parade was ordered for two o’clock but it was raining so hard that everyone wandered back to their huts.\n","126":"\n\nThrough a little pressure being brought to bear & a rush of applications from the chaps for leave, the heads at last took a tumble and commenced to give short leave to those giving a good reason. I was lucky enough to get away with the first batch on Wed. morning & was granted 36 hours. Caught 7.35 a.m. train from Tidsworth, changed at Andover and was in London (Waterloo Stn.) at 10.15 – the journey being 77 miles. I did not leave London until 3.15 p.m. the following day and was back at Parkhouse at 6.30. Stayed in London the first morning & afternoon & went down to Wallington (Surrey) via Streatham & Croydon in the evening. Came up to London next morning & paid a hasty visit out to Bayswater. Went down to Streatham for lunch. London did not appear any different to when I was in it 21 months ago – the same sober grey old city with its busy streets. In Trafalgar Square there was a supposed-to-be devastated French village with a few camouflaged heavy guns – all to encourage the sale of war bonds. A big Red Cross appeal was going strong in front of the Royal Exchange. This short spell of leave was very welcome & has stopped a lot of grumbling – in fact some chaps have withdrawn their application for 75 days leave in England after getting the few hours granted. The country is looking splendid – green meadows & plenty of fat cattle although not so much land under cultivation as in France.\n\nYesterday evening two of us walked along\n\nthe 3 miles of quite country lanes & roads, through the sleepy little village of Shipton into Tidworth where we saw a very poor show at the Garrison Theatre “Within the Law\". This morning there was an inspection by Gen. McKay but it was so cold on the parade ground that the parade gradually dwindled in numbers. (N.B. The 1914 men are sadly lacking in discipline – the older the soldier the worse disciplined he is.)\n","127":"\n\nYesterday evening the “Kookaburra\" Concert Party gave an excellent show in the Y.M.C.A. here. These concert parties consisting for the most part of girls, tour the different camps in England giving performances under arrangement with the Y.M.C.A.\n","128":" \n\nWe had reveille yesterday morning at 3 o’clock, & entrained at Tidworth at 8.30 on a cool, misty morning. A 7 hours run through Ludgershall, Pewsey, Westbury, Somerton, Taunton, Tiverton, Exeter, Dawlish, Totnes, Plympton & Devonport brought us to Plymouth where we detrained on the wharf. The long run through Wilts., Somerset & Devon on a bright sunny day was splendid & gave me the best view of England I have seen. Mile after mile in a fast comfortable train mostly through undulating pastural country which should in my opinion be under cultivation as in France. At Taunton the train stayed some time in the station, our free & easy crowd attracting a good deal of attention & incidentally buying out the refreshment buffet & newspaper stall. At the fine town of Exeter we had a long halt in the station & were supplied with refreshments by the Mayoress of Exeter & numerous lady helpers. Shortly after leaving Exeter we ran through Dawlish, a very pretty little place on the water’s edge with a continuation of tall red cliffs. The country for the most part of an undulating nature afterwards became more rugged with attractive looking houses nestling among the green hills. After passing through some of Plymouth suburbs – Wm. Road, Devonport, Dockyard Halt, Ford & Keyham, the train ran off on to a siding that took us down to the wharves. After one of the long waits, which we are now getting quite used to, the draft detrained & went on board two steamers which took us up the Sound to our floating home – H.M. Transport Port Lyttleton, 8000 tons, Tyser Line & before the war trading between England & Australia. We are 800 passengers going back on leave and although crowded we should be fairly comfortable – no worse than on the Kyarra at any rate. The draft arrangements have been anything but perfect and our various moves have been marked\n\n H.M.T. Port Lyttleton, D30.\n\nby one succession of blunders. Notwithstanding the prospect of being home soon everyone is grumbling and many wish they had taken the English leave to get away from the fooling about. The food on the boat promises to be plentiful & good.\n","129":"\n\nWe sailed at 4 p.m. on the","130":" and are now six days out from Plymouth bound for Aust. via South Africa. So far we have done 1500 of the 11 or 12000 miles and I expect to be home a week before Christmas. The weather which was quite cold when we left is rapidly becoming milder and to-day is quite hot & sunny tempered by a cool breeze. We sailed out of Plymouth Sound as a convoy of nine ships with an escort of 5 destroyers – so real is the submarine peril. Every man has to wear a lifebelt from when he gets up in the morning until turning in at night. All have been allotted to a boat or raft in case of a sudden call. No lights are permitted on deck & no smoking after dusk. During the second night out our destroyers left us & also 4 of the convoy evidently bound for America. We are now 5 boats, the flagship being a fast auxiliary cruiser which steams ahead and carries at least 8 guns. The other ships all have a single gun mounted in the stern and a gun crew of naval men. The night before last we ran into a storm & had a pretty rough passage. To-day there is nothing but a big swell. No land has been sighted since we left England and no ships other than one distant convoy faintly visible on the horizon.\n","131":"\n\nOn Wednesday a ship was torpedoed & sunk 60 miles from us. We are now all on our own, the aux. cruiser & other ships leaving us yesterday & steaming evidently for Sierra Leone. The weather for the past 3 or 4 days has been quite warm & is getting hotter every day. The chaps are beginning to shed their clothes. Very slow on board. Nothing to do but read. A lot of money changing hands at all sorts of gambling games. We had a death this afternoon & at 6 p.m. I saw for the first time a funeral at sea. It was one of the sailors who had contracted pneumonia.\n","132":"\n\nNow 14 days out from Plymouth. Weather hot, sea calm. Came into the doldrums yesterday & had some heavy downpours of rain. Have been sleeping on deck since we left port – too stuffy down below. The number we have on board exclusive of ship’s crew & naval gun detachment is:- Officers 35, W.Os., Staff Sgts. & Sgts. 200, men 601 = 836 all ranks.\n","133":"\n\nWe all gave up our lifebelts to-day to be stacked below. Evidently we are well out of the danger zone.\n","134":"\n\nThe war is practically over. We have been getting wireless news every day and have learnt of the giving in of Turkey, Austria & now Germany – the news of the armistice coming through yesterday.\n\nWeather is cool again with strong head wind blowing.\n","135":"\n\nArrived in Table Bay, Cape Town at 6 a.m. On a perfect day the town looks rather attractive lying at the foot of the irregular rugged mountain peaks that surround the bay. Table Mountain looms up as a great solid mass with Lion’s Head on its left and Devil’s Peak & Signal Hill on the right.\n","136":"\n\nYesterday afternoon we moved into the port and came up alongside the wharf to coal, water & provision. Since then the niggers have been busy shovelling the coal off the railway trucks into great baskets that are swung on board by steam cranes on the wharf. Opposite us, also coaling is the Borda, one of our original convoy from Plymouth & crowded with convalescents & 1914 men returning to Aust. Not a single man from our ship is allowed to land on account of the great epidemic of pneumonic influenza that has\n\njust swept over South Africa and from which no less than 50,000 people, black & white have died in the Union. In Cape Town alone there have been 18,000 deaths, 10,000 taking place in the first fortnight of the epidemic. The influenza was at its worst from 9th to","137":" and the natives died in scores, motor lorries & carts going round and collecting the bodies. Now everything is alright again but every precaution is being\n\ntaken to prevent a re-appearance of the disease.\n\nWe have now been here three days and the weather has been perfect. The day before yesterday the thermometer registered 70° in the shade; yesterday & to-day have been slightly warmer. We get the “Cape Times\" & “Cape Argus\" daily and I am learning quite a lot about the “dark continent\". Plenty of oranges are obtainable over the side at the usual exorbitant prices Australians have fixed for themselves.\n\nCape Town seems to be quite back to normal again and the theatres & picture shows are in full swing. Numerous swimming clubs are going strong particularly round at Green & Sea Points. The Scouts are also much in evidence.\n\nThe English & Dutch seem to have practically merged into one but the colour question is one that has yet to be faced; the “black\" people wanting restrictions removed and to be allowed to participate in the administration of the Union.\n\nThere are a fair number of ships in the Bay & Port. A smart little Japanese steamer with a gun mounted both fore & aft, is coaling behind us & in the basin are also Portuguese, Swedish & Norwegian ships & several British vessels. The “Wyreema\" left the Bay this morning crowded with Australian reinforcements that will now no longer be required. The Japanese steamer “Iyo Maru\" left this afternoon taking General Botha to England.\n","138":"\n","139":" anniversary of leaving Aust.)\n\nOur coaling, greatly prolonged on account of the shortage of labour & epidemic restrictions, was completed yesterday evening and we sailed at 6 p.m. for Fremantle with sundry dippings of flags by the allied & neutral ships in the harbour.\n\nThe 5 days stay at the Cape was a pleasant break in the monotony of the long voyage. The papers came aboard daily and we were able\n\nto get postcards, books of views etc. Yarns over the side with dock & civil police and a few civilians as well as with chaps on board give one a very good idea of what S.A. is like.\n","140":"\n\nThe weather has been pretty bad since leaving the Cape 8 days ago & is likely to continue such until we reach Fremantle. The day after leaving port the transport ran into very dirty weather which kept up for 4 or 5 days. Contracted a feverish cold 3 days ago & was admitted to ship’s hospital where I am now. Am alright again but the bunk here is so comfortable after 5 weeks sleeping on the open deck in all weathers that I am not anxious to leave it.\n\nEveryone was inoculated against influenza on getting away from S.A. So far there has been no outbreak on board.\n\nThe voyage is getting very monotonous & the crowd are getting rather discontented on account of the bad food we are getting. It is quite evident that some of the English crew are \ntrying to\n fleecing us and there may be trouble on board before we land.\n","141":"\n\nWas in hospital 6 days & then got the “bullet\". We are rapidly nearing the Aust. coast & yesterday for the first time since leaving the Cape we ran into fine weather – a very welcome change.\n","142":"\n\nOur fine weather only lasted a couple of days and gave place to a strong headwind & tossing seas.\n\nThe food throughout has been unvaried and badly cooked and things came to a head on the","143":" when nearly 200 Warrant Officers, Staff Sgts. & Sergts. refused to sign the certificate that they had been given second class accomodation & food. The O.C. Troops, a man who has shewn\n\nlittle or no tact since taking over the draft tried a little bluff but we stood firm. An inquiry was opened and the food has improved somewhat.\n\nFurther irritation has been caused by two wires received from Fremantle. One stating that we should have to undergo quarantine on arrival & the other saying that a payment of £9 ration allowance on board to all ranks was cancelled.\n\nOn the morning of the","144":" the transport arrived in the roadstead outside Fremantle but on account of the strict quarantine regulations no-one landed. The friends & relatives of the W.As. were on the wharf waiting for them. Nothing further happened until yesterday afternoon when orders were received to sail at 6 p.m. for Melbourne taking the W.As. on as well & who would then stand no chance of being home for Christmas. The 90 W.As. including 5 Officers & numerous W.Os. & N.C.Os. thereupon lowered away 4 of the ship’s boats with our assistance, put their kits in and set out for the shore amid loud cheers. A picquet boat between the shore & us subsequently took the boats in tow and brought them alongside us but they were refused embarkation and the tug driven off of potatoes & all kinds of invectives. Signal lights flashed to and from the shore & several attempts were made during the night to get naval “heads\" & the “rebels\" aboard but without success. Numerous red, blue, yellow & green german flares were fired into the air amid howls of delight (& sometimes spuds) from the crowded deck. The shore authorities have not given up hopes of getting the W.As. aboard and have not yet landed them; their tug is lying off us now. Although anxious to get away we are fully in sympathy with the W.As. and do not intend to let them be sent on board. The authorities ought to let our skipper leave or there may be further trouble. The troops on board are quiet so far but there is a restive feeling in the air.\n","145":"\n\nWe have gained a victory! During the morning the authorities decided to land the\n\n90 W.As. to be quarantined for a few days ashore. They steamed off in their tug amid tremendous cheers. Our ship’s boats were returned to us and the Port L. left at 3 p.m. for Melbourne, everything quiet again.\n","146":"\n\nArrived at Port Phillip Heads at 9 a.m. to-day and passing through the rip went inside. Much to our dismay we came to anchor off Sorrento & hoisted the yellow flag. Soon after we learnt our fate – Notwithstanding the fact that we were absolutely a clean ship, three days had to be done in quarantine with more throat spraying & taking of temps. The boys took it fairly quietly after a speech from the O.C. although our chance of getting home for Xmas Day was now absolutely nil.\n","147":"\n\nI never want to spend another Christmas Eve like this one. Why in the dickens didn’t I take my furlough in Europe as a number of others did and thus miss all the absolute bungling. The three days of quarantine had nearly dragged themselves out when another staggerer hit us this evening. Orders were received from shore that all N.S.W. & Queensland chaps are to transfer to-morrow morning to \nanother troopship\n and go round by sea to Sydney, and this after 9 weeks on a ship infected with lice & rotten tucker and without once setting foot on land. Shall we never get on land again? Men & officers are scattered in groups round the deck and there is talk of refusing to transfer on to the new ship. A number of us would like to get ashore and stay in Melb. until the joy riding public filling the Sydney-Melbourne trains kindly condescend to allow us to have seats on the train, or the military authorities ashore pull themselves together after their Christmas festivities and see about disposing of the common soldiers returning from abroad. What a nice Xmas Day we expect to have to-morrow.\n","148":"\n","149":" turned out cold & wet and the gloom was increased by a festive (?) midday meal consisting of meat, potatoes & dried beans. In the meantime we had weighed anchor and were on our way up the Bay. At 3.30 p.m. in the pouring rain we came up to the wharf at Port Melbourne & \neveryone\n disembarked. And then came the surprise & an opportunity! N.S.W. & Queensland chaps were notified that if they did not wish to transfer on to the transport “Durham\" lying alongside they could go overland from Melbourne, pay their own fares and no guarantee would be given as to when they would be able to get seats. A large majority immediately voted for the overland journey & were dismissed to go where they liked; the “Durham\" leaving for Sydney an hour later.\n\nNotwithstanding the inclement weather two of us made the most of the remainder of Xmas Day & the best part of Boxing Day in & around the city. Four years of war have not affected Melbourne. On account of the holidays large crowds were everywhere & the streets brilliantly lighted at night.\n\nWith the help of two very capable officers of the Victoria Barracks staff we left in a","150":" class special from Spencer St. at 5 p.m. and are now (10.30 p.m.) well on our way to Sydney. We halted for dinner at Seymour (8 p.m.) and had a short stop at Benalla.\n","151":"\n\nArriving at Albury at 11 p.m. we changed trains and reached Sydney at 10 a.m. Everywhere there were cheering people and waving flags. Breakfast was provided at Moss Vale and the station was full of V.A.Ds. distributing cigarettes, chocolates, flowers, etc.\n\nOn steaming into Sydney Main Station I hopped out, got my leave pass and found the family waiting for me outside. Was soon home.\n","152":"\n\nHave not settled down yet and feel almost a stranger in a strange land. Everything seems terribly quiet although Sydney looks the same with the addition, of course, of numerous new buildings.\n\n"}}