{"Document Name":{"0":"Diary_0247","1":"Diary_0247","2":"Diary_0247","3":"Diary_0247","4":"Diary_0247","5":"Diary_0247","6":"Diary_0247","7":"Diary_0247","8":"Diary_0247","9":"Diary_0247","10":"Diary_0247","11":"Diary_0247","12":"Diary_0247","13":"Diary_0247","14":"Diary_0247","15":"Diary_0247","16":"Diary_0247","17":"Diary_0247","18":"Diary_0247","19":"Diary_0247","20":"Diary_0247","21":"Diary_0247","22":"Diary_0247","23":"Diary_0247","24":"Diary_0247","25":"Diary_0247","26":"Diary_0247","27":"Diary_0247","28":"Diary_0247","29":"Diary_0247","30":"Diary_0247","31":"Diary_0247","32":"Diary_0247","33":"Diary_0247","34":"Diary_0247","35":"Diary_0247","36":"Diary_0247","37":"Diary_0247","38":"Diary_0247","39":"Diary_0247","40":"Diary_0247","41":"Diary_0247","42":"Diary_0247","43":"Diary_0247","44":"Diary_0247","45":"Diary_0247","46":"Diary_0247","47":"Diary_0247","48":"Diary_0247","49":"Diary_0247","50":"Diary_0247","51":"Diary_0247","52":"Diary_0247","53":"Diary_0247","54":"Diary_0247","55":"Diary_0247","56":"Diary_0247","57":"Diary_0247","58":"Diary_0247","59":"Diary_0247","60":"Diary_0247","61":"Diary_0247","62":"Diary_0247","63":"Diary_0247","64":"Diary_0247","65":"Diary_0247","66":"Diary_0247","67":"Diary_0247","68":"Diary_0247","69":"Diary_0247","70":"Diary_0247","71":"Diary_0247","72":"Diary_0247","73":"Diary_0247","74":"Diary_0247","75":"Diary_0247","76":"Diary_0247","77":"Diary_0247","78":"Diary_0247","79":"Diary_0247","80":"Diary_0247"},"Date":{"0":"unknown","1":304.0,"2":305.0,"3":308.0,"4":309.0,"5":310.0,"6":312.0,"7":314.0,"8":318.0,"9":320.0,"10":324.0,"11":325.0,"12":326.0,"13":327.0,"14":328.0,"15":329.0,"16":330.0,"17":334.0,"18":335.0,"19":341.0,"20":342.0,"21":343.0,"22":344.0,"23":345.0,"24":346.0,"25":347.0,"26":348.0,"27":349.0,"28":350.0,"29":351.0,"30":361.0,"31":365.0,"32":366.0,"33":370.0,"34":371.0,"35":376.0,"36":377.0,"37":378.0,"38":379.0,"39":405.0,"40":409.0,"41":410.0,"42":430.0,"43":434.0,"44":435.0,"45":436.0,"46":437.0,"47":438.0,"48":439.0,"49":440.0,"50":441.0,"51":442.0,"52":452.0,"53":453.0,"54":454.0,"55":455.0,"56":456.0,"57":457.0,"58":458.0,"59":459.0,"60":460.0,"61":461.0,"62":462.0,"63":463.0,"64":464.0,"65":465.0,"66":466.0,"67":467.0,"68":468.0,"69":469.0,"70":470.0,"71":471.0,"72":472.0,"73":473.0,"74":474.0,"75":475.0,"76":476.0,"77":480.0,"78":481.0,"79":487.0,"80":488.0},"Entry":{"0":"\n\n","1":" \n\nRaining pretty hard & all drill is off but we enjoyed ourselves packing & unpacking Kit Bags. The harbour at Albany is open to the sea & when \nwith\n the wind blows straight through the heads makes it pretty rough.\n","2":"\n\nis still pretty cloudy overhead it is drizzling rain.\n The Troops are all eating like horses & are getting fat & lazy as a result of no work. They are beginning to get full of sticking on the ship for there is nothing to do only eat, sleep & do a bit of physical drill.\n","3":"\n\nWe went into the wharf again today to get water & all the troops with the exception of our Company (who were on guard) went for a march similar to that we had on the previous occasion the only difference being that \nto day\n this time it was raining & thereby marred what would have been a pleasant march. All the boats are anchored here now & such a\n\na sight Albany or any other place has never seen before there being about 40 odd boats all waiting for the signal to steam off.\n","4":"\n\nWe returned to the bay to anchor with the rest of the boats\n","5":"\n\nwe got up & were glad to see that all preparations were finished & that the boats were starting off headed by the Orvieto. Such a sight as they went in single file out of the harbour & out to sea will never again be witnessed \nfrom\nby anybody we were all on deck watching 2 waiting for our turn to come which wasn’t long & \nnow\nwe are all in sight of one another on the high seas & \nwill\n have the same sight to see every morning we get up. There is an escort of 5 cruisers.\n","6":"\n\nThe sports on board were carried on quite successfully there being great excitement as\n\nevery event went off.\n","7":"\n\nThe sea watery calm & the weather is beginning to get hot the consequence being that an awning & also a bath have been fixed up on the lower decks. The Osterley passed quite closejust about dusk. They were given a few cheers as they went by. They are very lucky to see the sight they seen in the boats all in a line making for Colombo.\n","8":"\n\nWe were still making slow progress to Colombo steaming about 250 miles per day. Today morning about 7 o’clock the cruiser Sydney was detached from the convoy to proceed to the vicinity of Cocos islands where a German Warship was seen. It appears that as soon as the German Cruiser exchanged a few shots with the Sydney, it stranded itself so as to avoid sinking. The Cruiser is believed to be the Emden. The British Casualties were 2 killed & 13 wounded \n\nBut the Emden’s Casualties are believed to run into far more\n","9":"\n\nAfter finishing off the Emden the Cruiser Sydney began a chase after the collier which was coaling the Emden in the Cocos Islands & after a small run succeeded in overtaking & sinking her after she had taken her crew prisoners. Great praise is due to the men of the wireless station on the Cocos Islands for the way which they stuck to their posts amid bombardment from the Emden & succeeded in delivering their message although the Emden tried to intercept her message by sending different words & letters.\n","10":"\n\nWe arrived at Colombo & anchored outside.\n","11":"\n\nWe went inside the breakwater. Here we got 40 prisoners from the Emden put on board &\nright in our mess hereby cramming us into a very small space.\n The N.Z. Troops about a day before we arrived at Colombo therefore they had already got\n\ncoal 2 water aboard when we arrived. The sight of Colombo from the ship makes a chap feel like going ashore & having a ride in one of the rickshaws he can see from the boat. We stopped in Colombo from","12":" till","13":" during which time we had got water aboard. While we were getting water the N.Z. & certain other ships left a day before us on their way to Aden. We left on","14":" & caught the rest of the Troopships up on","15":"\n","16":"\n\nWe all got up in the morning to find all the boats had stopped & we naturally thought something was in the wind but the stoppage was only caused through two boats coming into a slight collision. We arrived in Aden on Wednesday morning","17":" & after stopping there a day for coal & water supplies\n\nleft again on","18":" & on the same day went through hell’s gate to the red sea on our way to Suez. Aden is a very desolate looking place no vegetation growing at all it being all desert & barren looking rocks. The Red Sea was very calm & the weather very mild from Aden to Suez. We arrived at Suez on Tuesday morning","19":" & after waiting our turn till 10 o’clock the same night we followed the rest of the boats into the Canal on our way to Port Said. The Canal is a wonderful sight. There were troops consisting of Sudanese, Sikhs, Gurkhas a batch of Manchester Engineers patrolling both sides of the Canal. After 14 hours steam up the canal we arrived at Port Said on","20":" Port Said is a fairly large place & the sight as we passed each boat & Cruiser which were in port (both French & English)\n\nto the tune of the different anthems was the best I have seen in my life. The natives in all these places starting at Colombo were all on the go doing their over the side of the boat but they wanted a lot of cutting down in price before we would bite. After getting coal & water supplies on board at Port Said we proceeded to Alexandria on","21":" where we arrived on Friday morning","22":" at 6 o’clock. While at Port Said we got rid of our German prisoners the Hampshire taking them away I swear they had the time of their lives while aboard with us\n\nDec 4th\n\nMeasles broke out on board & their were about 40 went ashore into quarantine.\n","23":"\n\nStill anchored just inside the breakwater at Alexandria waiting for the other boats to disembark their troops It is very monotonous on board here we have not been off since leaving Albany which\n\nis 5 weeks ago. This is the cheapest place of the lot to buy anything in the shape of fruit, cigs. Dates etc.\n","24":"\n\nWent into the wharf & unloaded the horses & disembarked 4 companies of troops. We did not land till the next morning there was an accident in the entraining of horses caused by one falling through the race & cutting himself severely.\n","25":"\n\nWe disembarked off the Omrah this morning & boarded the train bound for Cairo at noon we passed through some beautiful scenery & the irrigation along the line is wonderful the Egyptians working in the fields with mules, camels & buffaloes & the houses make the scenery very picturesque. We arrived in Cairo at about 4 P.M on Dec 7th & proceeded about 10 miles to our camp in trams. We are bivouacked on the sand at foot of the pyramids\n","26":" & 9th\n\nIt is all fatigue\n\nhere now going to the top of the hills & bringing stones down to mark out the boundaries of the camp. The camp is composed of N S W. Vic. Qlnd. Tas. W.A & S A. Troops & the 1st 2nd &","27":" Batteries.\n","28":"\n\nWe met Bob Hane & Jack Stead today. We went to Cairo last night & thought it a peculiar place & a place easy to get lost in. Leave is granted at the rate of 20% each night we got our tents . The pyramids here are a fine sight & it is marvellous how they built them as there is no stone like what they are composed of for miles around & the size of them is terrible large.\n","29":"\n\nWe had a day off & went to the pyramids to see the ancient ruins We climbed to the top of the big one of Cheops & also the little one inside of which is a temple with tombs of some ancient kings the names of which I cannot remember (Rameses, . \n\nWe also visited the Sphinx & the temple alongside of it in which the floors are composed of Alabaster stone I managed to procure a piece. There are temples & wells & tombs & villages all over the place & the sight of the huge masses of stone & granite make anyone wonder how they managed to get them here & the tools they must have used. There is some excavation work going on in one of the ancient cities now by some American syndicate. While at the top of the big pyramid I carved my name on a rock up there. There are pyramids all over the place but none as huge as the two that we can see from the camp. There is a big hotel here called Mena house hotel but is now converted into a hospital for the sick soldiers there is a fair sized swimming bath at the rear of the hotel where we go for bathing parades. A chap\n\ngets his eyes open when he goes for a stroll round about the pyramids for when you get on top of the big one & see the country for miles round which is composed of sandy waste he sees a wonderful sight. & when he goes round the native villages & sees the different style of houses & caves built in solid rock with cow yards made out of solid rock & look over the wall & see the cow down below feeding away as happy as you like a days outing to the pyramids takes a bit of explaining as you can’t express your opinion in words.\n","30":"\n\nEgypt was proclaimed a British protectorate to day & the Cairo is full of flags. Flags of every nationality are flying from nearly every building.\n","31":"\n","32":" in camp. Church parade in the morning & leave for town at 11 am which we took advantage of. There is very peculiar places in Cairo &\n\nsince the Aus troops have arrived the hotels & cafes have put up their signs as to take the eye of the soldiers. Such as. Sydney marble Bar, New Aus. Bar, Colonial Café New Zealand Café etc. When we first came to camp we did not understand the money & everyone doing a bit of business made a harvest out of us The Territorials who are camped on the other side of the Nile said that we put the Kybosh on them as what they used to get for 4 or 5 piastres we used to pay 10 piastres.\n","33":"\n\nSir Geo Reid. Visited the camp & addressed the troops from a platform erected on the sand & after making a stirring speech he took his stand with General Maxwell & the Brigadiers & Staff officers to take the salute as the troops marched past in column of fours.\n","34":"\n\nWe had a very painful duty to perform to day & that was marching at a funeral of one\n\nof the members of our company who died of pneumonia. He was buried in the soldiers cemetery at Ghizeh.\n","35":"\n\nWe had a dinner in the Mess room it being got up by the money which was sent to us by the people of Queensland, we also were issued with & . We have been going to the range this week to do a bit of shooting the result being a good majority of the men shooting very fair.\n","36":"\n","37":" &","38":" Batt. Left camp for Ismailia to engage with the Turks who were reported to be on the banks of the Canal but it seems when they got there the enemy were on the retreat being pursued by the Sikhs Ghurkas & an English regiment. The Australians brought to Cairo about 175 prisoners & these amounting to 500 show the reception they received when they came within\n\nfighting range.\n","39":"\n\nThe Second Contingent arrived & are now camped at Zetoun & amongst them were Two or three viz. I. Lamb, G. Smith & J. Ryan. The","40":" &","41":" Batt. Arrived back in camp without seeing any scrimmaging. The gardens zoo, & Museum of Cairo stand out on their own & the buildings in Heliopolis which is a suburb of Cairo are said to be the best in the world. The hotel out there which has been converted into a military hospital is absolutely the biggest hotel in the world.\n","42":"\n\nInstead of going on church parade we got the order to down tents etc & at about 2 p m the baggage transport together with escort moved off on their 10 mile march to Cairo station at which place they arrived at about 5.30 P.M. I being amongst the baggage guard\n\nwas up all night loading Kits, stores, provisions etc & consequently did not leave Cairo until 5 A M on","43":" There were a couple of trainloads of troops & goods etc. which left Cairo on the night of Feb 28. While we were camped at Mena we went through the whole of our training but were glad to get away from the sands of the desert as we used to go out on the sandy waste every day to the same place & see nothing except endless waste of sand & gravel.\n\nThe 3rd Brigade were the first to leave Mena Camp \nbut the others\n They being chosen before the rest to undertake the work which they are now going on. We arrived at Alexandria on 1st March at 10.30 AM\n\n1st March\n\nWe boarded the Ionian a troopship No 136 & such a dirty old tramp that she is. There are 2 Battalions\n\non board & consequently the troops very overcrowded there being a space of about 40 sq yds allotted to 40 Men. We left Alexandria at noon on","44":"\n\nMarch 2nd\n\nOne of the troops was put ashore in a critical condition as the result of an attempt at suicide. The Ionian is an old cattle boat of the Allan Line weighing 9600 tons she has been carrying troops ever since the war began. After steaming due north for a couple of days we arrived at Lemnos Island in the Grecian Archipelago where we anchored at nightfall on","45":"\n","46":"\n\nThere were a good few cruisers round about (both French & English) the scenery on the Island reminds one very much of Albany in Australia Lemnos Island is 30 miles off the Dardanelles\n","47":"\n\nOn","48":" the 9th Battalion went ashore on to the Island by means of the ship’s boats which were towed by a pinnace of H M.S Blenheim.\n","49":"\n\nOn Sunday 7th The troops went for a route march over a large portion of the island. There are a good few cultivation paddocks & some sheep grazing roundabout. There are also the old wind mills for crushing the grain & making flour. The population of the island who are Greeks are all a healthy sturdy race & they say that they don’t know what sickness or medicine is & consequently they live to a great age. The dress of the peasantry is very comical. The villages are not very large but they are scattered all over the Island. On Sunday night 7th March we were on guard & the rest of the battalion were bivouacked on Lemnos Island when it rained very hard & the whole battalion received a severe drenching. As the weather here\n\ndoes not look too promising we got our tents brought to the Island on","50":"\n\nMonday 8th\n\n& pitched them & therefore there is a fair sized camp on the Island comprising the whole of the","51":" Battalion. The harbour here is a fair size there were a lot of transports & cruisers & ships of all descriptions both French & English inside the entrance. The village which we were nearest is called Moudros.\n","52":"\n\nThe whole Battalion was beginning to get Lousy & they were marched down to a creek to wash their clothes & rub kerosene over themselves I was mess orderlie & had a day off as I washed my things on St Patrick’s day.\n\nDuring our stay on the Island we were kept very busy with fatigues such as \n\nwharf lamping & we also built a pier which is going to be called either after the Battalion or the Colonel. It was pretty monotonous work carrying & quarrying stones for the pier. The tucker rations were beginning to get short & there had to be an uproar to get what we were supposed to get. The prisoners get a bad time of it being out like rabbit skins to dry.\n","53":"\n\nFatigue\n Carrying water in buckets for about a mile for the hospital.\n","54":"\n\nChurch parade a corporal having charge of the service.\n\nFootball in the afternoon\n\nMarch 22\n\nFatigue road making. We had a visit from General Birdwood\n\non Sunday night 21st a torpedo boat was wrecked but fortunately all lives were saved. On Friday 19th the French & English received a hot reception. When proceeding up the Dardanelles a French cruiser sank with all hands & two british cruisers viz. Ocean & Irresistible being beached the damage being caused by mines\n","55":"\n\nParade on Battalion parade ground to be reviewed by Sir Ian Hamilton who was accompanied by Major General Birdwood after the inspection we went for a route march along the island. From 5 P.M. on March 23rd till 5 P.M. on March 24th we were on guard over the prisoners at the detention tents\n\nWhen the Torpedo boat got into difficulties on 21st March a portion of the 9th Battalion went to the scene of the wreck with blankets etc. & the sailors found them very serviceable. The cause of the mishap was due to the shortage of coal. It appears that the collier \"Doris\" was out near the Torpedo boat then was asked to supply her with 10 tons of coal to allow her to proceed to Mudros. But the collier could only supply 5 tons & the torpedo boat of course didn’t have enough to complete the journey so she anchored in what looked a well sheltered bay but in the night the wind changed & a fair gale had the little boat at its mercy & consequently all hands had to put on life belts & leave as she was being sent by the force of the wind on to the rocks & nothing could be done to prevent it. She eventually struck the rocks & broke in halves. The members of the 9th Battalion who aided in the rescue work received a Letter of appreciation from Admiral \n","56":"\n\nFatigue carrying fodder from the wharf up to A.S.C. stores. There were a good few cases of dysentery among the troops. On","57":" there was a French officer buried & all the \"heads\" turned out on the Island to pay their last respects to deceased who was wounded by the Turks in the Dardanelles & subsequently died on the hospital boat.\n\nThe Marine Artillery & bluejackets off the Queen Elizabeth landed on the Island on","58":" & went for a march.\n\nMarch 26\n\nDay off airing blankets & were shown the mechanism of the machine gun which was brought off the torpedo boat which ran ashore. On March 25th there was another funeral on the Island the victim being one of the troops. On the afternoon of","59":" Company drill on the ground at bottom of camp\n","60":"\n\nCompany drill in the day. & Piquet in the night Kit bags came ashore to-day from the Ionian\n","61":"\n\nChurch parade in the morning & fatigue rest of day for all who were not on piquet.\n","62":"\n\nFatigue carrying 14 feet pipe lengths to lay on water to the camp for a distance of 1000 yards. In the afternoon carrying timber from our wharf to the engineers for wells etc. in the night we received a night alarm to practice turning out & firing at an imaginary aeroplane which the enemy might send along at any moment. We were issued with ammunition.\n","63":"\n\nDay off slept all day in camp\n","64":"\n\nWent for a route march to a point on the Island about 5 miles from where our troops generally disembarked. Here we practiced embarking & disembarking in some of the ships boats. In the afternoon we had a spell & went on piquet in the night. We received mail for the first time\n\nsince landing on the Island & it caused great excitement as each mail call blew!\n","65":"\n\nWe had a day off on account of No 8 platoon being called out the night previous to assist the guard to guard the 30 odd prisoners who were somewhat roudy on a\/c of fearing that they were to be removed to. Malta. Their behaviour entitles them to the just punishments which they were sentenced. The prisoners left this morning for Malta\n","66":"\n\nGood Friday church parade in morning & rest of day off & went for a swim in afternoon\n","67":"\n\nWent on a washing and bathing parade in morning & had rest of day off. Two of the Cruisers which left the harbour yesterday were attacked were attacked by a hostile Aeroplane but received no damage. An English Aeroplane is in pursuit of the foreign one.\n","68":"\n\nEaster Sunday church parade. Mounted guard at 3.30 P.M. on the pier. We were on \n\nguard in the rain all night & day & consequently got drenched to the skin & it was terribly cold rain. We were relieved at 4 P.M. on","69":" when it was still raining.\n","70":" \n\nStayed in camp all day.\n","71":"\n\nGetting prepared for our departure. down at the wharf loading horses on barges to be carried to the transports.\n","72":"\n\nWent aboard the Malda which is worse than the Ionian on account of her being smaller & also because we have all the transport horses on our boat. We were kept busy all day loading her with stores etc. & worked till late at night.\n","73":"\n\nStill out in the bay at anchor & still loading with stores etc. Appointed sweeper today.\n","74":"\n\nIssued with Iron ration & a further 150 rounds of ammunition making the total 200 rounds. Still at anchor in the bay received pay.\n","75":"\n\nD & C companies went ashore to practice disembarking.\n\nFrom","76":" to","77":" didn’t do anything only stopped on the ship.\n","78":"\n\nWent by means of two or three boats drawn by a pinnace to H.M.S. Queen to practice embarking & disembarking on the battleship.\n","79":"\n\nOn","80":" all the troops got a bit excited as this was the day we got orders to have everything ready to leave the Malda. During our stay on the Malda we went through a great deal of practice in embarking & disembarking & night attacks. We left the Malda & embarked on a torpedo destroyer & subsequently boarded the H.M.S. Queen at about noon we left the Harbour at Mudros on the battleship\n\nThere is a lot of things of interest to be seen on a battleship & we kept ourselves busy looking round.\n\n"}}