{"Document Name":{"0":"Diary_0299","1":"Diary_0299","2":"Diary_0299","3":"Diary_0299","4":"Diary_0299","5":"Diary_0299","6":"Diary_0299","7":"Diary_0299","8":"Diary_0299","9":"Diary_0299","10":"Diary_0299","11":"Diary_0299","12":"Diary_0299","13":"Diary_0299","14":"Diary_0299","15":"Diary_0299","16":"Diary_0299","17":"Diary_0299","18":"Diary_0299","19":"Diary_0299","20":"Diary_0299","21":"Diary_0299","22":"Diary_0299","23":"Diary_0299","24":"Diary_0299","25":"Diary_0299","26":"Diary_0299","27":"Diary_0299","28":"Diary_0299","29":"Diary_0299","30":"Diary_0299","31":"Diary_0299","32":"Diary_0299","33":"Diary_0299","34":"Diary_0299","35":"Diary_0299","36":"Diary_0299","37":"Diary_0299","38":"Diary_0299","39":"Diary_0299","40":"Diary_0299","41":"Diary_0299","42":"Diary_0299","43":"Diary_0299","44":"Diary_0299","45":"Diary_0299","46":"Diary_0299","47":"Diary_0299","48":"Diary_0299","49":"Diary_0299","50":"Diary_0299","51":"Diary_0299","52":"Diary_0299","53":"Diary_0299","54":"Diary_0299","55":"Diary_0299","56":"Diary_0299","57":"Diary_0299","58":"Diary_0299","59":"Diary_0299"},"Date":{"0":"unknown","1":1003.0,"2":1004.0,"3":1005.0,"4":1006.0,"5":1007.0,"6":1008.0,"7":1009.0,"8":1010.0,"9":1011.0,"10":1012.0,"11":1013.0,"12":1014.0,"13":1015.0,"14":1016.0,"15":1017.0,"16":1018.0,"17":1019.0,"18":1020.0,"19":1021.0,"20":1023.0,"21":1024.0,"22":1025.0,"23":1026.0,"24":1027.0,"25":1028.0,"26":1029.0,"27":1034.0,"28":1035.0,"29":1036.0,"30":1037.0,"31":1038.0,"32":1039.0,"33":1040.0,"34":1041.0,"35":1042.0,"36":1043.0,"37":1044.0,"38":1045.0,"39":1046.0,"40":1047.0,"41":1048.0,"42":1049.0,"43":1050.0,"44":1051.0,"45":1052.0,"46":1053.0,"47":1054.0,"48":1055.0,"49":1056.0,"50":1057.0,"51":1058.0,"52":1059.0,"53":1060.0,"54":1061.0,"55":1062.0,"56":1063.0,"57":1064.0,"58":1065.0,"59":1066.0},"Entry":{"0":"\n\n","1":" Looks very much like rainthis morning. quite last night, no balloon visibalfor observations but continued a fairly constant fire for aboutan hour, we are all packed ready to leave, 5 o'clock. I hearthat our guns put a couple of gun batteries out of action yesterday our guns opened outvery constant for about a coupleof hours this evening. We left the reserves about ½ past10 o'clock and got the camps about ¼ past 3 o'clockthis does not seem a bad camp. We are supposed to beherefor about 12 days.\n","2":" Got up at ½ past 11this morning. We do not hear any of our gunshere, but may do so after we get more accustomedto the place, we came part of our journey in thetrain from Ypres yesterday, caught the train outof Ypres about a ¼ of a mile, continued finewithnot doing anything yet.\n","3":" nice fine morning nothing doing.\n","4":" wetcold, day nothingdoing.\n","5":" cold, nothing doing, sportsthis afternoon, made a bet& gave 2 to 1 - 20 to 10, that we are still in France or Belgiumafter 1st November, 1916. sports this afternoon\n","6":" church parade 9.15fine afternoon remainder of day quiet\n","7":" A very wet & cold morning, we havea wetcanteen now it started a day or two ago, goodbeer is being sold, quite remainder of day, but rainstill continues.\n","8":" Fine morningwent on route marchingthis morning, rained part of the day, just after we came homeabout ½, but did not last long,Moore went today to brigade cooking a good job. Can hear guns pretty constantmostly our own, hear good news of thefighting at the Somme.\n","9":" quietnothing doing.\n","10":" nice fine morningsports to-day, Mooney came back.\n\nfrom the working job, \nwe are\nhad sports to-day J. Hudson won the final ofthe hurdle's. the was funny, had avistfrom General him, concert held in Y.M.C.A tent nothing else happened worth recording\n","11":" Lovely fine morningit is a great change to see some sunshine. A few Taubes up this morning, but they were soonchased back by our anti-aircraft and aeroplanesrest of day and night quiet\n","12":" nice finemorning taubeup again, but he was soon chasedback. went to Bde sports this afternoon and they were afair turn out. nothing doing remainder of day. nothingduring night excepting concert & pictures at Y.M.C.A.\n","13":" nice fine morning. Brigade church service visitfrom General Birdwood remainder of day quiet.\n","14":"Lovely fine morning, expectto go into trenches this eveningcame here for good spelland had it\n","15":" Fine morningcame here last night & was in our dug-outs at 20 past10 o'clock. This is reserves seems to be quite. one of our aeroplane had a go with a Fockerbiplane this morning. there was a bitof machine gun fire after which the Focker got for his life &our aeroplane down well behind us we think he mayhave got hit. quite during night on fatigue duringnight. had a big night\n","16":" Fine morning, slept up till about 2 o'clock this afternoon it rained a bit thisafternoon. went on fatigue got back about ½ p 3 o'clockwas missed to-night it rained a fair drop during night abattery opened out about midnight and sent over agoodmany shells. it kept up for about a ¼ of an hour and sentthem over at the rate of about 40 a minute it was a 75Bty.\n","17":" Quiet during morning and excepting for theoccasional shell or two went on fatigue last nightgot back about 12-30 it was raining fairly heavy onour way back.\n","18":" a dull day with occasionalshowers went on fatigue to the same place aswe were at last night. they gave Fritz some straff while we were up there but he neverreplied while we were there. quiteremainder of night.\n","19":" went on fatigue again and had a Fritz some was but hedid not reply much. got home from fatigue about ½past 7 o'clock and did not on our feet as regards . They raided Fritz last night but could not findout proper details up to present quietreigned afterthe raid, except for occasional shells or two gunabout 350 rounds of ammunition went sky high butnobody was hurt. this was while the\n\n1916","20":" Fine day, quite except for the usual shells. went onfatigue about ½ past 8 O'Cand returned bout 4 o'clock in afternoon. aircraft buisy, Fritzs air-craft guns also buisy. one of our aeroplanes this morning brought driver out of we could see it going down in flames. The day ended up by two more of Fritzs ballonsbeing brought down with our. Rest of day quite.\n","21":" rain during morning but only showers went on water fatigue and that is road mending rained during afternoon quite remained of of day. \n","22":" Dull morning our guns up fritz early this morning quite day rained during afternoon\n","23":" Dull morning rained during day Fritz over to day, shelling has been fairly constant, the shelling got very heavy during the evening & continued up till about ½ Past 10 O'C. our guns opened upvery heavy about½ past 1O'C and gave it to them good & heavy for a good while, hear that the 1st Batt had 14 casualties. they are about 2 miles on our right\n","24":" Fine morning fairly quite heard that one of our fatigue party got hit last night. \n","25":" Cloudy this morning & showery. got here last night, had one case, in 3rd line of","26":" batt are doing fatigue here, quite remainder of day.\n\n\n\n\n","27":" Dull morning quite, expect to raid to-night had raiders went out about¼ to 2O'Clock, our raiders brought nothing back. had 7 or 5 casualties including Leut B as far as I can see it could not be called a success. one ofthe raiders reported missing after been seen dead on the missing is poor old let us hope that he is only wounded and is now a prisoner, if it is only with the huns. reported that 39 raids took place along the front last night but it is t be hoped that they were more of a success than ours, the germans do not appear to have this front.\n","28":" Dull morning inclined to rain exceptionally quite. expected to go out of the trenches to-night.nothing doing remainder of the day, exceptionally quiet.\n","29":" left Trenches last night came thro Ypres and camped at the dominion camp our old camp, left here again this morning and travelled about 9 miles full marching order we were into billets fairly early and camped in a barn,\n","30":" left billets early and travelled about 10 miles billeted in a barn again had lovely days for travelling both yesterday and today\n","31":" left billets early and travelled about 12miles, had a good day, but got billeted late. we are now in a big chateau. must have been a lovely place in peace time. do not expect to be here long St Omerwe passed over the line at Watten. this place we passed thro on our journey from the south\n","32":" quiet\n","33":" quiet\n","34":" quiet\n","35":" quiet\n","36":" leftlast night for St Omer were we entrained for Longpirie we got here about½ past 3 O'Clock, and billeted about 1½ miles from Longpirie\n","37":" Sunday had Church Parade this morning, it is very cold now, body is complaining about the cold quite remainder day.\n","38":" Left Longperie this morning and walked about 3 M where we got into motor buses and came on toAlbert were we arrived after a long walk and camped,\n","39":" moved this morning to our camp here on the road, mud is the main thinghere, we had no ideait was so bad\n","40":" Still here and quite\n","41":" still here more rain\n","42":" Still here and a drop more rain things are quite\n","43":" still here but expect to move the firing line to-morrow\n","44":" Sunday, wet day and plenty of mud leave here to-day for reserves\n","45":" Got here last night still raining and very muddy\n","46":" leave here to-morrow for supports\n","47":" Came into supports yesterday evening, had a couple of coming in otherwise quite\n","48":" had another case to-day sickness, expect to go into firing line to-morrow. it is inclined to rain.\n","49":" moved up here this morning it is cold and muddy we carried our Colonel out this morning shot by a sniper\n","50":" Same old thing bang bang. on each side, but I think our guns put in 20 to 1. sent over by the\n","51":" 1st Batt supported by our bombers attacked a german stronghold, but on account of the\n\nwet weather & state of ground it was not a success\n","52":" still cold and the trenches are very muddy heard to-day that our Colhas died. \n","53":" On account of thebombardment before the attack the other night we had some an entire M.G. crew excepting one man were wiped out the other night, the corporal was a fine chap\n","54":" Down in reserves now, it is not much of a place, we are surrounded with guns\n","55":" Fritz shelled to day but done no damage\n","56":" Fritz shelled again sent some H.E. over went close to some of the guns but otherwise done no harm, he also went close to our possy\n","57":" quite during day but aeroplanes buisy, seen one of fritzs come down in flames hit by our anti aircraft. it wasa great shot.\n","58":" the usual shells.\n","59":" quite during day, cloudy weather expect more rain. expect to be releived by the 4th Div to-morrow\n\n"}}