{"Document Name":{"0":"Diary_0267","1":"Diary_0267","2":"Diary_0267","3":"Diary_0267","4":"Diary_0267","5":"Diary_0267","6":"Diary_0267","7":"Diary_0267","8":"Diary_0267","9":"Diary_0267","10":"Diary_0267","11":"Diary_0267","12":"Diary_0267","13":"Diary_0267","14":"Diary_0267","15":"Diary_0267","16":"Diary_0267","17":"Diary_0267","18":"Diary_0267","19":"Diary_0267","20":"Diary_0267","21":"Diary_0267","22":"Diary_0267","23":"Diary_0267","24":"Diary_0267","25":"Diary_0267","26":"Diary_0267","27":"Diary_0267","28":"Diary_0267","29":"Diary_0267","30":"Diary_0267","31":"Diary_0267","32":"Diary_0267","33":"Diary_0267","34":"Diary_0267","35":"Diary_0267","36":"Diary_0267","37":"Diary_0267","38":"Diary_0267","39":"Diary_0267","40":"Diary_0267","41":"Diary_0267","42":"Diary_0267","43":"Diary_0267","44":"Diary_0267","45":"Diary_0267","46":"Diary_0267","47":"Diary_0267","48":"Diary_0267","49":"Diary_0267","50":"Diary_0267","51":"Diary_0267","52":"Diary_0267","53":"Diary_0267","54":"Diary_0267","55":"Diary_0267","56":"Diary_0267","57":"Diary_0267","58":"Diary_0267","59":"Diary_0267","60":"Diary_0267","61":"Diary_0267","62":"Diary_0267","63":"Diary_0267","64":"Diary_0267","65":"Diary_0267","66":"Diary_0267","67":"Diary_0267","68":"Diary_0267","69":"Diary_0267","70":"Diary_0267","71":"Diary_0267","72":"Diary_0267","73":"Diary_0267","74":"Diary_0267","75":"Diary_0267","76":"Diary_0267","77":"Diary_0267","78":"Diary_0267","79":"Diary_0267","80":"Diary_0267","81":"Diary_0267","82":"Diary_0267","83":"Diary_0267","84":"Diary_0267","85":"Diary_0267","86":"Diary_0267","87":"Diary_0267","88":"Diary_0267","89":"Diary_0267","90":"Diary_0267","91":"Diary_0267","92":"Diary_0267","93":"Diary_0267","94":"Diary_0267","95":"Diary_0267","96":"Diary_0267","97":"Diary_0267","98":"Diary_0267","99":"Diary_0267","100":"Diary_0267","101":"Diary_0267","102":"Diary_0267","103":"Diary_0267","104":"Diary_0267","105":"Diary_0267","106":"Diary_0267","107":"Diary_0267","108":"Diary_0267","109":"Diary_0267","110":"Diary_0267","111":"Diary_0267","112":"Diary_0267","113":"Diary_0267","114":"Diary_0267","115":"Diary_0267","116":"Diary_0267","117":"Diary_0267","118":"Diary_0267","119":"Diary_0267","120":"Diary_0267","121":"Diary_0267","122":"Diary_0267","123":"Diary_0267","124":"Diary_0267","125":"Diary_0267","126":"Diary_0267","127":"Diary_0267","128":"Diary_0267","129":"Diary_0267","130":"Diary_0267","131":"Diary_0267","132":"Diary_0267","133":"Diary_0267","134":"Diary_0267","135":"Diary_0267","136":"Diary_0267","137":"Diary_0267","138":"Diary_0267","139":"Diary_0267","140":"Diary_0267","141":"Diary_0267","142":"Diary_0267","143":"Diary_0267","144":"Diary_0267","145":"Diary_0267","146":"Diary_0267","147":"Diary_0267","148":"Diary_0267","149":"Diary_0267","150":"Diary_0267","151":"Diary_0267","152":"Diary_0267","153":"Diary_0267","154":"Diary_0267","155":"Diary_0267","156":"Diary_0267","157":"Diary_0267","158":"Diary_0267","159":"Diary_0267","160":"Diary_0267","161":"Diary_0267","162":"Diary_0267","163":"Diary_0267","164":"Diary_0267","165":"Diary_0267","166":"Diary_0267","167":"Diary_0267","168":"Diary_0267","169":"Diary_0267","170":"Diary_0267","171":"Diary_0267","172":"Diary_0267","173":"Diary_0267","174":"Diary_0267","175":"Diary_0267","176":"Diary_0267","177":"Diary_0267","178":"Diary_0267","179":"Diary_0267","180":"Diary_0267","181":"Diary_0267","182":"Diary_0267","183":"Diary_0267","184":"Diary_0267","185":"Diary_0267","186":"Diary_0267","187":"Diary_0267","188":"Diary_0267","189":"Diary_0267","190":"Diary_0267","191":"Diary_0267","192":"Diary_0267","193":"Diary_0267","194":"Diary_0267","195":"Diary_0267","196":"Diary_0267","197":"Diary_0267","198":"Diary_0267","199":"Diary_0267","200":"Diary_0267","201":"Diary_0267","202":"Diary_0267"},"Date":{"0":"unknown","1":508.0,"2":509.0,"3":513.0,"4":514.0,"5":515.0,"6":528.0,"7":529.0,"8":531.0,"9":647.0,"10":648.0,"11":651.0,"12":652.0,"13":653.0,"14":654.0,"15":655.0,"16":656.0,"17":657.0,"18":658.0,"19":662.0,"20":663.0,"21":664.0,"22":666.0,"23":668.0,"24":669.0,"25":670.0,"26":671.0,"27":673.0,"28":674.0,"29":675.0,"30":679.0,"31":680.0,"32":682.0,"33":683.0,"34":684.0,"35":685.0,"36":686.0,"37":687.0,"38":688.0,"39":690.0,"40":691.0,"41":692.0,"42":693.0,"43":694.0,"44":695.0,"45":696.0,"46":697.0,"47":698.0,"48":700.0,"49":703.0,"50":707.0,"51":708.0,"52":714.0,"53":716.0,"54":717.0,"55":718.0,"56":719.0,"57":720.0,"58":721.0,"59":722.0,"60":723.0,"61":724.0,"62":726.0,"63":727.0,"64":732.0,"65":735.0,"66":736.0,"67":744.0,"68":745.0,"69":746.0,"70":747.0,"71":748.0,"72":749.0,"73":750.0,"74":751.0,"75":752.0,"76":753.0,"77":754.0,"78":771.0,"79":778.0,"80":782.0,"81":787.0,"82":788.0,"83":789.0,"84":790.0,"85":791.0,"86":806.0,"87":813.0,"88":814.0,"89":815.0,"90":818.0,"91":819.0,"92":820.0,"93":821.0,"94":822.0,"95":823.0,"96":824.0,"97":825.0,"98":826.0,"99":827.0,"100":828.0,"101":829.0,"102":830.0,"103":831.0,"104":832.0,"105":833.0,"106":834.0,"107":835.0,"108":837.0,"109":838.0,"110":840.0,"111":843.0,"112":844.0,"113":845.0,"114":849.0,"115":850.0,"116":851.0,"117":852.0,"118":853.0,"119":854.0,"120":855.0,"121":856.0,"122":857.0,"123":861.0,"124":862.0,"125":863.0,"126":864.0,"127":865.0,"128":866.0,"129":868.0,"130":870.0,"131":871.0,"132":872.0,"133":881.0,"134":885.0,"135":886.0,"136":887.0,"137":888.0,"138":894.0,"139":899.0,"140":900.0,"141":903.0,"142":906.0,"143":910.0,"144":913.0,"145":917.0,"146":918.0,"147":921.0,"148":923.0,"149":930.0,"150":931.0,"151":935.0,"152":939.0,"153":940.0,"154":941.0,"155":942.0,"156":943.0,"157":944.0,"158":945.0,"159":946.0,"160":947.0,"161":948.0,"162":950.0,"163":955.0,"164":956.0,"165":961.0,"166":962.0,"167":963.0,"168":964.0,"169":965.0,"170":969.0,"171":970.0,"172":971.0,"173":972.0,"174":973.0,"175":974.0,"176":976.0,"177":977.0,"178":978.0,"179":979.0,"180":980.0,"181":981.0,"182":982.0,"183":983.0,"184":984.0,"185":985.0,"186":986.0,"187":987.0,"188":992.0,"189":1007.0,"190":1018.0,"191":1021.0,"192":1023.0,"193":1024.0,"194":1031.0,"195":1036.0,"196":1037.0,"197":1038.0,"198":1039.0,"199":1040.0,"200":1041.0,"201":1042.0,"202":1043.0},"Entry":{"0":"\n\n1915\n\n","1":" On","2":" I enlisted in the A.I.F. but owing to Father’s prejudice against my joining a fighting unit had to go into the A.M.C. I left work on","3":" inst & went into Camp at Liverpool on","4":" idem. \n","5":" Drafted into the","6":" of","7":" Battalion. I spent my first night with 14 in a bell tent. The following day I transferred to A.M.C. where I remained for some months. While there I did a little of everything & in general loafed for the whole time. Picked for Hospital Ship but returned because of over strength. While there I saw a lot of infantry training both new units,","8":" Brigade, and reinforcements & was convinced that the latter were sent away in a very raw state. Also the Royal Commission to enquire into certain allegations made against the authorities & Dr Schlink, O.C. Field Hospital, Liverpool\n","9":" Three days final leave during which news is received of Rol being killed in action on","10":" during the attack on Hill 60.\n","11":" Leave Sydney on RMS \"Moldavia\" in 11th Reinforcements of","12":" Field Ambulance with eleven others under Major Reid. Others were 6th of 12th L.H. & part of","13":" 4th Devons, T, returning to Colombo\n\nafter bringing German prisoners to Sydney. About 200 hundred passengers. Boat left at noon sharp, and a great crowd was down to farewell us & with the excellent weather we rounded South Head & made for Melbourne. The following afternoon we ran into a very heavy storm & could only see such places as Wilsons Prom & the Islands in the strait through very heavy rain & spray. On the morning of","14":" we made Port Phillip Bay & about 7 am moored at Port Melbourne. Leave until midnight. Tram or rail to City. Tram system very inferior. Small light cars which have to be pushed over loops. City very fine being laid out on block system with fine wide streets. Parks magnificent eg. Bot Gardens & Exhibition Park. The River is crossed by fine bridges, Princes’ B’dge being best. St Kilda Rd runs from City over a bridge to St Kilda & is the finest roadway in Australia. Divide for different classes of traffic & is planted with trees for its entire length. Site of many fine residences. In suburbs the electric (overhead wires) tram is in vogue. Watering places are rare. Brighton & St Kilda on the Bay being those which are most popular but are very inferior. No surf. Steamer to Geelong.\n","15":" Today another 400 men have come on board being the","16":" of 21st Batt. While they were embarking two stowaways got in through the port hole but were discovered before leaving the bay, though after casting off.\n","17":" On","18":" after a beautiful run we made Adelaide (Outer Harbour) Breakwater. Here we were allowed a few hours leave & visited Adelaide, 12 miles away by rail on R. Torrens. Adelaide is a very clean though small city with practically only two streets King William & Rundle. Away to the north stretch the Mt Lofty ranges rising from the outskirts of the town itself & where the fine residences are situate, among many fine orchards. The River too is a picture & a great contrast to the Yarra. Port Adelaide is half way to Outer Harbour. Tramway system not too bad but the Public Buildings form a beautiful cluster of buildings in fine grounds, comprising Govt House, Uni, Museum etc. Leave Adelaide at 3 pm. ","19":" The next few days were spent crossing the Bight in very heavy weather but on","20":" we entered Fremantle Harbour which is open but protected by a fine breakwater.\n\nFremantle is a very busy town but dirty with narrow streets, boasting of a tramway system (electric) like the Pitt St system. Perth is a few miles away by rail on Swan River which is much like Sydney Harbour in Places. The city itself is small but fairly busy & can boast of, in Kings Gardens, a beautiful playground. \n","21":" That afternoon we left Fremantle & watched Australian shores sink under the horizon & a day or two after we entered then tropics. The weather was fine but very hot most men sleeping on deck. On","22":" a concert was given for our benefit by the passengers & on the","23":" we crossed the Equator with usual ceremonies. ","24":" The ceremony is traditional in the British navy. \"Neptune\" comes on board & after ridiculous carryings on as emptying each person who hasn’t previously crossed into a bath, certifies as to his enrolment in the Log of Nep. \n","25":" We were expected to reach Colombo on","26":" & that morning I found the horizon dotted with black specks which on approach proved to be native boats or cadamarangs & by 7 o’clock we passed through the breakwater into Colombo Harbour. Colombo is a typical Indian city. All boats anchored out from shore there being no wharves & passengers are conveyed to shore by tenders. The harbour swarms with small boats, motor & otherwise, the police boat being very prominent. No sooner the anchor was down than the boat becomes the centre of attraction. Natives swarm over the side to offer their wares & to exchange their money as curios for many more times their worth. The coal barge comes alongside with a crew of dozens of natives & hand loading with bags, soon have their cargo on board. Then the merchandise, mostly tea comes on board in the same way. \n\nThe harbour is beautiful & sheltered by a fine breakwater & has for a land mark a huge lighthouse of high power. The City is on the right & to the left is a stretch of beach fringed with palm trees. Off the beach is the wreck of the P & O Steamer \"Nubia\" which ran aground. The Town is fine, boasting of a tramway system & some fine gardens. Rickshaws are in great prominence & are very cheap. A very interesting journey is to the Cinnamon Gardens & back through the Esplanade. En route you pass through the native & Malay quarters which are very filthy. Of Mosques there are many & a Banyan tree covering ¼ acre is a good sight. In the Gardens, Colombo Lake is the best sight & beautiful it is when the shores are dotted with native women of high caste in gorgeous coloured silk gowns.\n\nHere too is the home of the European residences. They are fine buildings in spacious grounds & surrounded with typical native vegetation. There are a few hotels of high repute ie Galle Face, Bristol, G.O.H. & of these the first is the most sumptuous standing in very spacious & beautiful grounds facing the sea. From that place to the town there is a fine esplanade running along the beach. Just previously a riot had occurred among the natives & a \"town guard\" of Englishmen had been installed & while there the men were inspected. Among the shipping in the Harbour there are always several river boats which are used to quell riots inland. When the \"Emden\" was running rife a big congregation of shipping had accumulated in the harbour & as a result of the Sydneys’ victory, was released. For this the Australian cruiser had gained a great reputation among the natives. English troops disembark.\n\nThat night we left Colombo for Bombay & the next morning found us off the coast of Western India. The scenery was grand. The sea was like glass and the coast is backed by the range of the Western Ghats. The slopes are covered with very rich tropical vegetation & every mile or so great high peaks tower up in to the clouds. To add to the scene two gunboats were between us & the shore. In places the water is very muddy showing the affluence of large rivers the sea. \n","27":" At midday on","28":" Bombay appeared in the distance & is even more typically Indian than Colombo with its numerous minarets & towers backed by the high hills of the mainland. The boats have to anchor out the passengers conveyed to shore by tender. Cargo is loaded as at Colombo & coaling is done by basket and among the workers a few women are noticeable. The city itself is on an island & the mainland is very hilly & in fact grand, covered with typical vegetation. Apparently the City has many fine buildings & the commerce must be great as there are many large boats always in the bay. Being so hilly the place is sheltered from winds & is very hot. No leave was granted here to any of the ","29":" troops but the next day a number of men commandeered the tender ‘Begum’, took charge & piloted & worked the boat to shore themselves. That afternoon we left Bombay leaving behind two men who had failed to catch the tender back to the boat & on the morning of the","30":" we anchored off Aden. ","31":" There is absolutely no town here but only the houses & quarters of the garrison troops & necessary businesses for their convenience.\n\nThe town is situated on a hilly cape of the sandy deserts to the north, the hills jutting straight up from the water. Some of the buildings are in the most inaccessible places & the hills are entirely devoid of vegetation. A couple of warships were in the bay. Here we found an entirely different kind of natives, the Arabs. We left Aden that morning & after hugging the coast of Arabia until 4.30 pm. Entered the Red Sea. Here was seen the grandest sight of the Voyage. The day had been perfect & now the sun is setting not over the ocean, but over the rugged mountains of that part of Africa. To the right is the island of Perim, a naval station, & beyond the next stretch of water the coast of Arabia. It is dusk & the lighthouse is alight & flashing up the Red Sea & as we enter the Strait of Babelmandeb the men & passengers crowd forward to watch a cable steamer pass through the same time. It is indeed the most unique sight of the voyage, the place where the \"China\" met her accident.\n","32":" After a good run up the Red Sea we entered the Gulf of Suez & next \n","33":" morning anchored in Suez harbour where we disembarked & entrained for our Egyptian destination. \n\nIn this voyage I consider we had the best time of any troops which had ever left Australia in this way. The boat was kept scrupulously clean & the food was of the best. The passengers treated us like little Gods & entertained us many times at concerts & kept us supplied in chocolates, cigarettes fruit etc. Of the English troops I have nothing but praise for the manner in which they strictly obeyed orders & drilled. They were always commended on the cleanliness of their deck. Their money is small & at ports we Australians arranged collections to enable them to have a good time. Consequently they held us in high esteem & were sorry to leave us at Colombo. Their strict English officer was a big contrast to our own, demanding a fullest extent of discipline. The men are certainly small of stature. Of the passengers, we have much to be thankful to in Mrs B Gwynne Hughes & Miss Churnside who disembarked at Port Said. Except for the second day out from Sydney the weather has been excellent though naturally very depressing & hot in the tropics. \n\nI must say that my first impressions of Egypt are not of the best as from the boat we can only see a long stretch of undulating sand. Hells entirely devoid of vegetation.\n\nNov 3 The railway journey to Cairo is I should say to a frequent traveller most uninteresting, but to me is a revelation. The country is nothing but sand but here & there along the route there are cultivation plots. Here too did I meet for the first time donkeys & camels being used as beasts of burden. There is only one station of any size viz Zag-a-zig. Tel-el-Kebir the site of the Battle of 1882 is en route. The journey occupies about 7 ½ hours. Also I was introduced to bully & biscuits on the train journey. At about 8.30 we arrived at Zietoun about 8 miles from Cairo (700,000) \n\nNov 4 Wake up on the Libyan Desert. In \"B\" Details Zietoun camp, the bulk being artillery men. Here is my first experiences of actual desert life, the sand stretching away for miles. Also too we are introduced to real discipline having to shave & dress properly for 2nd parade. \n\nRoutine Reveille 6. Breakfast 8. Parade 9. Dinner 12.30. Parade 2 – 4.30.\n\nIn the morning we usually go for route marches to places of interest eg. The tree under which the Virgin Mary rested when fleeing from Egypt & the well from which she drank. In the evening I went into Cairo. There are many Europeans resident here being mostly English & French. The natives are a cosmopolitan race but generally speaking they are filthy in their body & dress. Some of them however, very intellectual looking persons have adopted European methods of dress. The women mostly wear viels & are clothed mostly in black silk, the viel being cream. Those who are married have a wooden nose piece. \n\nThe tram service is fine there being a special service more like a train than tram, running to Heliopolis. There is 1st & 2nd classes & compartments reserved for \"Dames\". French is the language used on the tickets. The railway service is also good, 1st 2nd &","34":" classes. Cairo is served by two main stations Cairo & Pont Lemon . In dealing with the natives one has to resource to bargaining even more so than in Colombo but the natives invariably have to come down to the price offered. The City overrun with khaki the men usually congregating around the cheaper native public houses & the officers round ‘Shepherds or the Continental Hotels which are world renowned. The morality of the city is the lowest imaginable but these things I will leave to my memory. Currency is based on 1 Piastre being worth 2 ½d or 94 ½ for £ 1.\n","35":" To night I visited Heliopolis the fashionable resident suburb of Cairo. Here most of the well to do European people live. Among the fine buildings are a fine Catholic Church & the Heliopolis Palace now 1st Aust General Hospital accommodating at a pinch 3000 wounded.\n","36":" This afternoon I went out to Mena the site of the camp of the","37":" Aust Division. Here too are to be seen the greatest sights of Egypt vis the Pyramids, Sphinx & their appurtenant temples & also the River Nile in its annual inundation. Of the Pyramids & Sphinx every one knows & I witnessed the world renowned sunset over the desert with the Pyramids etc as a foreground. The Nile is crossed by fine bridges Gheziah Palace is the site of No 2 Aust General Hospital accommodating many men & standing in fine grounds. \n","38":" First church parade in Egypt & after I had a day in Cairo. Travelled in in a motor ambulance & may here remark that the rule of the road is \"keep to the right\" & there is no speed limit. The museum is place of chief interest in to-days peregrinations. It is very interesting in having many ancient works as well as the mummies of the ancient kings of Egypt including Rameses II One could easily spend a whole day here. In the afternoon I went too the Zoo the most important things to be seen are the Pontoons which the Turks attempted to cross the Canal last Febry. The vultures are the most interesting animals.\n","39":" Route march to the Oblisk which is covered with hieroglyphics. Here sugar \n\ncane is the chief object of cultivation.\n","40":" Route march to date plantation where I see the primitive methods of irrigation used by the natives. The ox & the water wheel with an endless chain of hide buckets in a well is the principle.\n","41":" Warned to proceed to the front on the morrow. Excitement among the boys. Great night in Cairo, possibly the last good time for a long time.\n","42":" Entrain for Alexandria. The run through is more interesting than that from Suez to Cairo being mostly along the Nile banks. When the river is some distance away a canal takes its place which is used both for navigation & irrigation. The river is extensively used for both purposes. is crossed in several places by fine bridges. There is also more cultivation & manufacture evident en route. Tanta is the chief station being a junction town of some importance. About 6 hours.\n","43":" Embarkation troopship \"Argylshire\" with 1500 men. A gun for submarine defence is mounted astern. Alexandria harbour shows signs of being a very busy shipping port but is not as big as Cairo (400,000). Hospital ships illuminated with Green band & a Red cross in electric light.\n","44":" Stand out to sea bound evidently for Lemnos Island. A strict lookout is being kept for submarines & all is excitement. Practice submarine & fire alarm. Lights out.\n","45":" 2 pm whistle sounded & all hands came on deck with belts on & on the horizon two objects were making for the ship. When they approached however they proved to be boats of the \"Orange Prince\" which had been torpedoed about 12 noon. There were apparently three men killed. Capt wirelessed for convoy & issued orders that lifebelts were worn day & night.\n","46":" This morning we awoke to find a British destroyer on our bows which is apparently escorting us to our destination. Our voyage now lies through the Archipelago. We pass quite close to the Islands & they are covered with villages nestling quite peacefully among the hills. Here too the sea is patrolled incessantly with Torpedo boats both English & French.\n","47":" Early this morning (12.30) we entered Mudros Bay, Lemnos fouling the net across its mouth for the prevention of submarine attacks. The Bay is full of shipping of all kinds, hospital ships store ships, troopers & vessels of war of all kinds. The illumination of the first kind of boats makes the bay very pretty. The weather is very rough & this morning we dragged our anchor & collided with a hospital ship. All night long the entrance of the harbour is lighted with a searchlight from one of the headlands. On shore there are signs of a big camp & the villages are typically of the islands passed en route.\n","48":" Hospital ship \"Aquitania\" enters port\n","49":" Olympic enters port with about 7000 troops for Salonika.\n","50":" French Hospital ship runs aground during the night but is towed off during the day. The French boats are painted grey with red cross on funnells.\n","51":" 29-30 The weather for the last few days is typical of bad weather here. The wind is fierce & incessant & very cold. It is snowing & sleeting & the navy has a bad time. I wonder how thing are on the Peninsular. L.H. reinforcements return to Egypt on HMS Mars.\n","52":" Hospital Ship \"Mauritania\" enters port\n","53":" Today we disembarked & proceed to camp at Anzac depot which is about\n\nthe worst position I have been too\n","54":" Visit Greek village which is typical of those scattered over the islands. It \n\nboasts of a church & a school & here too is a British Cemetery. The Greek takes advantage of the intake of khaki & converts his house into a shop charging extortionate prices for everything. The general contour of the island is mountainous but is fairly well cultivated. Corn is the chief crop. Pastoral pursuits are chiefly centred on mountain sheep & goats.\n","55":" Orders to proceed to the front. Embark on SS\" Osmanieh\" a boat of 21 knots & at 3.30 we left the harbour on voyage to Anzac where the Australian troops landed on","56":" A sharp lookout has to be kept for submarines & a 4.7 is mounted astern for defence. At 8.30 we anchored off Anzac beach. It presents a wonderful scene. The shore is dotted with dim lights apparently from the dugouts & occasionally a flare is thrown up into the air casting a bluish light over the sea. Occasionally the guns roar forth & the noise of a bursting bomb is even greater. All the time bullets are cracking overhead & potting into the sea. The splutter of machine guns is almost incessant as well as the sound of rifle fire. Out to sea a prowling destroyer is casting a searchlight round & occasionally a flash of a gun followed by a roar comes from the same source. The scene is weird but fascinating. All night we have been waiting to disembark & a couple of men have been shot before even we left the boat.\n\nDec 7 At 6.30 we disembarked & were conveyed by motor barges to the shore where we were ordered to Reinforcement Gully or Whites Gully. Soon the shells began to push their presence on us & among the first was one from Beachy Bill a battery of guns in the Olive Grove near Gaba Tepe. These guns have never been properly silenced although they have been bombarded several times. It has accounted for more men than any other individual position as it can command the entire stretch of sand marking the beach. Also it has the range of every valley in the place. The shell is preceded by a lazy screeching sound is invariably shrapnel.\n\nThe 75’s are marvellous the shells bursting one after the other with great rapidity. They are invariably shrapnel. This morning one burst a couple of yards down the hill but no damage resulted. At about 10 am after watching an 18 pdr reply to the Turks fire we were ordered to Anzac Gully (Headquarters) & then told off as reinforcements to the 2nd L.H. Field Amb. occupying a position at the foot of Victoria Gully. To-day a couple of cruisers & monitors were bombarding Gaba Tepe & by night we were all quite used to the bullets & shells provided they didn’t come too close.\n","57":" This morning I have good time to survey the place. Away to sea is the Island of Imbros about 15 miles. The beach only a few yards away but is made particularly dangerous by a sniper on Gaba Tepe. The hills rise up abruptly from the sea & are crossed with numerous gullies which were the scene of many a conflict on April 25th last. They are now named some after men who have distinguished themselves in that locality or after certain phases in the campaign. Away to the north the beach stretches till it comes to Suvla Bay where the English landed on August 6th. \n\nThe trenches are only about a mile away & the advanced portions are not as far to day as they were on the 25th April consequently there is not one place on the whole position out of range of even bullets. At places like Lone Pine & Quinns Post the trenches are about 10 yards apart. This morning we have been making dugouts & now the shells are quite common. The food is OK. This after noon we had to perform one of the two duties of a soldier which are to dig & carry water, viz to carry water from shrapnel Gully. I also went to the 2nd Bgde LH trenches to look for Harry but found that he had recd a comm. & was attached to the 6th Inf Batt.\n","58":" Water fatigues along beach to Casualty Corner under direct fire of snipers on Gapa Tepe. I am not quite used to bullets yet when they kick up the sand at your feet etc. \n","59":" The feature of to-day has been a big bombardment of Gaba Tepe the Olive Groves by three cruisers, two monitors & a couple of destroyers assisted by our land guns. The sight has been grand as spurt after spurt of flame runs along the entire length of each ship & finds an echo in the clouds of dirt from Gaba Tepe. Guns are 6\", 9.2\" & 12\" naval & 18 pdr land guns.\n\nThe Turks reply with the Beachy Bill battery & 75’s & a couple went appreciably close to the cruisers. Late in the after noon a couple of 8.2\" high explosive shells burst in the gully, coming from Chanak. Now our ‘plane is up directing the firing but clouds of smoke forming round it shows that it is the object of the Turks fire. A Taube flew over this afternoon & hailed down some machine gun’s bullets, bombs & darts but as far as I can see there is no one hurt. Our guns make closer shots than those of the enemy at the planes.\n\nDec 11th Last night I among others was hauled out of bed & told to pack up ready to leave this position & not having to come back. Everything packed I was given in charge of one of eight mule carts to move some of the gear of the unit. Everything seems to have been packed up & now I remember that several guns went down the road this afternoon & I ask are we evacuating Anzac. Half way along the beach my cart capsized & for a time I thought that the native driver had been killed. However the others went on & after a few hours waiting on the beach was assisted up to the pier with my charge.\n\nHere everything points to a big movement. Gear is packed in great heaps apparently ready for loading on to the barges & few men & guns are already embarking. The night is typical shells bombs & flares with machine gun & rifle fire being very pronounced. This morning we returned to Victoria Gully & in the afternoon went to the 6th trenches & met Harry who showed me through the trenches. I had a look at those opposite with a periscope Harry is also leaving to night, in fact the whole","60":" Bgde & the prevailing opinion is that we are going to make a fresh landing. But why send a brigade only ¾ strength & why our ambulance which is only ¼ strength. In my mind the position of Anzac is being evacuated, hardly credible & now I see the significance of the numerous graveyards round about.\n","61":" Last night I was again on duty at the pier & hundreds of men have embarked with their baggage & guns Harry & I included & are now on our way to Lemnos on the \"Princess Ena\" I worked as I have never worked before loading stuff on to the barge & then my idea became a conviction. Everything worked without a hitch & now Lemnos harbour is in sight again. The weather all the time I was on Anzac has been beautiful +\n","62":" Join unit at Sarpi camp. Camp life easy\n","63":" Route march to windmills on the hills. Here we saw the crushing of wheat for flour by the stones driven by windmill\n","64":" The withdrawal from Anzac & Suvla Bay is now an accomplished fact, accomplished with the loss of not one man & now only Cape Helles is the only position held on the Peninsular. Absolutely nothing of any value was left stores etc being burnt & a few old guns were blown up as a farewell a large mine much larger than any previous one was fired under the trenches of the Turks from the beach. The preparations were elaborate & worked without a hitch, the actual withdrawal being accomplished a day earlier than was anticipated. Every thing was left perfectly clean & many notes left for Jacko. To show those men last in the trenches direction the paths were all whitened so practically no one could be lost. The last man to leave was Gen Birdwood at about 3.30. At 4.40 the Turks bombarded the positions little dreaming that the trenches were empty.\n","65":" We have packed up ready to move at any moment & to day we have been issued with our Xmas extras including tinned fruit, puddings & billy from Australia.\n","66":" Still expecting to move.\n","67":" Reveille an address by General Munro thanking men for their work on the Peninsular & the excellent manner of withdrawal & Xmas greetings from King\n\n Brittannic in port as Hospital Ship \n\n1916\n\nJan 1st New Years Greetings by a nights rain which flooded our tent out.\n","68":" Marching orders. Baggage guard & have to load gear on to barges then again from barge on to ship \"Empress of Britain\" In fact I think this puts the finishing touches on my education. Wharf labouring loading slings etc to be put into hold. Leave Lemnos with between 5000 & 6000 troops on board, including Harry. The ship is fast being a CPR Express steamer mounting a 6\" gun & 8 machine guns. Strict regulations re submarines defence. Lifebelts to be worn throughout voyage & no smoking allowed after six pm. \nLemnos\n is a quaint place being inhabited with Greek peasants & dotted all over with small villages separated only by a mile or so. Industry is conspicuous\n\nby its absence, the only occupation of the people being growing corn & rearing mountain sheep & goats. The capital is a town named Castro but is of no considerable size. It is very hilly. In fact the island is typical of the Archipelago. Donkeys & oxen are the beasts of burden. The sunrises & sunsets in this part are superb having a grand effect on the water & mountains. The island is now overrun with khaki & navy blue & as well as being temporarily a great naval base many thousand pounds have been spent on road making (by Gypos) & erection of works of military significance. In the village of Therme it boasts of mineral springs but there is absolutely no means of travelling publicaly.\n","69":" Arrived in Alexandria harbour after a good run of 46 hours. Alexandria impresses me even more than previously. There are many fine wharves & the coaling facilities are excellent. The \"Southland\" torpedoed within 30 miles of Mudros is in harbour apparently in OK condition. We drew alongside the wharf at 6 pm & by 8 pm we had entrained for Tel-el-Kebir (a record for military organisation) On this run we were not even allow the luxury of carriages, even","70":" class but had to ride in iron goods trucks minus springs\n","71":" Arrived Tel-el-Kebir at 2.30 am & bivouac for the night but by 10 am we had pitched camp. Here everything to preparations for a big camp & a prolonged stay. There are tons of fodder, food, fuel etc here & everything is marked out as positions for the whole of the","72":" &","73":" Aust Divisions.\n","74":" Visit trenches of Battle of Tel-el-Kebir 1882 Camp routine is not very strict\n","75":" To day the","76":" &","77":" Australian Divisions were inspected by General Murry & the march past was very inspiring everything being on a war footing.\n","78":" Usual drill on the desert which is very firm here & while there a mirage was to be seen. They are often seen here & usually take form of a pool of water surrounded by bushes.\n","79":" It has been raining off & on since we landed in Egypt & to night we have had 7 hours rain continuously a record for some time in the memory of the natives.\n","80":" Leave & visit Cairo & this time I went through the mosques & citadel. The citadel is the old fort of Cairo & in parts it has been renovated & is in such a position as to command any point in Cairo. There is now an Indian hospital established here now\n\nFrom one of the towers you command a fine panoramic view of Cairo. The place is right on the outskirts of the town & the whole city lies before you. The river runs through like a silver streak & away in the background are the Pyramids & Sphinx. Napoleon occupied the Citadel in 1798 after defeating the mamalukes at the Battle of the Pyramids & while there he bombarded a mosque a few hundred yards away with 45 cannon shots one of which is in the walls to day. Of the mosques there are two worth mentioning one a new one & one that of Sultan Hassan, 608 years old. The latter is not now used but there is much fine work in its construction, gold & silver figuring prominently. Dove tailing of marble is feature. Circumcision bowl.\n\nThe new mosque, opposite to the old one is also a fine edifice. The place is covered with fine carpet & lighted with hundreds of electric lights. The work is in sandalwood, marble & alabaster inlaid with gold & silver. The marble is representing all kinds of familiar scenes as a stormy sea, cloudy skies etc. Women pray apart from men & have a part partitioned off for them. There are no carpets. It is now that I realize that Cairo is essentially a city of extremes. Immaculate & filthy, rich & poor etc without any medium. It is the place where East meets West, where Eastern peoples live in close contact with Western. Port Said is only the place where East passes West on their respective journeys.\n","81":" Orders come to hand at 8.30 pm that we have to move to morrow at 6 am. All night we have been working pulling down the tents & packing goods & at 1.30 we have all on the wagons ready to move.\n","82":" Move. Entrain at Tel-el-kebir in open trucks & thence to Serapeum on the banks of the Canal. Here everything was unloaded & then loaded wagons & men cross the canal on Pontoon Bdge. Here the sand is very soft & the wagons sunk up to the axles, ten horses to draw them out. Bivouac about 1½ miles from canal bank.\n","83":" Camp pitched & everything settled down Now we can go for daily swim in the canal & can watch boats going to & from Australia etc.\n","84":" Orders for ‘C’ section to move to railhead where we form a hospital for the men in the advanced trenches. We are now 5 miles from the Canal.\n\nThe Suez canal defences are most elaborate. The railway runs right up to the Western bank of the canal & that with barges from Suez, Port Said & Somalia can supply troops’ stores & ammunition at a moments notice. The canal is bridged with a pontoon bdge & with a punt transfers troops etc to the East bank. From here a motor railway & road runs out to 5 miles, Railhead where a supply depot & base has been formed. The advanced positions are at least 3 miles out. Daily patrols of N.Z.M.R. go out reconnoitring & along the bank of the canal a is drawn along every night & thus enabling the military to see if anyone has crossed the canal. Aeroplanes go scouting every two or three days.\n","85":" Visit advanced positions. There are no trenches but a series of redoubts separated by a few miles, commanding everything in front of them. They are formed by a maze of sand bagged trenches & have a front all round.\n","86":" 2-3rd Terrific wind storm. Typical sand storm of these parts. The sand is so thick one cannot see many yards ahead & the velocity with which it comes stings where it hits the bare skin. \n","87":" Rumour is rife & has it that within a month we will have left Egypt & be in either France or England. In fact everything points that way & various units have already received marching orders. Transport here is the greatest difficulty camels being mostly employed. For the evacuation of sick & wounded we alone have a sand cart with wide wheels drawn by mules, camel cradles which are two cradles one of which goes on either side of the camels hump & a sand sledge carrying two patients on stretchers drawn by horses. As for transport to Ismalia the barges & boats are used on the canal. We are allowed 1 gallon of water per diem per man. Active service rations.\n","88":" Return to Sera peum. Here all is activity where the whole of the Aust","89":" Division is now in camp. The whole of the forces have been divided & new battalions made from the old ones & these men together with 50000 from Home will make the Aust forces up to five divisions. We expect to move very shortly to will the prevalent & most likely rumour is to France where I expect the Australians will be used for a great offensive. Our own ambulance has been divided, B Section going to make the","90":" field Amb.\n","91":" Rumour is still rife but still nothing definite. Ships pass daily up & down the canal & there seems to be a concentration of transports at either end. All men are being inocculated & I may here note that of sick parade over 60% are venereal diseases. The Light Horse it seems are to be trusted with the defence of the canal & our bands are practising all National airs. Tommies are continually travelling along the road to Railhead & it looks as if they are taking over our places. \n\nA few hundred yards north along the canal are the bodies of fallen Turks who were killed in their attempt to cross the canal in","92":" They were once buried but now what with the effects of the wind & the men delving after relics have been unearthed. Only the other day one of our men overhauled a body finding a gold watch & a considerable amount of money. Major General Cheval","93":" Aust Div) at a parade accused the men who had interfered with the graves of the Turks & reminded them that many of their late comrades had been left in the enemy country & we left notes asking him to respect our dead.\n","94":" We have now received many reinforcements & our unit is now up to strength. Still empty troopships travel North along the canal & in fact marching orders for France have come to hand for part of","95":" Bgde. Battleship ‘Glory\" also went up to Port Said.\n","96":" Inspection of 1st Aust Division at Sera Peum by HRH Prince of Wales who accompanied by General Birdwood & a large retinue went the rounds & was heartily cheered. He is only a lad, a typical English Aristocratic son, very slight of build & very fresh complexion. All troops were broken off & allowed to please themselves at seeing him. Naturally he was surrounded & followed by a big crowd.\n\nThe troops have been now equipped with high velocity rifles which seems to point to \n\nclose range firing. Respirators have also been issued for protection from gas attacks\n","97":" We are now at sea on \"Ivernia\" one of the smaller cunarders. On 20th inst we struck camp most of the gear being left behind at Ordnance & on the","98":" a party of we ‘old hands\" were picked out as a advance guard to be prepared to move at a moments notice. In the afternoon we packed up & entrained & after several long stays at various stations arrived at Alexandria on the morning of the","99":" Open trucks were the means of conveyance & sleeping.\n","100":" The run to Alexandria impressed me more this time than last. From the canal bank to Zagazig the agricultural plots are rare & sporadic but after that both sides of the railway track has its irrigation canals & the crops are magnificent. Irrigation is very primitive in style the spiral wheel with the proverbial ox being greatly in evidence. There are several big manufacturing towns such as Tanta en route cotton seemingly being the chief product. There are many cemeteries along the line being evidenced by conical & other shaped mounds . The track is very good & enables very fast moving as one express for which we had to allow pass & crosses the Nile by very fine bridges. Near Ishmalia is another of the lakes & at present there are a couple of big warboats watching the canal. \n\nWe left Alexandria & Egypt yesterday afternoon & on this trip we have been allotted second saloon 4 berth cabins. Submarines are said to be in the vicinity of our track so great precautions have to be taken. The troops are now armed with the Lewis Machine Gun (Belgium) four to a Coy. (the Machine Gun section being attached to Brigade) which are capable of good work. They can be manipulated by one man & fire from revolving discs. The barrel is cooled by air chambers. \n\nEGYPT I first saw Egypt on","101":" & my impression confirmed all popular opinions ie that is a sandy waste & on seeing it I now say as has been before said that Egypt is made by the Nile Other than in the River valley the country is nothing but a waste of sand especially that part in the vicinity of the Canal but on the River bank & where the water has been brought by the aid of numerous canals the country lends itself well to agriculture. Maize cotton & sugar cane are the chief agricultural products. It very seldom rains other than in the months of Jany & Feby. when it does very often but in March strong winds spring up & carry the sand about for days. Dust storms as we know them are mere bagatelles in comparison. In October the River Nile \"Rises\" & not overflows its banks as popularly supposed. It floods particular spots & when I saw the Pyramids it was nearly over the Mena Camp site.\n\nCairo is the largest town (700000) Alexandria second (400000) but such places as Tanta Mansurah, Port Said Suez Rosetta Damietta & Zagazig are considered big.\n\nThe Suez Canals fine stretch of water about 90 miles in length & capable of taking vessels drawing up to 30 feet. At Sera Peum it is about 120 yards wide which place is between the two sets of bitter lakes. It is fringed on the west by a row of pine trees. The Egyptian people are generally speaking a filthy low down race but of course this is to be taken in moderation. There is a class of very well to do & highly intellectual people & a class who take offence at being treated as an ordinary fellaheen. He has established in the big towns many fine businesses & in fact makes a very fine business man. \n\nBut the great majority are content with their present lot, living in the filthiest hovels imaginable in the Cities, & in the country many families living in large mud buildings which also accommodates the family goat donkey hens etc. Their habits are correspondingly filthy & there seems to be a general lack of education of any sort (sb) From the smallest child to the oldest men ask for \"Backsheesh\" I sincerely hope that I never have to see Egypt again except going or coming through the Canal. In five days I expect we will be in the South of France a country exactly the antithesis to that we have just left.\n","102":" In the Mediterranean. Rumour now has it that our destination is Toulon. The sea is very calm & we are far away from regular routes. Boat drill on four blasts of siren every afternoon.\n","103":" Pass up the coast of Sardinia very rugged shore.\n","104":" About noon away to head could be seen the outline of the coast of France (the ambition of every Australian) & gradually it took definite shape. Great rugged hills covered with trees were a great change from the sands of Egypt. As we passed through the breakwater past the fine houses on the shore the Australian Flag was run up to the fore top & the band struck up \"Boys of the Dardanelles\" The town we cannot see well but all among the hills are beautiful houses for all the world like Mosman & Hunters Hill. The harbour is practically landlocked and the hills run right down to the\n\nwaters edge, the town nestling quietly at the foot Just as French towns are pictured. It was here that Napoleon made his name & here also that the French battleship ---- blew up with great loss of life. Small ferry boats ply from one side to the other. The Harbour is now protected by nets at the entrance constantly patrolled. Other boats travelling across from Alex have not been so fortunate in having the fine run we experienced. Persistent reports have it that the \"Miniappolis\" with Australians on board was sunken by sub the same day we left, just out from Alexandria.\n\n Fallacy no one on board \n","105":" Leave Toulon early in company with three other boats presumably for Marseilles. Sea fairly fresh. Arrive at Marseilles in company with five other transports & after running up our own flag & playing of bands moored in the docks. The dominant feature of this large city is seen long before you enter the bay viz Notre Dame on the top of a high eminence. The harbour is artificially formed, but crowded with shipping in spite of German alleged submarine menace. The wharves are magnificent and are behind a big breakwater & are packed with coal & merchandise. \n\nAnother feature is a bridge which crosses the harbour like an aerial punt suspended from a set of high rails. Taken on the whole the place is not nearly as pretty as Toulon but is also crowded to the foreshore with pretty villas nestling among verdant vegetation. At about 5 pm we disembarked but did not move off until night so had no opportunity of seeing the town. German prisoners are employed on the wharves which are constantly patrolled & they are housed in boats which are drawn out into the stream for the nights. Length of bayonets of the French. We entrained in a goods yard for what is rumoured a three days journey presumably across France & at 1.30 am moved on.\n","106":" Although I had no opportunity of seeing the scenery around the coast I awoke this morning to find us travelling through the most beautiful of countries in Southern France. All day we have been in the valley of the Rhone, on the river’s left bank & passing through large towns as Arles, Avignon, Valence Vienne & above all Lyons. The country is one mass of cultivation & is the scene of hundreds of prosperous homes. Orchards seem the most profitable undertaking. The greenness of the country is a great change to the solemn colouring of the Australian bush.\n\nAll along the route the people welcome us but I notice they are almost entirely womenfolk & are almost invariably in black. Besides passing through large towns we cross all the Eastern tributaries of the Rhone. There is a noticeable lack of natural vegetation but all the trees poplars in particular seem to have been artificially planted. All the trees are in blossom & look beautiful on their background of green. Lyons is by far the most magnificent town I have yet seen & I had only a glimpse of it as we dashed over the fine bridge across the Rhone. Fine buildings, streets with trees & squares & also half a dozen bridges across the Rhone. It is here that the river turns abruptly south from its course & also where it receives its chief tributary the Saone. \n\nTowards evening we still continue to be on a river bank but that of the Saone & on its right bank. This is also crossed by numerous bridges & for a few miles the site of many fine homes. In fact all along are many beautiful large houses & chateaux standing in very spacious grounds. I notice at some works en route women taking men’s places Munition works are largely evident.\n","107":" During the night we passed through Dijon & are now making our way along the bank of the Yonne a branch of the Seine. At Melun we come on to the latter stream & continue almost up to Paris. Along here the nature of the cultivation changes & wheat takes the place of Fruit. The Seine is a fine wide stream, divided into many locks & navigated by barges. It is connected to the Rhone with canals which are also navigated by barges. Great excitement is prevailing at the thought of seeing Paris & gives way to disappointment when we go round Versailles & St Germain. If we did not actually see the city we saw the aeroplane scouts which are constantly circling round it to give notice of any approach of hostile air craft. At Versailles we had a glimpse of the Tuileries which is a fine large palace on the banks of the river.\n\nThis morning I awake to find our train at Abbeville at the mouth of the Somme. During the night we passed through Amiens & other places & have now travelled from Mediterranean to the Channel. Our route now lies along the coast through Bolougne & around Calais then down through St Omer until we finally reach Hazebrouck. Pass French Airship.\n\nHere we pass through country sacred to Scott as all France is to Victor Hugo & the Rhone valley to Byron. The people here do not seem so well to do as those in the south & the towns of Boulogne & Calais are made up of long terraces of old cottages. Occasionally we get a look at the channel, which is constantly patrolled by destroyers. We are now billeted in an old house about 15 miles behind the firing line. We can hear the guns now & often I believe this village is bombed from the air. The Germans were right through this part at the beginning & well the people remember it. They committed many atrocities on children & destroyed much property.\n\nMy first introduction to the climate of France is enjoyable. There is a cold bite in the air which must be responsible for the rosy cheeks of all the French people. Last night we had a stay of about an hour at a village & many of the villagers turned out to see us. One little girl sang to us the National Anthem of Belgium France & England. They distributed eggs & bread to us & exchanged souvenirs. All along the girls gave us coffee at the stations & in fact they accorded us a great welcome seeing that we were far from the first batch to arrive.\n","108":" We are now billeted in the outbuildings of a farm well within hearing distance of the guns. We are about 18 miles from Ypres & not far from La Bassee & Loos. It is rumoured that we are going to take over Ypres with the Canadians.\n\nThis is a typical Flemish farm house & is very dirty. All the buildings are in a cluster house barns bails pigsty etc & in between the manure pits. The work progresses very little now since all the male population are away.\n","109":" Other section has now arrived & together we occupy two farms. The weather is beautiful. Aeroplanes here are \"more common than birds\" & occasionally an enemy’s ‘plane flies overhead. The great feature about this place is that we can get English dailies the day after issue. The village in which we are billeted is Strazeele about 16-18 miles from the \"line\"\n","110":" Weather changes & gives way to a dull leaden sky but no rain. Very cold & bleak.\n","111":" During the last few days we have heard many very heavy bombardments & seen very many ‘planes. We have been issued with two gas helmets & to- day they had to be tested. Each man had to pass through a trench filled with gas but the helmet was very effective. Then we were acquainted with tear gas which irritates the eyes temporarily destroying all power of sight. This is conveyed by ‘lacrymatrory’ shells. What with these tests & examination of","112":" Field dressings\n\nIt appears that we are moving on to the firing line early.\n","113":" Shift billet to Outersteene about three miles further on. This evening I went through the church graveyard at Herres. Among the tombstones was one dedicated to a lad of 19 a \"membre’ of the Junior Catholic massacre by the Germans in","114":" The Germans held all this district in October 1914 & committed many outrages both on men & women. The churches & buildings bear the marks of bullets & shrapnel. The religion of this country is rigidly observed. At every corner is a crucifix & in many of the houses are smaller ones. To day I saw a violent bombardment of an enemy ‘plane by anti aircraft guns. The brigade is now billeted alongside of us.\n\n Anti Aircraft Guns are mostly mobile. On motor lorries \n","115":" This afternoon we went into the town of Ballieul, about 10 miles from Armentieres which is frequently bombarded. It is the largest town in the district & is now the scene of much military activity. There are two old churches here, one dated 1635 & the other 1700 which have much fine work in their construction. Here we could also get many things which we could not buy in the villages as fruit postcards etc. The weather we are having is typical April weather, \"April showers & March winds. The place is a sea of mud in direct contrast with the sand of Egypt. Here also bombardments of hostile ‘planes are of common occurrence.\n","116":" Again visit Ballieul & this time had a look at the Aerodrome. We saw five bi-planes rise & one descend. Also saw a couple of monoplanes for","117":" time. Warned to move in the morning with advance party.\n","118":" This morning we (30) move off to Sailly sur la Lys in the rain & through by roads & sea of mud. Here we are about 28 direct miles behind the trenches but little is doing. We have taken over a dressing station & our division replaces the \"Bantams\" We’ve now come to the conclusion that for trench warfare the stretcher bearer is finished. Even from the Aid Post to the Motor Ambulance Rendezvous there is a wheel.\n","119":" Take over divisional baths & laundry which provides baths & clean clothing for troops. Here are about 80 girls employed in washing & mending clothes.\n","120":" Hostile aeroplanes are common. To-day the billets of the","121":" Batt were shelled with result of 17 killed & 60 wounded.\n","122":"\n","123":" Anzac Day Still at Sailly sur la Lys running the laundry. Lately it has been raining heavily & now the courtyard is half submerged. \n","124":" Sent off to the trenches to Eton Hall about four hundred yards behind the front line. Conditions A1. Fleurbaix section \n","125":" At Eton Hall. Big bombardment at 11 pm of the Enemy trenches & positions. Expected Gas attack.\n","126":" Return to A.D.S.\n","127":" Return to Laundry\n\n News that Townsend has surrendered posted in German trenches. Confirmed next morning \n","128":" Visit town of Estaires on River Lys. While there a shell burst in the town but no damage resulted.\n","129":" Germans shell Station of Bac St Maur with result of complete exodus of all the people & general disarrangement of work in Laundry. No damage. \n","130":" Trenches again. Battalions change over without one casualty. Visit front line & examine opposite trenches through periscope.\n","131":" Bombardment of Bac St Maur ","132":"\n","133":" During the past nine days things have been quiet & spring has been gradually putting the finishing touches of beauty on the fields & trees. The Australian","134":" Batt seem to have lost some machine guns & mortars through a bogus gas attack & officers are accused of leaving their posts. Our runs to the trenches have increased & now we are down to 24 on & 48 hours off. Experience two of our shells premature exploding to close to be comfortable.\n","135":" Retire to Rest Camp at Doulieu. It appears that the brigade does one month on duty in the trenches two battalions at a time. For this month things have been on our sector. (Fleurbaix – Fromelles) very quiet having only three or four casualties per night. While at Laundry I had good chance of seeing the temperaments of the French women. They are extremists & when things run smoothly, even though at any moment their homes may be shelled they are very happy but when they hear a shell en route for an object perhaps a mile away they become hysterical. They are as brave as their men at Verdun & work willingly at all things even to a mile or so behind the front lines. (In front of our guns)\n","136":" I am convinced that this place is overrun with spies & only yesterday the billets of the","137":" Batt were shelled with success. That morning though fine neither milkman paperman came & the plowman did not do his usual bit on the fields.\n","138":" Visit town of Merville on River Lys. It is far superior to Estaires or Ballieul & the church though modern is the finest I have yet seen in France. The people are a superior class to those of the other towns & speak a more refined language.\n\nThe country is still beautiful & the crops are in a more advanced stage of growth. Poppies are now making their debut for the spring & red hawthorn also.\n","139":" ","140":" Australian Brigade were to-day inspected at Sailly by Mr Hughes. This afternoon again visit Merville & en route see a close running duel between aeroplanes in which the Allied plane easily out distanced & out manoeuvred his adversary. The position at the trenches we have just handed over has become fairly hot & many casualties are the usual.\n","141":" News of the Battle of Horn Reef, at first it was bad but now we are convinced that the Germans got a little the worse. \n","142":" Admitted to hospital with septic knee. News of Lord Kitchener’s death from drowning en route to Russia.\n","143":" Discharged from hospital.\n","144":" At 12 midnight last, the clock was put forward one hour in consequence of the French adopting Daylight Savings Bill after the English precedent. Rumour has it that very shortly we will be moving to Ypres. To-day I had my first intro to a \"town crier\" who with his bell proclaimed decrees in the streets of Estaires.\n","145":" Move from Doulieu to Neuve Eglise via Steenwerke. Cross the frontier & we are now in Belgium about 8 miles from Ypres. The village of Neuve Eglise is one mass of ruins, by far the most desolate place I have seen. The houses etc are full of shell holes & many are only half standing. Great shell holes are all over the fields & there is an unexploded 8.2 German shell. The country is here hilly & the trenches are on a ridge about 3 kilos away. Plugstreet Sector.\n","146":" Some doubt as to our right of being here but to-day we visited plugstret which village is deserted & much shelled. There have been several gas attacks here lately & the crops have suffered severely.\n","147":" This morning I went on a working party to the A.D.S. about ¼ of a mile behind the line. The trenches are over a hill behind which the wagons etc can come right up to the communication trenches with perfect safety. The hill is heavily wooded with oaks & elms & affords great cover. Most sumptuous tea at Romani. Last night there was a gas attack along the line & the flares were sent up & gongs & bells rung as alarm. So far I havn’t heard of any casualties. The guns here are most cleverly concealed & one over the road, a 12\" howitzer is under a house made of canvas another in a stable of the same material. The guns are on railway trucks & can be moved in 20 minutes.\n","148":" Visit Armentieres which is almost deserted even though larger than any other place I have been in. It is very close to the line & bears many marks of fighting in the early days as well as of German shells. We saw a couple of shells burst, which were most remarkable. They seem to have burst several times & cast a shower of something like molten lead. They were lacrymatory shells according to\n\nsome persons.\n","149":" The preparations for the long looked for offensive are complete & the enemy trenches are daily subjected to a heavy bombardment & if the weather permits a gas attacks. The 12\" howitzer has opened & the Germans have replied but without any serious damage. A rumour has come to hand that the British have advanced some distance down the line.\n","150":" Confirmation of above rumour. Artillery continues active & the enemy have used gas.\n","151":" Still things are very active & it is said that within 14 days that the offensive in this quarter is to begin. To-night \"Bertha\" opened up again & the Germans vigorously replied with the result of four casualties one being a member of A section – Bull – now dead. I one of a stretcher party but had no case.\n","152":" We are ready to move again & a big one too. I think there are vague rumours of us going to the Somme & I feel sure that we are moving some distance. Artillery etc are all on the road & entraining. In Ballieu yesterday & had another good meal & a persons house. The son of the family prisoner in Germany since first week of Verdun attack.\n","153":" This morning we left Neuve Eglise for Ballieul & there entrained for where rumour said to be the Somme region. We travelled through Hazebrouk & St Pol to Doullens where we left train. This is France in reality & we are not sorry to have left Flanders. Rolling hills, woods etc. take the place of flat cultivation paddocks. \n","154":" Last night we marched from 6 pm until 2 am to Sur Champs a distance of about 18 miles (via St Ouen).\n","155":"","156":" from Sur Champs to Olencourt Chateau (Vignacourt) where we bivouac for the night 8 miles. Here we are in sight of Amiens the cathedral of which we can see plainly.\n","157":"","158":" from Vignacourt to Allonville about 10 miles. We are about 5 miles from Amiens. The country here is fine but of a limestone formation & broad acres of cultivation & grazing paddocks with many woods are the usual. We have now reached within 15 miles of the line where the advance lately took place.\n","159":" After a couple of days rest we have left Allonville in the direction of Albert & have now arrived at Vadencourt a march of about 9 miles.\n","160":" Lately we have been lectured etc as to our duty on the field & we were all looking forward to some real work. It has since transpired that the 3rd Field Amb are to work the Division in the field & we have moved to a rest Station at Warloy, about 10 kilos from Albert & 15 – 20 from the line. The Inf have been issued with distinguishing badges & have been moved forward. Everything looks as though the","161":" Aust Div have some tough work in front of them.\n","162":" Orders for \"B\" Section to stand by & be ready to move to the line in a moments notice. An attack is expected to shortly take place & we have everything prepared re dressings & accommodation. We plainly hear terrific bombardments & see the reflection of the explosions. \n","163":" For the last four days we have been in action in a most terrific battle the struggle for Poziers which has at last been captured after heavy casualties. On the evening of","164":" we were ordered to the front. We (no 12 Squad, & I) reached Albert about midnight\n\n 22 23 24 25 26\n\nat the time the preparatory bombardment was at its height & then moved on to the A.D.S at \nBecourt.\n Becourt near \nLa Boiselle.\n Here we turned in until morning & slept through the most terrific gunnery until 5 am when we moved to the Aid Post. Such a scene of desolation I have never imagined, the land being simply pock marked with great shell holes of the English bombardments. The villages of Contalmaison & Pozieres were simply levelled & the High Wood bared of all but a few stumps. \n\nAlong the road were many mangled corpses & the wounded have been coming in very quickly. Last night the","165":" & 3rd Brigades charged & established themselves on the outskirts of the village of Pozieres, Contalmaison being already in our hands, but with heavy casualties. Our work was hard & we suffered about 20 casualties including three killed. Dock & Bantry both being wounded (Rest to memory. We have now come out with the Division & are now bearing at the hospital for the 2nd Division who charged but owing to missing barbed wire, failed in their objective. Heavy casualties. \n\nAug 1st We are now resting at Warloy.\n","166":" A party of 20 including myself have been sent on to Puchevillers where we are doing the local bearing for 44th C.C.S. Things are not too bright & the food is far from the best, the head receiving the name of the","167":" Batt Green & white. The sisters vary as to personal charms etc.\n\nA congratulatory order was read out to us re the \"great gallantry’(?) displayed by the 1st Field & we have been congratulated by Birdie.\n","168":" General Birdwood to-day spoke to a party of us individually, & told us that to-night the second attempt by the","169":" Divn is to be made to gain German trenches. He is indeed a fine chap & speaks to men as affably as if we were on the same plane as himself.\n","170":" Leave Puchevillers to-day after a week’s work & a good time? Although none of us were crimed it was not the fault of one of us, what with arguments with the NCO’s & nurses. Arrive at Halloy-Genoes.\n","171":" To-day I am 21 & have had a small turn out, eggs etc champagne. \n","172":" Move to Wargnies. This evening I visited the Sousterrain at Naours. These caves were built as a refuge from invasions as far back as 850AD & can accommodate 300 families, from the surrounding districts (see copy of notice)\n","173":" Move to Herrisart a few miles further on where the Ambulance has congregated.\n","174":" Move to Brickfield Hill, overlooking Albert. The march was about twelve miles & no sooner had we laid our beds in the paddock than Fritz sent over about six shells fortunately doing damage \n\nAugust 15th Bearers A.B & C march off to Becourt where we leave our packs & then move off to various stations. We are detailed for Pozieres & the right where 6th & 5th Batts are in. Our carries are heavy especially the","175":" which is through a narrow sap. In the afternoon Harry Rogers came through wounded but it is only a flesh wound in the leg.\n","176":" This morning also a German plane was brought down in flames by one of our machines. In fact there were two.\n","177":" Retire to C. Corner where we load wagons for 24 hours. (spell.\n","178":" Again at 5th Aid post where to-day the shelling is very severe. This evening our relief was caught in a dugout, four being killed viz. Cunningham, Lehane, Elliot & Smith. Also one wounded at Pozieres.\n","179":" Back again at Casualty C. but we were called back to the Aid post as reserve for the 8th Batt’s attack.\n","180":" Three attempts were made to take the German trench after a terrific bombardment at 9 pm last night, but without success. However they dug in in front of their objective with not too many casualties\n","181":" nd \nAgain at CC for a spell\n \n\nYesterday & to-day we have been on the Pozieres carry but not much to do until this morning after an attack on the left. At 11 am. the Ambulance was relieved & we move back to Brickfield.\n\nAugust","182":" from Brickfield to Warloy. One night lately a shell burst on C Corner & wounded Capt Graham slightly. We have since heard that he has died of gas gangrene.\n","183":"","184":" from Warloy to Beauval, a couple of miles from Doulens. I don’t think that these divisions will return to the Somme front & I know that we have been detached from the 4th Army to which we were temporarily. I think that the Australians have fully justified their being transferred but the price has been heavy. I think we will return to the Armentieres dist.\n","185":" Spend day at Beauval & I notice that Col Lawson has been killed in action.\n","186":" At 1 pm we left Beauval & entrained at Doulens. The country down here has completely altered in as much as the crops have been cut & are stooked in long rows. For miles you can see long rows of these stooks.\n","187":" At 3 am. we left the train at Hopoutre siding a couple of kilos from Poperinghe (Belgium) & went to billets in huts a couple of miles from the town. This afternoon we went into the town which is typically Belgique & very old & is of some size. It is often shelled from Ypres direction. We are about 12 kilos from Ypres.\n\nThis part of the country is fine now the hops have matured & there are many fields in this district which is famous for them. In the town real Brussels lace can be obtained at high prices 200 fr. for a handkerchief.\n","188":" Move to take over D.R.S at Remi Siding about a mile the other side of Poperinghe. \n","189":" We have been doing very little here but indulge in sports of all kinds & walks. To-day we held a Grand Sports Meeting & the events were great, mounted & on foot. A few days ago I visited the Mont des Cats from the top of which a great panorama can be obtained. Armentieres, Ballieul, Ypres (cloth hall) Poperinghe, & some say even Dunkirk can be seen.\n","190":" Still at the D.R.S. & having a good time. This evening we are having a dinner & a distribution of the prizes won at the sports. Also lately the Military Medals\n\nAwarded to men of the unit were distributed. Dingle Ross, Murphy Phillips & Sgt Clapton being recognised.\n","191":"\n","192":" Lately a couple of observation balloons have been brought down by German ‘planes, fired\n","193":" I have now been away one year six months of which has been in France. We are running a D.R.S. near Poperinghe Belgium after coming out of our part of the Somme offensive.\n","194":" The weather here is very changeable & every day it is windy with an overcast sky. However the days are not cold & we have had very little wet weather. The trees are gradually losing their leaves & some changing colour to Autumn tints. All crops have been gathered wheat stooked hops bagged & the flax stripped. In fact the country is looking much the same as when I saw it first. To day I visited the local ‘drome & had a good look at the ‘planes.\n\n& had their business fully explained. We are moving in a few days apparently to St Omer but after that our destination is obscure.\n","195":" Move this afternoon to Steenvorde, a town within French border, 8 miles from Poperinghe.\n","196":" Leave Steenvorde at 11 am & marched about 12 miles to Villet about 5 miles north of St Omer. En route we skirted Mont des Cats & Cassel from which a view of over 400 Towns & villages is to be had. Coast of England can be seen on clear days. The country is beautiful hopfields giving way to pastures & fine trees. Cassel is a fashionable health resort. More I see of France the more I am enraptured with it. Berries now galore, blackberries raspberries & currants.\n","197":" Continue our march at 11.15 am on a beautiful day to La Recousse, near Nordasques on 1 St Omer Calalo road \n","198":" At nordasques. P. de C. 20 miles from Calais. Visit Ardres & the Field of the Cloth of Gold. Record my first vote on Conscription issue.\n","199":" Still at Nordasques. Visit adjacent village of Turnehiem through which runs a light railway Calais, St Omer, & Boulogne. Villages very quaint, water mills being very much in evidence.\n","200":" Expect to move to morrow\n\nOct.","201":" to St Omer late in evening & there entrain but I had no opportunity of seeing the town.\n","202":" In Dept. of Somme once again. Journeyed via Calais Boulogne, Abbeville to Longpre, about midway between Amiens & Abbeville on Somme river from where\n\nWe march to Billets at Bouchon. Visit L’Etoile where there is a big factory for making sandbags. Now in 4th Army.\n\n"}}