{"Document Name":{"0":"Diary_0374","1":"Diary_0374","2":"Diary_0374","3":"Diary_0374","4":"Diary_0374","5":"Diary_0374","6":"Diary_0374","7":"Diary_0374","8":"Diary_0374","9":"Diary_0374","10":"Diary_0374","11":"Diary_0374","12":"Diary_0374","13":"Diary_0374","14":"Diary_0374","15":"Diary_0374","16":"Diary_0374","17":"Diary_0374","18":"Diary_0374","19":"Diary_0374","20":"Diary_0374","21":"Diary_0374","22":"Diary_0374","23":"Diary_0374","24":"Diary_0374","25":"Diary_0374","26":"Diary_0374","27":"Diary_0374","28":"Diary_0374","29":"Diary_0374","30":"Diary_0374","31":"Diary_0374","32":"Diary_0374","33":"Diary_0374","34":"Diary_0374","35":"Diary_0374","36":"Diary_0374","37":"Diary_0374","38":"Diary_0374","39":"Diary_0374","40":"Diary_0374","41":"Diary_0374","42":"Diary_0374","43":"Diary_0374","44":"Diary_0374","45":"Diary_0374","46":"Diary_0374","47":"Diary_0374","48":"Diary_0374","49":"Diary_0374","50":"Diary_0374","51":"Diary_0374","52":"Diary_0374","53":"Diary_0374","54":"Diary_0374","55":"Diary_0374","56":"Diary_0374","57":"Diary_0374","58":"Diary_0374","59":"Diary_0374","60":"Diary_0374","61":"Diary_0374","62":"Diary_0374","63":"Diary_0374","64":"Diary_0374","65":"Diary_0374","66":"Diary_0374","67":"Diary_0374","68":"Diary_0374","69":"Diary_0374","70":"Diary_0374","71":"Diary_0374","72":"Diary_0374","73":"Diary_0374","74":"Diary_0374","75":"Diary_0374","76":"Diary_0374","77":"Diary_0374","78":"Diary_0374","79":"Diary_0374","80":"Diary_0374","81":"Diary_0374","82":"Diary_0374","83":"Diary_0374","84":"Diary_0374","85":"Diary_0374","86":"Diary_0374","87":"Diary_0374","88":"Diary_0374","89":"Diary_0374","90":"Diary_0374","91":"Diary_0374","92":"Diary_0374","93":"Diary_0374","94":"Diary_0374","95":"Diary_0374","96":"Diary_0374","97":"Diary_0374","98":"Diary_0374","99":"Diary_0374","100":"Diary_0374","101":"Diary_0374","102":"Diary_0374","103":"Diary_0374","104":"Diary_0374","105":"Diary_0374","106":"Diary_0374","107":"Diary_0374"},"Date":{"0":"unknown","1":1424.0,"2":1483.0,"3":1484.0,"4":1572.0,"5":1573.0,"6":1586.0,"7":1587.0,"8":1588.0,"9":1591.0,"10":1592.0,"11":1594.0,"12":1595.0,"13":1596.0,"14":1598.0,"15":1602.0,"16":1603.0,"17":1604.0,"18":1612.0,"19":1613.0,"20":1614.0,"21":1615.0,"22":1616.0,"23":1618.0,"24":1619.0,"25":1620.0,"26":1621.0,"27":1622.0,"28":1623.0,"29":1624.0,"30":1625.0,"31":1626.0,"32":1628.0,"33":1629.0,"34":1630.0,"35":1631.0,"36":1632.0,"37":1633.0,"38":1634.0,"39":1635.0,"40":1636.0,"41":1637.0,"42":1639.0,"43":1640.0,"44":1641.0,"45":1642.0,"46":1643.0,"47":1644.0,"48":1645.0,"49":1646.0,"50":1647.0,"51":1648.0,"52":1649.0,"53":1650.0,"54":1651.0,"55":1652.0,"56":1653.0,"57":1654.0,"58":1655.0,"59":1656.0,"60":1657.0,"61":1658.0,"62":1659.0,"63":1660.0,"64":1661.0,"65":1662.0,"66":1663.0,"67":1664.0,"68":1665.0,"69":1666.0,"70":1667.0,"71":1668.0,"72":1669.0,"73":1670.0,"74":1671.0,"75":1672.0,"76":1673.0,"77":1674.0,"78":1675.0,"79":1676.0,"80":1677.0,"81":1678.0,"82":1679.0,"83":1680.0,"84":1681.0,"85":1682.0,"86":1683.0,"87":1684.0,"88":1685.0,"89":1686.0,"90":1687.0,"91":1688.0,"92":1689.0,"93":1690.0,"94":1691.0,"95":1692.0,"96":1693.0,"97":1694.0,"98":1695.0,"99":1696.0,"100":1697.0,"101":1698.0,"102":1699.0,"103":1700.0,"104":1701.0,"105":1702.0,"106":1703.0,"107":1704.0},"Entry":{"0":"\n\n","1":"\n\nLeft Adelaide for Blighty\n","2":"\n\nArrived Devonport\n","3":"\n\nMoved to Warminister\n\n1.18\n\nWent to Pioneer School at Reading\n","4":"\n\nLeft for via Southampton France\n","5":"\n\nArrived Le Havre\n","6":"\n\nLeft Le Havre for the Battalion\n","7":"\n\nWent to the end of the line in mistake & finally got out at Candas. Slept there that night in old flying camp sheds\n","8":"\n\nLeft Candas at 10.30 pm & marched to Fienvillers. Got billeted\n","9":"\n\nWent for route march thro Autheox. Only a small village.\n","10":"\n\nLeft Fienvillers & came to Ergnies. We passed thro Berneuil, Franqueville & Gorenflos. We s'uposed to stop at the latter but couldn't get billets. At this place 'Ergnies' we did fairly well. Two of us got a bed. Arrived about 3 pm & after we got settled down two of were sent up to an aerodrome. Had afty tea & met an Airs in the Corp. Have been promised a ride for tomorrow\n","11":"\n\nNo luck for flight. Was too windy. Left Ergnies & moved to Pernois. Passed thro on the way Brucombs, St Oven, & Bertedycourt. Met Dad Hetherington at Pernois\n","12":"\n\nLeft Pernois & moved to Villers Bocage. Passed thro on the way Cannaples, Haverrias & Flesselles. Kunckey & Dean caught us up.\n","13":"\n\nLeft Villers, Bocage & moved to Bussy les Daours, Passing thro. Coisy, Cardonette & Allonville. From Bussy we moved to Blangy-Tronville & joined the Battalion.\n","14":"\n\nLeft Blangy & moved to Bussy. Passed thro. Daours on the way.\n","15":"\n\nWorked at Aubigny\n\nFritz crack airman killed.\n","16":"\n\nWent to Corbie but couldn't get a thing. Could have saved a big clock but it was too heavy.\n","17":"\n\nSlept in out new dug\n\nout last night. It got a good christening as we had to stand to at 3 am. Fritz attacked at Villers Bretenneux at that time. Didn't do any work but stook to all day.\n","18":"\n\nStarted back on our work again after out stand to. Had 2 hours parade a day doing RE. PT, gas drill & BF. was goodo.\n","19":"\n\nWent up to Villers Brettoneux & got a gas helmet, steel helmet & some bullets from some dead Fritz. Got shelled everywhere we went.\n","20":"\n\nNo 8 Platoon played the Transport Cricket. We won by 6 wickets. Made 0 first innings of the 2nd was bowled l.b.w. each time by shoots. Got 7 for about 14 in the","21":" innings & bowled very well.\n","22":"\n\nHad to go miles to out job today. Didn't get back till 3.20. Went out & had a good look at Fritz trenches. Was goodo. Started to play cricket but it started to thunder lightening & rain to some order that it has to be postponed. No bon.\n","23":"\n\nThe company moved from Bussy closer to the line. Had to dig in again. Gee it is getting monotonous. My platoon placed about","24":" mile away from the action.\n","25":"\n\nHad a terrible night going to work . Fritz caught my platoon as we were going to work with 2 barrages of HE & a little gas. Had 1 killed. 2 seriously wounded & 2 others wounded. All slightly gassed, but personally I think from the HE as they burst right on the trench. We got in after the first couple of shells. Went up & had a look at the other platoons. We were the only platoon caught.\n","26":"\n\nSent out & buried poor Mueers. Acres I think will die. Hope not 'cos\n\nhe was a good & bright boy.\n","27":"\n\nCapt Wilkinson was promoted to Major last night. Dates from the","28":" Was shelled on the job, but no casualties.\n","29":"\n\nBombed & shelled all round our camp. Kept us all awake. Time we had a good sleep I think.\n","30":"\n\nGot home early from work. Went out 8.30 pm & home at 12.30 am. Goodo. Things fairly quiet. Left our camp & came back to the battalion at Bussy. Do me. Guess we will have a sleep tonight. Very quiet here. Just heard that Appleby has died (as well as Acres) of wounds. Very bad. Am very sorry indeed. They were all good boys.\n","31":"\n\nNo work today. Drew 150 francs (£ 5\/10\/.) & sent £ 4\/4\/-over to Blighty for a course in Pelmanism.\n","32":"\n\nSome hot, went out to work on another switch trench near Villers Brettoneux. Only took us 2 hours to get out, 4 ½ hours work & 1 ½ hours to come home. Far too hot for this work. Fritz machine shot down behind our lines. Best I've seen. Gee he came down some hitting the earth with a crash.\n","33":"\n\nGo out on night work again. Just as well too as it is hotter today. Fritz bombed all round our camp last night.\n","34":"\n\nMy spell home tonight. Perkins took my platoon out.\n","35":"\n\nGot shelled a bit. Had to run for my life coming home. Fritz bombed. Could hear the bomb coming. Grabbed hold of the S.B & we ran. Just as well too as it dropped only a few yards from where we were.\n","36":"\n\nLittle bit of gas tonight. Everything OK tho.\n\nSome bombing very near the camp.\nLt. Dick joined the \n","37":"\n\nPlenty of bombing tonight. Much nearer than usual to our little camp. Stevenson got knocked down but wasn't too bad. Dick joined the Coy.\n","38":"\n\nGot a York attached to the Coy for instruction. We only have 9 officers here with the Coy now. Went out on the trench digging job again & finished.\n","39":"\n\nHad a spell all day & night. Quite a change.\n","40":"\n\nStarted making dug outs for artillery (our own).\n","41":"\n\nYork left & rejoined his Unit. He was a very decent bird. Enjoyed him. Got quite a lot of news from him. My spell tomorrow. Do me.\n","42":"\n\nWent out on the artillery dugouts again. Had 1 casualty. 1 of Scrivens men getting wounded. Was very lucky as he kept peppering the job all day with 5 g's.\n","43":"\n\nThe platoon has a spell today. Had an inspection & our usual game of cricket. Generally have a game after we come home from work. Had a look at an armoured car & then went to Daours for a bath. Was excellent. Did me. Vi's parcel from the Daily Mail arrived. Am going to see a boxing mach tonight at Daours.\n","44":"\n\nThe show last night was excellent. Thoroughly enjoyed it. Platoon has another sepll today. The first three books on Pelmanism. No letter from Vi. Think I'm turned down for keeps. Fritz has been busy with his checking. Fritz cam over last night but didn;t drop a bomb. Dead lucky. The platoon played the\n\nTransport boys cricket & we won easily – made 141 to 51. Managed to get 3 wickets & made 12. Coming on.\n","45":"\n\nOut to work again today. Fritz was fairly busy with his shelling. No casualty today. The Officers played the NCO's & men of the battalion cricket today. We got them out for 72 (got 4 for about 16 or so) & we them out for 72 (got 4 for about 16 or so) & we only made 24 (made 1). Started reading the Pelmian books.\n","46":"\n\nHad a bath. church parade this morning. Some stunt. Played cricket in the afty. & bowled very well again. Have done very well with the ball lately. Had a parcel of books & some writing material from Marie Fraser. Was goodo.\n","47":" of my boys are picked for the battalion cricket team. We play the ASC on their ground tomorrow. Am also in the team.\n","48":"\n\nDid some tactical exercises in the morning. Gee they were some mix up. We played the 29th A.S.C. cricket in the afternoon & beat them very easily. Won by an innings & 42 runs. Didn't have a hit as I went in last the other boy got bowled first ball. Got 4 for 27 tho so did fairly well with the ball.\n","49":"\n\nMore exercises today. Got inoculated just before lunch. Lt Guest & Wilson retd today. they make 10 in this coy. wrote a couple of letters in the afty & did some Pelmian. Both Guest & Wilson were sent to other coys.\n","50":"\n\nIll all day from inoculation. Had a terrible night. Tried to go out to work but couldn't manage it.\n","51":"\n\nA little better today but am still fairly seedy. Went to work tho.\n","52":"\n\nGoodo today, altho. arm is still swollen. Started a cricket match against the 4th Div. HQ. We made 73 & 106. Made 4 & 14 & got 1 wicket in the innings for 14. Happened to get going at\n\nright time. We had 7 down for 60 3h4n I went in – we brought it up to 90 odd. They made 51 in their innings. We finish the game tomorrow. Look in a good winning position too as we have 3 of them out for 16. Have 2 good solid bats in now tho against us.\n","53":"\n\nWorked in the morning & finished the game in the afternoon winning by 22 runs. They made a good start. Only got 1 wicket but 2 or 3 chances were dropped. Bad luck, still as we won I let them off.\n","54":"\n\nAnother church parade today. Getting sick of this padre. He talks far too much. He is a Salvo. bird & shows it very plainly. Still I guess will get on with him alright.\n","55":"\n\nFinished our work before 10 am. Only took us 1 ½ hours. C.O. had all officers up & gave them a little bit of news about the war. After this meeting No 8 Platoon played rest of 'B' Coy at cricket. We won by am innings & 23 runs. Actually got going this time & made 19 not out. Something unusual for me.\n","56":"\n\nPlayed the D.A.C. cricket at our ground. They went thro us in the 1st innings. Only made 18. Got them out for 43 & then we made 90. I made 4 in the first innings & 0 in the second. We got them out for 57 & so we won by 8 runs. Bowled well getting 3 for 5.\n","57":"\n\nBonney couldn't party tonight. The Kookooburra's gave us a turn They were excellent. The officers from HQ & A Coy played B.C & D. We got them out for 30. Both Hassell & self getting hatrick. We made 125. I made a duck. Got caught out first ball. Tried everyone bowling in the second innings & they made 135 so we only won on the first innings. They wouldn't let us bat in our second.\n\nOfficer from 2nd Pioneers came down to take our camp over. We move up the day after tomorrow to take over from them.\n","58":"\n\nPlayed","59":" D in the cricket \ntomorrow\n today. Scores were they 64 & we 92. I made a duck again but managed to get 2 wickets for 11 so did alright. Osborne came round to see me today.\n","60":"\n\nLeft Bussy & went to a spot near Heilly. Passed thro La Werville & Bonnay. Left camp at 6.42 am & arrived there at 10 am. Gee we had to climb 2 hills & they were beauties. Went out & had a loook at our work in the afternoon & at 10 pm had to take out a party & get a start.\n","61":"\n\nRained this morning making everything slippery. This is a boring camp. Only one disadvantage & that is shortage of water. The rain didn't last long. The \ndeg\n job is goods. Do me.\n","62":"\n\nThis camp is near enough. Old Fritz can see it quite plain but the trees protect us. Of course there is very little movement here now. Everything is as quiet as possible. the Tommies made a stunt on our left last night & old Fritz pushed artillery back at us. Got 14 letters today.\n","63":"\n\nRained some today. Kept going too nearly all day. Our little home was some slippery. Could hardly move about.\n","64":"\n\nFinished our job, or rather finished on the job at the","65":" Field Coy took over from us. We go our on the road work tomorrow. Old Fritz shelled just below our home & pieces flew across the place. Will write 'John Bull' about it all if things don't alter.\n","66":"\n\nWent out on the road work. It is near Heilly. After we got home we\n\nfound out that only one platoon is to keep on the road work & the rest are on CT on the front line. Going to our job was rotten, Up hills & down hills. Gee it wasn't too good.\n","67":"\n\nDidn't go out on job tonight because of a raid by our people. We could only work for about 1 ¾ hours as they wanted to use the truck so it was a waste of time going out.\n","68":"\n\nBoring day today. Wilsons came out & had lunch with us. Started on our job at the front line. Everything went well.\n","69":"\n\nGot out of bed at 1 pm. Some cold today. Rained just enough to make our track to work slippery. Big clouds of mist came along & disappeared, all night. We sent over gas at Fritz just as our boys finished their task.\n","70":"\n\nSyd Halford came along to see me this morning while I was still in bed. Had a good old talk of our Sydney days. Got my first letter from Phyl Barber. Wrote to Alec. Howlett. Fixed a new spring in out phonograph this afternoon & we played it to death for an hour or so afterwards. Real bonny day. We went to work as usual but were short of shovels so had to go round & look for some.\n","71":"\n\nWhile looking for shovels we came across some old Fritz positions. Gee they were knocked about some. Couldn't find any shovels so took Sgt Klunke up to the front line for them. While there old Fritz started putting over shells. We couldn't move as they were all round us. Eventually I stopped a lot of earth from \nthe\n a shell. was too close for further damage. It burst about 2 ft away from me on the edge of the parapet & trench. Got all my face peppered. Gee it is some picture. Should\n\nhave my photo taken now. Guess it would be worth something as a picture too. Didn't go out to work tonight.\n","72":"\n\nHad to go down to the 14th Field Ambulance today & let another Doctor have a look at my face. Very nearly sent me away but decided to have another look tomorrow. Gee it is some sight, & my eye looks real well. Am not going out to work tonight.\n","73":"\n\nWent to the 14th F.A. again. My face is on the improve now. My eye is swollen a bit more but is improving a treat. Wrote 5 letters this afternoon.\n\nSyd Halford came up to see me yesterday & didn't recognise me at all.\n\nSaw Ross this morning, also saw Palmer. Old Fritz shelled Syd Halford's camp a treat this morning. Hope he is O.K.\n\nLot of artillery action tonight.\n","74":"\n\nFace & eye improving. Be goodo in a couple of days time. The doctor came out & had lunch with us. Told me Kelynach was very near our H.Q. When we were getting our orders for the night the doc. wouldn't let me go out. Plenty of eggs dropped last night.\n","75":"\n\nFace almost better. Can't shave yet but would like too. Boring day. Will go out to work tonight. Work cancelled on account of Tommys raiding at 9.30 pm & the","76":" Bde raiding at 1.15 pm. Goodo. Played dominoes all day.\n","77":"\n\nSome bombardment early this morning. Busy day again. The Colonel went out & had a look at our work tonight. Went to work myself & everything panned out well.\n","78":"\n\nThings quiet again today. Saw a Fritzer machine come down last night in flames. Work as usual.\n","79":"\n\nWent for stroll today. Saw quite a lot of Yanks near here. Work as usual. Two boys\n\nwere injured with picks both in the left hand. All was quiet while we were out. But we had to leave at 1.30 am on account of a big stunt right along the line.\n","80":"\n\nThe Yanks birthday. Gee we are celebrating it too. Very heavy barrage is being put up by our people. It started at 3.15 am sharp. Beautiful to look at. Hope everything turns out OK. Am just going to bed (3.30 am). It was some stunt I reckon. Went from one end of the Allied front to the other. Here on our sector everything was gained. The Corp got 850 prisoners besides 13 officers & a lot of machine guns.\n\nGee we nearly bought a fight tonight. About a quarter of an hour before we were to start out for work old Fritz started. Evidently a big counter attack. An S.O.S. went up & away our guns started. It was lovely to watch it. It stopped Fritz anyway as all the guns are quiet again after 2 hours or thereabouts of throwing iron at Fritz. No work tonight, but have to stand to in case of accidents. Fritz machines came over & bombed very near to our camp too. Will write to his people I think. Went to bed early for us (12 midnight).\n","81":"\n\nScriven woke me about 2.30 to say Many Happy Returns. Old Fritz was stopped alright. Was cut up terribly & we then got prisoners. Went for a walk in the morning to see if we could get any information. Didn't get much so went out again after lunch & did well. Got a lot of news. Also had a game of rope quoit tennis. I enjoyed it immensely. Hope we can get some more soon. Came home & got 4 letters. Three from Mother & one wishing me many happy returns. Liked it immensely. Do me. Went out to work & did the usual while out & went up near the line & souvenired some china plates for the mess. We wanted them badly. Very close coming home. Got up a big sweat. Old fritz was\n\nvery windy all night. Thought we were going to stunt again. Gee he got thrashed some by our people on the 4th.\n","82":"\n\nHad to get up early to take the men for a bath to La Houssoye. Perkins, Scriven & I managed to get a lorry to take them all down on condition we lent the artillery people 4 men to built them a dugout. Was a good idea as it saved a 6 mile tramp. Do me. Wrote 14 letters today. Francis & Harvey from the 32nd came & saw Scriven & I. My turn to stay home again tonight. Do me.\n","83":"\n\nVery quiet all day, but just as we were going to work Fritz started with some heavy stuff. Got to the job all right & started but he stopped us for about ¾ of an hour. Lobbing very near. No casualties.\n","84":"\n\nArrived home at 4.15 am. Colored map & did odd things all day. Went to work as usual. A cpl. I sent out to look after tools shot himself in the arm (S.I.W.) McGowan saw him do it. His is under arrest. Fritz put over another lot of stuff & kept us 1\/4 hr longer\n","85":"\n\nGot home 3 a.m. We move back to C.Coy camp today & I have a rotten job of guarding forward bridges. Went round the bridges at 2 pm & took them over. Taking another & did one at Ville as well. Have 7 altogether now & gee it is some work. The one at Ville is the 4th b ridge on this site the other 3 having been blown up. Frtiz has direct observation on to it.\n","86":"\n\nWent round visiting the bridge guards. It is some distance too. The bridge at Mericourt was hit by a 9.2 this morning. Made a big smash in it too. No casualties tho. thank goodness. Weather is peculiar. It doesn't know whether to rain \n\nor be nice & sunny. It is a dismal failure at whatever it attempts.\n","87":"\n\nBrekker in bed. Went over & saw Scriven. Fixed up dugout. Played cards as usual. Weather still the same. Plenty of thunder the last few days. Looks as if there is a big storm somewhere around.; \n","88":"\n\nTook Edgley round to all the bridges. Had a lovely hot bath at one of the billets. Do me. Played cards. A big raid by the 15 Bgde came a crash last night. Got 1 killed & 4 wounded & never saw a Fritz. They had skedadaled\n","89":"\n\nDads birthday today. Hope he is well. Nasty bleak old day here. My day at home today. Books arrived from Marie. Goods too. Did a bit of Pelmeanian.\n\nA Fritzer came over & shot down 2 balloons about 9 pm. All the men in them came down safely in their parachutes. Also another balloons occupants came down before Fritz got them. Gee the Fritzer was game. Our Archies kept going at him but didn't do any good.\n\nBill Hepburn came round & saw me. He was here when the balloons wee shot down. Had a good old talk. He is now in the 32nd Battn. Have a cold on the chest.\n","90":"\n\nWent round the bridges today. Everything is OK. Rained as usual. Seems to have a habit of raining every time I go out to the bridges. Had a sponge down & then took Scriven a bunch of flowers as it was his birthday. Cold isn't any better. Got Mac to give me a rub. Couldn't sleep some time. As soon as I came home from Scriven's place was told that I have to go out to the job at 8 am again tomorrow.\n","91":"\n\nHad some work today. Started at 8 am. Took Wilson & his platoon out to the bridges & then came here to this hole. Only did 11 miles altogether. 'A' Coy left this camp in a rotten state. Everything in the mens\n\ndugouts were filthy. Ours are almost as bad. Didn't arrive here till about 2 pm. Actually saw a train today. Gee it is some sight too. Another balloon down soon after I landed here. Think Fritz must be going to attack here now. Looks very suspicious. Was quite right in my opinion as Fritz attacking cos he attacked at 5 am this morning down on the Trench line. Word just came through (8pm). Too hot to sleep tonight.\n","92":"\n\nHave been with the battalion 3 months today. Went out to work. My job is to employ 18 men & a few NCO's daily on spreading metal at a water point down at Pont Noyelles (about ¾ mile away). No work down there today tho. Couldn't get any transport. Fixed it all up for tomorrow tho. Saw Archie Haddon down at the R.E. Dump. Had a good old talk. Repaired the dug out made it a little better. Can now move round in it. Some hot today. Had a big thunderestorm & tons or rain early this morning & now it is too hot to move. Went down to the canal & had a dip. Was bonny. Do me every time.\n","93":"\n\nStill very hot. Had a shower or two last night but it doesn't cool the air a bit. It leaves it just as hot in the day time. Got a new wrist watch today from ordnance. Cost £ 1\/3 & looks goodo. Couldn't be worse than the last anyway. Made the Major a bit annoyed today. Guess he will get over it all tho. one of these days. Got 4 magazines from Marie. She is a bonny sport. Do me. Got my new watch from Ordnance.\n","94":"\n\nPlenty of work still. I played some RE cricket & won by 40 runs on first innings. Could have won by 5 wickets but it was too dark as pulled the boys out. Had my new watch absolutely smashed. No good to the business at all. Harry Moore & Raye came round to see me tonight.\n","95":"\n\nLost out first cricket match this afternoon. Only beaten by 110 runs. Gee they were good. I made a duck. There is some big stunt on here by our people soon. We have to have a 2 days spell as I guess\n\nwe are well in it. S'pse it means digging a C.T. back from the new line. Went to a concert given by Yanks & it was goodo. So me every time. Enjoyed every item. Old Scriven came back with this platoon today.\n","96":"\n\nMajor left for a weeks leave at Paris Pleege. Played a company of the 48th Battn. cricket & beat them by 30 odd runs. Saw quite a lot of my old boys.\n","97":"\n\nFroggies are still going some down Chattan Thiery way. Hope they keep going. Do us. Had a bit of fortune today. Went thro. tear gas to test our masks. Saw a fight between a Yank & an Aussie Won by the Yank on points. Was an 8 rounds affair. Got news of new stunt here. We have to go out & dig C.T. as soon as the Inf. have gone over.\n","98":"\n\nMac Dick & Edgley went out early this morning to reconoitre the job but they found that the Stunt was off. Gee I'm glad too as it was a big thing for us. Meant digging 4 yards a man which is far too much for the time we would have had. Could only get about 2 hours good work in which wasn't enough. A Fritz\n\ncame over today & dropped another balloon. he was some sketchy too. Quite a lot of Fritzers over last night. They did some bombing. Scriven went back to his old dugout & job. Wilson came up from D Coy. & we took him to a concert in the wood given by 4th Brigade. It wasn't good. Saw quite a lot of old & had a talk to them.\n","99":"\n\nStarted on the water points again. Rained all day. Was a rotten day. Took over Secretary for the mess.\n","100":"\n\nPerkins left to go on leave the Blighty. Played 51sdt Battery cricket & beat them by an innings & 13 runs. Should have attended a meeting today for the Sports & forgot, Colonel wanted to know why I wasn't there. Have 12 Yanks attached to the Coy. 3 of them went out with Sgt. Geult this morning to Mericourt.\n","101":"\n\nDear old Claire's birthday today. Had an extra job today. Our people put over a barrage this morning but no news has come thro at all about it. Only had a couple of showers today. The stunt is on again as we have to go out tomorrow to reconnoitre.\n","102":"\n\nLeft at 8.45 to go up the line but is B.O.R. first & the Colonel told me off very politely about not attending the meeting the other day. Sent a message back for Holmes to go into the\n\nmeeting today in my place. Then went out. Gee its a long way too. Saw the job, Everything seemed very quiet on the job. Country looks well. Saw quite a lot of Fritz country. Get back at 4.30 pm & was very much chafed. Am going to try & play football in about an hours time as hope the other chap is better. Made the chap fitter by playing football. Had a bonny game & enjoyed myself immensely. Mac gave me a rubdown.\n","103":"\n\nRained all day. Did nothing cept reading. The Sergeant all went out & had a look at the work for the stunt.. Gee they were some wet too. Got the news that we move to Heilly tomorrow morning.\n","104":"\n\nquite a lot of Fritzers came over early this morning & did a lot of bombing. Didn't go near us tho moved to Heilly into 'A' Coys old place. They were just as dirty as usual too. At about 6 pm we got word that our big stunt was coming off & that we had to go out.\n\nNo 7 & 8 platoons were on one sap & no 5 & 6 on another. Well at 10 pm we all moved out. Tools were carried half way out for us. We collected them & then moved up thro the saps to the assembling point. Gee the C.T. was terrible, mud as deep as 2 feet & plenty of pools of water. We all got wet thro, & eventually reached out place at 11.30 om. At 12.30 am our barrage started.\n","105":"\n\nMcGowan & Caley moved forward to lay the tape etc while I stayed behind to bring the platoons onto the job. Got a lot of backwash & No 7 2 corporals killed & one man wounded. I moved them all up & got them to the front line after much splashing & spluttering. Got the men on the job & paced it all out for them. Everything went well. Couldn't connect up to Fritz line cos we didn't have enough men. Edgley couldn' find his when everything was settled I went forward & found it for him. The second time I went out I brought in a Fritz machine gun. We left the job at 3.45 am having done 172 yds & leaving another 172 yds straight to do. Only got 1 boy wounded in my platoon. They all got home safely.\n\n& I carried home my gun. We were all dead beat. Nos 5 & 6 couldn't find their job & so didn't do a thing.\n\nMajor MacLean took charge of the company after we got home on a\/c of Edgley making such a mix up. We have to go out again tonight to complete & No 5 & 6 to start their job, I went out early with a runner to tape the remainder out. Got out early & did it with Stevenson Mac brought the 2 platoons down with him. I paced them all out & we got in a start (about 10.15 pm.) We just got down when Fritz got very shaky & sent over a lot of stuff & kept it up all night. We did 220 yds, marking total of 400 yds. Only had 1 casualty altho. The trench got 2 direct hits & a couple of boys got slight shell shocked.\n","106":"\n\nFinished the job about 2,30 am & came back home. Fritz did quite a lot of shelling all night & put over a lot of gas on the back areas. \n\nAll dead tired. Major Wilkinson was home (back from Paris Playe) whenw e got back. Slept fairly well but mosquitoes stopped a lot of it. My second pip came out & dates deom 17.7.18. Was 18 month with 1 pip up. Everybody in the company finished their job. Our total casualties for the two nights was 6 killed 9 wounded.\n\nWe move back for Bussy tomorrow morning for 10 days spell. Went to be early after writing 2 letters.\n","107":"\n\nOur move was changed form Bussy to Querrien as the 4th Pioneers hadn't left Bussy. The 4th. Div are taking over a sector from the Froggies. Tommies are relieving us. They come up \n\n \n\nto take over our billets & then we move out. It was at 2 pm. Gee it is some hot too marching these days. We did about 8000 yds from Hilly to Querrien, Got here OK & went into billets. We move to Bussy tomorrow. Passed 150 charabancs, lorries buses etc. They had evidently conveyed the whole Tommy division up here from some other place\n\nClimbed trees & picked green apples. Guess we have a picnic tomorrow. Had a feed of stewed apples for dinner. Gee they were good, We move to Bussy tomorrow morning. Will start a new book tomorrow.\n\n"}}