{"Document Name":{"0":"Diary_0305","1":"Diary_0305","2":"Diary_0305","3":"Diary_0305","4":"Diary_0305","5":"Diary_0305","6":"Diary_0305","7":"Diary_0305","8":"Diary_0305","9":"Diary_0305","10":"Diary_0305","11":"Diary_0305","12":"Diary_0305","13":"Diary_0305","14":"Diary_0305","15":"Diary_0305","16":"Diary_0305","17":"Diary_0305","18":"Diary_0305","19":"Diary_0305","20":"Diary_0305","21":"Diary_0305","22":"Diary_0305","23":"Diary_0305","24":"Diary_0305","25":"Diary_0305","26":"Diary_0305","27":"Diary_0305","28":"Diary_0305","29":"Diary_0305","30":"Diary_0305","31":"Diary_0305","32":"Diary_0305","33":"Diary_0305","34":"Diary_0305","35":"Diary_0305","36":"Diary_0305","37":"Diary_0305","38":"Diary_0305","39":"Diary_0305","40":"Diary_0305","41":"Diary_0305","42":"Diary_0305","43":"Diary_0305","44":"Diary_0305","45":"Diary_0305","46":"Diary_0305","47":"Diary_0305","48":"Diary_0305","49":"Diary_0305","50":"Diary_0305","51":"Diary_0305","52":"Diary_0305","53":"Diary_0305","54":"Diary_0305","55":"Diary_0305","56":"Diary_0305","57":"Diary_0305","58":"Diary_0305","59":"Diary_0305","60":"Diary_0305","61":"Diary_0305","62":"Diary_0305","63":"Diary_0305","64":"Diary_0305","65":"Diary_0305"},"Date":{"0":"unknown","1":1302.0,"2":1303.0,"3":1304.0,"4":1305.0,"5":1306.0,"6":1307.0,"7":1308.0,"8":1309.0,"9":1310.0,"10":1311.0,"11":1312.0,"12":1313.0,"13":1314.0,"14":1315.0,"15":1316.0,"16":1317.0,"17":1318.0,"18":1319.0,"19":1320.0,"20":1321.0,"21":1322.0,"22":1323.0,"23":1324.0,"24":1325.0,"25":1326.0,"26":1327.0,"27":1341.0,"28":1342.0,"29":1343.0,"30":1344.0,"31":1345.0,"32":1346.0,"33":1347.0,"34":1348.0,"35":1349.0,"36":1350.0,"37":1351.0,"38":1352.0,"39":1353.0,"40":1354.0,"41":1355.0,"42":1356.0,"43":1357.0,"44":1358.0,"45":1359.0,"46":1360.0,"47":1361.0,"48":1362.0,"49":1363.0,"50":1364.0,"51":1365.0,"52":1366.0,"53":1367.0,"54":1368.0,"55":1369.0,"56":1370.0,"57":1371.0,"58":1372.0,"59":1373.0,"60":1374.0,"61":1375.0,"62":1376.0,"63":1377.0,"64":1378.0,"65":1379.0},"Entry":{"0":"\n\n \n","1":"\n\nThis afternoon a walk to Warloy with Toby, Murph & Bill: met there at the 14th Field base Staff Sgt. Rainsford – of the old 2nd crowd: from him hear again of Chaddy's death in the Messines stunt: and of Tal. Milford at last being drafted to the field – and what a gutzer – he's been detailed straight away to work that will tear his unlovely mind – bearing.\n\nChaddy I've a snapshot of – a group of five taken in the Kitchen of the 2nd at Ghezireh: they are Chadwick, Wilson, George Masters, Frank Hungerford and Jake. Jake has head garlanded with vegetables – Jake whose head and build \n\ncall for ivy leaves or grapes.\n\nIn the cemetary – buried in long close rows between bearing fruit trees – the graves of Scotties, English, Canadians and our own boys – and in a grave of five \"C. Thompson, 18 Batt. July 26, 1916, Died of Wounds.\" R.I.P.\n\nLate last night, and all day today we've heard – even here so far away – heavy rolling of the big guns ….\n\nThe day's been dull, cold and the air full of rain.\n\nJack Bathker back today amongst latest joiners up – he was one of the squad that got knocked the second day in at Hermies – Jack, Max (still in hosp. knocked near the spine), George (back about two or three weeks) and Harry Bladin – who died of his wounds.\n\nWrote tonight to Phillip ler Warren for catalogue and prospectus of the \"Riccardi Press\" books. 'Apres la Guerre' if I can I'll get as full a collection of special press books as I can manage.\n","2":" 2\n\nThis afternoon a walk to Buire with Silver – and a swim – and an hour in the sun, lying about the soft grass flats – then a wet again and out. Tea in the village – and a slow walk back. A summer day again after a week of cold grey rainy days. We the only ones in the river – where last week the long banks were full of the chaps of the first three Battalions: the 1st Brigade have moved about Beaumont-Hamel for a practice stunt in open order.\n\nToday the guns heavy beyond what they've lately been.\n","3":" 3\n\nAcross in the cowshed last night, yarning before turning in, Snow, Arthur and self. I'd mentioned \"Les Miserables\" and Snow started a comparison of Hugo and Dickens: it lead to other writers, and Arthur was quiet, then,\n\n\"Did y' read The Woman You Gave Me in a mag. – she's not 'arf rough – she's a snifter: if that book 'ad been a foot thick I'd 'ave read every word of it.\"\n\nThen a little later,\n\n\"Gee, I'm afraid to tell you chaps what I like – you'd snout me.\" Then Snow, \"Not – Lance.\" Arthur subsided with his laugh.\n","4":" \n\n\"Hugo in England\" – still cherishes after her own 1688 and our 1789 the feudal illusion. She believes in heredity and hierarchy. The people, surpassed by none in power and glory regards itself as a nation not as a people and as a people it willingly subordinates itself and takes a lord for its head. As a workman it allows itself to be disdained: as a soldier, it allows itself to be pegged.\n\nAnd from what I've seen only in France, there's a deal of truth in this – ask Haggan.\n\nBut it seems certain – almost certainly certain that après la guerre this will change quickly. One of the most ironic signs of the times are the number of inanely sentimental of the press – \"Queen Mary and the of Whitechapel\". Queen Mary chats with the , etc. etc., and the ridiculous accounts of \"Royal Visits\". England without a King is not too far away from the limitless horizon.\n","5":" 5\n\nYesterday to Amiens with Bus and Snow. Spent almost full afternoon in Musee de Riccardi, dinner then at de la Paix with some chap and so to Henencourt. No mail.\n","6":"\n\nToday Harry Coffee and Tommy on leave to Blighty, yesterday Morrie and Buck back from Paris and today Bert R. back from Blighty.\n","7":"\n\n\"Letters from France\" to George C. this morning – making about the 7th to read it: \"Just a little too much ---\", the general opinion, but full agreement as to the writing of it, and its truth\".\n\n8. 1 p.m.\n\nThe 5th and 7th have just passed through the village marching in full Battn. order, back again afternoon, 3 p.m.\n","8":" 6\n","9":" a.m. Now she's slowing up – not much but still the thunder is less than it was an hour or so ago: the heaviest bombardment heard since we've been here.\n","10":" 6\n\nBert received from Ballarat a copy of Patterson's \"Saltbush Bill, J.P.\", \"The Road to Hogan's Camp\", the best of a very poor collection.\n\nThe end page by S. Ure Smith, the best in the small volume. There's one piece \"towelling up\", Lawson – not with the \" snobs\" which makes merely bad criticism. Lawson is far and away ahead of Patterson – he has more range and will beat P. on his own ground.\n\n\"Saltbush Bill, J.P.\" not by the Patterson of \"Man from Snowy River\" or \"Rio Grande's Last Race\".\n\n11.\n\nToday's been a day for a book beneath an orchard tree, lying in soft grass, with the loaf of bread and the flask of Muscat.\n\n12.\n\nHad back tooth filled – so escaped morning parade. Mail – Studio June number, and \"Interior Decoration\", Parsons\n","11":"\n","12":"\n\n- and the American edition: does the entry of America into the war mean their editions of English books are to be in place of English editions?\n\nThe book promises well: but the illustrations are too obviously of the American \"Architectural Review\" type – a type where the money behind the decorations seems to insinuate itself.\n","13":"\n\nDown to Buire – to the River: again the banks are full of our chaps – the first 4 Battalions. The water's cold – but the sun is perfect.\n\n14. July 7\n\nToday from the Commonwealth Bank letter in which note of stoppage to troops of Registered letters containing money: \"by order of Military\". \"Well they certainly can't make us \nlove\n the child\" as Arthur would say.\n\nRobbey explained letter – and offered me the money – and the making out – payable to him of a cheque for £2.10 on the Commonwealth Bank. I accepted, wrote out the cheque and wrote to Bank asking that it should be honoured. Sincerely hope this won't make any awkward situation to arise when I get at last my 'Blighty'. \n\nPaid Toby, also Syd.\n\n15.\n\nPhil Douring and self to Buire to the river for a swim and a following glorious sunbath.\n\n16. July 8\n\nFinishing a letter home, and one to the O.B.C. enclosing a Pound note to credit. I picked up my first journal, and read an article haphazardly. Then came across this … 201.\n\nJuly 8\n\n'Newman – till Jonas's enthusiasm – was merely a name – and a book: \"The Mystery of Newman\". (I'd asked J. of the \"Mystery\" – hence his enthusiasm.)\n\n'Merriden got me a copy of his \"Church of the Fathers\": so far I've read only a few chapters. It is of the \"Church of the Fathers\" – of my father's – the church lost in myself.'\n\nThen follows –\n\n'Though essentially appealing, it revolts me in its minor points as practised by a certain class.'\n\nThe \"it\" used there refers to the Church doctrine – not to Newman's Book. The book I only half finished – but will some day later get it again, and read it so that the dignity of the book itself suits the beauty of its matter.\n\nOften with Harry – before the years of war, I've yarned on the Church of the Early Christians. Harry was a Catholic of the best type – and always genuine. If he had lived – had there been no war, now I'd be again of the Church of my Father's. Yet where is the necessity of chaining belief to form? What I would gain would be the privilege of the Sacrament – that only for the knowledge of the Church and its majesty is for all.\n\nYet to take the Sacrament I've wished to a hundred times, but have always been afraid. With its wonder and beauty there is almost a terror about it, not a terror so much as an awfulness.\n\nShall I ever be of the \"Church of the Fathers\"?\n\nJuly 8-9-10-11\n\n17.\n\nToday I wrote to The Studio asking particulars of two Whistler first editions – \"The Tenth Art\", de luxe and signed, and \"Baronet and Butterfly\" – the former £6 and the latter 8\/6.\n\nAnd the only money I possess is a borrowed £1 note – and my pay book's overdrawn.\n\n18.\n\nAt last London Lamps – a slim booklet of verse by Thomas Burke has arrived. His two other books \"Limehouse Nights\" and \"Nights in London\" I'll get hold of later.\n\n19. July 11\n\nOn Monday morning after parade a cable of five deadening words, Father had died on June 15 …\n\nYesterday I wrote to Mother and Geoff. I applied to the Col. that an application for Transport Duty be approved, so that I might do my best towards getting home - even if only for a week – to know how Mother will stand till the war is over.\n\nI know it from the cable – just that it was on June 15 that my Father died, nothing else.\n\nTwelve months before Harry died, and now Father and half the chaps I knew at school, dead by the war.\n\nI can't realise it, but I know it: the cable words repeat mechanically in my mind, and for the instant I see home for a second – then the deadly blackness comes again. Mother, Betty and Geoff – and 14000 miles separate us. If I only knew their position – that Geoff will finished his school and go for his scholarship and Betty\n\nJuly 11\n\nfinish her schooling. I have had my chance. Geoff shall have his.\n\nFor me here, life must go on the same – I can do nothing but wait, and then at the end of the war, or if I can get my application granted, work to move lost ground and to make up to Mother something of her loss.\n\nAnd last night I remembered it, in June some time was the anniversary of 25 years marriage.\n\n20.\n\nGeneral Birdwood reviewed the Amb. yesterday morning, and decorated with the M.M. Andy, Erny Brown, Lofty and Mitch.\n\nTomorrow the King is to review the 5th Division – on the sports ground behind the Chateau.\n\nEngland leave has been added to by 16 men per week from the unit. I am down on the second list – Toby on the first.\n\nJuly 11\n\nJuly 12\n\nWorking since yesterday afternoon in the Orderley Room - Eric going to Rouen to study new system of bookkeeping.\n\n21. July 12\n\nToday Arthur Wilkinson had the word I had on Monday.\n\n22.\n\nThe 5th Division were reviewed by the King this morning: he passed the O.R. at about midday – sitting with Birdwood.\n\nBirdwood is a splendid type, and the chaps' favour will carry to him again.\n\n23.\n\nThere is a rumour about that another Australian mail has been sunk, so I lose another of Father's letters, and perhaps the photographs of Mother and Betty.\n\n24.\n\nLeave cut down this morning to 5 every three days: and early this afternoon to 2 every three days: Tomorrow?\n\nJuly 13\n\n25.\n\nAlmost since when Brennan first appeared in his brilliantly polished badges, the spirit of the unit has been changing. The sinking ship was the 1st Field when Col. Williams took Col. Shaw's command. Col. Williams though, if he'd not been killed, would I think after his newness had worn off, have followed the example set by Col. Shaw, and after a period of transition would have put the unit again where it was when Col. Shaw commanded it. Col. Williams was wounded – and he died: Major Brennan of the 7th Field then by promotion became our C.O. – and he's made the unit spirit lower than it ever was. Till he left a few weeks ago, Maj. Wilson was the only gentleman left amongst the Officers: Capts. Lee and Hunt – both M.C.'s from the Factory Corner stunt, and since Majors follow Col. Brennan: of the new men – Maj. Frizelle - \nnow with the C.R. is at Rouen acting C.O. – is as he's shown himself to us since joining up and Capt. Phillips are the only two we've got who are filling their commissions well\n and Capt. Phillips are the two who so far have still the men's confidence. Capt. Black – lately detailed to 4th Battalion was a characterless snob – and full of the promise of a rotten M.O.\n\nToday – the cause of these notes – Maj. Stack acted on 7 a.m. parade like a petulant child – and Maj. Lee followed his example at the 2 p.m. Pay Parade.\n\nJuly 13\n\nJuly 14\n\n26.\n\nThe end of this month – by the leave list – I'll get my pass …. If my application for Transport home is not granted, I'll take my leave – and my pass will be to Killarney.\n\n27.\n\nLast night Bill Bliss come over from the 14th – from Warloy looking for me: saw him and had an hour's yarn – he as usual doing the 'yarn'.\n\n28.\n\nSilver's just thrown over Wilde's De Profundis, finish writing.\n\n29. July 14\n\nYesterday bringing up particulars of personnel to date – from the Corps Order Book, I read some of the Divisional orders forwarded to the Ambulance after Bullecourt.\n\nIn orders 14 May 1917, the following has been received from the D.D.M.S., 1st Anzac –\n\nThe Director of Medical Services 5th Army, requests me to express to all ranks of the A.A.M.C. engaged in the recent operations, his great appreciation of the manner in which the evacuation was carried out by the stretcher bearers of Field Ambulances, and of the excellent condition in which the wounded reached the casualty clearance stations.\n\nHe realises that the devotion to duty shewn under very heavy shell fire could not have been surpassed and that in spite of the heavy stress of work, all wounded arrived at the Casualty Clearing Stations in a condition which testified to the thoroughness of the work at the Dressing Stations. (A.D.M.S. M 162\/165)\n\nIn orders","14":" \ncomplimentary\n, the Army Corps Commander wishes to convey to all ranks of the A.A.M.C. his keen appreciation of the excellence of the evacuation of the wounded during the recent operations. Not only was this\n\nJuly 14\n\neffected with the utmost care and expedition, but the courage & devotion to duty which caused all engaged in stretcher bearer work to disregard everything except the removal of their wounded comrades to the shelter & care of the Dressing Station, are beyond all praise.\n\nThat the barrage of fire through which the bearers carried the wounded, day and night, was of exceptional security, is shewn by the casualties in the Field Ambulance personnel engaged.\n\nSir William Birdwood is glad to learn, whilst the celerity of evacuation from the firing line to the Casualty Clearing Station could not have been excelled that the scrupulous attention given at the Dressing Station to the wounded noted at the same time, the admiration of the Administrative Consulting & Operative Staff of the Army. (1st Anzac R.O. 237)\n\nIn orders 20th May 1917\n\nThe following message has been received by G.O.C., 1st Aust. Division from G.O.C. 7th Imperial Division –\n\n'As the 7th Division has just come out of the line, I wish to take the first opportunity of conveying thanks to stretcher bearers of 1st Austr. Division, on the great assistance they rendered to the wounded of the 2nd Gordons and 9th Divisions after the attack on Bullecourt on May 7th. (A.D.M.S. M.168\/166)\n\nRe the 2nd and 3rd taking of Hermies, Boursies and Dernecourt in orders","15":"\n\nBefore departing on the 27th after his visit the Commander in Chief expressed his appreciation at the manner in which the Division has acquitted itself in the fighting to take Hermies, Boursies and Dernecourt, in the repulse of the counter attack on 15th April and in holding the Hindenburg Line and he furthermore asked me to convey his appreciation to the Troops.\n\nFrom Divisional Commander pub. for general information.\n\nJuly 15\n\n30.\n\nAlmost the whole afternoon yarning in the Billet – Wilk – Mitch and self: after the crowd had gone to the cricket – Mitch started on Dogs – his strong subject. Then we went to Cats – to Country life and hermit living. By the side of a stream – work and a dog and sufficient ground for immediate needs: only shorts and sandals to wear, the sun to worship and life to live with Nature. Much of his country days had some dog tales: of the dog he gave away to the people living near him, his late night returns – and how one night he 'dominoed' him, accidentally, a stone between the eyes.\n\nAn afternoon spent yarning – in the way of the writing of one of Gene Stratton Porter's \"Limber Lost\" novels.\n\n31.\n\nLast night I finished reading Wilde's \"De Profundis\".\n\n32.\n\nOnly once or twice Father ever mentioned to me my book extravagances - once when I asked him if he'd ever loved books, he told me yes: that he'd wanted deeply at one period a full set of all Stevenson writings. I hardly believed it, thought that if the desire had been great, its satisfaction would have been fulfilled. Now I must give up ideas and desires for collection of rare personal books – autographs and special press books. I have taken things till now too much as a matter of course, too confident of a future I've never really thought seriously about.\n\nTwo more years with Lindsay 'Apres' and filled in that time a full study of quantities and building survey, of planning principles, and of design of office management, and work supervising. After that? – money to be somehow made to start myself\n\nJuly 15\n\nand ambition to realise what I've till now idly fancied.\n\nThis I had once fully intended now I see its fantasy. Early edition of Wilde – and Metheun 1908 full edition: and a fairly compleat collection of the principle writers of the 1890's – some of them I've already got. Synge's first Cuala Press edition and the book of the \"Riccardi Press\". Lindsay's tale of Petronius and the 1883 edition in the works of Keats – besides a full set of books on Art generally and Architecture and Painting.\n\nAll my Military monie I'd ever spent fully on Books – even for the first pay had considered that the ultimate end of it. Dreaming on the trip from home – watching the water lap the side of the transport these books to be were half my imaginings.\n\n33. July 16\n\nA rainy and a dull day. The Col. and Eric back from the 3rd Echelon at Rouen and my application for transport Duty approved and forwarded with recommendation to A.D.M.S.\n\nMail today brought catalogues from \"Bakers Great Bookshop\" – catalogue of autographs and 1st editions.\n\nAbout book catalogues – any catalogue very nearly – there's a real fascination: there's hardly anything so stimulating, and withal as tantalising.\n\nIf I have the time, when I get to Blighty I'll try and look up the particular bookshop – at Birmingham – in John Bright St.!\n\nIn one of the catalogues is priced Arnold Bennett's \"Plain Man and his Wife\" at 8\/6 – the 1st edition that I paid","16":" for when it first came out.\n\n34. ","17":"\n\nFrank to Blighty tomorrow, so I'm installed in the O.R. – and to sleep there for the better guarding of secret papers and orders. One of these, relating to George Rex's visit of early this week is full of innocent charm - the troops to be disposed – with full Kits up along the Albert-Amiens road, as though resting from a route march, to cheer unaffectedly the car of the examining officer.\n\nWe came this terrible gutzer and had to march from here, packs up to the Amiens road.\n\n\"His most gracious majeste's deigning to so review his most unworthy Colonial Troops\" – as King put it, \"seems hardly appreciated\" judging by his stupendous reception.\n\nShall his finish help materially in the finishing of this war?\n\n35. July 17\n\nThe Food Controller of Pen 4 of Billet 63, Mitch's rationing was too drastic for his subjects so Algy and Buss led the opposition and Mitch with Biltman \"came a gutzer!\"\n\n\"Came a gutzer!\" about the most impressive saying and Tag of the Division these three months past: it shares honors for first place with \"on the grouter\" or \"at the Toot\". In future \"Ginger Mick\" and \"Sentimental Bloke\", these will take high honoured places with the fullest native slang.\n\n36.\n\nParcelling up tonight, for home \"Interior Decoration\" and \"London Lamps\". \"Int. Dec.\" one of the greatest disappointments of my book buying.\n\n37. ","18":"\n\nThis morning reported to A.D.M.S. at Baizieux and saw Col. Huxtable: he has promised to forward my application for 'Transport Duty' on to Division – \"but\" he says \"they can't spare men fit for the line\". Basil tells me he referred the forwarding this morning of a very full case – a man whose wife is almost an invalid, and who according to two Medical Certificates is incapable of looking after her two children.\n\nA yarn with Basil afterwards in the farmhouse, he's often spoken of, filled half the morning: between us of course only one subject: books. From him I have a lot of the Everymans edition – the library that must satisfy me in the near future. I must continually get hold of Browne's \"Religio Medici\".\n\nThe afternoon horror: work of course – but barren wasteful stuff. This evening in Billets, behind Billet – yarning with Mitch on things worldly and spiritual.\n\nTonight I'll read \"Les Miserables\".\n\n38.\n\nReading Thomas a Kempis last Sunday on the Brush road – this puzzled me – then struck me wonderfully –\n\n\"Many secretly seek themselves in what they do, and are not sensible of it.\"\n\nAs Nick said when I'd loaned him the \"Imitation\",\n\n\"Don't these things het a chap up?\"\n\n39. ","19":"\n","20":"\n\nYesterday I saw Col. Huxtable and he promised to forward my application today, it returns to the O.R. and he's appended note – he regrets his inability to approve …\n\n40.\n\nand another mail from home torpedoed. now two mails lost in the last few weeks, and probably all Father's last letters.\n\n41. July 20\n\nGeorge not yet back from Blighty – and tonight I've finished the first volume of Les Miserables. The second's in his pack.\n\nToday wrote to Times Book Club for Browne's Religio Medici and Pater's \"The Renaissance\" – the edition I bought in Sydney and read on the Transport and in Egypt. No mail today – and a dull tired day.\n\nA good footie match – one that the Dad would have enjoyed - 'famous' Officers v. O.R., O.R. winning, a hard game.\n\n42. July 20\n\nYesterday I'd a letter from Tom and looking up secret papers find he's billeted about Aveluy. It's about two years since I've seen him – and he's the chap I've often thought of as a partner when I'm a fledged Architect, he possesses what I'm lacking in – I possess what he needs: we would about give and take equally – but we've never discussed it. Apres? Before then though there'll be a terrible smash for us in Belgium. Will write to him tonight.\n\n43.\n\nJust back from the Chateau. In one of those high tall windowed rooms of the ground floor there are soft lights and there in the night are the sounds of a piano and of a man's rich voice.\n\nTonight I'll read Keat's Sonnets.\n\n44. ","21":"\n\nWord by telegram just through that Billy Aspinall has been \"Killed in Action\". 9.15 a.m.\n\n45. \n\nReady to turn in last night, Basil arrived with the promised \"Country Doctor\" of Balzac's. Till 11.15 we yarned – and it was a night's yarning such as is a rare experience. After he'd gone, I turned in in the dark and last night slept the sleep of a quiet mind.\n\n46.\n\nToday's a fine good day: Cricket between N.S.W. and the rest of Australia. Soccer against the 8th Field. Underwood has been reviewed for schooling at the Corps Officers training school at Aveluy, also Davis of C Section.\n\nGeorge back this morning from Blighty speaks of two Opera Companies in London, and two pieces seen by him, \"Samson & Delilah\" and \"Carmen\". To see \"Tannhauser\" or the \"Tales of Hoffman\", Killarney and the \"beauty of the world through a mist of tears\" – a Cathedral tourage – Lincoln – Lichfield and the Universities – or London – London and the Opera!\n\n47.\n\nNight: The day ends dully and a day of disappointment. 'How all occasions do inform against me' and \"I am sick at heart', and really I've no reason – just the mood of melancholy and regret. Tonight I want high wonderful rooms, rich brocade hangings and woundrous fantastick etchings, Chopin's nocturnes and old wines, the company of Harry and of Dad … of the Dead.\n\n48. ","22":"\n","23":"\n\nIt is not without reason that people speak collectively of the Priest, the lawyer and the Doctor, as \"Men of the Black Robe\". The first heals the wounds of the soul, the second those of the purse and the third those of the body. Balzac in The Country Doctor – reading it tonight.\n\n49.\n\nToday's been a full sun Aussy day, and as a result I've a \"full sun\" headache.\n\nBasil sent down the Colonials Guide to London this evening.\n\nCar to Aveluy and left with Pioneer in Albert letter addressed to Davies.\n\n50. July 23\n\nThe good oil: Hell as its never been when we get to Belgium: we \"pursuing troops\" – and on breaking through almost inevitable.\n\nThe guns of the nearest front from here last night and now – 10 a.m. – bellowing their \"fed-repriss\".\n\n57. July 23\n\n11.30 – Movement – the oil – entrain at Edge Hill night of Thursday. Is it our turn or the 2nd to run the A.D.S.? We ran Byzantin le Petit in Jan., Feb., March so it seems its their turn though the rumour is that they'll run a C.R.S. up North.\n\nTwo more of Artilleries Details wounded – we to supply another pair – making 3 in two days.\n\n58.\n\nReading this afternoon Balzac's \"The Country Doctor\", 'Genestas' tale of the episode of The Retreat from brought up again the nightmare of Flers.\n\n\"It was a pitiful sight, but it almost made me laugh\", writes Balzac through the mouthpiece of Genestas: they were pitiful sights then, but the desire to laugh with us hardly came till three minutes had passed, and there's a similar winter again in front of us.\n\n59. July 23\n\nC Section back tonight from Doullens. Gave 'Country Doctor' to Eric – I didn't finish it – only to the end of the section part: Basil is waiting for the book, so was Eric, and I didn't feel any inclination to skip the other three parts: so with an appreciation that demands a second reading for the while I'll be satisfied, and the fact that the move is due is a preventing of the full reading Balzac demands.\n\nFour years ago Angus were shewing a while in a separate window a splendid edition of Balzac in 50 volumes – or 40, limited to numbered 30 sets: they priced the set then at £25. Two years ago, before leaving, it was on final leave, the same set was priced £15 with a Bombay edition of Kipling, a large paper edition of Stevenson and a set of Meredith and Morris. The 23rd set of Morris at £11.11.0 and Balzac were two sets I've dreamed a hundred times of possessing, and at the time of leaving Australia of Balzac I'd only read \"Honorine\" and of Morris \"The Life and Death of Jason\" and his Early Poems and Prose romances. That 1000 copy set of Morris I'd particularly set my mind on – from the moment of the arrival of the first set of the volumes in Sydney till now. Yet absolute renunciation of Books is a renunciation of half my life, and perhaps. perhaps I may some day earn these two sets.\n\nIn the meantime 'Everymans Library' and ordinary editions.\n\n60. ","24":"\n\nThose long 'slender' casement windows of the chateau and the Musick room there windowed on each long side.\n\nA Musick – Drawing – and Gallery room – for a rare small collection of only Australian pictures – water colour nocturnes of the Whistler school – finishing of line decoration – a small case of luxuriously bound books – the Poets and Philosophers – a room of rich colour – but of rich colours so restrained that no one colour may be singled as the obvious ground scheme – but of such colours that fit as the pieces of a wonderful brocade into their perfect placings. Deep chain brass candling lighting.\n\nA room for Chopin's nocturnes, for reverie and old friendships: a room of self – and of quietness and wonder.\n\n61. July 24\n\nToday's mail – the second series of Molony Fellowship Books, and the July 19 Times Literary Supplement. In a list of Book Bargains the Times advertises \"Red Letter Days\" – being red letter days from the Diary of Samuel Pepys. 'Red Letter Day' seems rather a good phrase – for the day's fruitful of mail – letters from home and Catalogues and Books from Blighty.\n\nThe little Book of Georgian Verse – evidently the 3rd series – \"Verses from the Grand Fleet\" – Honey-Sight and seems the most promising as yet read – \"In a Belgian Garden and other Poems\".\n\nBy the Literary Supplement, Arnold Bennet has published another literary book – \"Book & Persons\" by the good publisher Chatto and Windus, Lord Dunsany, a volume of Plays and Maunsel's list added to: wrote to T.B.C. for Dunsany and Maunsel's 500 Poems.\n\nJuly 24\n","25":"\n\n62.\n\nTonight read a deal of poetry and wrote 2½ pages of letter to Mother: wrote also to T.B.C. for two of Maunsel's newly listed books – Poems and something of Padraic Pearse's.\n\n63. ","26":"\n\n1.35 p.m. I'll know in ten minutes if its Tony or myself on leave to Blighty tomorrow.\n\n3.30 Tomorrow DY, Leave to Blighty. The Dad dead less than six weeks, and leave to Blighty.\n\nThe Moving Finger writes, was one of Father's favourite pieces and the Omar, not his religion, contained not a little of his philosophy. Tears, mourning and worrying are useless, only one thing worries me – and till mail after the 15 comes through no worrying can help either Mother or myself. I will make the most of these next days – will spend them to an extent as I would have had I had my leave last December from the Base, and I know that spending it as I will will not be in any way other than he would have me spend it. Yet he is dead – and I hardly realise I, and leave to Blighty is a glimpse of Heaven after a year of Hell. My Pass to Killarney, Tony, Nick and Bill – next Friday, and while I'm away the Ambulance moves.\n","27":"\n\nTonight back to the only home I know – back to the Ambulance after 15 days away – after 11 days in England and Scotland.\n","28":"\n\nPetit Sec Bois\n\n(Hazebruck) \n\n64.\n\nTonight letters – and some from home: one from the Dad, one from Mother and one from Betty: the date May 27, and Father was well then: this May 27th letter will be his last, the mail all June 12 has \"gone down\". One too from Mr. Toohey – that I'll send home to Mother.\n\nThank God for this journal, and for letters and books, and in books I'm strong now – one of Brooke's letters – of his selected verse – Materlinck's \"Our Eternity\", Artzebashef's \"Breaking Point\", A.C. Benson's \"From a College Window\", Gautier's \"Mlle. de Maupin\", poems \"Earth of Cualann\", one of Synge's plays, and again after 18 months away from him Pater's \"The Renaissance\".\n\nThen from Charing Cross I sent to Bob Summerville some translations that I'll read later some time.\n\n65. Aug. 10\n\nIn Hazebrouck yesterday morning – and this morning too – we saw the terror and tragedy of a civilian population of a great town under the fire of 16\" shells.\n\nWe saw Basil and George at the offices of the A.D.M.S. and about 9 left there with directions to a tucker shop in the town square. Somewhere near, in the morning peace of a city, and the church bell tolling the death of a native, we heard only the sudden awful tearing smash of a shell, a few minutes and another, and another.\n\nOld women and old men, young women and children and a scattering of soldiers of three nations. In great silent awful streams those women and children ran from the city, terror on their faces\n\nAug. 10\n","29":"\n\nand terrible terror in the torturing agony of the old women. If it hadn't been made so terrible by these trembling old women – rumour has it there are deaths from fright – that morning evacuation would have been only funny, and slightly pathetic, but these trembling women and their fear were high tragedy.\n\nLast night – or early this morning they bombed a small village by us, that is the village the refugees made for from Hazebrouck.\n\n66. August 11\n\nOne night coming back from Amiens in the train to Henencourt, three chaps half potty, in a carriage filled with Australians of a finished day's leave, were making a fair share of the row in the car: one suddenly lifted up his hand and demanded silence.\n\n\"Listen!\"\n\nIn the full carriage on either side rise and fall the arguments and tales of the day – with the many full Australian adjectives. Solemnly then – \"They're Anzacs, Bill, they're Australians!\" Coming back from Boulogne in the leave train two evenings back, I was reminded of this, and listened to \"the Anzacs\". They argued and told their tales of a ten days leave that had in 90 cases of a hundred become a 12 days leave, and they summed up London, the British Isles and her people, and buildings, \"I walked about a --- hour looking for the Strand, 'an I was in it all the while --\". \"-- dag of a place, ain't it!\" \"An' Westminster Abbey! – it wants a -- scrub, so do half the places.\n\n\"Did you see …\"\n\n(Next page but one!)\n\nAug. 11\n\n67.\n\nTonight I wrote and posted a short letter to Mrs. le Friere – Aunt Louis! Last Sunday that I spent with her was a day such that only Brooke's Poem, 'Tenderly' \"day that I have loved\" could adequately express. A day of home after two years of Military Camp and Billets and Dugouts.\n\nI have read today Brooke's \"Letters from America\" and they're fine: finer than any other travel letters I read, and to be read again, and perhaps again. he writes as I would - tonight with Yeats' plays I sent it home – a book for my special shelf to be.\n\nBrooke, Masefield, Watson, Synge, Yeats and Swinburne – and novels of France, and Hardy, Meredith and McKenzie – plays of Shaw and Lord Dunsany – Wilde and Materlinck – these on my shelf of poets, novelists and dramatists.\n\nI must read some of Hauptman and of Brieux. In London I saw two of his plays, \"The Three Daughters of M. Dupont\" and \"Damaged Goods\" – both well acted, well theatred, and well written plays – of more than usual impressions and full of only good. The art of Brieux is high and beyond the art of half the present day dramatists.\n\n68.\n\nAt \"London, London our Delight\" you're our memories of half the days to come.\n\nToby back tonight.\n\nAug. 11\n","30":"\n\n\"An' one thing I missed – the Waxworks!\"\n\n\"Didn't you see them? – oh they're -- good!\"\n\n\"An' those undergrounds! – dags aren't they?\"\n\n\"An' Petticoat Lane of a Sunday morning! Christ she's a doer!\"\n\nSo on and so on, a hundred talking at once, and the train going to a war that's getting a bloodier and a more terrible part of the lives of the world.\n\nAug. 12\n\n69.\n\nAfter three weeks – again the early morning run, the morning parade, and roll at 2 p.m. After dinner, in the lovely grass behind the thatched billet, under a full fruited pear tree reading till about 3 Alec Waugh's \"The Loom of Youth\".\n\nAt York, not being able to buy at the station stall the book I wanted in the Lotus Library, just as the train arrived I bought the day's \"Spectator\": it reviewed the book – so that the impression left was that it was of the \"Sinister St.\" or \"Hyssop\" school. Now today I have half read it, remembering \"The Hill\" as a school yarn its not the best I've read, but the books to come from Waugh will be worth looking for.\n\nAnother novel I lately started was Artzebashef's \"Breaking Point\", it remains ¼ read, he writes brilliantly – his love of colour and his seeing of the beauties of things is fully written – but he is obsessed by the brutality of man – is struck by his physical beauty, too full of his weaknesses - I prefer his short tales to his long ones, his Nina, brutal and realistic in the\n\nAug. 12\n\nextreme still remains a perfect piece of writing. Perhaps I'll finish \"Breaking Point\" – it is so very uneven, so full of horror and beauty that it facinates even when it repels.\n\n70.\n\nThe day's been perfect – full sun and great white rolling banking clouds, it ends in heavy rain, and now with the \"grey veils of the half light deepening\" the rain clears coolly.\n\nTonight detailed for guard – third shift – 2 a.m. to 6, then 2 p.m. till 6 tomorrow afternoon.\n\n71.\n\nPosted tonight's letter, and 10 Francs to S.H. Bookshop in Museum St., London for Davidson's new Ballads and W. Watson's \"Year of Shame\". Two others of Watson's I'll get later \"Odes and Other Poems\", 3\/6 and \"The Hope of the World\", 4\/6, all 4 first editions.\n\nShop – Davis and Oriole. \"Green Arras\" by Housman there too at 7\/6.\n\n72. Aug. 12\n\nThe Cathedrals I was in during the twelve days in Blighty were, St. Pauls, The Abbey, Westminster Cathedral, St. Giles and York Minster. In York Minster I spent a full morning, and heard the most lovely service I've imagined possible. An Intercession in the Choir, only six others beside the Choir. I listened to that service as in a dream, no part of the world intruding. The exquisite voices of the surpliced and white ruffed boys, and seven men, the lovely harmony of voices, music more perfect than all the nocturnes of the world. The rich voice of the lesson reader, and the full charted responses, and towering around the high carved choir stalls, oak blackened by age, and rich in dim shadows, the magnificent powdered gold altar and the great west window\n\nAug. 12\n\nrising behind it, of soft diamond glimmering glass fully massed over its great face with a hundred soft colour traceries, the music of voices and of a solemn organ, and the high vaulting losing itself overhead - that short lovely intercession service was the most lovely experience of twelve days.\n\nWestminster Cathedral - to the generations that come down the years, Westminster Cathedral will be a great monument of today's art, it is magnificent, brilliant, and all of the cast, its incense and colour and wondour appeal to the intellect, yet spiritually it leaves a coldness and a feeling of overwhelming loss. I heard on the last Sunday night part of Evensong Benediction, and that part of Rome that had bewildered me and facinated me seemed lost with the responses, in the black domes above.\n\nSt. Pauls, the first Sunday we attended the 6.30 evening service. The regilding and decorating of the intercer is half finished and all the richness of renaissance magnificence is there. But the sermon irritated almost, a barren narrow affair of words, words, words, of narrowness and dullness - that sermon and a phamplet from Westminster Cath. on \"Mixed Marriage\" almost go hand in hand.\n\nSt. Pauls and Westminster are wonderful and full of magnificence, but York Minster is of all the beauties of God and The Christ. \n\nThe Abbey, just Henry VIII's chapel. I'm forgetting the waxen effigy of Elizabeth, that and a painting of her at Holyrood in Mary Stuart's bedroom make an understanding of the Elizabethan age easier.\n","31":"\n\n70.\n\nLondon Theatre – \"Samson and Delilah\" – the opera with Edna Thurston as Delilah, Sit Thomas Beecham's Company at Drury Lane – only passable. \"Chin Chin Chin\" – with Mick, and he to sleep heavily starts snoring – our seats in the centre of the Dress Circle. The scenery, staging, Dressing and Acting of this melting pot of opera, satire, melodrama, Russian Ballet and Pantomime, the most splendid of all elaborate mountings we've seen. It held me till the end – I could see it a hundred times and still enthuse over it, and chaps that see it merely dismiss it with \"Jolly Good\" while \"Zig Zag\" the most barren and dull of so-called Revues is enthused over.\n\nTwo plays by Brieux – \"Damaged Goods\" at St. Martins, and \"The Three Daughters of M. Dupont\" at the Ambassador. Two fine well acted plays at two jolly fine little Theatres.\n\n\"Romance\", Doris Keene and a good well enjoyed play. \"Mrs. Pomeroy's Reputation\" by Vachell with Violet Vanborough lead, of the social comedy school, and the Mrs. Pomeroy of Violet Vanborough a living woman.\n\nSusette - – \"zee zhat mouth?\", \"zee zhat leg?\" – but there wasn't the slightest need for her actually by word calling attention to their wondours.\n\nAnd \"Zig Zag\" and Maid of the Mountains, for the latter six of us had a box – to the play Sappe insisted on calling \"The Harlot of the Hills\". It was a merry night out, with supper back at the hotel with three picked up stragglers from the Square.\n\n\"Ghosts\" of Ibsen's was being played but I missed it.\n\nAug. 13\n\n74.\n\nMidday – Guard duty on A Section Billet from 2 till 6 this morning, the morning finish reading to the end of \"Loom of Youth\" and Campbell's \"Earth of Cualann\". Mail brings The Literary Supplement of Aug. 9 and Frank Richard's list mentions \"An Attempt at Life\" and \"Loom of Youth\" as the two promising novels – \"Loom of Youth\" – first edition exhausted before publication – second delayed by … and … by the fact that the Scotch printers chose the critical period to take a week's holiday.\n\nWrote to T.B.C. for Elroy Flecker's Poems – reduced to 3\/6 also for Lollingdon Downs, Masefield's, last book of sonnets and verse.\n\n75.\n\nThe day ends, the sky a soft pale dove colour, one thin pale slender line of green jade pointing a long finger across the sky. Planes the last hour have been 'going over' and the noise of the distant guns tiredly drags on and on …\n\n76. ","32":"\n\nA morning of gas Drill and a short lecture on the splendourness of our helmets compared with the ridiculous protection of the Boche …! – but if only one could believe it. 'Theirs' according to Fenton, 'can only be useful for from two to four hours – at the outside, consequently we are sending gas over continually till the German simply has to remove his helmet – and it. Splendid? how superbly humane we have all grown. One consolation only is that the blame is 4\/5ths with the Boche.\n\nIn the afternoon a cross country run. Rowe ran in shorts only and shoes, what a sight if they all ran naked - so, if say twenty of them did, the rest in full heavy woollen wrappers - germans - as spectators. The lovely day, the sun and cloud, the wheat field by the\n\nwhite road – the occasional tree by it and then rich shadows – and the narrow canal of Paris green ruled water. Instead, torn cut down underpants, odd sox, dirty grey or dull shifts, and handkerchief caps.\n\n77.\n\nThree of today's howlers …\n\nBib to a French Peasant, \"Bon jour Manure, comment tel-el Kebir\" – to his compleat wounderment! Mac – \"Ah, well, you never can tell as Shakespeare said!\", and Billy – \"What's in a name '--- it' as Shakespeare would say. Today Shakespeare's strong.\n\n78. ","33":"\n\nI have been reading de Maupassant – three tales in a collection of translations by one M. Smythe, Dumpling, Two Friends and Moonlight.\n\nWhy is it that in English, de Maupassant always appears in cheap horrible editions and sold mainly by the derelict shops. Three tales of the book of several, and two of them gems.\n\nSteenwerck-Nieppe\n\nDumpling and Moonlight – Moonlight an exquisite little cameo, as lovely as the best of France.\n\nThere is a full charm about the French writers that very rarely appears in any works of the English. Wilde nearest approaches to this atmosphere of all our men. Anatole France – Daudet – Gautier – de Maupassant and Flaubert, the Russian, Artzebashef, the other famous Russians I've not read sufficiently.\n\n79.\n\nAttached to 2nd C.C.S., the last entered interrupted by the warning to pack up.\n\n80.\n\nWrote to Charing Cross Road to the people I bought \"Form\" at - about two works I bought there last Tuesday week – they've not turned up yet.\n\n81. ","34":"\n\nThanks to the Pope the Mess had something new to discuss – or rather some new light on which to discuss our old subject - the 'Peace\" offer became as the day goes more general and more possible of acceptance – it now includes compleat restoration of Belgium, Serbia and France – Alsace Lorraine to be French again and Italy to connected to her lost colonies - and still H.E. shells tear over us and the wounded arrive from the line.\n\n82.\n\nOn night duty in the Dressing Room – 8 p.m. till 5 a.m. – all stretcher cases dressed by us – 4 and Sgt. Wylie – a good M.O. and decent dressing shack. Last night few cases, mostly N. Zealanders, this morning till C. exceptionally heavy bombardments. The day fine but rain about 8. 2 Duty.\n\n82. ","35":"\n\nGoing on duty yesterday evening, in the Dressing room, met Sister Stuart of the 2nd - from her after much yarning hear that Val is married, is living in England and has a baby. By rumour I'd vaguely heard of her marriage, not of the baby.\n\nDear Val, why? and only last November or was it October, dear little girl I'm so sorry, we were so suited one with the other, not for the ultimate marriage but for passing love. Now if we were to meet again what would we say. Could Brooke's 'Second Best' come to your mind? It came to mine last night, and his sonnet –\n\nNow that we've done our best & worst, and parted,\n\nI would fill my mind with thoughts that will not rend.\n\nDear Val, and all that remains of a Springtime love\n\nis your little note – the one you gave Jake for me, one evening after that day in Picardy.\n\nWith all your unemotional lines, Val, this ..\n\nI asked Stuart for your address, but little girl, that last evening, when we quoted and were full of Rosetti and Swinburne, and made foolish love, we could not keep our love. Trembled and laughed and kissed – that will end our adventure lightly and keep romance about it.\n\n83. ","36":"\n\nVery heavy air raid between 9 and 10 last night, the search lights got well in to the raiding planes and the anti air craft shooting better than any I've seen. No casualties from the raid through the Dressing Room. The night lively in the extreme – a rich luminous black blue sky horribly bespangled by tiny far away glimmering stars. Early this morning a second raid and away towards our right flank.\n\n84.\n\nDuring the evening wrote to Mother, Elsie G., Elsie B., Joe's sister and Hazel, enclosed photographs in each letter.\n\n85.\n\nBreaking Point, Artzebashef – its full of madness and the obsession of suicide – full of the beauties of nature, and the most terrible of philosophies, such a and such people, such collective misery and entire lack of faith. I cannot conceive of as existing – even in Russia that most amasing and tragic of countries.\n\nChapters magnificent and horribly sordid and follow relentlessly and terribly.\n\n86. ","37":"\n\nTonight I am restless and my mind won't fix itself, since tea I've read le Gallienne's Worshipper of the Image – a rotten affected fantasy – a few pages of Mdle. de Maupin, of Les Miserables and an essay of Pater's 'Botticelli'. Its still early in the evening, but late - the raid till now has been less severe and the night is comparatively quiet. I am still undecided whether to keep for Apres \"Breaking Point\", though morbid and deadly the book contains some wounderful passages, and its certainly worth its book room. No mail.\n\nThis morning work kept us going solidly from 4 a.m. till 9 – the five tables, and till 11 yesterday night the raid kept us at 'Breaking Point' – it was solid in the extreme, and hellishly unnatural – the search lights picked up three of the planes well and the air craft guns' fire brought one down. There must be a hundred machine gun positions about here, for directly a plane appeared leprously on the thin ray of the search light all the air sang with their firing, the machine guns, the heavy crump of the bombs, and the firing of the anti A.C. guns and then shells exploding, the far drum fire from the line, filled the night hideously. We had no cases through. Tonight's raid, the night's not over yet, but the planes that have so far been over avoided the lights. Distantly bombs are crumping.\n\n87. Aug. 19\n\nFor the quiet loveliness of our old room, of books and Poetry, of etchings and water-colours, Nocturnes, of folios of drawings and soft lighting, for fantastick reverie and the facination of loosed imaginings.\n\nGothick - and I'll carve my panels, that door frieze from Amiens Cathedral will inspire a mantle, or the over door design of the Chapter House of York Minster, black in Flemish oak, and a few Riccardi volumes or leather books .. No, many books of the Poets, Philosophers and Essayists, then the room will be classical – beautiful in simple lines and lovely decoration, colourings. The study the Jacobean styles and Arts.\n\n88. Aug. 21\n\na.m. Last night's raid the quietest yet, one plane passed over in towards Hazebruck probably – another dropped his bombs somewhere towards our left, the searchlight failed to pick either plane up.\n\nBombardment early this morning slightly heavy, cases during the night few – the few being of rather a light nature, those few were the only ones left of several parties.\n\n89.\n\nYesterday brought to the staff of the 2nd C.C.S. an Australian mail, of June, the mail reported sunk.\n\n90.\n\nThe last three mornings a train has come up for clearing the station, each day at 4 we've started dressings and gone steadily till 8, then a big stunt in the air, and tonight by the report, some wounded 18-20 through, our Division is relieving them. As one of the Inf. chaps in the train from Boulogne said, \"Too --- right!, we'll be in it solid son – to take a little village by name of Lille.\"\n\n91. Aug. 21\n\nWaking suddenly I dreamed early this morning, a stretcher case and ten walkers woke me up. In the dream I'd hurriedly risen, put on my gown, and started uncovering the face of the stretcher case, the last bandage revealed as it lifted a skeleton face with tattered fragments of flesh and smeared with blood.\n\n92.\n\np.m. Algy and Tommy up from Petit Sec. Bois with a bag of mail, one from Father, June 3, and he writes of 25 years of marriage on the 15th, of it seeming half that time, one from Mother dated June 3, and she speaks again of June 15, one from Geoff, of Football with school and a mention of our mother, who takes a 'hell of a while in getting to the point', one from Mat. of Goulburn and coming to Queen St. - June 15.\n\n93. ","38":"\n\nAnd two Bulletins – the first for ages - there's a full home flavour round the Bulletin, it's the most defined Australian we know. M. Forest scarce in a poem of his \"Fans\" – it's delicate and suggestive, it might almost be a piece of Middleton's or Wilde's - the Red Page reviews \"The Immortal Dorian\" well – extract from Diaries of the A.I.F. abroad.\n\nFrom the 'Book shop' no sign yet of 4 numbers of 'Today', Dunsany's 'Plays of Gods and Men' and one of The Lotus Library, ordered for forwarding Aug. 15.\n\n94.\n\nTonight special orders re lighting out – there's suspense in the air and the raid wasted on!\n\nThis morning in bed finished Stephen Phillips' \"New Inferno\". It's good – strange I'd expected something different.\n","39":"\n\nAug. 22\n\n95.\n\nTwo 4th D.A.C. chaps just through dressing room – one to theatre then to A.B. – both for operations immediate – if they live till they're under the anesthetic. One was opening a Boche new cap. This case was the most terrible – abdomen and chest ripped badly. The other, his R. arm shattered terribly and small perforations through his chest, his R. leg torn all down. Both their faces torn bloodily.\n\nEven the few days I've been here, a whole row has been added to the cemetary – to this close forest of plain crosses.\n\n96. ","40":"\n\nTonight an inferno of war – machine guns innumerable against bombing planes, and the noise of the Anti-air craft guns, bombs dropped seemingly between here and Steenwerk near Nieppe.\n\nAt 2.30 this morning gas over - which reached down to here.\n\nAug. 22\n","41":"\n\n97.\n\nAfter tea – to near the Steenwerk village with Robbins, there against the stacked drying wheat, in the shade from the rich willows by the arsenic leaf covered canal, yarning five minutes, musing an hour.\n\nThe quietness of these wheat fields – the colour of the stubble and the sun on the stacks – and the lines of willows by canal, make the sound of the guns, and the presence of baloons and planes in the skies ironical in the extreme.\n\nThe yellow of the wheat, and the green of the trees, there's the ground work colour scheme of my room at home.\n\nTonight reading and by heart a deal of it, Brooke's \"The Great Lover\".\n\nToday hot – and no mail.\n\n98. a.m. Aug. 23\n\nOne of day dreams seeing Brooke's Poems started yarning of verse, lent him the for the day.\n","42":"\n","43":" p.m.\n\n99.\n\nAfter Brooke –\n\nThese I do love,\n\nAbsurd blown sky and swimming clouds,\n\nHigh hazy stars – 8 deep black vaults of night.\n\nAdd Gothick carvings, 8 shadow traversed roof,\n\nCold gleaming brasses, and time riched tapestries,\n\nSongs and all sonnets of Elizabethean days,\n\nLow Hyssop laden nocturnes, and\n\nOld slim green bronze of fantastick gods,\n\nLong golden beaches, and lazy curling surf,\n\nThe sun on young brown bodies, and\n\nThe shade of forests, and rolling growing trees,\n\nAnd songs of hidden water,\n\nBut most of all,\n\nOld memories of home.\n\n100. August 25\n\nPaid today – and drew 40 F. Yesterday and this morning the usual train rush for dressings. No mail up with Frizzle, and no word of the Unit's moving.\n\nYesterday arrived Watson's Year of Shame and Davidson's New Ballad. Davidson is worth cultivating, he's universal but with a genuine – not affectedly so.\n\nThroat still bad after two days and a headache forbids long reading.\n\nYesterday wrote to all at home, and to Commonwealth Bank – and made out cheque of £5 to Robbins.\n\n101. August 26\n\nRupert Brooke, William Watson,, Stephen Phillips and John Davidson and Pater's Renaissance and Gautier's Mdlle. de Maupin – yet today I dreamt of the reading of Swinburne, and its over 9 months since I first read his Poems and Ballads. Tonight I'll write to Bakers for his \"A Song of Italy\" – the 1st edition and only 6\/6.\n\nI'll use the envelope I have had since Henencourt addressed to him: that was to order a book of Symons.\n","44":"\n\n102. 9 p.m.\n\nTonight raining and a heavy sky, which will mean all the mud misery of Flers in the line, a slough of despond for the bearers in the evacuation of the wounded, and all the misery of the world for the chaps on the stretchers. They'll be carrying four to a stretcher – if the aid posts can't hold the cases for the night there'll be a rain sodden silent party slowly plodding through the slush of mud – deep to their calves, and full of a hundred treacherous holes. There'll be only instinct to guide them, the night's black as hell. Yet somehow or other the instinct rarely fails them – they'll be lost for an hour, and all the while firmly assuring the chap they're carrying they know exactly where they are, and then suddenly they'll arrive at the relay post, with a relief in their hearts that's a prayer of praise.\n\nIt's raining evenly and hardly, on the iron roof of the dressing Room. Along its whole length there's the insistent beat of heavy rain, and the day's been moderately fine, there'll have been the usual line shelling.\n\nThank God for the infinite pity of the chaps in the line, not for their pity though as for their sympathy – their glaring lies of comfort to the chap knocked. In the spoken aside, \"Poor Bastard!\", there's more feeling than in the most perfect poem. War conditions bring out the most perfect, and the most revolting passions.\n\nAug. 26\n","45":"\n\n103.\n\nLast night, without the slightest warning, two quick following bombs were dropped alongside the C.C.S. Two Boche bombs from a plane that was over ours.\n\n104. August 27, a.m.\n\nThrough the night very few through. Rain held solidly till 11 – cleared then returned. Train this morning, but very few dressings. The chap that came in yesterday morning – with his face blown off – not on the tables. No one seems to know anything of him.\n\n105. p.m.\n\nTonight a mail up from Billets, from Mother, Geoff and Grandma, two from Mat. and a couple of others.\n\nFrom Mother – June 24, and from Geoff – the 17th.\n\nOn June 15, the day of 25 years marriage, the civil ambulance brought back to Mother, Father dead.\n\nGeoff seems to have kept up well, and unknown people's tributes seem to have brought an element of comfort.\n\nGeoff has 'given up all idea of enlisting now'.\n\nMr. Parrish is to manage Father's affairs.\n\nGeoff with a full heart writes, - For heaven's sake don't give up. Dear Dad. I'm looking to you not to give way, but to 'carry on'. Conditions here compel to cold carrying on, without revealing the heart for an instant. To think is to die.\n\n106.\n\nA rainy day, and it's raining now – nearly midnight. Back at the Unit a Dinner on the occasion of the third Anniversary of the Unit's life. Of the original Bearers how many? Nearly all the original left are those of the Nursing Section.\n","46":"\n\n107.\n\nOff duty this morning – to a tent rakishly half lying on the sodden ground, with her skirts most carelessly drawn away from half our gear, half the guys broken, and a gale blowing: still we're back in her again and vaguely wondering how long she'll last.\n\n108. p.m.\n\nTonight parcelled up Watson's \"Year of Shame\" & Davidson's \"New Ballad\", & addressed them to Mrs. le Freire, also wrote to her. Wrote too to Bakers of Birmingham for Swinburne's \"A Song of Italy\".\n\nTonight is a clear star hung moonlit night, clear to perfection for the Boche, and us.\n\nIn yesterday's Times there's an account of the several hospitals, French & English, the Boche has lately shelled and Bombed, they don't mention the shelling out of the 3rd C.C.S. from half way between Poperinghe & Vlamertinghe or the 44th British alongside there, or the bomb dropped here a few weeks back, or the bombs dropped on our own Clearing Station at Buire last year, or the three days shelling out of the M.D.S. at Vieux during the Bullecourt stunt.\n\n109.\n\nFew days back lent Basil \"Breaking Point\", tonight here yarning, it was good discussing the points of the book and its unevenness.\n\n110. August 29, p.m.\n\nRain again, and even here where duckboards have been a year, the place is miserable. A cloudy night, with a bright moon behind. No mail or word up from Unit.\n","47":"\n\n111.\n\nTonight nothing to write of, and only a desire to write. I've de Maupin, Brookes, and a phamphlet by the Catholic Truth Society – I bought it with others one day in Westminster Cathedral, on the Supression of the English Monastries: a good subject and an interesting one. History I'm slack in. At Fort St. I turned it down in some way that now I'd tremble to try – and only look in on at the Grammar, because I couldn't get out of it. There Charlie's sauve Catalogical Questions were our bugbear, and Butch usually backed me up. And Charlie had a great way with too – it's to him I continually owe a deal of my appreciation of Browning, and the decent essay. At Fort St. Cuthbert did all in his power to everlastingly call my curse down on anything and everything literary. In English he'd put all blackness in my mind, by asking for interpretation of Tennyson's \"Lancelot & Elaine\" – only when he was sure I couldn't interpret. All the smugness of misunderstood loveliness was his.\n\nEnglish at the Grammar was always good: there if the lesson before had passed well Charlie'd be in a mellow mood and he'd read to us if he'd the slightest chance, and the recollections of \"The Pied Piper\", \"John Gilpin\" and \"The Ancient Mariner\".\n\nJames Stephens somewhere says that 'the average man as readily bends to beauty as the flower to the wind'. Com. 1, certainly bent willingly to Charlie's readings\n\nAug. 29\n","48":"\n\nand without doubt enjoyed quite as much as the reader these three pieces.\n\n112.\n\nFinished the reading of The Suppression of the Eng. Monastries by William Collett.\n\nI'll to History – as a change from Books and the Arts, say the periods of Henry VIII and principally of Elizabeth, the Virgin Queen.\n\n113.\n\nMother, reading son's letter, \"Will's letters always send me to the dictionary!\"\n\nSecond ditto, \"That's nothing! Frank's always send me to the Bank!\"\n\n114. August 30\n\nStill occasional rain, and a little sun: now the sky heavily overcast, a yellow feverous flicker over the horizon with the slow dully booming guns. Last night only 5 cases through, and they mud soaked and cold. Two of our chaps spoke of their being relieved by the Manchesters, & they going to trenches blown in and heavy rain soaked. They speak of a place of mud approaching to Flers, but Flers will never be surpassed. One of the chaps, a Tommy, and he with a bullet through his face too: almost obviously a S.I. – first it was his own rifle that was fired, then a second he'd picked up to load! We marked him accidental, but he'll be S.I. at the Base. There's no incentive in his mind, and no hope, he's the result of the Army's discipline, and he was the type they shoot for \"cowardice\". They shoot for cowardice, and award for heroism, and everyone\n\nAug. 30\n\nhas come to know the vague invisible dividing line.\n\n115.\n\nFlicker and Masefield overdue, and the books from the Book Shop - tonight arrived the \"Collected Works of Padraic Pearse\" and they promise well.\n\n116. \n\nJ's to parade tomorrow to the A.D.M.S. re transfer to A.F.C. application and Harry Coffey left unit yesterday for home: his application went through.\n\n117.\n\nTonight I have read again of Browning, \"The Statue & the Bust\", and \"The Bishop orders his Tomb\", both lovely and perfect poems, or an attempt at Romance, one, and a creation of brilliant and tragic liveliness the other. The book from some friend of one of the Day Dressers, the owner a Methodist student who aspires towards beauty. My Browning I sent home last Nov. leaving the 2nd A.G.H.\n\n118. ","49":"\n\nTonight I have been reading again from the book of 'works' of Pearse. Now I've just finished \"The Singer\". Last night I finished the verse at the end of the book and then this morning a couple of the Tales. But The Singer is splendid. All I know of Pearse is all the Book Shop man of Charing Cross had to tell me - he was a \"remarkable man, one of the Rebels, and he was shot with Casement\", now in the light of this book, & especially after the reading of \"The Singer\", there comes the desire to know more of the man, and certainly this new Irish Movement & all its Questions should repay well a little following. The 1890's I know pretty well, now I think I'll\n\nAug. 31\n\nfollow the Irish Movement. Maunsels publish a lot on this. \"The Irish Literary Renaissance\" I fancy, and it should prove by its title the guide Holbrook Jackson's 1890's did. The Oxford Movement will wait: Synge, Yeats and The Irish Theatre now appeal far more, and the reading of these works offers more intimate facination. But Pearse I must know somewhat of.\n\n119.\n\nEvery light's screened here as on the darkest night, and blankets doubled cover the windows and doors, outside its clear and light with a bright moon, and a sky of few clouds. Its near 11 oclock, our planes have passed over, they've not yet come back. The Boche has kept low - till now. Again after nearly a week of quietness owing to the damnable bosche the guns are opening out. This evening in Steenwerck there were plenty of the 8th, and some of the 6th, our \"oil\" is that we're for Ypres early next week. \"To take Little\" still runs well, but there seems no interest attached to our future doings. Above all other philosophies ours is now, 'Come make the most of what ye yet may spend'.\n\nWrote tonight to Mother, and to Charing Cross, re those books I bought there at the beginning of the month - first number of \"To-Day\" & the new plays of Lord Dunsany.\n\nAugust's reading list quite approaches to one of the old first diaries lists – September will slacken – will be running then an A.D.S. or a M.D.S. and war will be in us again.\n\n120.\n\nHeard by the tent – N.Z.s playing Two up up, \"Emus & Kangaroos stick out all over his face!!!\"\n\nSeptember\n\n120. ","50":"\n\nThis morning to Steenwerck – there a haircut and a walk round: back to C.C.S. and over to Zoi for coffee. There spent an hour designing in sketches of marvellous ballets, & wonderful stagings. \"A Ballet of the Arts\" – Musick, Painting, Sculpture, Architecture and Literature. 'A Ballet of the Period', Cretean, Egyptian, Truscan, Roman, Byzantine, Romanesque, the Renaissance and the Modern: \"A Ballet of the Schools\" – Painting, and 'Ballet of Byzanteum' & a Medieval Ballet.\n\nTwo stage settings I lean towards – black tapestry heavy folded and a deep white frieze heavily overlaid by a Jacobean of orange scarlet and gleaming gold – a floor of night sky blue – and a few square same colour pedestals supporting some colour stained antique reproductions. The Ballet ? This for a setting, another, entirely of black, the ballet a ballet of the nude, & a pointed doorway at back gold-embroidered 'round, lighting round system of dull glowing – on wrought iron - harp and pointed holders.\n\n121.\n\nTonight Jim back for parading to A.D.M.S. and he successful - bring back note from Nick enclosing page of letter for Molony of the details of the Dad's death.\n\n122.\n\nNext week the two Divisions to go in and Ypres the front - it's rumoured the other three Divisions go down to the Somme!!!\n\n123.\n\nAt the Unit things seethe. Hunt is again prize giving for Kindergarten prettiness, for the four nicest looking in the Section – clean brasses and Kiwi prettiness, marks deducted for long hair, for teams in uniform and a thousand minute faults that are insult to refer to …\n","51":"\n\n124.\n\nA quiet night, so it was sleep from midnight till 5, the night was cloudy but light, no planes over, either Bosche or our own. This morning rain has it again, and a dull even sky promises no clearing up. Writing in the Church Army Hut, to get away for a while from the conversation of Buckholz – liquor extras and edibles – or his spreading of the news that we're going up the line early next week: seeing that the furthest he'll get will be the M.D.S. or at the farthest the A.D.S. that jars rather. When I joined up the Ambulance, Syd. told me that all that happened to the bearer became the adventures of the 'sisters' and our dangers nought to theirs. And now God help me I'm one of the \"sisters\". If it wasn't for the Mater I'd certainly get back to the Bearers: infinitely they're the better company and the more manly.\n\nLast night two of the sixth bearers in the dressing Room to fix over windows and doors – stayed by Buckholz, spent an hour yarning: for a while I was tempted to join in, but when Buckholz turned the conversation and the of a knock at some time or other came up, and he cites his 3 yrs. service – in the Nursing Sect. and a big whack in England, I stayed where I was. To give the his due, I suppose he'd shape as well as another at bearing, but his present attitude towards himself and the wounded is intolerable. He is the quintessence of affectation – and to hang his affectation on he has nothing, and the idea of he and Morris criticising any of the bearers – as they do – I must see only the ironical side and smile, if I can.\n\nSept. 2\n\n125.\n\nThere's a phonograph on the corner and rain like miniature machine gun fire over the roof. I'll have concert on my own.\n\n(1) William Tell, Rossini\n\n\"Pipes of Pan\", Arcadian\n\n'My Hero', Chocolate Soldier\n\n(2) William Tell\n\nThe Cygne, Saint Saens\n\nThe Gaby Glide, Hirsch\n\nCavalleria Rusticana\n\nSo, then came in one 'Anzac' and Banjo solos were called for - they're playing them now.\n\nPipes of Pan – the Bonzer old Arcadian, and the Dances in the second act, the chap who was drowned at Manly. The first time I saw \"The Arcadians\" the day after the results of the Junior 1910 came out – seven years ago to the month.\n\nThe Gaby Glide started me thinking, what vision of the Gaby herself and those Gaby dances, will the hearing of today's musick call up to those generations down the years. Will anything of Gaby and all her soft exquisite wonder and her posings that are poems rise in soft before them? Probably they'll only see a richer caricaturing prototype of their favourite Tivoli Girl and sneer accordingly. Will any have - we've seen Gaby - and only a hundred years can produce such a marvel. She'll die, and the blind worms will possess her, that exquisite body of hers will dissolve, and her soft dresses mould in the corners of old clothes shops, & ultimately become the disdain of the staid suburbanite.\n\nPoor Gaby and poor us. Now to Zoi's for coffee and her rare philosophy.\n\nSept. 2\n\n126.\n\np.m. Back at the tent after writing this morning some letters, amongst them one from Jessie G. She writes of Mother's wondering how to do up papers to me as the Dad did. That has been the most tangible word to me here – the Dad's writing or the Bulletin & the Times changing suddenly to Geoff. Dear little Mother!\n\n127.\n\nNearing midnight. The raid, the first for some time is all about us – the night's clear & already by the crumps some big bombs have been dropped.\n\nFour letters finished, one of three pages to Lindsay – he worked me into the A.I.F., there's a chance he may get me back. One to Mother – two cards only and the same to Billy, and an answer to Jessie's letter of this morning.\n\nFive minutes ago finished packing gear – pack and rolling blanket, and washing two hankies - word is tomorrow we rejoin unit before moving up.\n\nToday's been a long day. Writing after breakfast, some letters arrived, over to Zoi's for coffee, and then for a long walk through three villages. Those damnable machines in the air with their terrible loads, and me thinking of home. Oh !\n\n128. ","52":"\n\nTill 6 this morning the Bosche planes were over here and all about the sector. Rumour has it that three of our Art. officers were killed at Bailleul. Some heavy bombs were dropped & some fairly close to the C.C.S. Today's the promise of a glorious day, sun, milk blue sky and a few vague heaping clouds. There'll be a raiding today. Nothings known of our relief. Today for the sun while he lasts.\n\nSep. 3\n\n129.\n\nMidday Mess A – being mentioned, the subject of individual phisique was brought up, and the Unit's Apollos were discussed. It became heated: A – strongly favoured by Arthur – his choice judged bad by most of us, tho' not all. Almost of the whole crowd there's only one A.L. ---, perhaps B-- and N--.\n\nFrank Hungerford and Jake & Walker of the old 2nd, three almost perfect types, Jake with all the individual beauty of Australia, full of grace and litheness, Frank wonderfully proportioned, full limbed and a perfect torso, Walker of fine moving and clean rich bodied flesh. From the old second of Egypt a splendid crowd could be assembled, Frank and Jake are two to remember.\n\n130. Sept. 3\n\nThe Day's been perfect, again spent the day roaming, reading and lazing. Aerial activity has been brisk, and tonight there's an unbooked stunt. It's the baloon that flew over the station and almost us they're after - regularly they fire with their H.E. shrapnell, so they're looking to bombs.\n\nOnly mail up, Times Literary Supplement of Aug. 30. Wrote re last order of 13th and added Frankau's & Drinkwater's latest.\n\n131. 9.45 p.m.\n\nI've been reading a book I found in the St. George Hut – one of George Birmingham's, \"The Bad Times\". At Wimereux after the Easter Rising I read Brooke's \"The Irish Question\" – tried to understand the rising from that, but failed. Even now the Fenian I know\n\nonly as a name. Yet the Irish Question beckons me and it seems to offer me more interest and inclusion than the Question of my own country, and Father never seemed to feel for Ireland, and Grandfather I never knew. All my people, interests and loves are of Australia, yet to Ireland I feel an owed allegiance, and all the while I've the feeling of the uselessness of it all, the waste of enthusiasm and the dullness of her future. What is her future to be, she seems a country of wounderful beauty and dull brutality, hardly brutality, more of dull awful deadness.\n\nI wish there was someone here to talk to without prejudice. I've just tried it with Norm, but he holds the Popish bogey as the whole heart of the differences.\n\nI've read again the Dad's first letter addressed to the Amb. and tried to read something more than is written into it. Who was that great grandfather General who Commanded an Irish brigade against England, and when was it.\n\nIt's midnight and the Bosch planes are raiding again.\n\n132. ","53":"\n\nSlept from midnight till 7, train left at 9 but very few cases for Dressings. The Bosch over twice but the second raid passed while I was asleep. Today again is fine, there'll be some more solid peppering at the baloons.\n\nSleeping in that S cover Bell tent – by the sun an absolute oven and with H.E. shrapnell\n\nSep. 4\n\nbursting at spasms above – high certainally – but the pieces & the case has to come down – makes the day's rest impossible. The few casualties of the last week have made nights easy for us, and the sleeping in the hut has suffered, but these conditions come pretty hard on those sisters who are working here. They've got a dug-out certainly but it's more of a funk hole for bomb attacks, they sleep in an ordinary marquee. Last night during the first part of the raid, Stuart was in the D.R. – she's night duty in A.1 and A.2, she was inclined to be a trifle 'windy' but our company and our laughing at her put her right. Even so it's a big strain for them, and then being here for any considerable time is asking too much of them and when all's said and done, apart from the men's influence of their presence – not a small matter when a man who is broken and dying is concerned – they are of no more benefit to the wounded than the men, the women's place is farther back, at a G.H. they carry the greater burden of the work, but here the work is for men.\n\n133. Evening\n\nAt Zoi's after tea finished reading \"The Bad Times\". The book published in 1908. Rafferty is speaking, the scene is his ruined cottage on Ilaun an Anama - the Island of Souls – which the English making maps of their Irish possessions marked down as the Island of Soles.\n\n\"And we did it!\" said Rafferty. \"We, a handful of men, frightened them with all their soldiers and their ships of war. And who were we? The Church was against us, the gentry hated us. Tho' most of the people\n\ncared nothing for us, yet we frightened the English. But, sure, we failed.\"\n\nAnd again last Easter twelve months they failed again, failed with the same success. And England said the influence of Germany was at the heart of the tragedy. I don't believe it, or if the Bosch influence was anywhere, it was used as a means to an end. The very essence of Irish character is as different to that of the Bosch as England and Australia. I'll read Birmingham again, I thought all the readable novelists, I didn't.\n\n134.\n\n\"Like many another before him, and many since his time, Father Staunton became the victor of the fascination of utter sly denial. Thomas a'Kempis set Jesus of Nazareth before the eyes of men as no one else ever did. The man who has once felt the tender pathos of the stresses that breathe out the words of the \"Invitation\" can never reckon on escaping from the slavery of Jesus. He may lose sight for a while of the Master of whom his soul is enamoured, he may put out of his mind the words so that they do not haunt or trouble him, but at unexpected moments, at inconvenient times, just when he desires them least, the words will come back to him. The figure of the Master will be before him, the passionate pleading of the sorrowful eyes will compel him.\" The Bad Times, G. Birmingham.\n\n135.\n\nAgain tonight we come up against the M.P. Tommies of the 8th Division – permanents. Zoi and Ange were serving to us coffee – N.Zs and our own chaps, the time 8.15. And they brought up the tyrannous law of no coffee or Beer after 8, they sell nothing \n\nSept. 4\n\nbut Eggs, Salad and Coffee to the Frogs and their parlour is invariably full – at all hours. And these 'bloody' M.P.s threaten to enforce the keeping by these two girls of the serving hours of only 12-2, and 6-8, between other hours they are to keep closed house. They provide us with clean decent tucker that we can get nowhere else and they keep their charges lower than anywhere else in the Somme, added to that they're open to howling raids and regular shell fire.\n\nAnd the English bring this unfair and uncaring piece of beastliness into their orders.\n\n136.\n\nToday writing saw an Infantry man addressed envelope - Away.\n\n137. ","54":"\n\nEarly this morning I dreamed I was home again, and the dream is still in my mind. Home in the dream was more like Burwood than Muston, Mother and Grandma were sitting by the front of the house, I felt myself running across the lawn & I was in Grandma's arms and Mother was running away, when I caught her she seemed to not know me.\n\nThe dream remains and the dull terror of it.\n\n138.\n\nEarly morning – the prettiest piece of aerial performing we've seen for a long while. The Bosch are in low, but above one of our own planes. Then the diving, rising, volplaning and climbing were perfect. The Bosch drive our man almost to earth and through a most intense barrage gets here. Again an hour ago the performance\n\nSept. 5\n\nrepeated – though the position reversed. He's been full of bluff and gameness today, which is strange after all his late previous care, and he flew lower last night in his raiding, which all points to a coming movement on our part he's not looking forward to, the oil still is we are going in before Sunday.\n\n139.\n\nMet at Zoi's – after Coffee with Robby, a N.Z. and we yarned an hour on the Architecture and the wonders of the places we've seen.\n\nThe day's lovely – sunny & warm, more of a perfect Spring Day than one of Autumn.\n\n140. 9 p.m.\n\nTonight a concert by the 4 D.A.C. in one of the cleared out ward shacks. Full of Ragtime, and good stuff too. One gave to me an entirely new interpretation of the 'Musick'. You could translate none of the words from the Musick, the voice merely became a weird accompanying to the piano. Buck damns to the lowest hell all Ragtime, by an Italian name the rose would smell sweeter. The damning led to an argument – and I as the champion of Ragtime - usually I mistrust it - I contended it the musical expression of the age – a statement I'd have been hard put to explain, and he damned the age, as \"decadent, preposterous and entirely void of art and Artistry. And to explain his understanding of that terrible word 'Art', he asked \"what Artists have we – what Artists?\" When I took the wind from his sails by \n\ncataloguing names – and cataloguing them under the headings of Literature, Painting, Sculpture and Architecture, using as arts. Rodin and the English portraitists and Impressionists, he withdrew with majestic superiority.\n\nAs for literature, the present age is certainly the most productive of the years. Poets, minor and otherwise abound as the supply of ball from the machine guns, and such a bewildering number of novelists and essayists have reached such a standard of style and manner, that it would seem every second reader wrote to be read, and widely too.\n\n141.\n\nSeeing that this is a 'Diary', the raid last night of no excitement. I slept through it but lazily heard the machine guns in the air firing down the road alongside the station, some apparently went through some of our lines of marquees but beyond narrow escape there was no gain or harm done. About the time of the splendid 8 p.m., he dropped from a great height five bombs by the but did no damage.\n\nIt is significant that he neither shells nor bombs Steenwerck, and the church square would make a most paying – there are so many lorries there, and two full workshops. There's one explanation only, the place is filled with well working spies, who evidently justify their immunity from shell fire.\n\nBy the French paper this morning heard that Riga was seriously menaced, tonight hear she's already fallen.\n\nSept. 5\n\nQuite obviously the Bosch fears on this front – if the weather continues fine he'll have reason. The road for some which last night was under the traffic of guns, and again tonight, at intervals lately too though some of the N.Z. guns have come down, a far greater number have gone up. Then again the air has filled for the full share of straffing, and tonight's raid has started.\n\nThree submarines reported \"by one who knows in a high place\" sunk by Boulogne harbour. The second day bringing no mail or paper. Boulogne port closed. By the T.L.S. of Aug. 30, Waugh's \"Loom of Youth\" in its 4th edition. If Toby still has it 'whole' will send it home to Geoff.\n\nSept. 5\n","55":"\n\n142.\n\nReading tonight – and its jolly interesting – a phamplet I bought in Westminster Cathedral, \"The Benedictines\", writing of the grandeur and \"splendid ritual of the church – The existence of God is, in the mind of the Benedictines' work, an opportunity for giving to Him the very best. To aim at perfection in solemn ceremonial, in Art, in musick and in architecture is deemed a duty which man owes to God, and for him alone exists all that is generous and beautiful in creation.\"\n\n143. Sept. 6\n\nEarly about 4 a.m. heavy rain, then a solid carnage of fire from our guns that lasted a good hour. Quietness a while, and then heavy artillery fire again and is still lasting well at 10 a.m.\n\nWrote two pages of letter to Mother, & will keep one to post. Dreamt again badly, of Mother in Edinburgh, and the mother of last night's dream.\n\nSept. 6\n\n144.\n\nAn anti aircraft dud shell through the mortuary this morning, the dead had just been buried. Lying here in the tent – regularly in the winds at 10 oclock we hear the low monotonous intoning of the burial service and the following lights out. Follows the salute by the two bearers, the bugle, and perhaps by a rare mourner, and the marketed body is buried closely to those of yesterday and the long row of the dead surely fill the whole long field. Mark each dead exit of his country a plain bare wooden cross with its three aluminium strip of his name, his unit and his country.\n\nAnd to the morning of those \"Rich Dead\" comes to the mind with all their beauty Brooke's lovely sonnets, Blow bugle Blow and \"If I should die\".\n\nWhat is their ultimate place in creation: I think they will rest well, and they'll know goodly company, and their spirits well joining to the only Heaven they've known, Australia.\n\n145.\n\nA wonderful green black 'inverted bowl', and soft mist all round the horizon: the light clear, and the green of the trees and grass very beautiful, thunder rushing over the skies like heavy manacle chain dragged over great space, and faint flickering forked fantastick lightning, the rain, and a discharge of great drops. Now the skies of thin menacing clouds, and the air crisp & cool.\n\n146.\n\nMet tonight here an old pal of Jonas's, and the whole of the school of his followers are alive again in memory. Pater, the Russian pagan, who believed in nothing, George Martin the once close bosom pal of Frank Hungerford then of McDougal, and Bartlett.\n\nSept. 6\n\nGeorge and Frank the greatest of pals in Egypt, and a well matched pair – clean living & direct chaps. Then in France Frank was dropped for Mac, and their palship was a very real thing till Mac was killed at Flers, now the last I heard of George was from Clarrie, who saw him in B Details. George is for the Methodist Ministry, Mac was \"a wanderer in the middle mists\". Bartlett was a – is – a C. of E. Minister, inarticulate in an argument, and Jonas the leader of us all – a convert to Rome, and full of the wondour and learning of the church. Tall. ascetic, full of enthusiasm that lit his eyes and filled him with animation, with a luminous ivory, always ready and full of an interested tolerance as Mac for a Max Beerbohm portrait.\n\n147. Sept. 6\n\nThe only 'oil' available on the heavy hours bombardment early this morning, no cases from the force of the bombardment through the Dressing Room, the 'oil' came from a chap down from Armentieres, from him the bombardment was above Armentieres, we had sent over some new gas – gas that burns the helmet of the Bosch through and liquid fire, the Bosch infuriated leapt the parapet – and our barrage caught him. The bombardment that commenced later seems to be more from the Ypres section, and now, after the rain, etc., still beating on.\n\n148.\n\nThe first paper today for three or four days, dated Sep. 3, the news of importance is that Ashe has re-dressed his Chou Chin Chow – and the \n\nSep. 6\n\nPhilistines are on their hind legs judging from the five portraits of new dresses in the Daily Mail, their fantasy doesn't come up to the old dresses, principally Burmese in their style – an origin – and remembering the dresses of the \"Women of the Desert\" and other stunts it's hard to see just the points of objection.\n\nAshe answers their whingeings and dismisses them in a line as \"absurd and hypocritical\". Before the court of Basil & Les, we tried and judged the case. Ashe we congratulated – \"you'll do us Diggers\" and dismissed to the tune of \"We are the Robbers of the Wood\".\n\nIf the Philistines want to roar let them do their roaring at their stinking Revues and their dirty insinuations.\n\n149. Sept. 7\n\n11.30 p.m. Frank brought in tonight late a letter from Erskine Macdonald to M.F. subscribers 1st editions of the Soldier Poet are available. \"From an Outpost\" of Coulson is a bonzer in the collection, and we read it first by the embankment at Bullecourt early last May – read it between carries. The second part of the Bullecourt stunt, when Billy was in Blighty, Scotty buried in a shell hole by the R.A.R. and young Monty on his way to Blighty. I was odd man. Then emergency dresser, guide & runner, coming back each time through the valley of the Dead Coulson Outpost poem and \"The Hound of Heaven\" kept my mind from the shells. Getting back each time through that smashed narrow sap\n","56":"\n","57":"\n\nover and over again, the first verse of 'The Hound' I spoke to myself. Taking any of the wounded walkers down was all right, then you weren't game to shew you were windy, but coming back was murder.\n\n150. Sept. 8\n\nPetit Sec Bois – with the Ambulance again - Motor Amb. from C.C.S. to Billets. Mail of Literature – Masefield's \"Lollingdon Downs\", addressed Y.M.C.A., A.I.F., B.E.F., France, Swinburne's 'Song of Italy' the first edition from Bakers', Birmingham, and the parcel from Hendersons – including copies 2, 3, 4 of \"Today\" which promise a jolly fine Rag, will subscribe.\n\n151.\n\nA match against the 3rd Batt. French Motors - the prettiest game imaginable, two teams of brown Pagans in the best of nick. Joe and Nick played a good game. J. especially so. Tomorrow move to take up a M.D.S.\n\n152. ","58":"\n\nDickebusch, M.D.S.\n\nUp and away from Petit Sec Bois by 7 a.m. In motor lorries A and C Sections to Dickebusch, and we take over the M.D.S. from the Tommies.\n\nThe afternoon half through, half of Swinburne's \"Song of Italy\" and No. 2 Issue of 'Today' mostly read, and I've finished reading. As yet only a few detailed to duties.\n\nAbout 2 the Bosch was over – in a formation of 9 planes. Bombs he dropped all round us – about 10 in all, though they were small they did disastrous work, men and not guns suffered. 40 bad cases we dressed here, the of dead in the billet about 200 yds. across grass.\n\nTwo of warr's terrible Ironies – one Tommy who had served his full sum of years in the Army – tonight to leave for a discharge in Blighty – killed, and another, going on leave – he's right hand blown to bloodied flesh hanging on broken bones.\n\nSept. 9\n","59":"\n\n153.\n\nThe Book list stands now – Masefield's \"Lollingdon Downs\", Dunsany's Plays of Gods & Men\", Hugo's of Iceland\", Swinburne's 'Song of Italy', Brooke's \"Selected Poems\", Keats, 3 numbers of \"Today\", Waugh's \"Loom of Youth\", St. Phillips \"New Inferno\" and Materlinck's \"On Unity\" , works of P. Pearse. Transport? Some with Bob Sommerville in one of the Ambulances, some with Mac in another, three with Frank Stone in the O.R. papers, and Swinburne & Brooke and 'To Day' I carried in the pack.\n\n154. Sept. 10\n\nTo see that all patients get well 'fed up' – in the practical sense. Till the end of the week when our Brigade will be up there'll be mostly only Tommies through.\n\nShift 9 till 9 in the stunt. I'll be Dressing.\n\n155. Sept. 10\n\nReading the afternoon – the day brilliant and warr – quiet but for an occasional lazy beat of a high plane, or the sudden great whineing cry of a shell falling somewhere behind us – Masefield's Sonnet of Beauty in his Lollingdon Downs, and a play of Dunsany's, \"The Laughter of The Gods\", and \"The Queen's Enemies\". The designing of costumes and settings to one of his plays offers fascination. Ashe could do them well – but they're of a different atmosphere to his individual stuff – tho' their atmosphere is of the places he knows well. Barker could do them better. One of Ashe's in Chou Chin Chow was of Dunsany's though – a supremely simple and lovely design, she was a slave – beautiful and wounderful. Her hair was white – high dressed closely\n\nthe broad forehead sweep, a great bulging 'beehive' dressing she wore – a great white woollen cloak wrapt round her lovely glistening shoulders, and held over her breasts. This whiteness and beauty were exquisite.\n\n156. ","60":"\n\nHe's an \"I'm as good as any of them!\" type, yet he's full of a pseudo vivaciousness that, effeminate though it is, is only tolerantly held as funny, in the old life he was – report has it – a 'Dancing Master'. He is an animated marionette happy to laugh with you, when you'll laugh at him, and I've to split the 24 hours working with him, he is annoyed in the Methodist fashion already with me – to give bread sop to good patients seems unnecessary – even though they'll be hungry and done out. His stalwarts around like flies round the buffet & affect an exclusiveness in their speaking. Hoboes of the \"deeply-stupid-in-Hoboism\" type.\n\nThe day's been perfect though, of reading I've done nothing, all the cases through are gassed by the new mustard gas & have to be dressed with care, the dresser wearing both gloves and Box helmet.\n\nWe've lost our surface dug-out. I'm sleeping behind the O.R. with Frank. No Mail.\n\n157. ","61":"\n\nTen Bosch planes over the station this afternoon. Anti air craft guns shooting, ROTTON.\n\nCases through constantly till now - mid afternoon - and all gassed by the new terrible mustard gas shell.\n\n158. Sept. 12\n\nDuring one of the raids one night at Steenwerck, I started and half finished this – I finished it yesterday.\n\nNight Raid Impression.\n\nFrom round the horizon searching line of light pierces into night starred skies. \n\nFaintly down the darkness runs the beating of a swift machine. Remorselessly the pale fantastick fingers move slowly up and down, up, over and across. \n\nOf an instant, dully, viciously, a near gun vomits its shell and a rigid white gleaming moth lives leprous in the light.\n\nRound starkly mounted guns stiff nerved bodies relax.\n\nThe gun wakes, her head lifts, \n\nClimbs higher, across and up.\n\nA dull heavy overture of shells speed heavily high.\n\nGold sudden flashes in the night,\n\nAnd the hollow whip of their death.\n\nThe machine guns match their elated chorus.\n\nA thousand feet high, a touch releases an impatient compacted hell.\n\nA great sweep and a rushing whirl as it turns to earth.\n\nFollows another, and two more.\n\n\"Thank Christ the billet's thatched!\n\nDid you hear those bloody .\"\n\nSlowly the living beating dies down the night.\n\nAnd the faint tired drum – fire of a starting by Ypres drags on and on.\n\nToday posted a copy – \"The Vanity of Vanities\" - to \"Today\" – with 10 Francs on a year's sub. to include the 1st copy.\n\n159. Sept. 12\n\nLast night Tom Davis blew in and we spent an hour yarning in the Buffet, the first I've seen of him since one day in Oct. when we had lunch at the stores, both in new uniforms, last Oct. twelve months.\n\n160.\n\nReading \"Lollingdon Down\", John Masefield – I started out crossing the corners of pages whose sonnets fully appealed, now I've stopped it, merely in crossing of every page. Today I wrote to Bakers for \"Martin Hyde\" and Masefield's \"An English Prose Miscellany\". Later I'll get the others he quoted for – Gallipoli, 10\/- and 'Capt. Margaret', 9\/-.\n\n161.\n\nA jolly nice little letter to night from \"Your old Auntie Louis\". Of some of the 'bonzer' little women of the world she is one.\n\nThe two books – Davidson & Watson arrived well.\n\n162.Sept. 12\n\nSome day I'll have a finely designed case of books – there'll be 1st editions only and books of some fineness. There'll be Meredith's \"Ordeal of Richard Feveral\", Hardy's \"Jude the Obscure\", McKenzies \"Sinister Street\", Barrie's \"Half Hours\", Pater's \"Imaginary Portraits\" & \"Marius the Epicurean\". Poetry by Masefield, Brooke, Swinburne & Keats – and certainly Leslie Coulson's \"From an Outpost\". There'll be something of Symons, perhaps and Wilde's \"Intention\" and \"Dorian Gray\", and on Symond's Italian essays if I can get them.\n\nOh God for the quietness of home and books.\n\nA cabinet – in the print cabinet style for Mags. & literary Rags would be a rather interesting collection.\n\n163. ","62":"\n\nToday my birthday: the 21st in Liverpool, 22nd at Wimereux, and the 23rd – today – at Dickebusch in Belgium, the 24th?\n\nPresents to myself – an order to Bakers for Masefield's \"Martyn Hyde\" and \"An English Prose Miscellany\", and 40F. to Mayhew on account of 8 books he's putting aside, and from him the first edition of John Drinkwater's \"Olton Pools\".\n\n164.\n\nNow I've just finished the reading of Dunsany's new book – \"Plays of Gods & Men\". Four plays in all make up the book, published by Fisher Unwin, printed in Dublin. The first two are good – the second fully up to the standing of the plays in the book I bought in Edinburgh for 3\/6, and catalogued S.H. by Baker at 18\/-. That book \"Plays\" is infinitally the book in which Dunsany's merit will be founded. \"The Laughter of the Gods\" is a tale of the vengeance of the Gods, a false prophecy from the lips of their priests, became the truth, and the town is annihilated.\n\nThe third play, \"The Tents of the Arabs\" I skipped – but read the last spoken lines,\n\n\"I will raise up my head of a night time against the sky, and the old, old, unbought stars shall twinkle through my hair, and we shall not envy any of the diademmed Queens of the world.\"\n\nOf Synge all I have read is \"Deidre\", this of Dunsanys is somewhat in his manner.\n\nSept. 13\n\n\"The Night at the Inn\" is simply a rather an unique juggling with the ideas in \"The Gods of the Mountains\".\n\nToday cold and dull, a rotten, rotten, day, reading was taboo, and work slack.\n\nThis afternoon the 20 Batt. passed in Battle order, B Company of the Ambulance left Petit Sec Bois, and are expected here tomorrow. Wrote to Mother, this time a letter I'll post.\n\nThis afternoon full of restless desires, and longings, for everything millions of miles from war and its ideas. Damn, Damn!! Damn!!!\n\n165. ","63":"\n\nA mail in late last night – so I'd some home letters on my birthday. One from Mother, July 8 and from Billy the same date and of the good ones one from Mrs. Curtiss, July 8 too. Only two letters have I received from Mrs. Curtiss, and both very touching notes, full of real love and emotion.\n\nThe rest of the mail barren stuff – full of hypocritical endearment, funny almost in their smugness, one in particular after a page of written \"sympathy\" going to news, bemoans the attendance of physically fit at picture shows and theatres, damns those who \"fail to do their duty\". Father declined an invitation to that man's son's wedding last year, and his son is still one of the fit shirkers.\n\nGeoff going for 6 months to some farm. I don't understand it at all but from the Mother's letter his eyes are bad and he'll continue his course next year.\n\n166. Sept. 14\n\nIn the autumn announcements of Sept. 6 Times Literary Supplement appears a Swinburne notice. Messrs. Heinemann have acquired all his copyright – and anticipate publishing après la guerre a definite edition of verse & prose. In the meantime his unpublished Posthumous stuff in printing & will include the early publication of two vols. of letters, also a cheap pocket edition of sacred 'Poems & Ballads' and other vols.\n\nThis morning I've been reading the press notices the first series of his \"Poems & Ballads\" received: at the back, & between end page of \"The Song of Italy\" are a fair number of contemporary criticisms. They form in themselves a compared to \"Art & Morality\" of Mason – or Wilde's \"Picture of Dorian Gray\".\n","64":"\n","65":"\n\n167.\n\nA long day of solid going for all hands. Thirteen Bosch planes over this morning – as usual the shooting – \"Moody!\" Bombs dropped accounted for half the morning's dressings, then big batches – 10 to 40 at times of gassed kept the ball rolling.\n\nNo bombardment yet started but rumours still run wild.\n\nTonight I got my Keats back – from the B Section Bin of the O. papers.\n\nLast night Nick brought over two cuttings from Sydney's papers of the Dad's funeral, he is dead three months today.\n\n168. Sept. 16\n\nIn the line the bombardment started now with a vengeance – either tonight or tomorrow the Bearers go up. The hour's about 11 and already we've had a full squadron of 16 Bosch planes\n\nSept. 16\n\nover, they turned directly above us, and made back, shooting good for a while, but directly they'd banked well together it turned dry. Two enormous planes kept well amongst the others, but the gods of the Kaiser protected them. Anti air craft shooting is an absolute dud – except for pulling up a turning barrage, the planes today were so low that their compleat crosses could be easily seen.\n\n169.\n\nLast night a photograph from Toby, the supper a success.\n\n170.\n\nIn this morning's orders, Kirchner pronounced anathema, and \"La Vie Parisienne\" declared beyond the pale.\n\nIn a word – trading with the French in indecent pictures and literature is forbidden. The 'indecent pictures' referred to are of the French – photographs of the nude – and of beautiful courtesans certainly, so beautiful that only rarely can the terrible word 'indecent' be used towards them, but the literature! Considering the only doubtful literature sold to the Troops by the Frenchies comes from well established London publishers, this order is quite in keeping with their damned hypocrisy and pettiness.\n\n171.\n\nToday's mail – one letter from Mrs. Hadley. I'll send to her for keeping now Swinburne's \"Song of Italy\" and Masefield's \"Lollingdon Downs\", later then to \"Auntie Louis\" the \"Works of Padraic Pearse\" & \"Earth or Cualaan\".\n\nIf the twenty note I'm carrying now is unbroken by next pay, to Bakers I'll send 15 for A.C. Benson's \"Upton Letters\" & Swinburne's 3rd series of 'Ballads'.\n\nSept. 16\n\n172.\n\nAn hour since A and B Bearers left for the line. Tomorrow the remainder go in, and on Tuesday the stunt of stunts starts.\n\nThere's a destiny in the air, and a peculiar half hidden elation, the Battle will be ours – they'll take all their objectives, and the bloody price paid will bring new stars into Australian Heavens. Christ God help them!\n\nAgain the little rising sun will be the badge of another tragic success, there's high tragedy to be acted now, and the actors are Australians. An exultation will carry them through – an overpowering exultation that will bear a passion of fighting, and there'll trickle through the station a thousand tattered and warr wounded – their wounds ranging from shrapnell scratches to torn off legs and arms, and ripped bodies – a thousand who have made history super-splendid for a country young to fame.\n\nAt Bullecourt I kissed in the dark an old bronze badge – out of passion of love for those who owned it.\n\nThe night's rich in blue colour, and the tents are black silhouettes against a dark sky of a faintly lit horizon. The gun's lightning is quick and faint.\n\n173. September 17\n\nMother's birthday today.\n\nIts dull and there's a promise of rain in the windy sky, and the cold's coming over again, the early days of the winter seem looming darkly ahead.\n\nSept. 17\n\n174.\n\nSyd was 'up' this morning: yesterday afternoon being in Pop. he was too late back to camp to go up the line, seeing he had the impertinence while we were at Henencourt to apply for his second stripe – after service since the beginning, being wounded, the M.M. at Factory Corner, and being generally depended on in a hundred military ways by the M.O. and half the non coms. A L\/Cpl., so!\n\n175. \n\n- and working next to us now, some of the 7th Field under Maj. Conrick, D.S.O. of Bullecourt, at the 2nd General last year he was one of the wardens, and with the 7th he's the \"Butcher\", and the damnable part of the whole concern is that by the people at home their decorations mean only wondour and work that has counted.\n\nSept. 17\n\nSept. 18\n\n175.\n\nThe evening's colder than the morning promised: the stunt hasn't yet commenced, and a half hour ago a few rain drops fell. Another train load of bombs has just passed the station, and today Tom Richards through the D. Room, briefly outlined the stunt's objectives. Already two of our bearers have been knocked – report has it, Algy and Jim Mitchell.\n\nTomorrow?\n\nThrough the station today there's been a fairly steady flow, but nothing like the expected rush that will mean the stunting.\n\n176. September 18\n\nJim Downie, Freddy Flowers and Nic, killed in action. Wounded, badly, Sgt. Reid – in the abdomen, he left here in a very low condition, and \n\nSept. 18\n\nthe doubt was whether he'd reach the C.C.S. Matthews – Matty is in the Resuscitation tent now. Knocked in the head, and arms, shoulders and legs, he's lost a deal of blood, but his chances of pulling through are good. Toby and Nick – both 'cushy' wounds – probable Blighties. Also young George Cochrane, and the Sentimental Bloke – good Blighties. Stubbs, Lofty Owens, Ern Brown, Jack Bottger & Duval, Paddy O'Houllihan, and Robbins and Mulholland.\n\nTwo days in, and 22 casualties – three dead.\n\nMidday now, and the morning's been quiet and even, a thin drizzly rain has helped to dam things, and the sky's full of unshed rain.\n\nJim Downing was ready this week to go on leave: Nic joined us up at Henencourt and this was his first time in.\n\nLater. Sept. 18\n\nReid reached the C.C.S. and seemed better on arrival, it's a Canadian C.C.S., so his chances are good.\n\nNic few of the chaps here seem to remember: he was a tall slightly built young chap – perhaps not yet twenty, and this was his first stunt. Attached to the 2nd C.C.S. he was one of the night bearers, and the quickest of the crowd, always in the morning rushes gave one of us dressing a hand with the most difficult.\n\nIn A Section he had no particular friend – he played Cricket at Henencourt, and seemed particularly attached to no party.\n\nAlmost he was one of the Predestined of Materlinck's exquisite papers, \"Predestination\". And Jim Downing: an easy slow going bootmaker of Henencourt and Freddy? always reading.\n\nSept. 18\n\nFreddy'd softly enquire, \"What is it this time, Frank?, and he'd be interested when he had no sympathy with the matter.\n\n4 p.m. Paddy dead and Sgt. Reid at the C.C.S.\n\nSyd has gone down to see Erny.\n\nThese laid the world away: poured out the red \n\nSweet wine of youth: gave up the years to be, \n\nOf work and joy, and that unhoped serene \n\nThat men call age: and those who would have been,\n\nTheir sons, they gave, their immortality.\n\nBlow, Bugles Blow!\n\nIn the cemetary by the station they buried the bodies of Freddy, Jimmy and Nic.\n\nTonight C Section Bearers go up, 6 p.m. The Col. and Syd back from the C.C.S. Ernie and Duval – Ernie penetrating wound chest, and Duval abdomen – both stand a chance of pulling through & Young a good chance, a lot depending on himself. Nick and Toby and some of the others already entrained. Matti still here in the Resus. tent, and a 100% better.\n\nThe sky's clouds seem thinning – but the air's grey and cold.\n\n177.\n\nTomorrow I'm to take over for the stunting the Resuscitation Tent. Thank Christ the days of mouthing \"cheerful clear flat platitudes\" are passed. Cheerfully serving Coffee to \"Damaged Goods\" when hell's delight is the day's orders would be rotten, and in the Resuscitation Tent I'll have a decent chance.\n\nIt's about 9.30, and the big bombardment started a while back. The sky's clearer and one long flicker makes it always bright.\n\nSept. 29, 20, 21\n\nSept. 21\n\n178.\n\nSept. 19. Neilson died of wounds at A.D.S. and Syd Knight wounded.\n\nSept. 20. Only serious cases through the station and a stream all day. In the Resuscitation Tent and Les working there too. In the afternoon Tom from the Q.M.'s dept. in to give a hand with Mason - Bike orderly and O'Sullivan. The stream continued till early this morning, at 9 the tressles of the R.T. empty, and the Bow hut next to Dressing Room now used in its place.\n\nThe stunt?, seemingly it's been successful from the jump, but we've \"no guts\" since 9.\n\nThe day's magnificent, clear and a brilliant sun.\n\nThe curl round the 'a' in magnificent – from a starting at the opening up of the anti air craft gun alongside the station.\n\n179. Sept. 21\n\nSomebody a while ago used the phrase, \"a picture no artist can paint\", there's one subject only, one man has been remotely successful at 'War!', the man is Raemaeker, and of his remembered cartoons the one that holds some of its big horror is the one of the living demented woman amongst her murdered dead – she kneeling over the ravished body of a young girl.\n\n'War' – as a stark splendid youth in a great charge, stately marching over heaped dead is the sentimentalist's idea of a force he only imagines.\n\nAs a figure of Death carelessly scything long ranks of men, there is only an imagined side. Bloodiness, sheer horror and torn parts of men, futile agony and pity. War cannot be fastened on canvas as the other forces.\n\n Bert Reynolds latest knocked. near end of book.\n\nSept. 21\n\n180.\n\nThe rumour comes down that two more of the Ambulance have been killed and six wounded. Nothing yet been heard of Ernie's or Young's condition, the last heard was of a favourable progression.\n\nTonight Tim down to the station and an hour's walking up and down the road that runs by us. Talking of many things and casualty – and we with few late subjects of old interest. Blighty and Amiens and the Somme, and of the men who make up a unit.\n\nThe coming night gave us – or provided the perfect background, for a display from a Bosch plane. Secretly he came over – and fired into one of our baloons, a long lovely pillar of darkening smoke from a lurid gold flame, and a million pale and brilliant stars, a fantastick Pogany - with the bright colourings of Branguin.\n\nThree times during the day, fleets of his planes have come over, by report they dropped bombs by Hill Corner.\n\n181. Sept. 22\n\nA fourth raid about 9.30 last night – and a dump caught a few miles across from us, burnt till we tired of watching it, some of the cases through here – about 7 in all, six killed outright. Cloudy sky holds today – but bright otherwise, quiet generally.\n\nMail – one receipt from Mayhew, and word of his seeking for Drinkwater's Olton Pools\". Parcelled up for Mrs. Hadley, Song of Italy and Masefield's Lollingdon Downs and for 'Auntie Louis' The New Inferno and Dunsany's book of plays.\n\nSept. 23-24-25\n\nSteenvoorde\n\n182. Sept. 25\n\nTo Steenvoorde from Dickebusch on Sept. 23rd by M.T. lorries. Billeted about 2 kilos outside the village, in the centre of lovely fields, in a group of thatched farmhouses. Writing this before 9.30 parade – down one of the roads comes a column of our Infantry, brought down from the line by Transports, and resting till the end of the week.\n\nThe rich male musick of a bugle band plays their time. As men they're again the splendid types they were last year.\n\nFrom casual report our casualties have been wounderfully light, while those of the Bosch have been correspondingly high, and they took all their objectives – and could have taken more. We are expecting to move up again at the end of the week – to take over the A.D.S. Then there'll be stunting again, the 1st Brigade will be in again.\n\nTurning in last night Frank and Basil & self yarning – on a subject now generally taboo – taboo seemingly because of the distance to be gone before the ending.\n\nThe warr, the conditions internally and in the line of the Bosch, of the Porters, of the Tommies, and of ourselves. It was a delivering of opinions – personal – of the attitudes to be adopted towards the Bosch 'Apres la Guerre'.\n\nPersonally I cannot yet place my own attitude, I 'clutch at shadows, Cry, and cannot tell'.\n\nAlways the art of Building, of Decoration, and of Architecture as practised by the Bosch till 1914, have irresistibly appealed, have appealed even on the highest and most perfect periods of English Art, and certainly they have evolved out of the centuries' styles, a unique and most fitting modern style, here France cannot attempt\n\nto compete with her.\n\nEngland? England's Architectural Arts and Buildings remain distinctive and high, but she owes a very great deal to Germany. Witness one of the highest forms of Art – the Art of the Theatre, there to Germany England owes enormously, though repays her debt by her loan of Shakespeare.\n\n183.\n\nYesterday's mail brought Copies 1, 6 & 7 of \"To-Day\", the day before's Masefield's 'Martin Hyde' and his Anthology of English Prose – with his introduction. 'Martin Hyde' I started immediately – Stevenson and Conrad on a shelf with this of Masefield. Three masters of the Romance of Adventure, and each with his own individual style.\n\nLast night Bosch planes over somewhere about Steenvoorde bombing, here we heard about half a dozen crumps then hideous elation.\n\n184. Sept. 25\n\n\"Ah, Snowy's gone to No. 2 Aust. General Hospital –\"\n\n\"Who 'as!\"?\n\n\"Maclure!\"\n\n\"That's a --!\"\n\n\"Where is it: Rouen ain't it!\"\n\n\"No Blighty!\"\n\n\"No its at Abbeville – or that's No. 3!\"\n\n\"What's 'e gone there for –\"\n\n\"—to have a – good time! wish I could get there.\n\n\"Ow'd he manage it!\"\n\n\"He's got a brother there who's claimed 'im!\"\n\n\"Wish to Christ I 'ad one of those brothers in a cushy job!\"\n\n\"And so his knoll is knolled.\"\n\nA golden haired young lithe pagan full of the joy of the sun, and with a taste for the voluptuous wonder of Ancient Greece.\n\n\"I bet Mac's drunk before he – well leaves 'ere!\"\n\n\"The lucky --!\"\n\nSept. 25\n\n185.\n\nThe Billets are old thatched Farmhouses built along the short side of a great rich grass'd tree bounded paddock: at the opposite side to the Farmhouse, 500 yards down, a stream runs across the paddock: at one place the stream has been dug out on either of its banks and a great willow lined pool breaks the stream. That is our bathing place. This afternoon Mac has left for the 2nd: the entry, 184, I wrote on hearing just as he'd left the Billet to parade to O.R. To the Billet it was one of the Transport chaps that brought the first suntan.\n\nThe afternoon lovely for writing – for a walk to the ridge that dominates our plain, where the town of Cassel is built. Or even to the village of Steenvoorde to see nearby the church, its fretted spire rising from the rich brick tower.\n\nBut my ankle's in plaster coils, so I'm by the bathing pool. The footballers are between myself and the Billet, and their shorts and Guernseys would make the high Gods weep.\n\nI've again my \"From a College Window\" of A.C. Bensons. Bus brought it into the D.R. at Dickebusch just as we were leaving, and Darcy carried it with my library to here.\n\nIn one week I've lost three of my best friends – Nick, Toby, and today Mac. Harold will get to Blighty but it will be only with a lot of luck. Toby will follow him.\n\nNo mail today. One letter dated July 15 yesterday from Mother.\n\nRead \"The Simple Life\", A.C. Benson.\n\nSept. 26\n\n186.\n\nJoined up the unit again, Bill Dunn, Jack Maddox – both wounded at Vaux and Bullecourt last May, and 'Hunter' (Underwood) from the C. Cadet School.\n\n187.\n\nLast night walked with Frank into Steenvoorde: waited in the queue of the Kookaburras for a half hour and with a long line turned away. Then walked through the square – listened a while to one of the Brigade Bands.\n\nThe town full of the 1st Divisioin, and they all looking splendid. They're tanned by the summer sun, and in wounderful nik from a heavy training of three months behind the Somme. Added, their success and few casualties in the beginning of the stunt that's still on, have immensely bucked them.\n\nEvery estaminet, shop and eating house was crowded. Met there one of our chaps who had left us at Henencourt as an A.M.C. detail to one of the Artillery Batteries, he now detail to 1st Divy. Signallers.\n\nThen to the church. The Tower of old fine now wearing bricks richly rising from its clustering houses of large-tiled roofs. Against the pale sky, enclosing the town, down the road with the tower rising from directly our front, there was in its design all the quaintness of a Samuel Prout lithograph. The fretted spire not in keeping, and spoiling in the effect. The church itself hidden out of proportion by the Tower, seems new. Its design inside rather fine, and certainly unique. The old cross plan survives, but its trancepts shallow. The\n\nSept. 26\n\nwhite stone pillars at the crossing, built evidently to support the lantern tower, support but a low of walling, that rises only 1' above the apex of each arch. The ceiling is vaulted, and line behind a timber ribbing. The effect is fine and unique. The High Altar ends in an apse, the Nave, and the Lady Altar and are of the aisles: the altar rail and steps enclose the three.\n\nThe windows are modern and of poor stained glass.\n\n188.\n\nToday we've our flag up, or rather England and the Red Cross. Why we are not permitted the working under our own starr'd flag beats me, and half the unit. Today wrote letter of six pages to Mother, and read \"Martin Hyde\". Its 'tres bonne!\"\n\n189. Sept. 26\n\nNo mail – posted to 'Aunt Louis' Padraic Pearse \"Works\" and \"Earth of Cualaan\". Two books of Maunsells, that of Padraic Pearse full to each of its covers of beauty and loveliness.\n\n190.\n\nToday green envelope, Norm Reed used to give them to our section – he's dead.\n\nHe only joined us up at Henencourt, and in a month had taken Cliff's place. We lost Cliff to B. Section, and cursed them accordingly. Then came Norm Reed. He was a big chap, finely built – a larger edition of Jake, with all his pagan grace, with all his vitality and character. He filled Cliff's place so well we followed him willingly, and in every way he was 'one of us'.\n\nHe was of the type that\n\nSept. 26\n\nhas given all the honour to Australia's name, and he's dead. His white cross in some cramped graveyard, by the dead of the stunting and past stunting is another part of the \"glorious pageantry of wounderful war\".\n\nIf these damned preachers who preach this a \"cleansing warrr\" could be brought face to face with a sap of shell'd dead, their mouthings full of God's name would wither on their thin lips.\n\nAnd Paddy, Paddy with the heart of a girl child, the tenderness and love of a woman, and the stubborn soul of a martyr. On leave last year he was married, took as his honeymoon 17 days 'without leave' – and did 21, 1st F. punishment. Here in the unit his irresponsible nature and stubbornness not being admitted by authority, he was a typical case of the chap of worth at his work, but 'up against' authority – authority that is here in the Army every bit as bad as any Bosh militarism.\n\nReports up to today report Ernie and Duval still hanging on. Ernie with some improvement. A thousand times I've cursed him silently in my mind, when we've been in some hot position, but his coolness and unnatural calm has always had its effect, and we've owed our lives to him.\n\nAn original of the Ambulance, and having sufficient character to believe in his own experience against the knowledge of the vacuum, decorated by three stars, and bearing till he was knocked, not till Bullecourt did he get the M.M.\n\nSept. 26\n\nAt Factory Corner last Feb. he was hauled over the coals for taking the saving of a man's life into his hands.\n\nAt the R.A.P., and a new newly arrived newly fledged, by university examination, doctor! – a child wearing three stars with the experience of medical practice afforded by a six weeks transport across the Indian Ocean.\n\nTwo Inf. chaps were both badly caught at the Sunken Road below Headquarters by a shell. Ernie got his squad across to them, dressed them both, and put on the stretcher the one most alive: the other was smashed about the head, shoulders and had his guts protruding.\n\nThey started to carry across to the R.A.P., and met the M.O. (?) coming across to them in a fury: his demands were why they'd not sent Regimental to bring them to the post – why they'd dared to dress them without he first seeing them, why they'd dared judge the condition of the men and place one before the other.\n\nErnie was polite: stuck to his ideas, and carried on.\n\nThat Captain's ? charge was impertinence and Ernie's unreliability.\n\nIn a stunt that newly arrived M.O., if his Battalion suffers sufficiently heavily will get the Military Cross. Regimental and his Medical Details will win it for him, he never will.\n\nAnd the Sydney University has shortened the Medical Course and now her machined turned 'Doctors' are arriving here to divest of its last shread the hideous skeleton of the old Doctor puppet lie.\n\nSept. 26\n\n191.\n\nWriting before turning in.\n\nHancock just bowled over from across the billet with a white satin square, centrely painted in lurid flames the tower and a part of the building of the Cloth Hall of Ypres. Encircling it a wreathing of pale pink and veau rose roses and foliage. Compleating the satin were two rows of lace, rather coarse but apparently hand made: in the four corners of the first row were tied seven blue baby ribbon bows.\n\nThis work of art cost him at Steenvoorde 20 Francs: my opinion as to its artistic qualities in comparison with the price were asked.\n\nIn Egypt – in the Wassah in the even as in the principle street the Arabs sold similar pieces of embroidery and painting on lurid blatant satins. Here, and in the Somme region the Flemish and French sell the troops the identical articles, cushion covers, scarfs and small 'embroidered' post cards.\n\nTheir colours are primary for the most part, and their golden inscriptions of the 'Love to Mother' and 'Remember Me' type. They are 'Souvenirs of France' – 'of Albert' – 'of Cairo' and 'of Belgium'. Their subjects are bunches of the Allies Flags, of rustic farmhouses, of Pansies, and floral designs.\n\nThey would be great trading articles with primitive peoples, and the traffic in them is appaling. To let them\n\nSept. 26\n\nhaving been sent home by 80% of the A.I.F. – sent home with an innocent belief in their beauty – would be safe and sure.\n\nA hundred times I've been asked to deliver judgment. I'd have given worlds to have done so on their , but I've cheerfully lied as the way out, and have saved my name as one who understands the elements of Taste.\n\n192.\n\nAfter 6 with Brooke's Selected Verse and No. 4 of 'To Day' for a walk by the Billets scattered by the farmhouses, along the white wandering roads that lead far away places by timid ways.\n\nThe reading I kept till I'd arrived back at Billets, then I read a review of Ralph Hodgsons new book of Poems. I have written to the Book Dept. of To Day for a copy – enclosing 5 Francs to buy a 3\/6 book.\n\n193. Sept. 27\n\nNo Mail.\n\nA 'Flemish fine day', the country as depicted in all the old Flemish paintings, calm and neatly outlined.\n\nSome of the new reinforcements today arrive, and Harold Long amongst them, a friendship to be taken up after a barren break of almost ten years.\n\nYarning to Steenvoorde with him. Straight from Australia after 18 months – or 15 at Nelson Island. D.H. Detailing him to the Bearers, but as yet to no particular section. Potato picking morning and afternoon, and from half a loaf of freshly baked bread.\n\nSept. 27\n\n194.\n\nThe 4th and 5th Divisions have – report here this morning – taken all their objectives in the advance and with small casualties. The A.D.S. seems to be still suffering, and the 8th have lost 4 killed & 28 wounded, similarly to our big batch of the 18th. Then the report, our bearers went in again two days ago, no report of them. The 2nd lost one of their Ambulance cars at the culvert from the A.D.S.\n\nAnd the A.D.S. is ours when we next go in, report next Sunday.\n\nLaus Deo.\n\n195.\n\nFrank last night shewed me a cable from – the information of it to go to Syd Woollems. His father dead, and he anxiously waiting word of Ernie, his sister's husband.\n\nThere'll be agony of mind for him when he hears, and a terrible woundering that it's some mistake, and there'll be no quiet fields and white sunken road for him to wander in, holding his misery and his mind the other side of the world. He's with the bearers, in the line, at the A.D.S. or about Ypres.\n\nIn a dugout at Flers last December I first heard him mention his father – 'the Dad', and it was in connection with his having received his expected commission – \"Wouldn't the old Dad be proud\". And he's dead.\n\n196. September 28\n\nAt 4 this morning the Col. up to the advanced area, to look out the position of the new A.D.S. we're to open up.\n\nSept. 28\n\n197.\n\nFirst I noticed him between his pair of horses at Dickebusch.\n\nHe was new to the Transport. Then I saw him here our first day in Billets. Two Flemish girls selling chocolate had found his identification disc, called his name at the Barn doorways.\n\nHis thanks to the girls were shy, they were offered with a colouring up and he was embarrassed.\n\nOnly in fatigues dress I've seen him – Kharki slacks, creased so they're no looseness, a brown cardigan, & his bracers over it, his hat badged and turned at the side – a slouch hat of a landsman. He leaves the impression of a country lad, well burned by the sun a rich warm colour, well featured and quiet, broad shouldered and well built from the hips, his ugly slacks contradict his legs building.\n\nSept. 28\n\nSept. 29\n\nThen yesterday, I saw him at the stream, stripped in the warm sun, flinging buckets of the stream water over his horses. He was rich in his build, and with the horses, the sun and green grass, a wounderful type – typical of Australia's country, of her colour and of her beauty. He's a number and a Driver in the A.S.C.\n\n198. Sept. 29\n\nDe Profundis, the word's our morning up most likely tomorrow: from last night word will be any hour from the A.D.M.S., and we for the A.D.S., advanced to the Bosch old country and close to the wood – West Hoek.\n\nLate last night – Frank and self to Cassel in the afternoon & back to camp late – word of 5 more of the bearers knocked – Pullen, Croden, Squires, Piam & another – the chap who exchanged\n\nSept. 29\n\nwith Mac.\n\nThis the last page of my third journal, the 4th to start with the last quarter, a bright moon and the A.D.S. amongst the guns – more than usual. My luck's held now for ten months – and the stunts – Flers – Factory Corner, the Yarra Bank, Luisenhof Farm, Ligney Thilloy and La Barque – Doignies Hermies – and Bullecourt. I've come through clean.\n\n199.\n\nOne of the white ducks over to pick up our breakfast scraps – a white duck, with a faint tinging through clean feathering of old ivory. The colour of her feathers for the walls, gold Chinese Brocade hangings to windows, a small casted Victory stained orange-Vermillion standing on a black basalt pedestal – olive green rugs, and three nocturne paintings of Syd Long, and a few designs by Thea Proctor.\n\n200. Sept. 27\n\nThe guns last night, early this morning and now – 8.15 a.m., heavily incessant, booming without cessation, and to here the bark of the 18 pounder won't carry. \"Did you hear there's a – war on?\" from a Transport the minute back, which led to this entry.\n\n201.\n\nMail midday – letter from Harold – from No. 5 Hut Cambridge Hospital, Aldershot, and he doing well, 'a bonzer Doctor, and fine sisters', from T.B.C. \"The City of Fear\" Frankau and from C. Bank word of their paying to to Robbie's account £5. Sept. 3rd I wrote for \"The City of Fear\" – with Drinkwater's book of essays. Since then I've written for one of Ledwidge's, one of Seeger and \"Letters of a Soldier\". These are still missing.\n\nEnds the journal started at Henencourt and completed at Steenvoorde in Flanders resting from the first stunting of the Menin Road Battle.\n\nWar Office letters\n\nQuaint Correspondence\n\nThose concerned with the payment of separation allowances receive some weird letters. The following were received by the London authorities –\n\nDear Sir – My husband has been away at the Crystal Palace, and got four days furlong, and has now gone to the Mind Sweepers – Yrs. respectfully.\n\nDear Sir – I have received your letter. I am his Grandfather & Grandmother: he was born and brought up in this house in answer to your letter. Yrs. truly.\n\nDear Sir – I am writing these few lines for Mrs. Morgan, she cannot write herself. She is expecting to be confined and can do with it.\n\nDear Sir. Mrs. Haynes has been sent to bed with a little lad. Wife of Peter Haynes. I am etc.\n\nDear Sir. In accordance with instructions on ring paper, I have given birth to a daughter on April 21st. Yours etc.\n\n(Note – the Ring paper is a paper given by the Gvt., to women drawing separation allowances, and it is stamped with a circular stamp giving date of last payment.)\n\nDear Sir. You have changed my little boy into a girl. Will it make any difference. Yrs. truly.\n\nDear Sir. I am expecting to be confined next month. Will you please tell me what I am to do about it? Yours. etc.\n\nDear Sir. My Bill has been put in charge of a Spitoon, shall I get any more pay?\n\nThese from a cutting Jim had from home in one of the letters. Basil reading them was told by Maj. X that he was too too young for such stuff. B Highly indignant.\n\nDear Sir. Will you please send my pay as early as possible, as I am walking about Bolton like a – pauper, and oblige?\n\nRespected Sir. Dear Sir – Though I take this liberty as it leaves me at present I beg to ask you if you will let me know where my husbin though he is not my legible husbin as he 'as a wife though he says she is dead but I don't think he nos for sure but we are not married though I am getting my allotment reglar which is no fault of Mr. Loy. George who would stop it if he could and Mr. McKenna but if you know where he is as he is belong to the Navy Royal fliing Corp. for ever since he joined in January when he was sacked from his work for talking back at his boss which was a woman at the laundry where he worked. (Thank God for the stop. F.M.) I have not had any money from him since he joined though he told Mr. Harris what lives on the ground floor that he was a pretty ossifer for six shillings a week and lots of underclothing for the cold weather and I have three children what is been the father of them though he says it was my fault. Hoping you will write to me soon and you are quite well as it leaves me at present I must now close hoping you are well.\n\nBooks in Everymans to get hold of, to read.\n\nBalzac\n\n1. Will Ass's Skin. Read at Factory Corner.\n\n2. Eugenie Grandet. Read at Wimereux.\n\n3. Old Goriot\n\n4. Atheists' Mass\n\n5. Christ in Flanders\n\n6. Chouans\n\n7. The Quest of the Absolute.\n\n8. Cat and Racket.\n\n9. Catherine de Medici\n\n10. Cousin Pons.\n\n11. The Country Doctor. Read at Henencourt, I II\n\n12. Rise and Fall of Cesar Birotteau.\n\n13. Lost Illusions\n\nVictor Hugo\n\n1. Toilers of the Sea\n\n2. Les Miserables. 1 Vol. Henencourt. \n\n3. Notre Dame\n\nBjoernsons Plays, Vols 1, 11\n\nHerricks Hesperides and Noble Numbers\n\nHibbets Plays\n\nLife of Robert Browning, E. Dowden\n\nGerhart Hauptmann, 6 vols.\n\nHenry James, \"The Turning the Screw\"\n\n\"All the Dinkums!\"\n\nAug. 25. The Kaiser's committed suicide! 'Again?' – and (again). Lens has fallen.\n\nAug. 26. The unit's going back for more training! The Australian fighting here is purely a blind to make Fritz imagine this is our permanent address.\n\nAug. 27. Leave open again after three days closing of it. So the Americans are over at last.\n\nAug. 30. Att. to the 2nd Army were to go out for a six months rest, but again Birdwood with his 5 Divisions is going to have a smack at Lille. Leave closed again.\n\nSept. 1. 1, 2nd Divisions for Ypres front this coming week, 2, 4, 5 for the Somme.\n\nSept. 2. The warr's over (only fighting continues).\n\nSept. 5. Riga has fallen to the Bosch.\n\nSept. 13. Stunting like hell starts tomorrow!\n\nSept. 16. Now not till tomorrow, Tommies want to know if it's a fact that the non success of this stunt means our turning the game in. Well yes, our failure would.\n\nThis page has come – in Blue's words, \"An Abdominal Crash\".\n\n"}}