{"Document Name":{"0":"Diary_0490","1":"Diary_0490","2":"Diary_0490","3":"Diary_0490","4":"Diary_0490","5":"Diary_0490","6":"Diary_0490","7":"Diary_0490","8":"Diary_0490","9":"Diary_0490","10":"Diary_0490","11":"Diary_0490","12":"Diary_0490","13":"Diary_0490","14":"Diary_0490","15":"Diary_0490","16":"Diary_0490","17":"Diary_0490","18":"Diary_0490","19":"Diary_0490","20":"Diary_0490","21":"Diary_0490","22":"Diary_0490","23":"Diary_0490","24":"Diary_0490","25":"Diary_0490","26":"Diary_0490","27":"Diary_0490","28":"Diary_0490","29":"Diary_0490","30":"Diary_0490","31":"Diary_0490","32":"Diary_0490","33":"Diary_0490","34":"Diary_0490","35":"Diary_0490","36":"Diary_0490","37":"Diary_0490","38":"Diary_0490","39":"Diary_0490","40":"Diary_0490","41":"Diary_0490","42":"Diary_0490","43":"Diary_0490","44":"Diary_0490","45":"Diary_0490","46":"Diary_0490","47":"Diary_0490","48":"Diary_0490","49":"Diary_0490","50":"Diary_0490","51":"Diary_0490","52":"Diary_0490","53":"Diary_0490","54":"Diary_0490","55":"Diary_0490","56":"Diary_0490","57":"Diary_0490","58":"Diary_0490","59":"Diary_0490","60":"Diary_0490"},"Date":{"0":"unknown","1":1322.0,"2":1323.0,"3":1324.0,"4":1325.0,"5":1326.0,"6":1327.0,"7":1328.0,"8":1329.0,"9":1330.0,"10":1331.0,"11":1332.0,"12":1333.0,"13":1334.0,"14":1335.0,"15":1336.0,"16":1337.0,"17":1338.0,"18":1339.0,"19":1340.0,"20":1341.0,"21":1342.0,"22":1343.0,"23":1344.0,"24":1345.0,"25":1346.0,"26":1347.0,"27":1348.0,"28":1349.0,"29":1350.0,"30":1351.0,"31":1352.0,"32":1353.0,"33":1354.0,"34":1355.0,"35":1356.0,"36":1357.0,"37":1358.0,"38":1359.0,"39":1360.0,"40":1361.0,"41":1362.0,"42":1364.0,"43":1365.0,"44":1366.0,"45":1367.0,"46":1368.0,"47":1369.0,"48":1370.0,"49":1371.0,"50":1372.0,"51":1373.0,"52":1374.0,"53":1375.0,"54":1376.0,"55":1377.0,"56":1378.0,"57":1379.0,"58":1380.0,"59":1381.0,"60":1382.0},"Entry":{"0":"\n\n","1":" Beaulencourt\n\nAt 8am moved out to jumping off trenches between the Sugar Factory & Le Transloy where the other battalions of the brigade met for the attack. With Rodda proceeded to Bde HQ to act as umpire. The attack launched at 9.15 against positions in the direction of Villers au Flos – Haplincourt. Tanks were represented by hessian frames quite realistic in appearance made by the renowned Scotty Lang of 24th. They mopped up strong posts and sticky positions. The morning was nice and fresh and the view towards Haplincourt very charming – rolling grass meadows and trim thick woods. The old chateau at Villers au Flos stands ruined in its grounds. after the operation we had a conference on the mistakes etc. At 4.30 the G. held a conference on training etc. General Wisdom called in. During the evening the doctor and myself had great French conversation with Leon Burbier and he was very amusing on religious topics & the question of divorcing of the Church and State 10 years ago. A decent little fellow who knows the whole continent well and has kept his eyes open during his travels. \n","2":" Beaulincourt – Haplincourt \n\nA lovely day. The men all fell in early for church parade at which the whole Brigade was present. Formed up in a large hollow square and Generals Birdwood & Smythe attended. During the service a Taube hung overhead and the archies were potting at it persistently. After the service there was a march past which was well carried out. Birdwood shook hands and had the usual things to say about the men looking very fit etc etc. A good plan on marches past to place someone down the line to stop the columns \"boring\"at times they nearly swung right into the saluting base: after the march past I introduced all the young officers to the General and he gave them some good advice about looking after the men etc. After lunch got very busy with maps and orders for tomorrow’s Divisional stunt – the last, Thank God, for a long time. Had a conference of company commanders and then we reconnoitred the ground on horse back. It was very pleasant riding over lovely fields in the warm sun and Haplincourt and the other woods looked so enticing that we\n\n22\/7\/17 Beaulincourt – Haplincourt \n\nneeds must push right on. Haplincourt has been a delightful little place sheltered in its fine square wood which is undamaged. The chateau is a mass of ruins and its fine grounds are a waste used as horse lines. The church is a level waterpoint! The cemetery is intact and placed out of bounds by our authorities. All the houses have been collapsed and razed to the ground. The next village is Barastre and coming to this we passed many English camps and some of the troops appeared to be without shelter bivouacking on the grass. We rode onto Villers au Flos and reached home about 5pm. Turned Rodda and Fulton on to the Operation Order and they made a good job of it. Two splendid chaps these. Busy on details after dinner as tomorrow will indeed be a long day for us commencing at dawn. Miss Stewart a good deal as he is such a grand chap to lean on and will go a long way yet. Stayed up all night as we commence operations with the dawn tomorrow. A quiet still night here but on the front there was much roar of guns.\n\n23\/7\/17 Beaulincourt \n\nReveille 2 am. and a cup of tea. Moved out at 3.30 in artillery formations and took up position in a sunken road. It was just flushing light. The 5th and 7th Bdes jumped off keeping up to a barrage of lights and we waited orders before commencing our advance. At 6.a.m. started off and worked up in accordance with our plans. The operation was not complete at 7 am when the General ordered the \"Cease fire\"and \"Dismiss\". We marched back to camp through Villers. au. Flos our band playing us in. Everyone was tired and glad to get breakfast. Went to bed and stayed there until 1 pm. In the afternoon cleared the camp and then turned the hounds through it to burn and destroy. We found great accumulations of stuff it is a remarkable thing how it does accumulate. Received our move order and after mess went down to Bde HQ and met General Paton. Colonel Craig A & S Highlanders was in to dinner and made a nice little speech of farewell and good wishes for us.\n","3":" Beaulincourt – Aveluy\n\nReveille at 4.45 am. All up and out early and set to work striking the tents before breakfast. Coys. then marched out and piled arms on a hillside. Men then marched through and through by the officers picking and cleaning up all the rubbish until the ground where the camp had been was as bare as a board. It is marvellous what there always is left even after several preliminary goes at cleansing. Incinerators were roaring. At 7o’c the Battalion moved off and passed the starting point on the Bapaume - Peronne road. Our good friend the Scottish Colonel (Craig of the Highlanders) was there to shake our hands and we gave him an \"eyes right\". Moved from the Pumping station over through Ligny Thilloy which was occupied by the 2nd Pioneers. On one ruined shack was the legend \"Pioneer Pub. Adams Ale\". Another ramshackle place was the \"Elite Theatre\"with sheet iron painted like stage scenery. \"Whale oil fag!\"Came\n","4":" Beaulincourt – Aveluy\n\nout near the Butte and marched through Le Sars doing 45 minutes marching to the hour. The day was hot and their packs dragged. Halted for lunch outside Pozieres finding it hard to get a decently level place the ground is so shell torn although now grass covered. Graves, graves and ruin everywhere. What blood and agony here! Dear old Bert Curnow. Moved on after a 2 hour halt and made the Ancre where we piled arms and all enjoyed a swim – laving tired bodies & feet. Here our guides met us and led us to huts near Aveluy. Rather pretty surroundings. Some Huns doing road work under the usual guard of juvenile tommies. Big dumps and rail sidings about here. Stewart was expected back today but has not returned yet. Harricks does rather well as A\/Adjutant. The camp was very silent tonight as all were well tired out and not in a mood to get up to mischief. Some of the lads have fiancées at Bouzaincourt but reserve their visits for later \n","5":" Aveluy\n\nThe morning was devoted to cleaning up the camp and salvaging the stuff round it. It was remarkable what was raked up round the camp. At 10 a.m. rode down to Villers and attended a conference presided over by Genl. Paton. After lunch specialist training. Dealt out some pack drill to offenders against march discipline. About 4 went over to Bouzaincourt and met the old patron of the chateau in the street. The rest of the family were in the fields towards Millencourt so we walked out and in a beet patch busy working we found them all. The little Chretian kissed us and Marie the servant was hard at work. At the Bureau we found Madame & some of our lads were evidently there as we heard a scatter as we entered. At Dubray’s place I had a glass of wine and waited until a shower passed when we took our horses and rode back to camp. A cool night the air having been well washed out by the afternoon’s rain.\n","6":" Aveluy\n\nA day of parade ground work. The Battn. formed up as such and did some ceremonial before breaking off to their tasks. The band played. Physical, gas and bayonet drill mostly. A lowering cloudy day. After lunch we had 21 Lewis guns spread out fanwise and put our bombers and rifle bombers through the loading and firing instruction. For a change the gunners did some musketry work and two squads of officers were going – one under Sutherland in the use of the prismatic compass and one under Thwaites in the Lewis gun. After mess this evening Alderson gave a very good lecture on Mess Etiquette and got home some excellent home thrusts particularly at a few of the younger chaps who have still much to learn. For the first time for a long while recd. today some letters from Australia. Staff Capt. arrived with orders for entrainment tomorrow.\n","7":" Aveluy\n\nA fine warm day. Specialist training all the morning. General Paton was here and talked mostly about nothing. Leaving about 10 officers over I gave them a little tactical exercise to do including making a field sketch and placing outposts in position for an outpost company. Bill May was in to lunch and Stockfeld to dinner. At 1.30 pm marched out on a route march via Bouzincourt to Martinsart and home. Halted just outside the former and marched through in style with band playing and troops at attention. Coming through the wood at Martinsart we found plenty of Huns hard at work on forestry. Our water bottle discipline needs improving muchly. a comic sight – a giant Scott marching along a diminutive little Fritz carrying a score or so of water bottles. Our chaps have a great sense of humour and see the funny side of everything that occurs. Formal mess without the band and the King’s health duly drunk proposed by me supported by Thewlis.\n\n28\/7\/17 Aveluy\n\nA very close and warm day. Morning parade 9-11 am. Lectures, inspections and a little dull. Inspected platoon in detail and found it fair but like their boss the members have too much to say. Early lunch and at 1.30 pm the whole Battn. piled arms in bivouac and waited time for moving off. All our transport went aboard 3 hours before the train moved off. The camp was thoroughly cleaned by parties sent back from our and all the men were given a drink of tea before moving off. At 2.45 (less A Coy who stay til tomorrow) we swung off to the tune of the ‘Long Long Trail\". The entrainment was complete in a few minutes – the men getting into trucks & the officers into one coach the latrine of which stank furiously in the most approved Gyppy style. Major Miles GSOII yarned until the train moved out at about 4.45 pm. Ran thro’ Albert on to Amiens the land all heavy under crops and plenty of fine green woods making a lovely sight. Coming into Amiens on the low lying ground the cultivation becomes very intense and there are many patches under\n","8":" Amiens\n\nglass. On the intersecting canals are many sampan like punts. The train discipline of the men was excellent and we had absolutely no trouble at all. At Amiens the train pulled up at the public platforms and some girls came along collecting for the wounded. It does the men good to see a little of the softer side of life. We ran out to Vignacourt and the country was very open and beautiful fertile rolling plains covered with waving corn. The terrain runs in gentle folds with occasional big hollows which would be marvellous from the point of view of attack or defence. As the line wound about we kept getting glimpses of the high standing Cathedral of Amiens with its tapering slender spire looking out over these plains as it has done now for more than 700 years. After leaving Vignacourt we ran into very pretty country hills and dense woods with the most delicious shades of green and song birds of all kinds singing in the trees. Night came on and we continued to run through idyllic country. The whole Division is on wheels today! Arrived at \n\n28\/7\/17 29\/7\/17 Arques & Campagne\n\nBerguette and the convoy was reconsigned to Arques where there is a big railway yard. Just about 18 months ago we detrained in the same spot from Marseilles in snow and sleet. The indefatigable Rodda was on the spot and all our billetting NCOs under Keith Anderson. From the YMCA we got hot cocoa and all had a drink before moving off. The wagons and limbers were all unloaded by an unloading party of the 21st. After everyone had gone went down by an ambulance car to our billets at Campagne – a very clean and tiny little village in which the","9":" are also lodged. My quarters at a two storied place evidently the home of the leading people in the village a nice white little chateau with pretty grounds. A number of rank and file were also here but they soon had other billets found for them. Madame produced hot coffee and bread and made a request for not too much stamping in the rooms above. At 6 am turned in and slept until 11. Lunch at noon and had the telephones put on. An attack of hay fever today – unusual.\n","10":" Campagne & St. Omer\n\nBeing wet cancelled march out to parade ground and carried on in the billets with ordinary drill and training. Went round and saw some of the people who are very nice and agreeable. A very pretty little place this. Major Matthews commenced duty today. After lunch went to a conference at Bde HQ and then on to St Omer. Saw the old Abbey (980) now in ruins and the Cathedral of Notre Dame where a priest very obligingly showed us round. Two big market squares. The Rue de Dunkirke is a fine street and in the shops were pleasant faced nice girls with whom it was pleasant to talk. Had a good dinner at Cafe Vincent with Dooley and the doctor and then rode home by 10 pm. Arques is also a fairly large place & near here on the canal is a lock supposed to be an engineering wonder. Trotted home over wet cobble stones and had no misadventures. A busy day take it all round. Once more we are in lovely lovely country and the wheat is in golden ear.\n\n30\/7\/17 Campagne\n\nMarched out early to a parade ground about 45 minutes away and there got on to drill and general training. Generals Paton & Smythe were round and General Birdwood also. The latter was in good form and had much to say. Two Armies jumped over this morning and Genl Birdwood says that 35000 tons of shells were used in the bombardment. Later we heard that between 3 & 4000 prisoners are taken – it will be a busy night in Hell! After lunch carried on with specialist training. A splendid view from here in all directions. In the distance are the towers of St Bertin & Notre Dame of St Omer looking out as they have done now for hundreds of years. Nearer are pleasant fields and old little red brick & thatched hamlets. The ground hereabouts is damp and peaty and part of a marsh system. Marched back with the band in full swing and passed a busy evening. an excellent mess here – very homelike. Told Penna I am superseding him for his Captaincy. \n","11":" Campagne\n\nWoke up early to hear heavy rain and it continued more or less all day. Cancelled the march out to the training ground & put in the day on work in the billets. The outlook is very pleasing from a window here the green grass and the grounds full of trees. Had the Q.M. up and threshed out a few matters regarding flare pistols, compasses etc. Our mess room is very nice – two adjoin. The tables are white clothed and we use all the furniture including the piano. Madame, a parvenu bought the place for 15000 francs and is yet content to get all she can from the soldiers. We are apt rather to forget the convenables’ of civilization and men are in no hurry to screen their latrines even when they are in full view of the womenfolk of the house. The same way in swimming some of them are careless unless checked. Went round to see Colonel Duggan at his headquarters. Yesterday they had a great day with the kids at the school and had a prize giving. The village church is of the usual type and all surrounded with graves \n","12":" Campagne\n\nwith the flimsy wooden crosses. Put Rodda on as Adjutant upon hearing that Stewart had been under amputation of a toe from an accident in Paris. We began to think that he must have been bitten by a duck! Received word that there is barrel of beer for us at Bde HQ and today is Pay day too. Powys the Canteen Corporal has gone to St Omer buying goods and will open today. Many old heads Crowley, Nelms, Robbins, Grant etc turned up last night and have resumed duty with their companies again. At 3pm went out with Rodda to \"C\"Coy. Leaving H.Q. we went round trim lanes like Melbne. suburbs or like the one to BonAccord and came to a canal with a bridge over it. On this bridge is the usual guard of a French and an English soldier – both of military age. The canal is fairly wide and straight and many barges were coming along drawn by horses on the towpath. Shells are brought from the Thames right across the Channel and up these canals.\n\n1\/8\/17 Campagne\n\nWe now struck across to a large farm nestling in among trees and looking very trim and neat with its red walls and old thatched roof. The cultivation was most intense, wheat (in full ear and rather beaten down by the rain) potatoes and beans growing on every inch. The roads winding in and out like ribbons, never a fence, and close by snug little hamlets. Our farm house was \"C\"Coys headquarters and about two platoons were located here. Inside, the house was of the usual style the living portion facing the courtyard and centred by the dung heap and fringed by outhouses. Several women were at work washing and Billjim seemed well at home. Round the officers in a nice light room with walls covered with the usual certificates of education and religion and knick knacks of travel and chase. A M’selle (a neat pale girl about 20) came in and began to set the table for afternoon tea with plenty of bread butter cream jam and cakes. We also\n\n1\/8\/17 Campagne\n\nhad a bottle of wine – quite a farm life. Talked to Madame and she was full of trouble about the War and the inroads on her family. A splendid field at the back she would not let us have for drill as she keeps horses calfs cows etc. Went on to another billet now of a similar kind – old low black ceilings and men rolling in casks of beer and wine for the soldiers get paid tonight and their money will be largely used for buying these things. The people here were not so nice - two old things were working near spinning wheels. The daughter was florid and flirtatious looking. Home via the bridge – we have men in all the billets hereabouts. Entered the grounds by a side gate and took a path which wandered round through the trees and undergrowth all dripping with the continuous rain. The rain has continued steadily all day and must be most unfortunate for our offensive as Leon Barbier says the Germans\n\n1\/8\/17 Campagne\n\nseem to have God with them and we have to fight him as well as they. Our guard marched down smartly today. Indeed generally I can see a great improvement in smartness all round.\n","13":"\n\nRained nearly all day. Major Miles was round in the morning and we picked a miniature range for our practice. After lunch went round all the billets and saw the companies at work – some on the Lewis gun stripping and assembling blindfold and in the dark. Walked down to Bde HQ at Wardrecques and saw Bridges. A very pleasant walk from one village to another the crops growing right up to the roadside. The iron stays passing through the walls of the houses and barns are used to denote the date of building i.e.\"1748\". Being payday yesterday there was some drunkenness and it is hard to know why the chaps will persist in calling one another bastards as soon as they get a few drinks in. \n","14":" Campagne \n\nVery threatening still. Sent the Coy route marching by different roads with full packs up for about 5 1\/2 miles. One chap collapsed with acute pleurisy and was brought in on a stretcher. Inspected the billets with the doctor and found them very good and clean. At \"C\"Coy. the doctor had a patient in Madame who lost her uterus some years ago & is consequently getting very fat. another Madame was of course present at the time – a necessary thing for convention’s sake. Yarned in the kitchen to the very clean and proper daughter of the house who once visited Paris for four days. Arras is the summit of her conception of the hub of the universe. The land here is heavy with wheat and all the other fruits of the earth . In the afternoon coys. carried on with specialist training. Went down in heavy rain to Bde H.Q. and saw General Paton on several matters. This village (Wardrecques) is much the same as our own – trim hedges, thatched houses, lovely trees and a church in the centre of everything. Our band is going well at present and helps to while away the time.\n","15":" Campagne, Roquetoire & Aire \n\nParade in billets. Weather slightly finer. Made an inspection of A & D Coys and found work progressing satisfactorily and then walked part of the way down to Wardrecques. Winding leafy lanes with red thatched farmhouses with walls new whitewashed. Along a field track to the 21st and there saw Padre Lamble and Henry Crowther just back from leave. Returned to our own billets and found Padre Major F H Durnford M.C back from leave laden up to the eyes with comforts for the troops and sports material. Also a new gramophone which we tested and soon collected an audience of M’selle and the 2 little youngsters. The little girl became frightened at the music & cried. after lunch dealt with several cases of absence without leave and applied the acid where needed. The horses were there waiting for the doctor, Davis and myself, and we set off first off all the visit Roquetoire and Ligne de Roquetoire – our first billets in France after landing 18 months ago. The ride was very nice \n\n4\/8\/17 Roquetoire Aire\n\nby woodland and pasture snug valleys and smooth rises little villages nestling cosily at intervals among their trees. Rode through leafy lanes and vividly green fields and at last came into sight of the Chateau of Roquetoire and the little village. Rode through and down more beautiful lanes to Ligne where we soon recognised \"C\"Coys billets but I was diffident about going into my old billet as the people would probably have forgotten me. Not so, Madame hailed me as an old friend and asked \"the domestique with the big moustache\"(Spendlove). A dear little woman this, always spruce and neat. Looking after her farm and the two little boys and patiently awaiting the return of her husband – a prisoner in Germany since the start of the War. The mademoiselle was also there – giggling as usual and grown a good deal – she enquired after Elmiger. Everything here is spotlessly clean and neat – good plain farming people. Many Portugese are billeted round here now and they \n\n4\/8\/17 Roquetoire & Aire\n\nseem most dirty, ragtime and far from desirable. Steering by the map we made across very pretty country towards Aire whose two towers (Church and Hotel de Ville) look out all over the country. We rode through the winding old streets with their dingy and aged houses and came out in the square and put our horses up at the Hotel du Clef d’Or. On the corner of this square is an old Guard room about 1600. The Town Hall is also a fine old building. Round the streets are jolly good shops – stationers clothing etc. We went round to the Church 15th Century. Its tower is square and like those at St Omer. Entering we found a fine interior with some very good stained glass and pretty side chapels. Old world air about everything – a few praying visitors. Left here and went round the street again to make a few purchases, kiddies coming up and asking us if we wanted \"a mademoiselle\". At 7.30 went to the Hotel d’Angleterre for a real French dinner commencing \n\n4\/8\/17 Aire & Campagne\n\nwith soup, an omelette, some beef, veal and a salade with plenty of brown bread butter, a bottle of Haut Sauterne of fine taste, cup of black coffee, and a small cognac. A silent dinner table – ourselves 2 English officers, 1 French Second Lieutenant and two privates, 3 civilians (two well bearded) and a man and his wife. A silent party but about half way through the wine had loosened tongues and all conversed together in a babble of noise – a great change. Returned to our horses and had a very pleasant 9 mile ride home in the twilight along good roads and came back to our chateau about 10. In AIF orders tonight I am permanently appointed Lt Col and made second senior Colonel in the Bde which is satisfactory and not bad for the old Yabbies. Round Roquetoire at every shrine there are many little wooden crosses deposited and each barn has a little recess for image etc. This seems to be peculiar to this place – not noticed it to any extent elsewhere.\n","16":" Campagne\n\nSunday and a fine day. Church parade at 10a.m. was held in the Chateau grounds and General Paton attended. After service marched past headed by the band – rather a good turnout. All the officers then sat for a group photograph by M’selle and we also had a few individual photographs taken as well. She leaves for Paris tomorrow. Stayed at home all the afternoon and had a visit from the CO.23rd Battn Brazenor. A beautiful fine evening and walked in the grounds along the leafy paths. Leon Barbier was in during the afternoon and had a long talk and made a translation of a story in Fantasio. Also talked to M’selle who is bovine like her mother and will be very haggish later on. A quiet and peaceful evening and the War seems very far away indeed. The Band played at mess and sounded preliminarily the \"Roast Beef of Old England\".\n","17":" Campagne\n\nUp early in order to be photographed with the band but owing to fog it had to be postponed. Dr & Bunning left for Paris. Owing to baths we did not march out until fairly late and then took over the area of the 24th. Did a couple of tactical exercises by companies on a peaty hillside much like the Highlands – a splendid view from here. In the far distance the towers of Aire could be seen through the haze. Nearer the farmers were gathering in their crop stooking the sheaves in neat rows – a fine peaceful sight. Marched back with band playing and then with all officers went down to a conference at Wardrecques where General Paton presided. Rode down – horse rather fresh. The reaping here is done by sickles and the rain having beaten down the corn they have little hooks for raking it up so the sickle blade can be brought into use. Women and children assist. The latter follow our band everywhere the same.\n","18":" Campagne\n\nMarched out as usual to training ground and did some company tactical exercises – forming a defensive flank and a little wood scheme. General Paton was out and General Smythe was also close. Also did some close order drill &c. The ground very soggy and peaty and the extensive view from here very enchanting. Harvest is under way and our chaps are helping the farmers with it. Some cases of fowl stealing occurred today. Lunched out on the ground and after lunch carried on with specialist work and sent A Coy for a route march. Immediately after getting back went to an Intelligence lecture at Wardrecques at which 3 of our officers were late. The Adjutant paraded them to me after dinner and I handed out the strafe. Held Orderly Room and gave some FP. Major Matthews returned from \"W\"area umpire job. Any amount of clerical work and interruptions taking place during the evening.\n","19":" Campagne\n\nA busy day. Went out early to the Brigade parade ground and carried out close order work under the platoon officers. The ground sedgy and spongy and all peaty and oozing water. General Smythe passed us with his lance and flag. Lunched on the ground having our bootmaker and tailor on the ground also at work on own jobs. At 2 p.m. moved off on a route march of about 7 miles via Blendecques – a fair sized town and a number of quiet little villages where all the kids turned out and followed the band – indeed our Band Sergeant was quite like the pied piper of Hamlin and some of the kiddies must have wandered a long distance from their homes. All reached our billets fairly tired. To dinner we had General Paton & Staff and Bob Rolland – rather a pleasant meal and conversation excellent: to recall (Bozar?). A very busy evening on detailed work of one kind and another.\n","20":" Campagne\n\nUsual march out with band and the usual children came running out to meet us and follow the music. Our cymbal player takes their fancy – one little girl especially is quite carried away by the music. A little thing of only 6 her whole attitude is that of delight all a - dance. On the ground, which was very soppy met the B.M. and General Paton and decided to carry on with drill and close order work in lieu of what tactical exercises we had arranged. The rain had washed the air clear and the sunshine made every place stand out in clear relief. Noticing the difference I put some musketry squads on distance judging to test them on this clear morning. The towers of St Omer stood out strikingly. Had lunch on the ground and the Battalion then did a route march of about 7 miles. I went in and received word of approval of my leave to Rouen. Rode down to \n\n9\/8\/17 Campagne\n\nArques and had afternoon tea with General Robert Smith D.S.O. otherwise known as Bob the Bastard and made friends with the vieux Monsieur and with the Mademoiselle there. Some heavy rain fell. Here they have troops billetted all through the town and it must be awkward indeed for training. Saw the Pontmettres or big hydraulic locks by which the boats on the canal undergo a difference in level of 45 feet by a lift arrangement. Today I put in orders some particulars regarding St Omer and these other historical places but old Billjim would pay more attention to old places than to new and has no respect for old age and things venerable. Rodda acting as Adjutant is a good dear old fat thing – there are some fine chaps in the world. This placid brave boy among the great shambles of blood & pain at Pozieres was one of the things that make one proud of our country. And he was roused up for losing a flare pistol!! \n","21":" Campagne & St. Omer\n\nFeeling tired did not get up until later than usual and let matters carry on. Rode into St Omer with Murphy as orderly passing through Arques. Between Arques and St Omer the country is very pretty & intensely cultivated. The ground is flat and much diversified with woods and crops. (Yesterday again noticed \"the Pyramids\"two big piles of stock at some distant mines). Left horses at Hotel de France in St Omer and went up & saw R.T.O. Returned and had a walk in the gardens which are very fine and well laid out. There were a good many soldiers & civilians here and many kids playing about. Some of the St Omer streets down towards St Bertin are very old and full of quaint looking houses. A lot of people as usual are in black. There is one class of Frenchman eminently unhealthy looking – puffy faced and sometimes I suspect even powdered. Usually has a M’selle in tow so prowess in love cannot not be judged on mere outward physical appearance it seems. All the gardens here are most delightfully green.\n\n10\/8\/17 St. Omer, Calais, Boulogne, Etaples, Abbey \n\nGot into a train crowded full and set off at 1p.m. on a long and tiresome journey having as travelling companions a few padres and some English officers. Journey to Calais was not bad – one sees little of the town beyond one peculiarly shaped spire. The line runs down from here along the sea and is low lying and duny. After leaving Boulogne this continues altogether and around Etaples there are enormous camps and hospitals. Near here I think I saw the largest military cemetery on record – a forest of neat little crosses packed closely together and extending for hundreds of yards. Our journey began to get very tiresome with frequent long stops. At Etaples saw M Pezet changed carriages & took over as O.C. Troops which caused me to rub up at least one RTO the wrong way. Everyone delights in being nasty to these unfortunates. Travelled all night.\n","22":"\n\nand did not reach Rouen till about 10.30 am. going to the Hotel d’Angleterre by tram and ordering coffee and rolls hot water and a hot bath & felt much better\n\n11\/8\/17 Rouen\n\nthereafter. The river is navigable right in the centre of the town and troops were being embarked on a channel steamer. Some showers of rain. Made an excursion up the street and bought a necktie and then had a look at the wonderful big church of Notre Dame – the front very elaborately carved and ornamented. The Tour de Beurre is very fine and was erected from funds obtained from indulgences to eat butter during Lent and is quite unlike the other tower which is whitened with more years. Between the two a tapering spire rises and you can see through it. Inside the church is not as airy as the Amiens one & carries the impression of having more building in it. Some of the side portals are wonderfully carved and the stained glass fine indeed. Being the scene of the death of Joan of Arc the town is naturally full of memorials and references to her. another pretty old corner is the Grosse Horloge, the markings on the clock face as very extraordinary. Everywhere there are old buildings leaving the mark of many years on \n\n11\/8\/17 Rouen\n\n them. After lunch went up to the No.2 Brit Red Cross and found Stewart there and with him walked down to the Quai where we got a taxi for No.1 A.G.H. – a tent hospital located on a Racecourse. A big hospital for wounded Germans and an American hospital is also here. Met Sister Gerrand and Major James. Went to the operating theatre and saw a chloroformed man getting dressed and X Ray work. A number of very bad cases of limb wounds in special slings and appliances. Had afternoon tea with as nice a lot of Australian honest girls (pretty too) as one could well wish to meet. They are very cosy in their nurses quarters. Walked all round and saw some games of tennis and had a good talk. Sister Cameron said this war would leave the bonds of Empire less strong when it is over. She is right. The Crass messers deliberately so arrange that our girls nurse all Tommies and our boys are designedly packed over elsewhere to be nursed by English strangers. Returned to hotel by train feeling tired and \n\n11\/8\/17 Rouen \n\nand write this sitting near an open window. The river and wide quais are in front and busy traffic on the water. Beyond there is a background of white fleecy clouds and some distant woods. Went up the street and then returned to dinner at about ¼ to 8. Not many in the restaurant – some English officers and a French family or two. Some of these affect the filthy English habit and bringing dogs in to dinner. Opulent (siens?) & perfume were the two chief points about the young French matron near me. Prices high. 12fr for dinner. How some of these English officers manage on their smaller pay I don’t know. Some of them are on Base jobs elderly & paunchy and alcohol up to the eyes. They serve liquers here in a glass about a little more than half the size of the ordinary wine glass and on top of a bottle of Sauterne and a Perrier, a benedictine was rather heavy. Circumnavigated the Cathedral by night – it looms up black and silent & the footsteps of passers by tread the same cobbles that have been there for ages. Returned to hotel and started to write but drowsiness was such that I just threw clothes off and turned in.\n\n \n","23":" Rouen\n\nAfter a hot bath and a French petit dejeuner walked round the Rue Jean d’Arc to the Church of St Vincent which is a small church and not unlike St Giles Edinburgh. It is full of the most beautiful stained glass most of which like the church itself dates right back to the 12 & 13th century. Passed the Palais de Justice – a rather plain and official place and walked down the old winding Rue de Ganterie to the Church of St Ouen a very large old church older than the Cathedral. Inside it has a bareness not being full of seats and is very high in the roof. There are no side chapels and the glass is mostly plain so the lighting is excellent. There are gardens at the back and from there the exterior looks very fine. A group of statuary – a centaur taking off a woman. She resists and has her hand warding off his face which smiles in triumph. Adjoining is the Hotel de Ville and the gardens are very pleasant. Walked down now through more pleasant old fashioned streets to the Eglise Maclou a little Gothic church\n\n12\/8\/17 Rouen \n\nabout which there seemed nothing very wonderful. Coming down by some old old places struck a richly decorated side door to the Cathedral in a Cow yard and went inside and sat down. A service of some kind was in progress. The old Suisse was extremely gorgeously attired in gold lace and cocked hat. Went back to hotel quite tired again. Returned to Notre Dame in time to see the celebration of High Mass with a crowded congregation. In the distance the gorgeously arranged priests looked very small and tiny mites at the altar of this great Cathedral. The smoke incense filled the air. When the service was done took a walk round. A very old Servian officer in his distinctive uniform was here. Now by rear streets to the church of St Gothard where another mass was in progress – a large congregation in a small church. There is good stained glass here too. Next door is another old church (St Laurent) which has been turned into a museum. From here went on to the Tour Jean ‘d’Arc a funny old donjon not unlike a windmill. A round tower with a beehive \n\n12\/8\/17 Rouen\n\ntop where Joan of Arc was imprisoned. Now to the church of St Patrice which is noted for its stained glass (nearly as good as St Vincent). There are beggars round all these churches and one poor devil was sitting on the wet pavement in a side street – no legs. In all the churches there is abundance of carving in stone and wood. Now to the Old Market Place to see the place where Joan of Arc was burned by the perfidious English. There are market buildings here and evidently it is much the same as in the days of old. Very old houses are hereabouts. Back to the hotel for lunch. Many of these people overeat themselves tremendously. A girl near me drank a large bottle of wine and another of mineral water and eat a big lunch as well. a family near me also ate themselves to a standstill. Most of these folk become very obese and shapeless at about 40 – drones on society. Rarely does one see a comely matron of that age or a man who is not unwieldy. After lunch went to sleep. Going round here tires me out \n\n12\/8\/17 Rouen\n\nsoon and I can’t keep going like up at the front. It is the hard pavements. Awakened at ¼ to 7 and dressed for dinner – a quiet meal with the usual family groups and a couple of Guardsmen. After dinner set out for No 1 A.G.H with a note for Sister Gerrand and had to walk all the way there and back as the trams were crowded out. Soldiers everywhere and plenty of gaiety but over the tops of the highest houses there shot across the sky lurid sudden flashes from the guns 70 miles away. Generally this place like Paris is quite dead as far as streets go after 10 pm. C’est la guerre! In times of peace one can well imagine the gay sight that would be presented by all the cafes along the Quais front open all night and gay with light and music. With their wine at dinner these people take a bottle of mineral water using a separate glass and it really is remarkable just what they can get through at a sitting.\n","24":" Rouen\n\nAt about 9.30 walked out to St Vincent and had yet another look at its colors in glass in windows 500 years old and then walked up to St Pancrace for a feast similar. From here returned to the Quais and walked the long distance to the Records office and saw them all there, having a long talk to Col Griffiths & then going to lunch with him at his comfortable little flat. He says it costs him at least 1 £ a day to live here & that most of the officers and his men have temporary wives and spend every penny of their pay and allowances. After lunch returned to hotel and then went up the street to buy some sweets and some biscuits. At 4o’c went up to No 1 A.G.H. and had afternoon tea with Grace Gerrant and Sister Greenaway and they had some American girls over to afternoon tea and to tennis. Went off with the two Sisters and came into town by tram then going out to Bonsecours from where a lovely \n\n13\/8\/17 Rouen\n\nview is to be had of the crowded and the surrounding green plains of Normandy. Up here there is a church perched in the height. Inside it is all blue and meant to represent the sky. Came back to town and dined tete a tete at my hotel and spent a long time talking. Then ran them home by taxi and came back myself. Several times today little French carelessness in customs re latrines etc caused me some apprehension and made me fear the worst but these girls resident here so long look the other way. They remark also on what strikes me the prevalence of over eating among these people one sees here. The saluting in these streets is a terrible nuisance and over the odds. Their looseness in morals and grossness are French habits that are objectionable & give me our own good honest Australian girls like these nurses. Met also this afternoon – a straight out piece of goods.\n","25":" Rouen\n\nWalked up to St Ouen and went round inside. Too severe for my taste. Viewed from the garden outside it is delightful and the central tower the Couronne de Normandie is a wonderful piece of work. Via old touristy streets to Maclou the carving of which on the outside is exquisite. Inside there is a little staircase ascending to the organ which is a gem of stonework. The walls rather heavy with a lot of gilt and painted wood work. From here round the Archepiscopal palace to the cathedral and went went slowly round inside taking the old gold laced Suisse for the large chapels behind the choir screens. Some very fine work here and magnificently carved tombs – two especially. The old chaps pedantic well mouthed French was amusing but easy to follow. Went up to the top of the high spire using a taper for the first stone portion. above roof level it is of steel and a deuce of a height that quite knocked me up by the time the ascent was done. All open it is no place for anyone liable to giddiness. Reached the top and from the dizzy height viewed the whole panorama of the city stretching before and green hills and country all round. The busy\n\n14\/8\/17 Rouen\n\nriver runs through all. All the different churches lay round and all the old houses and gardens – a splendid view. Descended very puffed and walked to Records office fruitlessly for movement order. Returning called in once more at St Vincent and studied the stained glass before returning to hotel. At the wharf crowds of ambulancesdebouching wounded into the hospital ship. Lunched at the hotel and several families were in at the same time – all overeating and doing much gesticulation. Raining a bit afterwards. The Records people sent round my movement order and some information that my unit has moved on from Campagne to God (&R.T.O’s) knows where. At 2.30 pm paid my bill, ladled out the tips and slid down (per taxi) to the Gare du Rive Gauche and there found a long train and crowds of Tommies embarking on it. Found a compartment specially branded to my use in chalk and took over there. Presently and R.T.O came along and told us we might expect to have a 24 hours journey – that I was OC Train (joyful news) but that a regular draft officer was to be my Adjutant. \n","26":" Etaples, Calais, Boulogne\n\nTravelled all night in the train and did not have a bad journey as the Adjutant (a Capt. of the South Staffordshire Regt.) knew all the ropes. In the early morning we pulled into Etaples and went over to a Y.M.C.A buffet and went into the back of it getting good cocoa & scones. Met one of the nicest girls serving here – some of these women are wonderfully good. She gets up and puts up with all the roughness and hardness of the rude life. Did not stop long at Boulogne but had a good rest at Calais and during the journey had some argument on Imperial politics with the Train Con. officer an Imperial man. Reached Eblinghem and detrained walking back to Campagne via Renescure – a pleasant trip through waving crops yellow and ready for the sickle. Found things going well but any amount of work in prospect and a good deal accumulated. Dr Craig & Bunning running rave about Paris and what is to be seen there and don’t intend to take any more English leave for a long time. Letters today from various folk including Ella who now is at Aix les Bains. \n","27":" Campagne \n\nStayed in during the morning and attended to routine work and went out to the parade ground at lunch time. The Battalion was route marching and arrived there rather blown. During the afternoon carried out some company tactical exercises forming defensive flanks, advance guard and some trench to trench operations. A fine afternoon and the view was very fine from the parade ground. The harvest is well under weigh and the landscape for miles round is dotted with stooks of corn all gathered in. The scenery is very nice in every direction. Marched home with the band playing but our marching was not too good. After mess called in the company commanders and discussed things with them in general. Spent the evening in my room but constantly interrupted by office work and things calling for decision or opinion. Payday yesterday and as a consequence a certain amount of people merry. \n","28":" Campagne\n\nClose order training during the morning. Had a talk with Major Watson of Divnl. Signal Coy and the one and only Henry Crowther. At lunch time we had some sandwiches and ate sitting in the long grass. The air today was remarkable clear and distant objects appeared very close to hand. In the afternoon went for a route march via Blendecques –Arques but Rodda had made a miscalculation in estimating the distance and we landed home too early. Perforce had to order an inspection of feet to fill in time. Rumour that we remain here for another three weeks. Some shells were landing into Hazebrouck during the afternoon and a Taube was flying over Blendeques.\n","29":"\n\nUneventful. Usual close order work on parade ground. Afternoon half holiday. Hay fever and plenty of work to do. Resolved to put the acid on at the Orderly Rooms for a while as Drunks and A.W.L. are getting too frequent. Leniency does not pay.\n","30":" Campagne & Cassell \n\nChurch parade at 11 00 by Padre Lambe was followed by a march past which went very well. A lovely fresh sunny morning. The trees and hedges in full leaf threw back in our ears the music of the band. After lunch rode to Cassell with the doctor, Rodda and Jimmy Alderson. A very pleasant trip to the old town perched on the crag as it has been since Roman days. In all directions stretches a magnificent panorama – old Roman highways now continue as routes nationals. The town is a mass of old grey stone houses wedged close together, slippery streets, and cobble stones. We found the Hotel Sauvage put up our horses and dined there. Left on the homeward journey after 9. Searchlights were after a Taube and shrapnel flashes of anti aircraft shells bursting showed up like fireflies in the dark sky. Altogether a most interesting day. Received orders on return for a staff ride tomorrow and will take Rodda with me.\n","31":" Campagne\n\nRode over to Ancient Abbaye de Woestine & met Col. Miles doing a tactical exercise issuing orders etc. A lovely sunny morning and it was pleasant taking our ease in a stubble field. After completing the job rode to DHQ at Renescure and had lunch with Major General Smythe who got on to big game topics. After lunch we had some good profitable discussion on the morning’s work and then rode home. Very pretty and mild and peaceful everywhere here. Rather a big Orderly Room here tonight and the need for putting the acid on seems to be rather apparent. Leon Barbier came in for some conversation and Matthews also. A busy evening like all here and midnight seems to come round quickly. Although previously flush of officers we are now commencing to get short again owing to Training Battalion etc etc. Intend sending Evans to a School of Instruction and putting Thewlis on in his place.\n","32":" Campagne\n\nInspected the transport early in the morning sending out the Battn under Bunning. The inspection disclosed many little faults and quite confirmed me in the resolution to send Evans to a school and to put Thewlis on the job in his place. Carried out close order work on the ground all the morning, had lunch & then did some company tactical exercises which were good. One strong post attack & defence was rather realistic and we had a real German m.g (borrowed from DHQ) in it. Reached billets about 5 pm doing the march through the village at the slope. Fewer orderly room cases tonight. Formal mess having Padre Lambe for a guest and then some routine work and a yarn with the doctor which left me finished for the day at rather an earlier hour than usual. 10.35 and free to go to bed. Rodda goes back to his company in the morning & W.J.C. carries on. \n","33":" Work in billets for morning. Baths afternoon.\n\n23\/8\/17 Campagne\n\nAt 10 a.m. inspected the companies falling in for a march past. Dress fighting order. Followed in rear of the 21st and swung down along the canal towpath fixing bayonets as we marched. The pace was not too good until the band picked us up and set the pace. We swung past the saluting base where the Australian flag was fluttering in the breeze. There were Generals Birdwood, Smythe, White, Paton, and Smith. I stepped up beside Birdwood who after greetings had not very much to say. The transport was not too bad but still not up to the standard of the other units. We had some rain and the air was steamy. Brazener and Bazeley came in for a drink before going back to their place. Had intended to make up for last night’s want of sleep by taking a doze this afternoon but there was too much doing and I went down to Bde HQ at 4.30 pm and had afternoon tea with them there. Put the acid on \n","34":" Campagne\n\nthe General for leave and was not choked off. Had orderly room & took a Summary of Evidence. Early mess and sent the OC Coys out on to the ground early with Matthews & brought out the companies with their seconds in command in charge. Carried out an outpost scheme using D Coy as enemy but we should have been in position earlier to get the fullest advantage from the exercise. General Paton walked round with me. The work was not too good to take it all round and showed a lack of grip of the fundamental principles. The challenging was too loud and not strict enough. A pleasant & mild evening this. Returned about 10.30 with W.J. Cawthorn leaving Matthews and Stewart to bring the men in. They did a silent march halfway and then completed it at ease. Some gunflashes lighting up the sky fitfully tonight & the glare of a furnace some miles off.\n","35":" Campagne\n\nMarched out early and carried on in the morning with a programme of close order work. I took a platoon and inspected it and found it not too good at all. A good deal of wind blowing. We lunched in picnic style and then did some tactical exercises. \"A\"Coy attack & defence of strong posts, \"B\"Coy outposts. C & D defensive flank and counter attacks. At 4 o’c formed up the whole battalion into mass and marched home to billets our band coming out to meet us just past the school master’s house. The men marched well past the Guard. Having been sticking in the punishment lately the result was no cases for orderly room tonight. Now have about 40 officers here and the battalion nearly quite up to strength. After mess Reg called in and I then dealt with correspondence etc. Leon Barbier came along for some French conversation and translation until 10.30 pm. \n","36":" Campagne\n\nMorning parade held in the paddocks round the billets – close order work bombing etc. Went round them and then to the Canal bank where our snipers and others were at work and the Engineers putting across a pontoon bridge. Barges drawn by horses passing. Spent the afternoon writing and reading. Davis left on Paris leave. The farmers busy on their harvesting operations and getting all the crops into the barns – some of our men are helping them in this. The fumier and the stereotyped water pools are never missing from the farmyards. They use churns that are manipulated by means of treadles. The other day paid a visit to people at Dooley’s billet – quite a ceremony. All sat down while citron and wine was produced. Pledged healths after clinking and then ate cakes to our hearts content. Very kind and homely folk. The mistress has a bad time with her health & consults our doctor. \n","37":" Campagne\n\nSunday church parade at 11 a.m. went off well the men looking smart. Afterwards had a march past – they swing past in style to the band’s music. Earlier had taken the salute from the Roman Catholics who had been to mass in the local church. Horse was waiting so rode straight up to Bde H.Q. at Wardrecques there meeting all the other Battalion commanders and getting full particulars of F.M. Haigs inspection on Wednesday next. After that we adjourned to a very recherche lunch and what with sherry and bitters, gin and vermouth and liquers one had to go slow to avoid getting inked. Returned to and spent the afternoon in billets our band playing a programme which served to pass the time away. After mess had the O.C. Coys up and passed the orders on to them. Some Australian mail arrived today. Heavy rain set in after dark and will be bad for the crop. \n\n27\/8\/17 Campagne \n\nMoved out o to Divnl parade ground near the R.F.C. hangars. The whole Divn was concentrating here so the roads were thronged with marching troops coming from all quarters. Formed up on pegs. The 5th Bde in front of us and the 7th Bde behind. Went with the General up to General Smythe beforehand and received instructions regarding the signals from his lancers pennon. At 10.30 on the pennon being raised all the troops sloped and then on another movement of the flag the whole Division presented arms. It looked very well. Tiny Heath was in charge of the bands which should have played \"Australia will be there\"but he messed it up and a silence resulted broken only by an angry voice from the General’s staff officer. After the G.O.C had ridden round we marched off – not until I made a horrible break. Gave the order \"The Battalion will unfix Bayonets\"and looked at the wrong flank for the men setting the\n","38":" Campagne\n\ntime. Seeing no movement I rode at Major Dooley spitting fire and roared \"Why the --- hell does not your left hand man move\". As a matter of fact the left was Bunning’s company and the man there had moved. Covered it all up in bluff but did feel really an awful fool. Marched home for lunch. At 2o’c rode over to Renescure with Rodda & Cawthorne and there caught a ‘bus for Hazebrouck to attend a lecture on M.G. barrages presided over by Major General Walker. Pleasant country round about. The signs over many estaminets are very appropriate viz \"To the Reunion of the Refugees of Armentieres\" ‘Today for the money tomorrow for nothing\"\"The top of the hill\". \"The gathering of Harvesters\". Heavy rain came on during the afternoon. We walked back from Renescure and then took things easily. After mess read and wrote. Had an assignation with a mademoiselle of 15 named Marie for a French-English lesson but she slipped me up.\n\n28\/8\/17 Campagne\n\nA very black and unpleasant day. The battalion formed up in mass at 9.15 am but a shower came on and the wind was unpleasantly strong so I sent the coys home to their billets. Today was a foretaste of winter with falling leaves The Swallows crouched under the house and commenced to think of their southern journey. Stayed inside practically all day & very busy doing nothing. The padre entered a suggestion regarding ‘La Vie Parisienne\"and I acceded on the grounds that it is too warm for the youth of the mess. Busy with Baedeker all the afternoon going over an Italian trip. M le Curie a fat priest has been here all the afternoon and village scandal is busy with his and that of mademoiselle. In the evening the weather cleared up a good deal and the wind dropped. Madame the owner of this house is very avaricious and out to get as much money as possible all the time. Barbier says \"I ‘ate dat woman!\"\n\n29\/8\/17 Campagne \n\nAgain wet and threatening. At 8.30 am moved to a stubble field just outside the village and sat down. The concentration of the Division started by different roads and at 9.30 we moved on to the Divisional parade ground following in rear of the 21st with band playing. Pegs and markers were out and we were in position in good time. The 5th Bde was in front and the 7th Behind. After a stand easy F.M. Haig rode up with an escort of lancers flying the Union Jack On the signal from General Smythe’s pennon we presented arms together – a fine sight 14000 men and the bands crashed out a few bars of ‘Australia will be there\". The slope and subsequent order were done by flag also and we stood easy while Fighting Bob’s brigade was looked at. After riding right along he came down to us and called me up. Asked about strength officers etc and commented on the good turnout.\n","39":" Campagne\n\nA well nourished good looking big man who seems to look just absolutely correct in every way and would probably say just absolutely the correct English thing everytime. After completing the inspection he rode to the saluting base where the Australian flag was flying and took a march past from the three left battalions of the Division. They went up in columns of platoons and returned in columns of route. The mass of moving bayonets was quite impressive. Marched home passing Col. Barney Somerville DAA & QMG with some Australian nurses. Formed up on the stubble near A’s billets and addressed the men for a few minutes about the parade. They then marched back to their billets and a half holiday and during the afternoon several heavy showers of rain took place. \n\n30\/8\/17 Campagne and Renescure \n\nWent over to Renescure at 10am and sat with General Wisdom & 4 Colonels on a G.C.M trying a Captain of the Provost Corps. Some of the M.P witnesses were terrible people – fat & cold footed perjurers. Had lunch at 7th BHQ in an old fashioned castle like place with a moat round it. A date 1472 over the door but the whole place shows signs of very much rebuilding and renovation. Lots of little turrets & towers. Mullioned windows. Our Court sat in an old meeting room elsewhere & on the walls were photos of past Republic presidents and a plaque of war of the female figment symbolical of \"Republique Francaises\". After dinner corrected a number of maps sent in by the Intelligence officer & done by our privates. The regimental buglers played a very fine ‘Last Post\"at 10 p.m. Am anxiously awaiting word of my application for Italian leave and do hope it soon arrives. Harricks leaves for the 6th I.B. in a few days for 6 months.\n","40":" Campagne\n\nIn spite of rain marched out to the parade ground and there took up a defensive position against the 21st who attacked the full length of the ground. After the operation criticised it with all the officers and made them do the same with the men. After lunch we attacked against the","41":" following a preliminary rally by dud Stokes’. Formed up then and marched home. Ploughing has commenced – the earth is just free of its crop. The French people have a rumour that we are leaving next Tuesday and strangely both General Smyth & Col Bridges mentioned similarly the matters! It is remarkable how such information gets round. An officer of the Historical branch called to see me re our history of the regiment. Very beautiful here today as the rain has washed the air very yellow and the buildings & towers of stone stand out very plainly and are wonderfully near from first appearances. \n","42":" Campagne\n\nMorning. Worked in the billets on specialist work and in the afternoon marched the men down to the Canal de Neuf Fosse for Aquatic sports. There was a good deal of rain which rather spoilt things. The Engineers put a pontoon across the Canal and it had to be slewed round occasionally to let barges pass. The banks were lined with men. It was cold work for the competitors who shivered with very few clothes on. An interesting item was the duck hunt where ducks were put in the water and swimmers had to catch them. One platoon secured 4 ducks. Had afternoon tea in a marquee borrowed from the Y.M.C.A. Later in the afternoon the men started to go away as things flagged and weather got worse but the affair was a break in the monotony. \"Podgy\"Kellaway returned from England today after 5 months over there at the T.B. After dinner had a long talk with Mademoiselle and little Marie who is very pretty and very petite for her full 15 years.\n","43":" Campagne\n\nSunday. Left Major Matthews in charge of the Church parade and went down to Bde HQ\t with Stewart to conference of Battalion Commanders & Adjutants and argued there until 1pm then riding home. Polygon Wood is going to be a well known name to us soon and today the maps that are the forerunners always of a move forward came to hand. A fine day. Received orders to carry on a stunt for General Plumer on Wednesday next and will have to get the orders out. Slept during part of the afternoon. After mess lectured to all of the officers on what I have heard today and then had a long yarn with Sgt. Bill Green D.C.M. who came down for the evening from the 24th. Being the night after pay there are few loud and bibulous voices to be heard in the highways and hedges. ‘Excessive drinking will be your trouble you Colonials’ said Plumer addressing some of ours at a school of instruction. Davis back from Paris.\n\n2\/9\/17 Campagne\n\nA lovely moonlight night so went for a walk via Wardrecques before turning in. On the way back an air raid commenced and the archies and searchlights started furiously. A number of bombs were dropped round our billets but no damage or casualties resulted therefrom. Pieces of shell were falling round. The raiders were very persistent and hung round for a long while. The people were much alarmed a little Marie was very afraid and needed quite a lot of pacifying – a pleasant job. Madam was also worked up. The shooting of the anti aircraft guns was futile and ridiculous simply blazing money up into the air. The obvious counter seemed to be to send one of our fighters up and let him engage everything in the air. Spasmodic shells were fired by the aerial gunners long after the raiders were half way back home – a most windy performance. By midnight all the excitement had died down and everyone turned in for a quiet sleep. \n","44":" Campagne\n\nWent out at 9a.m with the company commanders to reconnoitre the ground for Wednesday’s operation. A lovely sunny morning and the air was bracing. Made our dispositions and walked through the woods. After lunch rode down to Arques and there attended a lecture on Gas. At mess had a lecture by the Doctor on trench feet and added a few words of my own to his. Some people arrived here tonight from St Omer as their neighbours have been bombarded out of their houses by the Boche last night. They seem rather decent sort of people. A beautiful moonlight night with some of our aeroplanes up above. In the morning we do a dawn attack facing East just to get into the habit. Reveille will be at 2.30 am! The people here use the patois in their speech and are hard to understand. Inspected some packs and pack horses tonight. The horses were under the care of Jones M.M. & O’Neill D.C.M two decorated old originals.\n","45":" Campagne\n\nReveille 2.30 a.m.. Marched out in the moonlight to the parade ground and did a dawn attack jumping off about 5 a.m.. It was not well done there being too much talking and noise. Put SM. Edgington under arrest for drunkenness and sent him in under an escort. Returned to billets with band about 8a.m. and then had a little sleep. A lovely day. After lunch company parade and lectures. Went round to B & C Coys & found some dirty billets. The Hun is putting some heavy shells round here and every night his ‘planes are over. Had some good talks with the people from St Omer. The band played tonight at formal mess. attended a lecture by Col Bridges on Wood fighting & he droned on for nearly 2 hours to an audience bored quite stiff but atoned a little by giving us a lift back in his car to the Chateau. P.V. Martin was up on an Orderly Room charge tonight and is not looking after himself. A grand chap in the line he is quite a waste out. \n","46":" Campagne \n\nMarched out to Le Biberou at 8.30 and carried out a tactical exercise. General Plumer of the 2nd Army was present. A white little man full of honours and monocled. His comments and questions were very much to the point and highly valuable to have. All officers assembled after the operation. A lovely fine morning. The woods are full of nuts and blackberries and the men killed a hare which was hiding in the undergrowth. The 7th Bde were working just behind us. In the afternoon had a sleep and gave the men a half holiday. Met Jack on the grounds before lunch – very pleasant riding along. Took two summaries of evidence for Court Martial cases. Our planes the last few days have been doing a lot of squadron flying & have a landing place near the ancient Abbaye de Woestine. The crops about are now well garnered to barns & stocks in the vicinity here. Reg came in for a yarn during the early part of the evening.\n","47":" Campagne\n\nAt breakfast received orders for a Divnl operation which involved quick thinking cancelling existing orders and the issue of new ones. Moved off to the position 5 miles away at 10.30 am taking our cookers with us and marched by winding roads to the Foret de Clairmarais a thick wood where we halted and had lunch in the shade of oak trees. At 2pm we jumped off from a position in rear of the wood and followed on the heels of the 5th Brigade. The 7th followed us and eventually passed through us. The trees were close together and the undergrowth thick which made keeping direction very difficult. On each flank was an officer with a prismatic compass. Early in the operations received a message that the Brigadier had become a casualty and for me to take over the Brigade which was simply a matter of sitting down at Brigade HQ. There was far too much noise going through \n\n6\/9\/17 Campagne\n\nthe wood due to some degree to the troops beating up game hares pheasants etc and in one case a wild boar. At the end of the show met General Plumer who criticised the operation very capably indeed and then rode home. Our band met us and we marched into billets in rain. At 7.30 pm went to a dinner of the 21st officers. General Paton & the other CO’s were also there. Made a speech in response to the visitors and enjoyed a very pleasant and convivial evening among ourselves with plenty of toasts mixed drinks etc. Honours & Rewards lists are now going on for the New Years Gazette and our recommendations were forwarded . Generals Smythe and Smith went ahead to make reconnaissances of the front line today so our stay here may be regarded as very short now. Every sign points to going up within a week to do a wood stunt of some sort & a possible stay up there of at least 2 months.\n\n \n","48":" Campagne\n\nStayed in bed until late and sent Matthews out with the Battalion to the Training area. Finished a Summary of Evidence and then got on to some office work rooting the place out pretty thoroughly and clearing out a lot of rubbish. Stewart has a septic arm and seems generally unwell. The arm is inflamed right up to the armpit and will take a while to heal. After lunch cleared up more arrears of work and did not set foot outside the Chateau grounds at all today. During the evening received word of our move forward on the 12th inst and had some French conversation with Marie & with Leon Barbier \"un homme extraordinaire\". It is damned annoying missing Rome leave but cannot be helped. General Paton has gone ahead to reconnoitre the line today. There was some rain today and the area for training was wet. After mess I lectured the officers on tactics up to date and several other minor points as brought to light by recent happenings. It will be like leaving home going away from the happy little place.\n\n \n","49":" Campagne\n\nMoved off at 8.15 in column of route for a gas attack demonstration. Paraded at nearly full strength having about 850 actually out on parade – a long khaki snake. There was some fog as we moved down to our training area and there had demonstrations of gas. Formed up on a J.O.T and gas and smoke were let off. We did an advance in our respirators and managed quite comfortably and well. Formed up and had some company lectures then marching home. Stayed in billets all the afternoon and at mess Jack came down and had dinner with us. Walked with him down to Wardrecques and called in on Col. James and had some supper. Then back home and yarned with the doctor, Bunning Alderson and Stewart preparing to have a bath prepared by O.P. Hunt who yesterday returned from a leave of 10 days, jaded and exhausted by sleepless nights of dissipation and hard doing I dare bet!\n","50":" Campagne\n\nThe 21st paraded with us on our ground for church parade conducted by Lamble and Durnford. A fine morning and the parade went off very well probably our last big one for sometime. For lunch Kellaway had his brother with us. A medical authority on the subject of meningitis. During the afternoon made preparations for tomorrows work embodying the necessary cleaning up and cleaning out the packs of surplus gear. Stewart, Greig and Blanchard all celebrate their birthdays today & strange to say the two latter were also married on the same day of the year. The Portugese are a great joke round here and said to be noted for ability in acquiring venereal disease principally. In some parts about there seems to be a good deal of poverty and old people beg . Hereabouts everyone seems to have at least food and lodging but in Rouen it is different. In Glasgow the bare poverty was more noticeable than anywhere else.\n","51":" Campagne\n\nIn the morning cleaned billets and took out all surplus articles out of packs and returned them to the Q.M.s store. A very nice morning, inspected the billets and said goodbye to the various people there. Received word to prepare to go up and reconnoitre the line tonight with the company commanders and at once commenced to get very busy in those ways than mean preparation. Saw the General at 2pm. and got the general gist of the attack plans and my position in the line. Held a conference of company commanders in the evening before mess and discussed things with them. At mess tonight the band played very well and we drank the King and then success to the old Regiment. Leon Barbier looked in afterwards but I was too busy to see him. Our bus leaves at 1.a.m. & we expect to go through Ypres returning here within 12 hours. Then another shift on short notice and a devilish long march to Steenvoorde.\n","52":" Campagne\n\nTravelled until 5a.m. in motor bus up to Ypres and nearly had several accidents by telephone wires sweeping the top of our bus. Once past Poperinge the war started flash and burst of shells & roar of guns was terrible. In Ypres there was gas and we blundered along in our masks. I got a bit of gas which affected the throat. Picked up guides and pushed on up the line – terrible stinks. In odd shell holes filthy black swollen corpse – dreadful things showing the awful side of war. In a concrete pill box found a young Colonel DSO MC who knew everything well. Got all information & returned by bus via Wallon Cappail. Capt Bean over during the afternoon. Slept and then issued orders for move. Extremely tired and fatigued. A crowded day if ever there was one. Back here it seems so quiet & peaceful. At the right batt HQ 3 men blown to bits & pieces of them scattered round the place there.\n\n \n","53":" Campagne\n\nReveille at 3 am and a breakfast by the light of candles. Batmen and others rushing round packing up. The whole family turned out to see us off and the poor Marie cried but a few kisses fixed her up. Pitch dark morning inclined to rain but afterwards cleared up. An officer of the Gordon Highlanders stayed with us prior to taking over the billets. At a little after 5.30 a.m. the Battalion about 950 moved off leaving a loading party behind to load up our two motor lorries and g.s. wagons. Moved through to Renscure and Ebblinghem. As soon as the light grew, inspected the column and the transport and found all smart and correct except the cookers which, although newly painted, were all cumbered with gear packs etc etc, one lot of cooks having even built a superstructure for their cooker. Ordered the whole lot to be dumped at the first halt and after that the cookers looked well. Pulled up on a paddock at 7.30\n\n12\/9\/17 Campagne – Steenvoorde \n\nAnd there issued each man with a good hot dixie of tea which they had with some army biscuit. At 8 am we passed the Bde. starting point being the leading battalion of the whole of the whole Division. Marching on the 1\/100000 map we wound through villages & countryside among pleasant green hedgerows and smiling fields. Noticed many hop fields where picking of the blossoming plants was in progress. The marches were of 50 minutes with 10 minute spells and the band did good work on the move. For lunch we pulled up on a field near Steenvoorde & had 11\/2 hour there. The tower of the Steenvoorde church is a modern open one and can be seen for miles. The people speak Flemish here and it sound s very coarse and guttural after French. Steenvoorde is one of the usual cobble stoned places and has an ordinary big market square. We picked up our billet guides and marched into close billets on fairly open country \n\n12\/9\/17 Steenvoorde \n\na couple of miles out of the town and just on the border of Belgium. The mens’ feet were inspected by the officers and found clean and fairly free from blisters considering they have marched over 20 miles since breakfast today – a long way. They marched excellently full packs up. My quarters are at a large farmhouse which is also an estaminet and the men sit round the kitchen drinking beer. We have some good bedrooms and a mess. The officers mess is temporarily dissolved and company messes are again the rule. In the household are some buxom mademoiselles who speak Walloon, French and some English. One brought us black coffee in bowls, beet lump sugar and milk. We also got some French white tipped sulphur matches rather rare things these days. On the march assembled the company commanders & handed on all I know about the march tomorrow. 7.00 is supposed to be start time.\n\n 12\/9\/17 Steenvoorde\n\nSlept in a small room between two dirty blankets and did not find until the morning that all the while under the pillows there were two snowy clean sheets. The farmer here has a bevy of rather good looking but untidy & tousled haired girls. The dialect is a barbarous thing of which we cannot understand a word. The boundary of France & Belgium runs just near this farm. Taubes were over during the night & were flying very low. Searchlights were trying to pick them up but without success. All packs and surplus gear are dumped here & henceforth all our marches are in battle order. Gunflash and roar are continuous and distinct. Our batmen produced a dinner of rabbit fresh dairy butter and biscuits and did us rather well. The weather is again cloudy and unsettled and looks like rain. The horrible dialect here grates on one after the musical French conversation.\n\n","54":" Steenvoorde – Abeele – Reninghelst \n\nWhile it was still dark the transport had commenced collecting packs & other gear. After 8’oc breakfast had some coffee served up by a smiling mademoiselle. Moved off at 10 in column of route and joined the Bde. column at 11 seeing the General there. The roads were congested with many marching troops and a lot of transport. Our march carried us right along the Belgian border. Pulled up outside Abeele for traffic delays and then marched right through forming up for lunch the other side. An aerodrome here was very busy. The hop pickers were industrious sitting among the vines & picking the flowers. They use long poles for detaching the plants from the wires overhead. Marched on through towards Reninghelst having long & tiresome delays owing to blocks in traffic. Met billeting people. Passed enormous shell dumps with niggers & Chinese laborers. Made Camp at 4.45. Met General at 5 and arranged to go up to the front in the morning. Roar and gunflash tonight.\n","55":" Dominion Camp \n\nAwakened at 4 am by Hunt and got up and had a bite of breakfast in the dark. General Paton called for me with the Divisional General’s motor car and we pushed off first of all to the Chateau Belge there picking up Major Fussell. Our run to Ypres was fairly quick and there was no shelling and no gas. We left our car at the Birr Cross roads and collected the Bde Intelligence officer prior to reconnoitring the firing line. The road had a few dead horses on it and showed signs of heavy shelling from the night before. We went up towards Hooge and had some heavy shells landing round as close as dam it. Went through Chateau Woods on duckboards with Taubes flying overhead in squadron formation. Our machine guns firing at them. The Wood is all smashed about and in wet weather must be morassy. Noticed a few sabots lying round, relics of happy homes and civilisation. The Etang de Bellevarde is a lake about 4 acres in dimensions. Pioneers were hard at work on a road running\n\n14\/9\/17 Front Line Ypres\n\nparallel to the ridge. The ground is a mass of shell holes and there were many bodies lightly buried - here legs sticking out, here a mummified hand. Reached the right battalion headquarters & saw the Colonel who was a decent little chap who seemed to know his job very well. His \"dugout\"consisted of a little elephant with about 3 feet of earth on top and was generally a wretched place. The celebrated Glencorse Wood is our right flank. Walked round with the Colonel and had a look over the position. Thousands of blow flies were hovering round different portions of the trench finding ghastly banquets where the earth had slipped away from half buried corpses. The morning was very quiet and shelling quite ordinary. Returned via the right of the Etang and was rather amused by trying to recognise places from the map. The village of Westhoek was represented by a couple of shell holes containing a few fragments of timber. There were no other signs of a \n\n 14\/9\/17 Front Line Ypres\n\nvillage ever having existed there. In another place there was a trace now & then of what had been once a main road. The enemy was shelling Chateau Wood rather heavily and using shrapnel as we made right back for Railway dugouts which we located after being misdirected several times by that more or less unreliable cheerful liar the British tommy. Descended long flights of stairs and found corridors lighted by electric light . Went along these still deeper through passages oozing water which splashed underfoot. We passed pushing trollies on a tramline just the same as in a mine. Found a colonel in command of the Brigade in a nice little mess, white tablecloth fish breakfast etc – they do themselves well. Walked over to Birr Cross roads and found the dugout there also very extensive and the old General with ribbons sitting down to a comfortable meal and had a cup of tea with him. Commenced to walk back by\n\n14\/9\/17 Ypres & Dominion Camp \n\nroad but very heavy shells were landing right on it causing batteries around to evacuate. We made a big detour to the left and escaped the bombardment. Caught our car at the big dressing station and drove back through Dickebusch home. Spent the afternoon working out details for the relief and taking things easy. The band gave a programme during the afternoon. At 6.30 Kellaway put on a concert in the Y.M.C.A and I sent Major Dooley over to preside being too tired myself. Col James came in for a talk after mess. The concrete pill boxes are a characteristic of the front up here and are very strong undoubtedly - solid concrete and steel rails. The left battalion H.Q. has several direct hits daily. The C.O. in one place was most apologetic for the bad odour about and said it was a Colonel of the Northumberland Fischer and his Adjutant who were buried inextricably in debris.\n\n","56":" Dominion Camp\n\nSlept in until late being very full of a catarrahyl cold in the nose and had breakfast in bed. After that spent all the morning on odds and ends. Young Smith reported back from leave and took over his intelligence duties again. Received a big crowd of aeroplane photographs of the front very well done. The great drawback is the absence of contours everything appearing dead flat. The photography is not the easiest of operations as they have to come low. A squadron of Taubes flew over early in the day and archies and machine guns were firing at them. At 3.30p.m. three busses called for our advance party for the front line. The band rendered a programme during the afternoon. Paid the men during the evening. An Australian paper mail in. General Paton came over for a talk before mess. Fritz’ s latest is firing into his own pill boxes by leaving the backs of them thin. Cursed again with hay fevery symptoms the doctor advises a douche but nothing seems much good. Am taking the men in with 170 rounds S.A.A. 3 days rations and water and no greatcoats or any blankets. \n\n","57":" Dominion Camp\n\nAttended a conference at Bde H.Q. presided over by the General. A windy dusty day with a heavy bombardment during the morning. At 2.30 p.m. all the men came out of the huts and loaded up with their line kit wearing sandbags round their legs instead of puttees and looking very daggish in their steel helmets. At 3p.m. we moved down to busses on the road and the whole battalion was soon on wheels running up towards the line. We debussed at the Ypres asylum and I scattered my 700 men about in little parties to avoid the Guns and let them have their tea. A number of big guns were firing and up overhead there were plenty of planes. We stayed on this ground until 6 p.m. and then commenced forward movement with big intervals. It was hot and dusty going through Ypres and just before coming to the square we saw a dark pool some clothes and a few splinters all that was left of a bussload of people. As we quickly crossed the hated square we had a big shell whiz close over & churn up some ruins out\n\n16\/9\/17 Ypres\n\nof whom a few men tumbled. Through the Menin Gate to the corner where a traffic man told us that Hellfire Corner was being strafed. Passing the main dressing station noticed many wounded men. Hellfire Corner was churned to pieces and we wasted no time getting past. Some guns knocked out, dead horses putrefying all round and some chaps flung out of their graves by deep plunging shells. A motor lorry was burning and blown to pieces. At Birr Cross roads we got a good lateral view of the rear of the battle field where long flashes leapt out of the slopes of distant rises. Here we found our dumps of water and panniers ready and also our guides. The men loaded up and swung off the road towards a Corduroy track. A fair amount of stuff was flying round and presently a shell got into the rear of a little group about 70 yards in front of us killing 2 and wounding about 3 others. Legs and arms were flying all over the place but Monaghan the sergeant is a good relentless old chap \n\n 16\/9\/17 Ypres – Westhoeke Ridge\n\nand made them push on leaving one stretcher bearer with the dead and wounded. I.P. Stewart and self halted until the hate died down a bit and then pushed on again. It was now dusk and the flame and smoke of bursting shells were all round. Chateau Woods was a merry hell we skirted it and the Tommy guides pushed on very fast with the result that our heavily laden men were nearly right out to it. We pushed up to the head of the column and re-organised the fellows and cheered them up. The shelling was very heavy and we had about five more men wounded. We got all the men up under Bellevarde ridge and put them into shell holes there for a blow and re-organised our guides. A very rough night and a nasty introduction. Had a better passage along duckboards to a battalion headquarters and there saw Colonel Hughes who lost a whole platoon by shell fire yesterday. Then walked over to Colonel Friend and reached there sweating and exhausted. Took \n\n 16\/9\/17 Ypres – Westhoeke Ridge\n\nsundry drinks and then commenced talking. All crowded into a stinking pill box. The Hun was active the S.O.S went up on the right and we had more men badly wounded including C.S.M. Carter Sgt Castledene Hinds and our black man Owen whose face all bloody looked worse than ever. Our casualties totalled about 25 up to midnight. Before dusk two planes had been brought down one of ours & 1 Hun. We got the camera and gun off the plane. The corpse of the Flying Corps officer we put near our R.A.P. ready to bury in the morning. Relief was complete about 11.30 pm.\n","58":"\n\nSlept until dawn in a troubled sort of way. At 4.45 went out with the artillery observing officer to watch our dawn bombardment. The Hun got in first and put down a heavy quarter of an hours barrage which was mostly in Chateau Wood direction. At 5.30 a.m. our guns opened up and the whole horizon was flash and fire. The shells went screaming over thick and put up heavy barrages on the enemy. The line of shrapnel puffs\n\n 17\/9\/17 Westhoeke Ridge Ypres\n\nhung like a curtain and as they started to creep started to touch him up and he sent up his S.O.S. The retaliation was partly on our front line and partly on the supports. Greig was killed by a shell burst. The shell came through the parapet and burst back on him. At 9a.m. our casualties were for about 12 hours 1 off killed, 2 OR killed, 30 OR wounded. A few direct hits on this pillbox. Dreadfully foul smelling place. Opened all curtains & got a draft through the structure. A little party took the poor bodies of Greig, the R.S.C. officer and a private soldier and buried them in a shell torn waste beyond Bellevarde ridge. The shelling continued more or less active during the morning. This pill box on further inspection proves to be a very substantial place and quite extensive. Solid concrete and iron rails. There is an O.P. on top of the dugout. War is getting too much for flesh & blood –how can one stand up to a barrage of steel. Poor soft bleeding limbs torn and shattered\n\n 17\/9\/17 Westhoeke Ridge\n\nlast night the poor boys lying smashed up. Hun guns open up intense fire at 3pm and some more will be casualties then. Our stretcher bearers have been busy. At 3 p.m. our guns commenced once more an hours intense bombardment on the whole Divisional front and drew some retaliation. A F.M. officer found one dead engineer and another one dying just near here. Copl. Morrison of \"c\"Coy killed. Fired a siren message rocket back to the Bellevarde ridge. A birdseye view of the battlefield in front discloses a tangled rubbish heap all pitted with shell holes. No sign of any living being in sight. Extremely hard to tell where our posts are on the map as landmarks have all been blotted right out. After dark went up the line with a runner and others. The ground round the positions forward is not as torn up as one might expect. Found Bunning in a concrete block house which was nearly awash with water and had a talk to him about the situation.\n\n 17\/9\/17 Westhoeke Ridge Ypres\n\nThe boys were all in fairly good heart. While there Blanchard came in rather shaken up with the effects of one of his lads who had just had his head blown off. Pushed off towards \"D\"Coy crossing what had once been a road – now a tattered battered place. Flares were going up close to us and we had to freeze into rigidity now and then. Entered another round concrete place after much adjectival advice to keep our heads down and there found Davis and his officers. I was not satisfied with the grip shown in handling the situation here and put the acid on. They could not find the company on their left so I arranged for two flares to be fired in quick succession at 11 p.m. from their left post to give the direction. Mc Intyre had 4 men killed in his post. Returned now to \"C\"Co. HQ with Sergt Cook (wounded later) and some shells skimmed close enough to part our hair, found Woolf and had a good talk smoothing out some difficulties for him. The enemy shelling consistently round about here. Called in at R.A.P.\n\n \n\n 17\/9\/17 Westhoeke Ridge Ypres \n\nand saw the doctor, Rodda & company. Some slightly wounded men here and one S.I.W. Reached Battn HQ about 11pm and found orders for our relief in the evening tomorrow. \n","59":"\n\nAbout 1a.m. a runner brought in some belongings of another dead man and a German Prisoner of the R.I.R. A fat little chap a typical cockaded capped Hun wearing the ribbon of the Iron Cross. He had been caught by one of our posts and caught speak a very little French. Called the Kaiser & Kronprinz swine who ride about the rear in motor cars and he said they hoped for a Republic after the war. His belongings were of the usual type – photos of himself and other Huns, a map of the fronts, a little testament, some tobacco etc. He was packed off to Brigade under a guard of a Billjim. Got on to details for our relief and to intelligence. Our patrol met a party of Germans and fired on them getting a few. One of our chaps was wounded in the foot. At dawn everyone \n\n18\/9\/17 Westhoeke Ridge Ypres\n\nstood to arms and a stiff barrage was put down. General Paton came in about 8a.m. and we had a screw round the position from an O.P. At 8.30 our guns lashed out on a prepared bombardment which roared until 10. He retaliated and we had four good chaps blown to bits. Sgt. Kelly of \"D\"Coy was one. Ireland of the Sigs. was in here the night before last joking. He was killed on the way home. Colonel Pye and Colonel Norrie called in and arranged the relief tonight. Things quietened down a little. Some of the chaps were a little shaken with seeing casualties etc. Our total is well over 60 and we have just been sitting down doing nothing. During the balance of the afternoon the gun battle continued very heavy. A runner who passed the R.A.P. reports wounded trickling in there. Our militant padre has been up to the company headquarters as it is. Cox the runner came up with three grave crosses for Greigs & other graves. On arrival of part of \n\n 18\/9\/17 Ypres Westhoeke Ridge\n\nthe signal personnel of the 19th Battn we released part of our own. About 5.30 the batmen pushed off. Capt Bean & Gullett dropped in for a talk having been round on the 1st Division front for a portion of the afternoon. Our heavies are putting it hard on the Anzac ridge. Have arranged our buses for 2 am the companies to assemble at the Ypres Asylum only have some tea and food before embussing for Vancouver Camp. Too much movement round about here today and we have drawn much fire. The wires to the two forward coys have been broken all day and did not come on again until the evening. The runners are characters – dags all and most amusing in their conversation. The support company under Rodda was relieved and got out about 8pm. At 8.30 all the guns on the whole 2nd Army front opened up, (supported by hundreds of machine guns), in one \n\n 18\/9\/17 Ypres Westhoeke Ridge\n\nterrific bombardment. They started far back 2500 yards behind his line and commenced to work forward. The sky was one livid mass of flame and the air full of acrid fumes and smoke. Several times our dugout rocked and one was thankful for the steel rails and concrete. Our 15 inch guns had been strafing a ridge 1000 yards away and each thud shook the foundations here. The blow backs were enormous. All the post guides for this flank we put into our rear recess but the other flank I am rather worried about. The 5th Bde take over this as a battle H.Q. in the morning and already we have scores of people buzzing round, wireless and other signallers, engineers etc. For weeks we have been deliberately refraining from shelling certain of his roads keeping them for zero day and then every place will catch it. Hereby we trust to keep down his supply of ammunition from coming up.\n\n18\/9\/17 Ypres Westhoeke Ridge\n\n10pm. The enemy retaliation took the form of their usual strafe including some gas of which we all got a whiff before getting helmets on. A few men outside were hit and one of the 19th Batt. killed. A SergtMajor called down the stairs that he had pulled the body out of the trench and put it on the parados. Those he addressed paused a minute in their joking to shout out alright. At 10.40 we hear of another chap killed outside – a little runner blown in half. Getting the relief out to the posts was the devil’s own job owing to the guides having trouble in finding their way. It was pitch dark. Major General Smythe came in with an engineer officer and they must have had a rough passage indeed. We talked of going forward but conditions were too bad and shelling too heavy. The relief was completed slowly and at 4.20 we moved off. The sap just out side contained something soft that gave underneath the foot in a disgusting way and we knew that we were walking over the dead body of some poor chap. There was \n","60":" Battle of Ypres\n\nmuch traffic and by dawn his body would be trodden to pulp. A nightmare passage out. We ran and tumbled over duckboards and shell holes fountains of flame and dirt shooting up from round about. A shell landed a couple of yards from our party and failed to detonate. The barrage of our guns was due to commence at 5 am so we were rushing against time and tumbled down the steps of the Bde HQ at Birr Cross roads absolutely done. Poor old doctor was very exhausted and a little hysterical. We waited underground with the Brigade Staff and I had a talk with the General. Left about 6 and caught a motor lorry which had just dumped shells and went down the Menin Road which was not being heavily shelled. One 8 inch one landed 100 yards – a pretty sight solid flame and sparks leaping heavenwards. An enormous cloud of dark smoke drifted away and the air was full of dust and fumes as our motor lorry charged through it. Through Ypres picking up some kilties also coming out of the line and at the Asylum found Crawthorne\n\n19\/9\/17 Ypres\n\nand Miles and a motor lorry. All the men had gone on ahead so we soon reached camp and slept until 3 00 in the afternoon – done. Foyles had bad luck coming out – 9 killed by a big shell. Our total casualties for this little trip just about 100. At 5 left camp again and marched down past Chateau Belge to Canal area and bivouacked among trees. The 18th Battn was just marching out to the attack loaded up jesting but everyone had a tense haggard look that is customary before a charge takes place. Our aircraft is wonderfully busy until dark planes of all descriptions flying overhead.\n\n"}}