{"Document Name":{"0":"Diary_0429","1":"Diary_0429","2":"Diary_0429","3":"Diary_0429","4":"Diary_0429","5":"Diary_0429","6":"Diary_0429","7":"Diary_0429","8":"Diary_0429","9":"Diary_0429","10":"Diary_0429","11":"Diary_0429","12":"Diary_0429","13":"Diary_0429","14":"Diary_0429","15":"Diary_0429","16":"Diary_0429","17":"Diary_0429","18":"Diary_0429","19":"Diary_0429","20":"Diary_0429","21":"Diary_0429","22":"Diary_0429","23":"Diary_0429","24":"Diary_0429","25":"Diary_0429","26":"Diary_0429","27":"Diary_0429","28":"Diary_0429","29":"Diary_0429","30":"Diary_0429","31":"Diary_0429","32":"Diary_0429","33":"Diary_0429","34":"Diary_0429","35":"Diary_0429","36":"Diary_0429","37":"Diary_0429","38":"Diary_0429","39":"Diary_0429","40":"Diary_0429","41":"Diary_0429","42":"Diary_0429","43":"Diary_0429","44":"Diary_0429","45":"Diary_0429","46":"Diary_0429","47":"Diary_0429","48":"Diary_0429","49":"Diary_0429","50":"Diary_0429","51":"Diary_0429","52":"Diary_0429","53":"Diary_0429","54":"Diary_0429","55":"Diary_0429","56":"Diary_0429","57":"Diary_0429","58":"Diary_0429","59":"Diary_0429","60":"Diary_0429","61":"Diary_0429","62":"Diary_0429","63":"Diary_0429","64":"Diary_0429","65":"Diary_0429","66":"Diary_0429","67":"Diary_0429","68":"Diary_0429","69":"Diary_0429","70":"Diary_0429","71":"Diary_0429","72":"Diary_0429","73":"Diary_0429","74":"Diary_0429","75":"Diary_0429","76":"Diary_0429","77":"Diary_0429","78":"Diary_0429","79":"Diary_0429","80":"Diary_0429","81":"Diary_0429","82":"Diary_0429","83":"Diary_0429","84":"Diary_0429","85":"Diary_0429","86":"Diary_0429","87":"Diary_0429","88":"Diary_0429","89":"Diary_0429","90":"Diary_0429","91":"Diary_0429","92":"Diary_0429","93":"Diary_0429","94":"Diary_0429","95":"Diary_0429","96":"Diary_0429","97":"Diary_0429","98":"Diary_0429","99":"Diary_0429","100":"Diary_0429","101":"Diary_0429","102":"Diary_0429","103":"Diary_0429","104":"Diary_0429","105":"Diary_0429","106":"Diary_0429"},"Date":{"0":"unknown","1":623.0,"2":624.0,"3":625.0,"4":626.0,"5":627.0,"6":628.0,"7":629.0,"8":630.0,"9":631.0,"10":632.0,"11":633.0,"12":634.0,"13":635.0,"14":636.0,"15":637.0,"16":638.0,"17":639.0,"18":640.0,"19":641.0,"20":642.0,"21":643.0,"22":644.0,"23":645.0,"24":646.0,"25":647.0,"26":648.0,"27":649.0,"28":650.0,"29":651.0,"30":652.0,"31":653.0,"32":654.0,"33":655.0,"34":656.0,"35":657.0,"36":658.0,"37":659.0,"38":660.0,"39":661.0,"40":662.0,"41":663.0,"42":664.0,"43":665.0,"44":666.0,"45":667.0,"46":668.0,"47":669.0,"48":670.0,"49":671.0,"50":672.0,"51":673.0,"52":674.0,"53":675.0,"54":676.0,"55":678.0,"56":679.0,"57":680.0,"58":681.0,"59":682.0,"60":683.0,"61":684.0,"62":685.0,"63":686.0,"64":687.0,"65":688.0,"66":689.0,"67":690.0,"68":691.0,"69":692.0,"70":693.0,"71":694.0,"72":695.0,"73":696.0,"74":697.0,"75":698.0,"76":699.0,"77":700.0,"78":701.0,"79":702.0,"80":703.0,"81":704.0,"82":705.0,"83":706.0,"84":707.0,"85":708.0,"86":709.0,"87":710.0,"88":711.0,"89":712.0,"90":713.0,"91":714.0,"92":715.0,"93":716.0,"94":717.0,"95":718.0,"96":719.0,"97":720.0,"98":721.0,"99":722.0,"100":723.0,"101":725.0,"102":726.0,"103":727.0,"104":728.0,"105":729.0,"106":730.0},"Entry":{"0":"\n\n","1":"\n\nSat 4th\n\nStan & Les on duty on the ‘phone from 4 till 8 ‘clock this morning here at No 1 Outpost; I woke at 5 o’clock had a nice little walk down to the well for water, which is nearly a mile away from here; (we always seem unlucky in never striking camp near water); Last night a fatigue party of 200 men were told off. Some of them had to put out barb wire entanglements & the remainder to be ready in case of discovery & attack; A Monitor opened fire from opposite us at dinner time with large guns apparently shooting at a target some-where in the Narrows; At 4 oclock a Cruiser gave The Turks trenches on Walkers Ridge a particularly rough time dropping large shells right along their trenches, There is only a gully between us & where the shells fell. So we had a grand view of the bombardment.\n","2":"\n\nSun 5th\n\nSergeant Nelson went off duty yesterday morning sick, & I am in charge of the Signallers at present. Stan & Les was on duty from 8 oclock to 12 last night; Today Cpl Yule was sent away sick; Fleas appear to be very bad here and I put in a very uncomfortable night last night in consequence; The same party of 200 men were sent out again last night putting out barbed wire entanglements, & as the full strength of the Regt is only 235 men they are not getting much spell as there are several fatigue parties told off every day for small jobs; I have had a swim every day since coming to Old No 1 Outpost; The Welch Pioneers who have been in the trenches here were sent away today, & C. Sqd went into the trenches in their place; a Cruser has a bad habit of standing out about a mile from here & firing her heavy guns kicking up a hell of a row.\n","3":"\n\nMon 6th\n\nEvery available man was on another fatigue party last night & orders came through yesterday saying the fatigue parties have to go out every night; we were told we would only be at this post for 3 days when we came but it has lengthened now & we are to remain a fortnight. Stan went to Anzac this morning to have one of his teeth filled & arrived back at dinner time after being told to call back next week as the dentist had no stuff to kill the nerve. We have been trying to get half a case of eggs through Monk one of our Red Cross men but so far have not succeeded. Col. Meredith has been behaving like a gentleman here & we all have a much better opinion of him here than we had in Egypt & everyone agrees he will not be found wanting if we have any more charging to do, he seems to be always smiling & happy & is proud as punch of the old boys.\n","4":"\n\nTues 7th\n\nLast night about 8 o’clock I walked to the depot about a mile further along on the left of the offchance of seeing Mills and getting a loaf of bread from him, but my walk was in vain I put in an hour looking for him among the mule transports & then gave it up as a bad job & came back; A destroyer was firing at intervals during the night to make the Turks keep their heads down so as they would not discover our fatigue party putting out barbed wire entanglements; Stan discovered a plant while down for water this morning & bought a box of chocolates for 6\/-; We had no trouble to sell half the contents for 4\/- here & are keeping the remainder for our own consumption; An English mail today, & I received another note book & some papers from Edie. Stan & Les were on duty on the ‘phone till 4 oclock this afternoon & as soon as they came off\n\n7.9.15\n\nLes and I went for our daily dip, our tin of Curry is nearly finished, so we worded one of the Indians for some to-day. The Indians had no powder but gave us some curry grains & told us to call tomorrow for curry. After we had finished swimming we decided to go around to Anzac to see if we could buy any eggs from the sailors, but our trip proved a failure; a German Taube flew over us to-day & opened fire with a machine gun on some of our positions this is the first machine I have seen with a machine gun mounted on her. A fatigue party was sent around to B.H.Q: for Canteen Stores this afternoon. This Regt has been having a fairly rough time of it here doing fatigue work etc. A pinnace off one of the war boats was raised at Anzac this afternoon, it had been sunk close to shore.\n","5":"\n\nWed 8th\n\nA warboat standing well out from the shore has been firing to the South of us this morning, some bombarding has been going on to the South of us yesterday afternoon & last night & the torpedo boat was yapping again last night as usual; We have dodged standing to arms pretty well up to date but the Adjutant is getting a bit particular lately & we have had to stand to arms the last few mornings with the Regt; At dinner time to-day our Turkish interpreter was coming from Bde H.Q. to Anzac beach instead of taking the sap he started to walk along the beach & a Turkish sniper dropped some shots uncomfortably close to him: he then turned & started to walk towards us & the sniper, the bullets were just missing him & one went between his legs, he then sat down behind a bush until one of our lads went down to the sap & called him in; he was not hit & had no idea he was in the line of fire from Turks\n","6":"\n\nThurs 9th\n\nStan succeeded in buying a couple of tins of Salmon & 2 tins of milk last evening for 4\/- so he struck a mine & we had Salmon for breakfast to\u001eday; Les has taken a bad turn again today & is far from well; Bill Nelson has recovered & is well enough again to do duty; Our rations have improved considerably during the last week & we even had a small issue of bread to-day, we have plenty of jam & a fair issue of rice & & have even had 2 eggs each since we arrived here; When down for a dip to\u001eday I gave my clothes a treat also; Scott had a row with the Dr to-day and got transferred to A Sqd. The nights are beginning to get a bit chilly but the days are still warm & the weather is perfect; Everything quiet.\n","7":"\n\nFri 10th\n\nLast night at nine oclock a good deal of rifle & machine gun fire was exchanged, & one of the warboats threw a few shells into the Turkish lines, but it proved to be only a demonstration & there was no attack made; The men here are in the trenches during the day till 6 oclock when they are relieved, they then have to fall in at 7.30 & do six-hours fatigue during the night; While having a swim at 4 oclock this afternoon, the Artillery opened fire on the extreme left, the warboats also took active part & the bombardment lasted for over half an hour. I cannot hear if we attacked but it looked very much as though one was in progress. The sun went down behind a heavy bank of clouds tonight.\n","8":"\n\nSat 11th\n\nReceived another apology for a mail again to-day. I received a letter from Lilian Tomlins also a package of cigarettes; & some papers from Aus. but no letters: Everything is very quiet here & the only thing we have to interest us is the dispatch rider running the gauntlet along the beach & the Turks sniping at him, they have put some shots very close but have not succeeded in hitting him yet, occasionally a man on foot also walks down this road not knowing the danger, but they are soon made aware of it when the shooting starts; Fleas gave me a rough time here for the first few nights, but they have now deserted us or else I am getting too thick in the hide to notice them; It has been cooler to-day than what it generally is.\n","9":"\n\nSun 12th\n\nPractically the whole of the Regt still go out on fatigue work every night & the troops are having a rough time in consequence, a good many are going away sick, 6 went yesterday; Today has been quite chilly & a little rainy looking. Church Service was held here at 3 olock this afternoon by Col Merrington (our Chaplain) I was too busy writing to attend Received an Australian Mail to-day for a wonder Stan got 9 letters, & I received 2 from Jessie & 2 from home. Stan & Les still do 4 hrs on the phone & 8 hours off & although Nelson is on duty again I have not been called on to do any work so far & quite enjoying my holiday. It is 4 Calender months to-day since we arrived on the Peninsula. Very heavy bombardment towards Achi-Baba.\n","10":"\n\nMon 13th\n\nAt 4 oclock this morning rain began to fall & we got quite a sharp shower & as our bivy was not made for a wet weather Campaign, our blankets got wet, & at 6 oclock it looked as though it was going to rain for a week, but the clouds cleared away by 10 oclock. Smithers & I went to the beach for water & had a dip while we were there & the water was like ice; Stan was also in swimming on his way to Anzac to have his tooth filled; The sun came out very hot about dinner time & I put in an hour or so building a rain proof shelter & I now think we can afford to treat any rain we are likely to get with contempt: The Canteen rations were served out to-day but they did not amount to much, one tin of Cocoa-milk, a bottle of vinegar, one tin of sardines, 1 tin of Herrings & 3 tins of Ham & tongue was about the total we received. Stil heavy firing to the South.\n","11":"\n\nTues 14th\n\nWe are having very dull, cloudy weather at present but the rain seems to be hanging off well & the nights are quite chilly & even a little on the cool side during the day time: We had a pay day to-day, I drew £ 2.0.0 & sent £1.0.0 to Edie for goods we want. One of our aeroplanes flew over us at dinner time & headed South at top pace, another aeroplane was visible a long way to the South & it was generally thought to be a German &were in hopes of seeing a duel but they were soon both lost to sight, our aeroplane soon returned so probably there was nothing doing. Our Dr has a bomb mania & is always experimenting with them, to-day he has been particularly lively, exploded one in the Latrines to kill the flies, & several in the incinerator, it appears to amuse him as much as crackers do schoolkids. Eveyone here considers him a bit mad.\n","12":"\n\nWed 15th\n\nThe Despatch rider came a cropper late yesterday afternoon, the horse he was riding has been hit 7 times before but only slightly & yesterday a bullet entered his chest & brought him down, the snipers were very busy & poured in a volley as he fell but the rider managed to get off the road & into a sap without being hit, but he lost his despatches & decided to wait until dark to get them as the snipers were making the road too hot to get them in daylight; A party of 25 men & an Officer was sent from this Regt this morning as a body guard to Div Head Quarters only men who have been here from the start & have not been away sick or wounded were sent. Capt Smith was the Officer in charge; &25 men of the 25th L.H. came here to replace them. Had another shower of rain between 3 & 4 oclock this morning but our ‘bivy’ turned the rain well a very fine day after 9 oclock when the clouds cleared.\n","13":"\n\nThurs 16th\n\n(Sent Cable of Congratulations to Meg & Steve)\n\nA barge loaded with 500 shells was hit by a shell coming into shore this morning early & the lot went to the bottom of the sea, most of the cases the shells were in burst open & were floating about when we got up; enjoyed a dip while down for water although the morning was on the cool side the water was warm; We have had 14 or 15 English lads attached to us all the time we have been here & they had orders to move this afternoon. They could not understand us firing in the trenches without orders when we saw a target & they said they were sorry to leave as everyman done what he thought right here without going to an Officer to find out, they were mixed with our lads in the trenches one morning & Col. Meredith went along the trenches, no one took any notice of his presence & the Tommies said if it was their Col they would have all been Court martialled.\n","14":"\n\nFriday 17th\n\nRained a little again last night: An order was sent in to Bde H.Q. last night for 35 Bell tents, also several small tents for Officers for this Regt. so it looks very much as though we are here for the winter: Two Motor Lorries were landed here the night before last & they were using them last night; a good deal of shelling goes on here every day & the aeroplanes are still as busy as ever; but this spot we are in at present is very safe & we have had no one wounded since we came here. The Turks trenches are 600 or 700 yds away & seldom anything doing: Stan and I went down for a dip again today; This evening the despatch riders horse was badly hit & lasted just long enough to carry the rider out of danger before he collapsed: Last night the Turks had a demonstration but there was nothing doing.\n","15":"\n\nSat 18th\n\nHad a swim while down for water this morning. The despatch riders horses was hit in the fetlock this morning by the snipers, they are getting a good few horses but the riders always seem to escape: The Turks opened up a very heavy fire at 4 oclock this afternoon right along the line, & directed all their Artillery on the trenches about a mile to our left, an attack was expected when the bombardment ceased, it lasted a good half hour & and our war-boats were very busy dropping big shells amongst the Turks. We received the oder to stand to arms some time after the bombardment commenced but there was no charges made & everything was normal at sundown: Quarter Master Sergeant Easterbrook has been made Sergeant Major in Wrights place, Wright having received a commission.\n","16":"\n\nSun 19th\n\nThe despatch rider was wounded to-day but the Turks did not bring him off the horse; Nothing out of the ordinary occurred last night after yesterdays demonstration; but our warboats have been very busy down Achi-baba way & in the Narrows; Our machine gun men had orders to put in a new machine gun in these trenches yesterday morning & it looked as though it was put there for the demonstration; Last night the two motor lorries took 14 tons of provisions etc around to the left; a railroad is being constructed along the beach & the work is going along at a fine pace, however they are now just on the edge of the danger zone & it is too dangerous to work on it in the day time; The strip of land commanded by the Turks is about 500 yds long right down the beach; Another dip today.\n","17":"\n\nMonday 20th\n\nIt turned very cold last night & this morning is a \"freezer\" & clouds hanging around threaten to give us a ducking as well: Clouds cleared off early & had a fine day A sailing vessel came on the scene this morning early with divers on board they are here to dive for the shells that were sunk a few days ago, The Turks soons got the range of the boat & succeeded in hitting her twice below the water line, & she sank slowly the water was very shallow, but she is resting on the bottom; a good deal of artillery fire has come over the last few days but it is seldom any damage is done, & most of the shells fall far out to sea. A good deal of shooting goes on at the boats but it is very rarely they score a hit; Went down for a swim again this afternoon & had a \ncold\n swim. Bought 4 doz eggs today at 2\/9 per doz.\n","18":"\n\nTues 21st\n\nI had a swim this morning while down for water I believe despatch riding along the beach has been given up on account of the number of horses hit & the danger the rider runs The new moon has been showing for several nights now & it is getting bright enough to see the transports by & where the Turks could only fire at the sound a few nights ago they can now see their target they get an occasional mule & sometimes wound an Indian driver ot two; Mills has to go along this road with the Indians every night as interpreter; The nights are getting quite chilly here now but the days are still warm; Nothing doing in the fighting line; Nelson & one of his men are to run out a telephone wire tonight they go out over the parapet with it.\n","19":"\n\nWed 22nd\n\nNelson and I went over the hill & down to the bottom of the gully in the new saps just dug to put out another ‘Phone; The ‘phone is an old Mark 2 & perfectly useless, we tried to get another from B.H.Q. but was told they had no others & we would have to make it do; so we took it out & connected it up & put in half an hour trying to buzz someone up, the buzzer went bung on us & we could make no one hear by talking, so we decided to take it back as it was worse than useless in such an important post: Just as we had disconnected the ‘phone the General (Godley) came along with the Signalling Officer; Godley said Good-day boys how is it going! Nelson said it won’t go at all Sir; & then complained about the ‘phone that we were given to put in the firing line; Godley agreed it was an important post & told the Sig. Officer to find a good ‘phone for this place.\n","20":"\n\nThurs 223rd\n\nStan managed to buy quite a store of goods yesterday afternoon such as pickles Sauce, Salmon, Sardines etc 16\/6 worth altogether; by the way we have been living high lately eggs & bacon; risoles & eggs & Rice Custard play a prominent part in every meal we have but the eggs have given out to-day & there has been some rows on the beach lately by the Ships officers & the sailors who bring the goods ashore, one sailor was sentenced to death yesterday over the goods he was bringing off the ships; A lad in the 14 Btn was sentenced to death here for being asleep on duty, the sentence was brought down to 7 years hard labor & was sent to Egypt to do it, from there he wrote to the General asking for a chance again in the firing line & it was granted him. I guess his motto now is \"to do or die\"\n\nWe go on duty tonight on the ‘phone in the firing line; Sapping this afternoon putting in a possy for the phone.\n","21":"\n\nFriday 24th\n\nNelson, Stan, Les & I were working hard yesterday afternoon putting in a small trench off the firing line to make ourselves comfortable on the ‘phone during the winter the ground is very hard & the trench 6 or 7 feet deep so we did not get far in, & then last night we were on duty on the ‘phone all night 3 hrs 20 minutes each & we put in a very cold uncomfortable night: & this morning we came to the conclusion that sapping in the day time & on duty during the night was a little above a joke & I decided to see the Adjutant as Nelson seems afraid to say what he thinks to him, we were given the same ‘phone (that was condemned by the General) after it had an expert onto it who fixed it right enough for about an hour then it turned dog on us & we could not use the buzzer on it, but managed right enough by speaking through it till 2 oclock this\n\nmorning & after that we could neither buzz or speak & could not send in the hourly reports, so I brought the phone back with us as we came off duty & handed it back at the ‘phone room here; This I told the Adj & the Colonel was also there, & said they would do what they could for us; I then complained against sapping in the day time & being on duty on the ‘phone every night & asked for a sapping party to do the work; The Adj apologised for putting us on the day before & said they were short of men & had no one to put on; (I did not tell him what I thought as I probably would have been arrested for calling him a liar) however I saw the Regt S. Major & told him the Adj said I could get a sapping party to do the job the RSM. asked me who I wanted I said Hobson & his mate, as I considered them the two best workers in the Regt. so I was told to take them; & at 9 oclock this\n\n24.9.15\n\nmorning Hobson, his mate , & I went out & set to work & did good work till dinner time: Hobson & his mate were to go on again at 2 oclock till 5; Hobson’s mate went off duty at dinner time with a poisoned foot & as the dirt had been falling in off the parapet all the morning Hobby & I decided not to go out till after tea, so as we could get up on the parapet & shovel all the loose dirt away from our front, as there should be an hours darkness before the moon rose & not much danger of being hit by our friends the Turk, who is entrenched 500 or 600 yds away; We worked at high pressure during that hour & before the moon rose we had finished all that could be done for the present on the parapet & returned to our bunks; This afternoon Stan & I received a sheep-skin waist-coat from Aunt Bessie, & they are very acceptable as the nights now are getting very cold. \"No phone work tonight\"\n","22":"\n\nSat 25th\n\nAt 9 oclock last night the warboats opened fire, also our artillery & put a few rapid shots in & at the same time all the firing line opened up a rapid fire; I thought for awhile that an attack must be in progress for 971 but it proved to be only a demonstration but it was the biggest I have heard, it is rumored that an attack is to be made this afternoon or tonight on 971, one of our machine guns was taken around to the left yesterday in anticipation of some lively work; Captain Broadbent is our Adj from to-day on & Chisholm is going back to his Regt (the 2nd) ;Hobson & McGee were on the ‘phone box again to-day; I was with them all this afternoon, the ‘phone has not been fixed up yet & we have no phone work to do tonight in consequence: Everything very quiet.\n","23":"\n\nSun 26th\n\nHobson & McGee were put sapping in another position today & the work on the ‘phone box is hung up; Nelson & I went to Bde HeadQuarters this afternoon to receive telephone instructions & saw in Div. Orders that Arthur Lye has been struck off the strength of the Army Corps; It is a decent step to B.H.Q. but we had an interesting time finding where our lines ran & met etc on a sketch. also fixing telephones; Col Merrington is returning to Australia shortly, & he has promised to take Stan diary also mine back with him; I heard to-day that Stan Creighton has or is returning to Australia; A Rumor has been afloat that the Gurkhas were to attack 971 last night but it proved only a rumor & there was only a small demonstration. On ‘phone duty again tonight at F.R.A.\n","24":"\n\nMon 27th\n\nLast night we were on duty all night: & I felt the benefit of the sheep-skin waist-coat; the warboats gave 971 a rough time of it for some time; as we were going on duty we could see the shells bursting: This morning I asked the S.M. for a couple of men to go on working at the ‘phone box & got McDonald & his mate; I went down to show them what I wanted done and was picking away when a bullet cracked very close to my ear I looked round to see where it came from ,when another hit the dirt right in front of me I did not wait to look for more, but set to work to make sleeping \"possies\" if the second bullet was a foot higher I would probably have been with the angels now as it was a direct line, we have only an hours work to finish it, & as we are in full sight from the Turks the work shall have to be done during the night; had a swim this morning & it \nwas\n cold.\n","25":"\n\nTues 28th\n\nLast night the warboats kept up one of the heaviest bombardments I have yet heard apparently somewhere about Bulair,they were a long way off, but the sky was lit up & looked exactly like the constant flashing of sheet lightning in a heavy storm, heavy rifle & machine gun fire was also quite audable but too far off to affect us; We were on ‘phone duty in the trench last night; This morning some warboats gave Achi-Baba a particularly hot time of it the noise here was a continual rumble like thunder & a Monitor standing off the island of Enos was taking long shots with a 14 inch gun, the accuracy of the naval gunners in marvellous I took my tea with me this afternoon & went around to the ‘phone box and put in some work, putting in a dug-out; At 10 oclock last night several Taubes flew over and endeavoured to drop bombs on the warboats with no success.\n","26":"\n\nWed 29th\n\nYesterday afternoon one of the war-boats gave the ground between Popes Hill & the Turks trenches particular fits, apparently blowing up 3 lines of barbed wire entanglements that the 17th Btn was too slow to stop the Turks from pulling out; It is reported that the heavy bombardment on the left last Monday night was followed by an attack by Gurkhas who took quite a number of prisoners (300) && took the position with very little resistence. Last night an attack was made on Courtenays in which bombs played a prominent part, the fight lasted for 15 or 20 minutes; The Turks got more than the bargained for & had to retire, I have not heard casualties; Sometime last night 60 reinforcements arrived for this Regt. several lads previously wounded being among them, the returned wounded says Egypt is much worse than here to live in, was inoculated today for Cholera.\n","27":"\n\nThurs 30th\n\nYesterday afternoon I fell in the soup; I asked Nelson on Tuesday to put in for 50 sand bags to finish off the telephone box in the firing line with, yesterday I asked Tancred (Quarter Master Sergeant) if a requisition had been sent in for sand bags & he said NO! so I came to the conclusion that Nelson had not asked for them. I then went to hunt up Nelson & found he was around at Bde Head Quarters & as I wanted the sand-bags as soon as possible I decided to see the Adjutant (Capt Broadbent); in the office was the Adj Col.& Chisholm who had been acting Adj since the 1st LH was cut up & who is the biggest crawling conceited snob I have met & says anything wanted for the signallers should be reported to Sergeant Nelson & Nelson is the man to approach the Adj at anyrate I bowled in yesterday not expecting to run foul of\n\n30.9.15\n\nChisholm & asked Capt Broadbent if Nelson has requisitioned for sand bags for the signallers box as I was under the impression that he had not & it was important that we should get them as soon as possible as we could not go on with the work without them; Chisholm chipped in with – Sergeant Nelson spoke to me about them yesterday & he is the man to come along with any requests etc etc. Broadbent said that he would let me know as soon as he could get the bags & I beat a hasty retreat swearing if I ever met Mr Chisholm in private life I should tell him just what I think of him pulling his nose in one direction & his moustache the other, at any rate I was playing cards in the Signal room a little later when Broadbent came in & rang up Bde H.Q. asking for sand bags so my visit may have done some good; A mine was blown up last night on\n","28":"\n\nTable Top at 10 oclock: The warboats were fairly busy at intervals during the night giving the Turks trenches opposite Walkers & Popes a rough time: Went for a dip this afternoon the weather has become quite mild again; at 4 oclock this afternoon the warboats opened fire in the Achi-Baba again & one would think by the noise that a violent storm was approaching from the South; Beachy Willie which has been silenced the last few days again started to-day & is causing some commotion at Anzac, a hospital boat leaves here on an average of about 1 per day with sick & wounded (principally sick) We are on duty every night in the firing trench & have a very steep hill to go over to get to our post:: The batteries in all the phones here are about to run out & they do not work too well & we cannot get the new ones in here\n","29":"\n\nFri 1st. A good deal of bombarding in the region of the Narrows, it is reported that Monitors are gradually forging their way through but we get so many false rumors one does not know what to believe: Had a swim today & it was glorious; some of the boys have been in the habit of bombing fish but it is now forbidden & anyone caught in the act soon finds themselves under arrest not for killing fish but for wasting ammunition; 3 old sailing vessels were captured from the Turks & brought here & beached a few days ago, they are very old & only fit for firewood. A supply of wood is being brought here to put us over the winter months.\n","30":"\n\nSat 2nd\n\nThis morning we received orders to shift our camp as we have been in A Sqds ground & we had to move to make room for reinforcements that arrived last night, so we put the morning in making ourselves comfortable once more & are now camped on a small terrace with a couple of reinforcement Officers, we are in a much better position than the last \"bivy\" & are OK here; Hobson Randall &Fox swam out to the beached sailing vessel to-day & managed to force some slabs off the hatchway & found one of the sails nearly new & commandeered it for the Officers dugout also as much firewood as they could carry .Penny managed to secure 1 doz eggs at 1\/6 at Anzac this afternoon so we are still right for rice custard.\n","31":"\n\nSun 3rd\n\nFox the batman here had a quart of Cocoa ready as we came off duty this morning at 6 o’clock, & as soon as we had finished breakfast Les & I went down to investigate the wreck, we swam out to it & were exploring it & found all the canvas that remained on her rotten\n\n while investigating a naval officer sang out from the staging to \"get off that wreck\" we took no notice, after he had repeated his order several times he came out himself on a pinnace & said didn’t you hear me sing out to get off the wreck; I said Yes Sir; he said why didn’t you leave it. I said it was a long way to swim & we wanted a spell; He said an order is an order & to get off it now, I said right & dived in, Hobson said I am not a very strong swimmer & and am going off this side & your B— old boat is in my road, the Officer only smiled & gave the order to his engineer to \n\n3.10.15\n\ncast off. Hobson & Garner then threw an 18 ft stay overboard & we swam with it to shore, brought it home split it & got 4 lovely ridge poles out of it Col Merrington is away today & Chaplain Green held the religious service here. I was too interested in reading letters to attend, I have no time for Green at anyrate & gives me the pip to listen to his sermons while poor old Merrington generally gives us a bit of war news in addition & is aways fairly interesting to listen to; Sunday seems to be a pet day in the Army for any work & the warboats have been rattling in enough shots to-day to blow hill 971 off the Peninsula altogether: We have been having a particularly easy time of it lately; The sand bags arrived today.\n","32":"\n\nMon 4th\n\nPoor old Conway got in the way of a stray bullet to-day entering his back & the bullet’s nose just showed through the skin on his stomach, the Dr cut it out & he was sent away in a more or less critical state: Soon after breakfast this morning the Turks opened up a heavy bombardment with Artillery; We received the order to stand to arms & man the trenches but there was nothing doing in our part of the world; The principal points appeared to be on Walkers, Popes, Quinns Courtenays & Steels Posts on our right but we cannot hear any news of what was doing anywhere probably only a demonstration: Hobson & I went for a swim this afternoon: received enough Aus. papers to-day to commence a news agency.\n","33":"\n\nTues 5th\n\nA sea-plane has been busy the last few days flying over us, also aeroplanes have been showing out very consistant: & the Taubes seem to be just as busy but the pilots of both aeroplanes do not seem too anxious to clash; I have been on to Nelson on several occasions now to speak for the sand bags I want, but they have not come to light yet. Had a dip this afternoon: The war-boats still keep up a heavy fire at intervals during both day & night; Last night about 70 Turks were sighted in front of the 3rd L.H.R. a special patrol was sent out to try & find out what their game was. it was supposed they were out after our patrol as they were seen & fired on the night before, no casualties\n","34":"\n\nWed 6th\n\nThe phone did not work too well last night the batteries run down & McKell promised to put in a complaint this morning as he failed to get satisfactory results while speaking to Maj. Chambers; Got the sand bags this morning & took a couple of B Sqd men to the box & set them to work at 2 oclock this afternoon then came back was inoculated again against Cholera & then went for a swim a Turkish gun had our range to a nicety to-day & put shrapnel all around us fortunately no one was hit but we decided it was safest to cut the \"dip\" short. Some gift goods were distributed to the 1st LHR this afternoon, we received a tin of Quakers Oats, 2 tins of sardines 1 tin Havelock tobacco & some fancy biscuits\n\n7.10,15\n","35":"\n\nAs soon as breakfast was finished this morning I had to go back to the phone box to tell a couple of fatigue men what to do; Les changed the tin of Havelock tobacco for a pack of cards this morning; A parcel mail also arrived with a parcel to me from home; Have had a headache all day but felt a good deal better after having a swim; The heads must have another rough charge in view for us, as we have been issued with fresh meat daily for over a week now & we have come to the conclusion that they are fattening us up to kill; Several lads are complaining of headaches besides me to-day & have come to the conclcusion that is is probably from inoculation\n","36":"\n\nFri 8th\n\nHave been feeling pretty bad all day, a few sprinkles of rain fell this morning & I thought it wise to go back to the ‘phone & see nothing could get wet, but it cleared off before dinner. at 2 o’clock I got two men & took them around & introduced them to the phone box, one of them had front enough to jump up on the parapet to shovel some dirt out of his road despite the fact that the Turks trenches are only 350 yards away. Our snipers seem to have the Turks too frightened to show their nose above the parapet now, & all we long for is the Turks to give us the targets we give them; A Turk came in the night before last & gave himself up, he had arranged with his friends a rifle fire signal to be fired during the night if he got through safe & 7 more would come in, our lads fired the signal & 3 more came in next morning at 4.30.\n","37":"\n\nSat 9th\n\nA sapping party was sent to do some work from C Sqd this morning & when returning to camp in full-view of the Turks as usual Mr Turk gave them a few shots, killing Newton & wounding Colin Cameron in the leg, the wound is only a flesh one & I think Sandy in the happiest man on the Peninsula. Les gave him a sov. as he was out of cash;The storm that has been threatening us lately paid us a visit last night. I went around early & arranged a couple of oilsheets over us, shifted the ‘phone under them & was a warm & dry as if we were at home, the boys in the trenches had a very rough time & it was that dark that it was impossible to see anyone more than a couple of feet away: The patrol also had a very rough time of it\n","38":"\n\nSun 10th\n\nRowling paid us a visit today he said the storm shifted both piers at Anzac both the captured sailing vessels broke up & disappeared; Nelson has been off color for some time & went to the Dr today & was sent away with jaundice, he looks very bad on it; I am acting Sergeant till he returns & one of the old 12th L.H. boys is going on at F.R.A. as they have a spare man; I tapped the Adj for 3 oilsheets for a cover over P.R.A. ‘phone box but was told that it was impossible to get them but we are to have iron as soon as possible. Took a walk around for my gear this evening & struck the Church Service in full swing when I was returning, so I waited to hear the benediction, A report came through at 8 o’clock last night that the Turks had opened a gas cylinder on hill 60\n","39":"\n\nMon 11th\n\nGeneral Chauvall was around this way to-day inspecting: Ser Major Latham the Brigade Sig Office was also along & took back the F. R. A. phone for repairs & brought it back this afternoon in good order It is now asserted that the report sent along in reference to the Turks opening a gas cylinder was a mistake & up to date no gas has been used by them: The machine gun section of the 12th L..H. turned up here this afternoon Capt Hyman is in charge of them ;We had a good shower of rain at dinner time to-day & it looked as though we were in for a rough time, but it cleared off during the afternoon; We were paid today I only got £2.10.0 Stan and Les got £ 3.0.0 each sent away 5\/- per man to Imbros yesterday for Canteen stores\n","40":"\n\nTue 12th\n\nNelson came around to-day to get his pay & he is not likely to go away; Cases of rum were washed ashore in the gale a few nights ago, a good many lads that happened to be along early about Anzac commandeered a few cases, & they are having a merry time around there since Garner managed to come on a plant also & has a good supply on hand; Jock Davidson has been away a few days & Sergeant Wright is now acting S.M. The weather is getting very cold again, & the fleas are a thousand times more nuisance than the Turks are at present, everything is so quiet one would hardly think a war was on.\n","41":"\n\nWed 13th\n\nHad a fraud of a mail in this morning & did not go around to the ‘phone box, but took a dozen sand bags around this afternoon & finished off any work that can be done in the day time; Nelson was knocking about again to-day so he cannot be too bad; One of the B Sqd Sigs went sick this morning & I got McDonald of A Sqd to take his place; one of our aeroplanes appeared to be in difficulties this afternoon & was volplaning down & and came very low over the Turks trenches, The Turks opened a heavy rifle and machine gun fire on her; the ‘plane eventually landed on the beach & the aviator & pilot had to run for cover as the Turks peppered it with shrapnel, it landed near Suvla Bay.\n","42":"\n\nThurs 14th\n\nI believe the Canteen at Imbros was not warned that so many order were likely to come in & the amount of goods we sent for were not available; We have to find a guard at present to protect what was available & is now on the beach, it arrived yesterday afternoon; Nelson came on the scene this afternoon fit for duty & took over, I have not to go on duty tonight letting things go just as they were; Stan has been complaining right along that he is not well but I have never felt fitter; I have been right off my tucker the last few days but feel as fit as a fiddle nevertheless The Hospital boats are constantly on the go between here & Alexandria.\n","43":"\n\nFri 15th\n\nReceived the canteen stores today & we got 2 tins Tomatoe, 3 bottles Sauce 2 large tins of Currie 1 Pkt Herbs 1 tin margarine; Nelson came back from Hospital yesterday & took charge again; We have a dirigible airship that appears to do a good deal of work about Imbros apparently trying to locate submarines, she is very seldom over this way & I have only seen her flying at a distance aeroplanes are always flying over us here, but they are taken no notice of now except when they drop an egg or two; It is rumoured that we are to attack the Turks tomorrow around at Lone pine & there is to be a ‘Stand to Arms’ at 3.45 tomorrow morning to make a demonstration.\n","44":"\n\nSat 16th\n\nAt ‘Stand to Arms’ this morning I strolled around to the ‘phone while the troops fell in & manned the trenches & then a flare went up, (the signal for the demonstration) & then everyone cheered & kicked up as much noise as possible, but the Turks did not bite or else there are very few in the trenches along our front as there was very little rifle fire & only one Turk on Snipers Nest appeared to lose his head & he commenced throwing bombs in all directions It is very sultry to-day; Someone was hit in the sap between here & the beach this afternoon & some of our lads were put on to keep Mr Turk down Stan went down to Mills to see if he could get some Cocoa today & managed to get a little for a tin of \n","45":"\n\nSun 17th (Last night the 3rd LH patrol failed to return)\n\nWe had a shower of rain at 3 oclock this morning but managed to keep dry; Church Service was held this afternoon by Col Green; General Chauval was here for the service. Everything is very quiet.\n","46":"\n\nMon 18th\n\nA message came through last night saying The Turks fast from the 18th to the 20th & we are to be prepared for a fanatical attack in consequence; Sentries & the patrol have been doubled tonight: I came into the tent to go to bed tonight & found there had been a land slide & there is about a yard of dirt over most of our gear; I generally put in an hour or two after tea playing cards We were issued with a new blanket each to-day Believed that 3rd LH Patrol was ambushed and captured last Saturday night\n\n Page 50\n","47":"\n\nTues 19th\n\nStan has been off color the last few days, & as his legs were swollen up to-day he decided to see the Dr this afternoon & was very much surprised when Wells told him he would have to leave the Peninsula; bad circulation of the blood was the cause of the swelling & he was sent to the Field Hospital for tonight & is to go on board the Hospital boat tomorrow; I am on duty tonight in consequence & am going to keeps Stans rifle, we made arrangements allowing me to draw any parcels addressed to Stan; Stan is run down, by by the way Wells spoke he is not likely to see any more active Service; he is lucky in getting away before the winter sets in: He does not look bad, & I had no idea he was as sick as he is; Everything very quiet\n","48":"\n\nWed 20th\n\nWas on duty the last shift last night from 2 oclock until 6 this morning came around & had breakfast, took a towel & soap around to Penny also his glasses & put in the morning there; Stan was overhauled by Dr Storey at 9 oclock this morning & was told he would have to have a long spell; He went on board this afternoon; As Les & I were going around to go on duty this evening we met Dr Storey at the Hospital & asked him his opinion. He said he should be sent straight back to Australia & given discharge, as he is completely run down & his heart is weak, & will not be fit for active Service again for a very long time; At Quinns Post yesterday the Turks threw a parcel to our lads but it fell short the Turks then threw a note over saying they were feasting & would guarantee not to shoot anyone who would go out for the parcel one of the lads got the parcel and it contained pipes, tobacco & cigarettes\n","49":"\n\nThurs 21st\n\nReceived a parcel to-day from Edie. it was a tin of biscuits & Les and I lost no time in making a hole in them: I was quite surprised to get them as I had heard no word of them coming: The Hospital boat with Stan aboard was still anchored when we came on duty tonight: This evening heavy clouds were scuttling over us & Les & I hurried around to the ‘phone & just beat a light shower of rain; it is rather chilly outside tonight and a strong breeze blowing but it is lovely & warm in the ‘phone box; Gave in a order for Canteen goods to-day; Keating Insect Powder being our most important order as the fleas give us particular fits during the night time; paid Fletcher 10\/- I owed him to-day\n","50":"\n\nFri 22nd\n\nLast night our patrol under Sergeant Lowe went almost up to the Turkish trenches & observed the enemy working on the parapet: he fired a flare from a revolver & the machine gun section who was waiting immediately opened fire giving the Turks a little shock; It set in to rain nice & steady about dinner time to-day & has been coming down nice & steady ever since. It is a brute in the trenches tonight but very warm and comfortable in this ‘phone dug-out; Cakes can be bought on the beach for 2\/- each but a man is very lucky to get one, as there are hundreds lined up awaiting their turn, they are sold by the Y.M.C.A. & made at Imbros by all accounts are not the best in the world; On duty from 2 AM till 6\n","51":"\n\nSat 23rd\n\nThe rain ceased at 6 oclock this morning: I could not sleep at all last night but put in a very interesting night chasing fleas who were running a steeplechase over me: Received another stab over the heart this afternoon innoculated for typhoid, It was voluntary & only those who wished were done; It has been very cold and cloudy all day, in fact I have had cold feet all day with 2 pairs of socks on: Long went off duty to-day sick, & I have got Reid to take his place tonight: Everything is very quiet in the fighting line here; Les went to the beach this afternoon to see if he was lucky enough to buy a cake but returned with 2 tins of Herrings in Tomato Sauce & 1 of Sardines\n\nSun 24th\n\nToday has been very cold, Church Service was held his afternoon in a large Hospital tent that was erected this morning at the Field Ambulance as it was drizzling rain, I was too comfortable lying down in my dugout with a blanket over me to attend & I think nearly every one else felt the same .Reid took last shift last night & Les & I slept in till 9-oclock this morning; The warboats have been very busy this afternoon to the south of us but everything is very quiet here; the poor beggars in the trenches & on patrol get a rough time of it these nights; 3 Officers & 85 men arrived at 10 oclock tonight, Harris, Weir & Snodgrass & the 8th Reinf.\n\n25.10.15\n\nMon 25th\n\nI was expecting to see Roy Forsyth with this lot of reinforcements but I find he is a Sergeant in the 7th & as the 7th left Aus after the","52":" they still take second place: there was no one in this lot that I know; Peters H Q Signaller went off duty to-day & Nelson is now doing duty; Reid is a permanent C-Sqd Signaller from now on in Stans place; Some mighty big shells were thrown at the beach about 8 oclock tonight, & by the sound of them they had come a long distance as they appeared to be travelling very slow when they arrived, & we could hear no report of the gun; Our patrols have silencers on their rifles in case they meet a Turkish patrol\n","53":"\n\nTue 26th\n\nThe Signallers of the old 12th now D.Sqd have been working to have us hoisted out of F R A dug-out; they have also had Major Chambers on battling for them but so far with no success: A small steamer has been run ashore down at the beach near us & they have been busy to-day taking her cargo off, it is rumored she is a captured vessel; One of the Turkish guns gave one of our mine sweepers an uncomfortable ten minutes this morning, they picked up the range in quick time & soon were dropping shells very close, the last lot fired before the boat commenced to move appeared to fall only a few feet short of the water line, but she soon moved out of danger\n\n27.10.15\n\nWed 27th\n\n3 lads of D.Sqd (the old 12th) were slightly wounded this morning coming from the 1st Reserve trench to the firing trench, about 50 yds separates them & one is in full view of the Turks going that 50 yds, & as the Turks are only 350 yds away it is a marvel some of us have not been fired at before, as it is becoming a thoroughfare as it is a few yds shorter than following the trench along; The Turks Artillery open up at 10 oclock this morning & shelled the beach very heavily making everyone there take cover, I was ready to go for a swim when they commenced & I altered my mind: I believe the C.O’s of the","54":" L.H. Bde held a meeting & decided to go to Mudros for a months spell (the whole Bde) The troops have not been told officially yet; The majority of men wish to stay where we are\n\n28.10.,15\n","55":"\n\nToday has been warm, but a heavy sea still running & the Small Hospital boat (that takes this sick from the pier to the Ship) has been in difficulties all day the sea would wash her away to the north & towards the beach, & it kept one tugboat busy all day towing her to & from the shore to the \nbeach\n Ship I raised enough energy to go for a swim & do some washing this afternoon the water was not at all chilly & I enjoyed the dip some bullets however cut our swim short as they commenced to fall in the water too close to be comfortable; I believe on Walkers Ridge a good bit of mining has been going on by both sides, but everything is very quiet here, The warboats are shooting every day \n","56":"\n\nFri 29th\n\nAnother warm day, apparently the cold weather during the last fortnight was only a cold snap & not the commencement of winter; Yesterday the Signallers were reformed & Traill & Leask were both made Corporals of A &B Sqds respectively; Stan was unlucky in going sick so soon, as he would certainly have got one of the jobs; I heard to-day for the first time that Claude Lambert came over with the last lot of reinforcements & is now in A Sqd. I had not heard before that he had even enlisted, a good many wounded men were sent away today apparently from the left so I guess all the troops are not having quite as easy a time of it as we are at present; The aeroplanes have not been so active as usual lately probably on account of the weather\n","57":"\n\nSat 30th\n\nAnother fine, warm day & not a cloud to be seen; I saw Claude Lambert tonight while coming on duty & had a long yarn with him; Our trenches & the Turks on Walkers Ridge are only ten yards apart now & tonight the Turks have been very busy throwing very powerful bombs wounding several lads The heads on Walkers appeared frightened & rang up the Artillery asking if they could get their support if required; A message was sent to all the Regiments at 8 oclock tonight saying a Turkish Officer was expected to surrender tonight, & that he was to be well treated & subjected to no inconvenience & sent to Divisional HQ I suppose he is one of our spies\n","58":"\n\nSun 31st\n\nThe Turks did not attack Walkers last night the bomb throwing was as far as they got & they had an hour or two on the same job tonight; This morning was warm & fine, but clouds came on the scene this afternoon also a cool wind sprang up: Nelson told me this evening that the Col .told him that we would have to change with FH on the top of the hill, & that this ‘phone FRA at NO 3 sub section is to be worked both night & day by 6 of D Sqd’s Signallers; I did not mind changing when I heard it is to be a 24 hrs Post: Nelson & I both have to go to Bde HQ at 2 oclock tomorrow afternoon Les & Reid have to remain on duty here till 6 tomorrow night\n","59":"\n\nMonday 1st\n\nIt is a strange thing that every time I am on duty from 2 to 6 AM I cannot go to sleep before I go on duty & last night was no exception to the rule. I lay wide awake all night & then do 4 hours duty to wind up on; A strong wind sprang up during the night & a heavy sea was running this morning & one of our old paddle-wheel barges was run ashore this morning & the Turks put a couple of shells into her which started a fire going but the waves washing over her extinguished the fire before it had got a proper hold; Nelson & I received & order to go to Bde HQ this afternoon, we went, also the Sergeant & senior Cpl from the 2nd & 3rd Regts; we received instruction on the Field telephones & were then told by Capt Downing (who is OC of the sigs again) that we had to give our Sigs flag practice, ‘phone instruction & lamp work daily;& we will (I don’t think)\n","60":"\n\nTue 2nd\n\nThis morning Nelson & I had to into Mule gully where we met the Sergeant & senior Cpl from the 2nd& 3rd also Srg-Major Latham who took us around & showed us where each others lines ran. So as we should be able to know them in case any of them got cut by a bullet or any other cause; We were on duty at FRA till 6 oclock last night & I had to leave Les &Reid to attend to the work while I went to Bde; I got back to camp after an interesting walk round Destroyers Hill & Camel Hump & back to camp through FRA & FH . made some jam tarts this afternoon out of flour, suet, sugar & jam. cooked them in fat, & they turned out real good. We have been keeping what little flour we get for some time hoping for Baking Powder, but I now think I can produce better pastry without. Came on duty at FH at 5 oclock.\n","61":"\n\nWed 3rd\n\nWe are now working 24 hrs on & 24 off, Nelson & I went around to Bde H.Q. at 9 oclock this morning for more ‘phone instruction, got back for dinner & them proceeded up to the ‘phone FH in NO 2 Sub Section as we are on till 5 oclock; The sea is calm again today & we were issued with bread & meat, we only get it in calm weather as they cannot bring it ashore while it is rough; Our trenches on Walkers Ridge are now only a few yards from the Turks & every night, they have a bomb throwing competition, the Turks are now using a very powerful bomb & seem to have an unlimited supply of them, & that is more than we have, It is rumored that the trenches are ready to break through & that our lads are to attack them shortly, everything is quiet as usual.\n","62":"\n\nThurs 4th\n\nAnother morning at Bde HQ to-day & we had some practical work which is much more into my hand than theory, arrived back soon after 12 oclock, just in time to miss a shower of rain & it has been drizzling all the afternoon; Scurvy has broken out amongst the Indians & I believe that is what was the matter with Penny & Broadbent; An Aus mail arrived to-day & I opened one of Stans letter put in one from myself also one from Nowland to \"both of us|\", closed the envelope again with the gum off another envelope & sent it on with the rest; Came on duty at 5 oclock at PH & a couple of schrapnel shells cur down some bushes from over the top of the ‘phone box as soon as we arrived doing no damage; Everything going along smoothly:\n","63":"\n\nFri 5th\n\nThe Canteens Stores turned up today & proved to be a frost we only got 2 tins Herrings & ½ Doz salts; Last night at 9 oclock the Turks tried a surprise attack on a sapping party in the vicinity of Lonesome Pine. the sapping party however turned the surprise onto the Turks the fight lasted an hour & at its finish our lads had 50 Turkish prisioners besides a great many dead & wounded our casualties proved very small only 4 being killed & 17 wounded; Received a parcel addressed to Stan from home also 2 from Edie & the 3 proved to be filled with goods we most require; Received a note this evening telling me to report to Bde HQ as soon as possible to collect a badly damaged parcel\n","64":"\n\nSat 6th\n\nNelson & I went to Bde HQ again this morning for instructions also collected damaged parcel, it contained: 4 plugs tobacco, a parcel of dried apples, one handkerchief, some linen & a bag of Camphor Ice: We have been living high since the parcels arrived tonight we had for tea rice & apples (stewed) & jelly. It is expected that the Turk will shortly give us a heavy bombarding as they are getting ammunition in from Bulgaria; This afternoon a report was sent in saying how many men in this Regt. 2 months & how many have been here 3 months & over, it looks as though they are finding out how many are going on this spell they have been talking of so long, I intend to remain here if I can possibly do it. (Innoculated again for typhoid)\n","65":"\n\nSun 7th\n\nAsked Major Granville this morning if C Sqd Sig’s could miss the coming spell to Lemnos as the 3 of us would rather stay here, or was it compulsory to go: (The Regt is to go a third at the time & 2 thirds to remain on duty here: taking turn about spelling). The Major said he would see & that a big percentage of Sigs would have to remain in any case to keep up the communication so we stand a good chance of staying here, I think we would have a good chance of striking rougher times at Lemnos than we have here & I am quite contented with my job here MacGhee was wounded through the hip while at the incinerator soon after dinner; it is marvellous how unconcerned a man seems when he is hit, when MacGhee was hit he just fell &\n\n7.11.15\n\nsaid to his mate who was alongside of him I say Charlie the ---- have lent me one; & went on smoking his cigarette as though he had only laid down for a spell; & was still smoking away at the cigarette, when he arrived at the dressing station a few seconds later on a stretcher, & he appeared the least concerned man in the Regt; I have noticed the same thing with every man practically since we landed; & men who have known they were mortally wounded & could not possibly live more than an hour or two have always shown the same courage & seem to take it as all in the days work & are quite contented: It was a fine shot that got MacGhee (over 800 yards) Casulaties have been so slight since we have been here at GW No 1 Outpost that it is a surprise now to hear of one of our lads being hit; at Pope’s Hill they were of daily occurrence; Charlie Burke went away sick to-day\n","66":"\n\nMon 8th\n\nClaude Lambert has taken Burkes place as off sider for Tancred: This morning we had some Heliograph aligning; & were supposed to have ‘phone instruction but it did not come off. We came on duty at 5 oclock; I tried my hand on apple pies today & had quite a treat for dinner & tea; yesterdays dinner consisted of rice and stewed apples & plum duff followed up with jelly so we are living high at present for soldiers: Last night one of our lads was at the beach & this morning was hauled up for comman during a bag containing 21 tins of milk, he said he was walking down the beach & kicked the bag & saw it contained milk, so he asked a lad who was standing by it if it was for sale, he replied that he\n\n8.11.15\n\ncould have the lot for £1.0.0 so gave him £1.0.0 & walked off with it; he had not gone far before he was overtaken by one of the military police & put in the guard room; It appears a sailor brought them ashore & on being discovered dropped the milk (as they are not allowed to bring it ashore) & made good his escape & the lad who received the £1.0.0 was only a bystander looking at the fun; the accused was acquitted: The Turks have been wasting a good deal of ammunition today trying to hit an old barge that was well out to sea but with no success; Today has been nice & warm & we are now enjoying lovely weather; Last night I managed to some disinfectant from Lt Campbell & gave our blankets a good sprinkling, also the ‘phone box.\n","67":"\n\nTue 9th\n\nThe Turks have been very busy all day trying to get a shell onto the old paddle wheel boat stranded on the shore but so far they have expended a large quantity of large shells & only secured two or three hits. With the exception of a few shells flying & occasionally a warboat opening out everything is very quiet; Our spare time is generally put in playing dominoes, cards or writing; the long promised trip to Lemnos is about to come off within a day or two. Wordsworth who has been bomb officer for some months for the Bde was sent away today with appendicitis. Roffe his batman was sent away last week, & Campbell took Roffes place\n","68":"\n\nWed 10th\n\nThe Turks have been giving up some shells again today; killing 4 lads at Bde.H.Q.: The 2nd L.H. also lost a good many men to-day by the same cause, & a good many shells fell into Div H.Q. but hurt no one: As a third of the Regt. is going away tonight also 3 Sigs Peters, Caban & Winterton & the FH ‘phone is cut out during the day time in consequence, & I came on duty at M.H at 3 o’clock this afternoon with Tomlinson we work 5 hrs on & 10 off here & have a good many messages to run: Made some apricot tarts soon after dinner & set some jelly: It looks as though we are about to have some rough weather & it is sprinkling a little tonight.\n","69":"\n\nThurs 11th\n\nWe had a rather busy time of it this morning running messages I had a trip to Divisional HQ & found a shell had landed just before me killing 3 men & wounding 4 others Tomlinson who was on with me had a much longer trip to the 1st Inf. Bde which is on the extreme right at Gaba Tepe; I had another trip to Bde HQ tonight with the daily state as Les was feeling a bit off color, apparently apple tarts & jellies are a trifle too rich for him; I came on duty from 9 till 2, & our switch board is not working too well. Nelson was on the phone & there was a row with Bde as they could not get us, it is rather a complicated matter & we can see no reason why the plug will not work in the centre hole, I believe there is to be an enquiry tomorrow\n","70":"\n\nNelson went around to Bde H.Q. this morning to see Major Williams & give an explanation of the ‘phone failure last night & he told Nelson to fight it out amongst yourselves; Nelson thought there would be no more about it; But an order came through from Bde this afternoon asking for a written report on the case; I was caught on the same thing while on duty a little after 4 oclock this afternoon, & was told by Ser Maj Latham that they were going to bring this ‘phone in & that we would have to do all message work, if this comes off I think I shall apply to go away for a spell with the next lot; We had a good shower of rain this morning but it is nice and sunny this afternoon & the air is a little nippy; I put the morning in making fruit tarts\n","71":"\n\nSat 131th\n\nThe Xmas mail closed for Aus. today; Kitchener put in an appearance at Walkers Pier this after-noon, & any one would think that peace had been declared by the cheering that greeted him, some of our lads went down especially to see him, but I did not feel energetic enough for the walk & made apple pies instead; Last night 6 NCO’s arrived for this Regt. I think they are all old hands who have been sent away sick or wounded; The ‘phone here at MH has been refusing to work with the plug in the centre hole of the switch board & we have been getting into arguments with Bde HQ in consequence\n","72":"\n\nSun 14th\n\nWe got a message through to-day from Bde HQ telling us to send a man down to Anzac to get a model bomb-proof shelter belonging to Col Merrington & that we should take care of it till we heard from him; I believe Col Merrington has left the Peninsula & is on his way to England apparently he has put in some of his time here inventing bomb-proofs; he always took a great interest in any movements here, & I believe he knew more about both ours & the enemy’s position than any other Col on the Peninsula; The Turks & our lads on Walkers Ridge have a bomb fight every night & both sides of Artillery throw a good many shells about, but to the men in the trenches things are generally quiet.\n","73":"\n\nMon 15th\n\nWas on duty from midnight till 5 oclock this morning; At 2 AM Joe Tomlinson who was on duty with me woke me up to say that he had not been able to get into communication with Walkers Ridge since he came on duty at 12 oclock; so I took a piece of wire to mend the line & started off on on my trip Liept Weir went along the trench & warned all the sentries to take no notice of me coming along the parapet & not to fire at me on any account as I was out repairing the line; Every linesman should have a spare ‘phone so as to go along a few hundred yards into the line & find which side of him the line is broken, but as all our phones are in use, I had to find line line to Walkers Ridge & follow it along yard by yard feeling for the\n\n15.11.15\n\nbreak in the line, going, I was halted about every 10 yds by sentries, but the word linesman asted as well as a pass word as they knew I was out; The night was dark & I had some queer experiences; The line crossed the firing line trench in several places & at times I was out in front of the firing line & sometimes behind it & one place I went to drop into the trench to cross over, & thought the trench was about 4ft deep, but\n\nI happened to be looking a few feet higher up than where I dropped in with the result that I had about 6 ft to drop & my foot just grazed the step & I went sliding down the steps but got off with nothing more than a shaking up, a few minutes after this a bullet hit right under my foot, 3 inches higher and it would have been worth a holiday to me; after this I was out of our own lines & was covering the ground held by the 26th\n\n15.11.15\n\nInfantry Btn, & as I was not known amongst these, I did not feel quite as safe when out in front of them as I did amongst our own lot; As this part of the line should have been looked after by the Sig’s of the 26th I decided to go up the trench to their office, as I considered it rather risky following the wire as the 26th had not been warned & I was halted more than once & had to explain matters, One of the Patrol has been sent to Walkers Sig’s saying their line was broken & although I went to the top of Walkers Ridge I could not find the Sig Office & as a man has only to miss his footing there to go rolling down 100 ft or more I decided to give up hunting in the dark & started to return & then I had to give more explanation to all the sentries as they had changed shifts & did not know me & I thought once or twice that I would be held\n\n15.11.15\n\non suspicion but managed to spin a pretty good tale & got back to our own lines; I found that I had been 2 hours away & Joe Tomlinson had got anxious & so had Weir & they had just called Nelson to go an look for me when I turned up; I was not back 5 minutes before the 26th rang up & said they had been ringing us every half hour & thought we must have gone to sleep & when they got my message they had investigated & found their line cut in two places just outside their office; Line repairing is noted as a ticklish job & one our Bde linesmen was held up for 4 hours one night by the N.Z.M.K. while out looking for a break I told Weir I intended going to the top of Walkers, & thought that was enough to let them know I would\n\n \n\nbe away sometime & a man could not do it much under 2 hrs if he had no sentries to stop him & I had no idea they would get so anxious about me. I was lucky to get through with only a stiff shoulder as I had several communication trenches to cross & a jump through the dark was the only way of crossing them as some of them are 9 & 10 ft deep but I was surprised to see on my return a report of the case wrote out by Joe who said he had felt sure I had stopped one of the bullets that were flying about and was not able to get back to our own men so he had reported to Nelson & had a written report ready for Bde as soon as my body was found. rather comical to have the report of my surmised death written while I was out enjoying the stroll through the scrub. Heavy sea running again today & cloudy otherwise everything same as usual.\n\n15.11.15\n\nAbout 3 oclock this afternoon one cruiser & 2 Monitors standing off Imbros put in the rest of the afternoon with rapid fire the cruiser firing broad –sides & the Monitors their 2.14 in guns as fast as they could go ,firing to the south of us; I had to take a message to Brigade at 6.30 tonight it was moonlight when I started but a thunderstorm was coming up & I ran nearly all the way back from Bde & just got back as the rain started but it was only a shower; FH phone went bung tonight as is out of action. A very heavy sea is running; Hill 60 was mined & fell tonight, the mine blew up part of our own trenches as well as the Turks killing 4 & wounding 35 of our own men\n","74":"\n\nTue 16\n\nI went down to the beach with Traill at 6 oclock this morn & collected as much wood washed ashore as we could carry. A message came through this morning saying a paper is to be commenced here as a memento of the work done here, prizes are being offered for the best verses written by any soldier the winner draws £5. for best short story £3.00 cartoons etc also are worth £5 to the best also a prize of £5 for design for cover; Bean appears to have the biggest say in getting it going it will be rather a novel book; A man was sent to Imbros again today for fresh vegetables Les & I put in for £2.00 worth: Went for a swim this afternoon also washed some clothes. the water is rather chilly for swimming\n","75":"\n\nThe sea is rougher today than I have ever seen it & a heavy wind blowing; Last night Sgt Williamson (12th LH) was accidentally shot through the leg above the knee while on patrol duty: Roby Carr Q.M.S. of A Sqd stopped a Turkish bullet just above the heart last night also & was in critical condition when he was sent away from here; Lieut Harris is OC of C Sqd and promoted to Capt & Weir is OC of B Sqd. & promot to Capt. also McDonald Wright & Harris have received Commissions; At 7 oclock tonight & regular storm came our way with a heavy cold wind blowing a proper test for our Winter shelters, a good deal of shelling goes on at Anzac daily\n\n18,11,15\n","76":"\n\nI was on duty from 3 oclock till 8 this morning & had a very cold shift despite the fact that I had plenty of warm clothes on: After I had breakfast I went to Army Corps Head Quarters & put the day in with Rowling; A Turk gave himself up to-day & all his cartridges had the ends cut off. he said it was a general order for them to cut the bullets; 3 others came in a couple of nights ago & said they had plenty of men & ammunition but no overcoats or boots to supply the troops & if they had much wet weather a large number will have to surrender, they also said they are short of sugar & salt but have plenty of biscuits; Anzac came in for its usual amount of shelling today – otherwise everything quiet enough\n","77":"\n\nFri 19th\n\nPut in this morning making improvements & giving our home a general cleaning up; Went on duty from 1 oclock till 6 tonight: Riddett who returned from Lemnos a few days ago, & Watson have been put on duty here, & we are now working 4 hours on & 12 off so have a much easier time; We have a good deal of running about working here running messages, there is one thing about it we know where anyone & everyone of any importance is camped A warboat & a Monitor have been giving us a treat in rapid firing today; Our patrols still go out every night & the bombing on Walkers just as willing as ever during the night time, & everything as quiet as ever here; One of our reinforcements was sentenced for a Field Court Martial today for malingering\n","78":"\n\nSat 20th\n\nWrote a letter this morning & had a busy time this afternoon while on duty, had to take a message to the beach master: also run down the O.C. of the Sqds to show them routine orders & then Post them up on the board; Everything same as usual & the sea calm again today: \nToday has been a little chilly\n","79":"\n\nSun 21st\n\nThe German aviator made a little mistake today he dropped a bomb meant for one of our trenches on Walkers, the bomb was badly aimed & dropped neatly in the Turks; Francis who has been in England turned up here today, he says he had the time of his life in England; Today has been very cold\n\nMon 22nd\n","80":"\n\nA heavy bombardment to the South of us this morning by the warboats; Francis made himself useful this morning by pinching enough wood from the beach this morning to last us a fortnight he is having his meals with us at present; Today has been about the coldest I have felt for sometime \n& everyone is doing a shiver today\n.\n","81":"\n\nTue 23rd\n\nAnother cold day, on duty from 6 to 10 am. Went to the Indian Gully & scored a little flour from Mills & put this afternoon in making jam tarts; We have been getting good food the last couple of days even cabbage yesterday: The Artillery has been pretty busy on both sides otherwise all quiet a little rain during last night\n","82":"\n\nWed 24th\n\nToday has been a little warmer than usual but turned very chilly this afternoon; two shrapnel shells dropped right amongst us today & we have 3 holes in the roof of this signal office as a memento, fortunately no one was hit, this is the 1st day we have had shrapnel here. The wire was cut on both HLA & FKA lines\n today apparently by shrapnel fire\n","83":"\n\nThurs 25th\n\nReceived a letter from Stan at Malta this morning & after coming off duty at 10 oclock I went around to Rowling at Army Corps H.Q. had dinner there & I believe the heads are thinking of withdrawing the Aus. Troops from here only leaving enough to garrison the ground we now have, they also seem to think Greece will\n\n25.11.15\n\ncome in with us; They are busy around there digging tunnels in anticipation of a bombardment when the German guns get through to Turkey. The Tunnels are to be lighted with electric lights. The £2.0.0 worth of vegetables arrived from Imbros this morning. we got mandarines cabbages & some potatoes as our share, we have cabbage for sale tomorrow; Last night we received an order not to fire any rifles, bombs or any other explosives for 48 hours as the Turks believe we are about to evacuate & we want them to think so to induce them to attack they will find we have not evacuated yet if they do come & today the Turks have had the firing all to themselves & tonight is the quietest I have heard; A Turkish machine gun seems to be a bit merry as it opens out now & then & an occasional rifle shot from the Turks side is all that breaks the silence\n\n26.11.15\n\nFri 26th\n\nSold 28 cabbages this morning we decided to keep all the mandarines & potatoes, has been very cloudy with a few drops of rain during the day & it being my turn to do the trip to Bde HQ with the daily state, I had a rough passage; the night was pitch dark except when a flash of lightning lit up the country & just as I was about the start the storm broke & the sap to Bde being all up & down hill, I had several falls & a very interesting trip right through by walking into the end of the sap where I should have turned etc. Boots, socks, trousers & overcoat were all that got wet & I turned into bed soon after I got back; I believe the Turks got quite cheeky today opposite the 6th & 7th L.H. gathering wood from in front of their trenches, the lads stood it for a long time & then a few opened fire against orders. The order not to fire was renewed & now lasts till midnight tomorrow.\n\n27.11.15\n\nSat 27th\n\nVery cold again today, was on duty from 6 till 10 this morning been raining all day & generally miserable; Started to dig a tunnel down in the Orderly Room also one in the ‘phone office, they are to be 15 ft deep & put down to ensure the safety of Head Quarters & the Signal Office in case Germany get some of her large guns through to Turkey\nThe night before last\n last night the Turks attacked some trenches held by the 6th & 7th L.H. but were repulsed & this morning they counted 19 or 20 dead Turks between the trenches, so they got a few, & received no casualties themselves The 6th & 7th Regts have been doing exceptionally good work right through, also the","84":" L.H. (Queensland) who only have 60 original men who have not been either killed or wounded.\n","85":"\n\nSun 28th\n\nI was on duty from 10 PM till 2 AM this morning & received quite a surprise on going outside to go off duty to find snow was falling, the ground is very slippery & muddy from the rain & we are having a rather rough time just at present fortunately we are getting good food & plenty of warm clothing, a consignment of sheep skin waistcoats arrived yesterday otherwise this weather would be unbearable. It is a funny thing that the rougher the life is the happier the men seem & they are in great spirits today singing & whistling everywhere; the Turks are expected to attack\n\nCamel’s Hump tonight & every available man has to be in the trenches that also may have something to do with the good spirits of the lads & the trenches are not an inviting place to\n","86":"\n\nbe at present as they are nothing but slime & slush, & snow still falling: Everyone is complaining of cold feet, but are warm enough for anything everywhere else; Everything is very quiet so far as fighting is concerned & it is only an occasional shot that \ncan be heard anywhere\n","87":"\n\nMon 29th\n\nToday has been sunny but last night the gound was frozen to ice making it good to walk on, but this afternoon the sun began to melt it & it has been \n\nrather sloppy again, any water we want has to be melted out of the cans & boiling water left outside turns to ice in less than an hour any time during the day. No attack came off last night, the CO’s of each Regt had to report to Bde H Q this afternoon\n","88":"\n","89":"\n\nA fine sunny day today& a good deal warmer than it has been lately, a good many warboats are out to sea today; Col Cox has been made Brigadier of the 1st LH Bde & hold the rank of General whilst Brigadier; Meredith is back here & C.O. of this Regt again; We received one pair of boots & a waterproof cape for the Signaller on duty running messages, all the men on duty in the trenches have boots which come up to the thighs, also capes; Sunday night 3 or 4 English lads died on duty from the cold, a rum issue was given to them before going into the trenches & blamed for their death; We receive a rum issue every morning now. Granville is now O.C. of C Sqd Harris OC of A; Weir OC. of B & McKell (Capt) OC of D. Sqd ,D Sqd originally belonged to the 12th L.H\n","90":"\n\nWed 1st\n\nA lovely warm sunny day today although water freezes in the cans all day, any one who had earthenware jars to hold water woke up on Sunday morning to find they had broken during the night, as the water froze & expanded; Capt Stucky put in a complaint some time ago against Liuetenants (Weir and Harris) being made O.C.’s of Sqds & put over him, Saturday night last he received a message to leave for Egypt at 5 AM Sunday morning with his batman, but there was no boat to meet him at the pier & he has been having false alarms ever since, the latest order for him is to go at 5 oclock tomorrow morning; I suppose we shall hear next that he was sent back for incompetency, We have had no fighting to test him but I think he is a good man & only being sent back to give the Officers of the old Regt the rise;\n","91":"\n\nThurs 2nd\n\nCapt Stucky left here for Egypt this morning; We are enjoying nice warm weather again now; The Turks fired up some Parachute rockets (4 white 2 green & one red) from \"Lone Pine\" & the \"NEK\" at 4 oclock this afternoon, apparently as a signal, to some other part of their lines; but nothing followed, & we cannot understand why they were fired; Squelch started cooking for CSqd today\n","92":"\n\nFri 3rd\n\nRum is now being issued daily; Today it is drizzling again, & promises to be a rather cool night; We have been getting an issue of flour daily, but I manage to keep ours down by making puftaloons, & scons; have been nliving well for some time, & getting a double chin in consequence;\n","93":"\n\nSat 4th\n\nLast night Francis & I went down to the beach & brought back a piece of hardwood that had been washed ashore, it was as much as we could carry & will keep us in firewood for a week or two; a Turkish spy dressed as an Indian & went from camp to camp haircutting for some months past was arrested & found guilty and shot a few days ago; This afternoon 7 warboats opened up to the south of us & it was the heaviest bombardment I have yet heard, the seven boats firing broadsides making one continuous roar while the bombardment lasted; some gun off the warboats which were landed & are now dug in along the beach blew the top off Snipers Nest this afternoon; The 17th Seige Battery done the job, otherwise all quiet & warm\n","94":"\n\nSun 5th\n\nThe tunnel being put down for the Signallers is only half finished the ground proving very hard after sinking a couple of feet, they came on to shaly sand stone, & it is proving a tough proposition to get down the 16 feet. It was my trip to Bde last night with the state; The Turks have been killing a good many mules near \"Divisional H.Q.\" lately , (averaging 6 to 8 per day) with shells ; Some large Turkish shells fell in the sap leading to Bde H Q today & made a mess of it; Last night Randall & Les went down to the beach for wood, Randall said here is two good pieces, & grabbed hold of a dead sailors leg thinking it a log in the dark, the body had been washed ashore, it was reported today to the beach authorities to have him removed\n","95":"\n\nMon 6th\n\nGood news came again today of the Russians coming down on to Bulgaria relieving the situation of the Serbians; Nothing unusual here; Weather nice & warm\n","96":"\n\nTue 7th\n\nA Cruiser & Monitor standing out off Anzac gave the Turks a very heavy bombardment this afternoon which lasted until sundown otherwise everything same as usual\n","97":"\n\nWed 8th\n\nLast night there was a rattle of rifle & machine gun fire apparently near Achi-Baba; The warboats have been shelling the Narrows constantly all day but we get no news but the warboats are speaking fotr themselves, all quiet here\n","98":"\n\nThurs 9th\n\nReceived a parcel from Edie T. today.The bombardment of the Narrows still continues; A Battery of Naval guns (landed) has been giving Snipers Nest & trenches a rough time of it yesterday & today; (Snipers Nest is only 350 yards from our trenches) Our aeroplanes are up every day & busy as usual, but a German ‘plane is scarcely ever seen; We received a rumor last night from Bde H Q that German workmen wanting peace blew up a German Arsenal & damaged a second, but have nothing official about it. The Turkish Artillery are getting into a bad habit of exploding shells just at the top of this hill & scattering shrapnel amongst us but doing no damage so far\n","99":"\n\nFri 10th\n\nWas on duty from 10 till 2 last night & Meredith had a stand to Arms & man the trenches order issued at 10 o’clock just to see if we could get out in reasonable time; We did not know at the time that it was only one of the Colonels little fads & we sprang to it; But the C.O. wants to be careful & not repeat it unless he wants to get into rows with the men Every night all the men have to be either in the firing trench or else in the supports, night about in each & during the day time they all do 6 hours pick & shovel work making terraces (to camp on during the winter) tunnelling & keeping the trenches in order & although every man gets to his place as soon as he can at ‘ stand to Arms’ it is not likely\n\n10.12.15\n\nthat they will bustle if they think it is only a false alarm to amuse the Colonel, they do their work freely & willingly, but they object to being messed about disturbing their rest for nothing; I had a mess-tin of rice for breakfast in bed this morn & then slept till 10.30, & was awakened by the roar of guns; 3 Cruisers & several Monitors standing out off Anzac were all at it as hard as they could go, at time the boats could not be seen for smoke & flame, & the ground here was shaking with vibration; I thought by the sound of the shells exploding that they were falling at the Narrows but on ringing up Walkers Ridge to find out, we received a message to say they believed the shells were falling in the Olive Groves & main road; An aeroplane has been up all the morning apparently directing the fire\n\n11.12.15\n\nSat 11th\n\nThe 54th Division of English Tommies that landed at Suvla have been withdrawn off the Peninsula, I believe a good many Australian troops are also being sent away, 3 battery of Artillery going tonight; It is the general opinion that only enough men are to be left here to garrison the ground we have & the rest are to be sent to Servia; If they intend to evacuate the Peninsula altogether I hope I am not one fighting the rear guard action as they will have a very poor chance of getting away alive; A message came through from Bde today asking for the names of more men of the 1st LH who want commissions in the 1st Infantry Bde; Garbett received a star yesterday, also Mann into the 4th Btn\n\n12.12.15\n\nSun 12th\n\nPut in my name for a Commission this morning but think I have a very poor chance of getting one, as Meredith is not likely to recommend any of his Signallers for anything, as the Regt. is not overstocked with them &he now knows a Signaller cannot be replaced by everyone. D Battery shelled Snipers Nest again this afternoon, I was on duty on the ‘phone & had an interesting time sending through the ranges from the Observation Officer the shooting was very good; 2 guns from every Battery has been taken away from here; the 4th LH left last night also a good many Infantry (7th Brigade;) & stores are being taken off the beach all day & night by pinnaces; Barbed wire entanglements put out tonight.\n\n13.12.15\n\nMon 13th\n\nIt is rumored that the troops & Artillery that were taken from here were landed higher up the Peninsula to the North of us & Saturday night they advanced 2 ½ miles cutting of the Turks Communications by land & that we hold the highest positions, but we have nothing official; & the general belief here is that we are evacuating the Peninsula; The 1st LH Field Ambulance received orders to pack up yesterday afternoon & all men fit to leave the Hospital were sent back to their Regts & the remainder sent onto the Hospital Boat ; At 2 o’clock this morning a message came through from Bde saying to get ready to send 32 men from C Sqd 32 from D 12 from B & 11 from A Sqd away tonight\n\n13.12.15\n\nthat will only leave 10 men besides the 3 Sig’s in C. Sqd. & not a great many more in the others, & it looks as though we are left to fight a rear guard action if we are evacuating; I was very busy while on duty from 6 till 10 this morning had a trip to Bde HQ & a couple of trips to all the Sqd leaders; but at 9.30 the order to move was cancelled; No letters are to be sent away until further orders; Last night while taking the State to BDE. H.Q. I could see shrapnel shells bursting to the North (but they were too far away to hear the reports) among the hills to the North of Suvla Bay so perhaps the rumor of a landing up there is true ( 10.30 PM on duty) We have no doubt whatever now in regards to the evacuation of the Peninsila; This\n\n13.12.15\n\nafternoon the Ordnance Store on the beach was thrown open; & we were allowed to take anything at all we required Les happened to be down there and brought back a pair of new leggings for himself also a pair for me; he also secured one pair of rubber boots that comes up to the thighs; Tonight the 3rd LHR & also the 2nd LH are leaving and we had to send part of this Regt to man the trenches of both the 2nd and 3rd LH tonight so the 1st Regt are now holding the same front as the 3 Regiments have been holding previously; If the Turks attack at present there is sure to be blood & hair flying for a while & then I suppose the annihilation of the","100":" L.H; it is practically certain that we shall be the last troops to leave here, &\n","101":"\n\nwe all agree that we are to take part in some pretty warm work before many days; & to hear the lads joking about the situation we are in is very comical & although they all say that practically none of us will manage to get on board the transport; I do not think there is a dozen who would not stay to see the finish even if they had the opportunity to get away tonight. The Turks position on Walkers received particular fits this afternoon from the warboats, over 100 high explosives must have fell on their positions inside half an hour Walkers Ridge was nothing but a mass of smoke & the shooting remarkably accurate; there are practically no stores on the beach now the Hospitals have all been cleared out but the tents remain standing but deserted\n","102":"\n\nTue 14th\n\nWas on duty from 2 oclock till 6 this morning; One of the sentries of the D Sqd. apparently had a touch of nerves last night as he reported that he could see Turks advancing & seemed very excited over it, but as nobody else could see them we came to the conclusion that he only fancied he saw them;The Regt received orders today to burn anything we have, & do not intend to take with us; apparently \nevery\n all the troops have received the same orders as dense columns of smoke can be seen all along the line\n today \nmen are busy on the beach today breaking up all old rifles & bayonets & throwing them into the sea, also saturating the heaps of old overcoats & clothing & any stores that are left behind with petrol apparently to set fire to as we are leaving; Everything very quiet. Bet the Adj. £ 1.0.0 that we would leave before midnight \"Mon\"\n","103":"\n\nWed 15th\n\nLast night the Turks had sentries out on Bushy Ridge & we turned a machine gun on them at 10.30 but everything is very quiet here; A heavy bombardment still continues somewhere about Cape Hellas; This Regt is at present making Cheveaux de Friese (Barbed wire entanglements) in the day time & putting them out every night; A strong breeze blew up last night & turned the air rather chilly again; fortunately the sea remains fairly calm & we are all hoping for it to remain so as it is our only chance; At present we have 200 men of this Regt spread out over a mile of trenches & it is the same right along & more are leaving every night; Last night at 10 oclock we could see several transports lying in close to shore taking troops off; I fancy the Turks have suspicions of our\n\n15.12.15\n\nmovements as they fired a good many shrapnel shells on to the beach at intervals during last night: Major Granville: Ser-Maj Wright, Sgt. Lovett & Gray were out last night doing patrol duty; It is the general opinion here that very few of the last troops to leave will ever get off the peninsula, & unless we can sneak down to the beach before the Turks are aware that we have left I fancy we shall get a rough time from machine gun fire: I do not think the Turks will come to close quarters with us, as they would lose a good many more men than we would even if we were annihilated which is almost certain we would be; A good many men here are asking; What would the people in Aus. think and say! I contend that they have no right to condemn anyone & if this position is costing us too dear to take, the men in charge are doing quite right in withdrawing us, & putting us where we may do more good: Heard last night that America had declared war on Austria.\n\n15.12.15\n\none NCO & 5 men were sent away from both the 1st & 2nd L.H Regts at 7 oclock tonight take the more important records of the Regts; Lieut McGuigan received order to take a \nfatigue\n party of 10 men to proceed to the junction of SAZLI-BEIT-DERE at beach road near mule camp to guard stores belonging to 3rd L.H. McGuigan was arrested on the road as a German spy & taken to the beach where the Colonel had to go to have him released; Lieut Wright had to take Mac’s places & when he arrived at the stores found they had been looted 5 transports are in tonight to receive troops & they must be quite visible to the Turks as it is bright moonlight tonight; Our lads leaving tonight are attached to N.Z. Infantry Bde who are embarking tonight; The Turks rigged up a dummy this afternoon with arms working a good many rounds were fired from the machine gun & rifles before it found out to be a dummy.\n","104":"\n\nThurs 16th\n\n3 Hospital boats came in close to shore today which looks rather promising to us; A machine gun \"posse\" only large enough to hold a gun & 2 men has been dug on Russells Top to cover our retreat each gunner has been issued with a stick of gelignite to blow up their guns with; Barbed wire entanglements & trip wires are out everywhere & everything is as complicated as we can possibly make them for Johnny Turk when he comes along It is also rumoured that 400 tons of explosives is under Walkers Ridges in mines a light pier has been erected out to the boat that is aground near Watson’s Pier; If it comes to a fight & we can manage to get inside the old ship we shall be able to give a pretty fair account of ourselves No N S Wales troops have been withdrawn yet apparently they are giving us New South Welchmen the honor of fighting a rear guard action\n\n17.12.15\n\nFri 17th\n\nFrom one till four oclock this morning we had orders to fire no shots & to keep a strict silence which was carried out without any movement on the Turkish side; Earlier in the night a good deal of rifle and machine gun fire was heard somewhere about Lonesome Pine & I thought the 6th & 7th L.H were being attacked but have no heard no word of it. D Sqd buried all their spare ammunition today; A Naval Officer & a couple of men were killed at Watson’s Pier last night; Today the men working on the pier were busy today blowing the side out of the old ship & a good many Turkish shells also fell around the pier; The 3rd Light Horse Field Ambulance have received orders to remain on the Peninsula if we are attacked while leaving to attend to any wounded left behind & to surrender to the Turks; the Sgt & one man who are to work\n","105":"\n\nthe machine gun on Russell’s Tops have also received orders to hold the Turks back as long as possible & they are also to be left behind if we have any difficulty in getting away; The Gurkhas are leaving tonight; this evening the Colonel & Adj & Major Granville went around to Bde Head Quarters to see the Head about the final arrangements. Another gun of D Bty was sent away today & now only one remains. Somehow I fancy we shall all get away off the Peninsula without being molested by the Turks; We ran another ‘phone line out today down to the Gully to A Sqd. No 1 Sub Section & believe we are to get a ‘phone from Bde tomorrow & have another Station working tomorrow night Last night we could hear the lads going out to the transports singing Good-by Gallipoli we could hear them quite plain & thought it hardly fair to us, as the it was as good as telling the Turks they were leaving\n","106":"\n\nSat 18th\n\nAt midnight last night that stack of old clothing & equipment at the Ordnance was set fire to & the conflagration lit up all the hills; At 9 oclock this morning we were lined up & addressed by the Col who said he had received a message from General Godley who had given the 1st L.H. the honor of being the last troops of the 1st Aus. & New Zealand Division to leave the Peninsula,& he knew that if we should have to fight our way out we would fight as stubbornly as we have done all along; & there is no doubt we will as there will be nothing else for it but to fight; \nTonight\n 3 Officers & 30 other ranks are to go away tonight; the remainder leave tomorrow night; Nelson, Traill ,Leask & Tomlinson have been told off to work the phone for the final; Traill has to go to Destroyer Hill; Leask to Camel Hump, Tomlinson to FH at top of this\n\n18.12.15\n\nhill & Nelson works the H.Q. ‘phone When I heard that there was only one Signaller to remain to work each ‘phone I naturally concluded that the rest would be going away tonight & as Les & I have both been here from the start we came to the conclusion that we were not getting a fair deal by being sent away before the 'final flutte', so I went to Major Granville who explained matters saying that only a certain number of men are to remain here after tonight & Les & I are staying, but go into the trenches tomorrow, Les goes away with the first lot tomorrow night & he thought I was to remain with a few others to the last so I am satisfied once more; the Officer responsible for the lighting of the fire last night cannot be located there is trouble awaiting him if it can be found out who gave the order; 2 German Planes flew over us tonight soon after dark \n\nAll who are remaining till tomorrow handed in their blankets today, to lighten our load if we have to fight. Fortunately the night is warm for this time of year& since the snow we have been having lovely warm weather not even getting any frosts to speak ofl It was my turn for the trip to Bde tonight.\n\n"}}