{"Document Name":{"0":"Diary_0426","1":"Diary_0426","2":"Diary_0426","3":"Diary_0426","4":"Diary_0426","5":"Diary_0426","6":"Diary_0426","7":"Diary_0426","8":"Diary_0426","9":"Diary_0426","10":"Diary_0426","11":"Diary_0426","12":"Diary_0426","13":"Diary_0426","14":"Diary_0426","15":"Diary_0426","16":"Diary_0426","17":"Diary_0426","18":"Diary_0426","19":"Diary_0426","20":"Diary_0426","21":"Diary_0426","22":"Diary_0426","23":"Diary_0426","24":"Diary_0426","25":"Diary_0426","26":"Diary_0426","27":"Diary_0426","28":"Diary_0426","29":"Diary_0426","30":"Diary_0426","31":"Diary_0426","32":"Diary_0426","33":"Diary_0426","34":"Diary_0426","35":"Diary_0426","36":"Diary_0426","37":"Diary_0426","38":"Diary_0426","39":"Diary_0426","40":"Diary_0426","41":"Diary_0426","42":"Diary_0426","43":"Diary_0426","44":"Diary_0426","45":"Diary_0426","46":"Diary_0426","47":"Diary_0426","48":"Diary_0426","49":"Diary_0426","50":"Diary_0426","51":"Diary_0426","52":"Diary_0426","53":"Diary_0426","54":"Diary_0426","55":"Diary_0426","56":"Diary_0426","57":"Diary_0426","58":"Diary_0426","59":"Diary_0426","60":"Diary_0426","61":"Diary_0426","62":"Diary_0426","63":"Diary_0426"},"Date":{"0":"unknown","1":1750.0,"2":1751.0,"3":1752.0,"4":1753.0,"5":1754.0,"6":1755.0,"7":1756.0,"8":1757.0,"9":1758.0,"10":1760.0,"11":1761.0,"12":1762.0,"13":1763.0,"14":1764.0,"15":1765.0,"16":1767.0,"17":1768.0,"18":1769.0,"19":1770.0,"20":1771.0,"21":1772.0,"22":1773.0,"23":1774.0,"24":1775.0,"25":1776.0,"26":1777.0,"27":1778.0,"28":1779.0,"29":1780.0,"30":1781.0,"31":1782.0,"32":1783.0,"33":1784.0,"34":1785.0,"35":1786.0,"36":1787.0,"37":1788.0,"38":1789.0,"39":1790.0,"40":1791.0,"41":1792.0,"42":1793.0,"43":1794.0,"44":1795.0,"45":1796.0,"46":1797.0,"47":1798.0,"48":1799.0,"49":1800.0,"50":1801.0,"51":1802.0,"52":1803.0,"53":1804.0,"54":1805.0,"55":1806.0,"56":1807.0,"57":1808.0,"58":1809.0,"59":1810.0,"60":1811.0,"61":1813.0,"62":1814.0,"63":1815.0},"Entry":{"0":"Liverpool England ","1":"\n\nAfter leaving Leatherhead yesterday by 4.35 pm train & arriving at Waterloo, Christie & I got all luggage & took to the Cloak room Euston RlyStn thence to the Royal Auto Club where I stayed for the night. Rose at 7 am, had breakfast at 8 am & got a taxi to Euston where I found Christie who informed me that all luggage was on board train safely - there were 3 cars reserved for 60 Australian officers in Compartments of 4 & 6 - furnished with arm chairs & tables, the best rail journey I've ever made. Unfortunately it rained all the day & thus spoilt our view of the country which I should estimate was\n\n\n\n\n\nvery fine - an old friend of mine Lt Col E Martin 34th Regt was with me and as he had lived in that part of England previous to going to Australia 28 years ago he was able to give me many interesting items of the people living between Rugby & Liverpool - he was astonished to find so much land under cultivation - mostly beans, wheat (dark color) & oats. We arrived at L'pool at 5 pm & our carriages were then detached & taken down to the wharf alongside the ships. We found 100 officers (600 wounded & sick NCO's & men) & about 100 others on board - accommodation very good indeed. Dinner quite in the old style plenty of sugar & \nno coupons\n-could have whatever we liked. The ship drew out from the wharf into\n\n\n\nstream where we are now lying at 10.30 pm. So I am going to turn in - we saw very little of Liverpool but it appears to be a big place. The transport Military Officer at this place is Lt Nichol (lost his left arm) he is a son of Dr Nichol of Mudgee an old friend of mine - Major Leahy of the Aust Pay Office is my cabin companion.\n\nMonday -","2":"\nWe are still in the Mersey - The weather has taken up & it is bright & warm - we had a treat today in watching 20 American troop ships arrive under the care of the Grand old British Navy - The boats were\n\n\n\npacked - estimated about 40,000 U.S. troops on board, as the ships passed ours the Bands on board played & the Tug & ferry boats whistled Cock a doodle - one of the boats was the Benalla the one I left Australia in on","3":" just 4 years ago.\n\nToday we were told off to our life boats - I am in charge of No 6 Port L.B. 2 Doctors 6 Nurses 6 crew (Naval sailors returning from HMS Sydney & Australia) 14 Tubercular cases 8 Hospital cases - or 40 souls all told - I pray God that we shall not need to take to the boats, but of course all must be in readiness.\n\nTuesday 17 Sept\/18\n9 am - and we are about 30 miles out - weather very fresh but fine - about 8 cargo ships are attached to our Convoy and about 12 U.S. war boats. We have a \n4.7\n 6\" gun on our ship astern & 2 Howitzers for throwing depth charges just in front of our bridge on the second deck, they were all loaded & got ready this morning. Am feeling fit & well had enjoyable breakfast started on Grape Fruit (from West Indies) it is like a very large sweet lemon - the food on board is excellent so far both for the men & officers &c. Our hot salt water bathes commenced this morning I'm glad to say.\n\nWe are compelled to live in our life belts which adds rather to my appearance resembling something like a rugby football - don't smile.\n","4":"\nThe weather freshened up after a while yesterday & the sea became pretty rough - our boat is a good sea goer and it was not to keep ones balance except where the wind met one - several cargo boats in the convoy appear to be fairly heavily loaded & the water was continually breaking over their forecastle looked very pretty but unpleasant to be in\n\nThe weather this morning is a bit milder but we still have a pitch & toss game on with the waves. Very little sea sickness amongst the men so far - 10 am - Weather still good & improving - Was up at 6 a.m. today - 2 Submarine chasers & an Aux Crusier met us this morning & joined in to increase our Escort. Am still taking advantage of 4 meals per day - some beautiful sky effects again tonight. The water is tested every morning I should say the temperature of the water, for what reason I do not yet know, must ask one of the ships officers.\n\nIt was 58° Far. today.\n","5":"\nGot up at 6.30 am fine weather but a bit too fresh for my liking – when we Zig Zagged in one direction all this morning it landed us for a few minutes side on to the waves so we got a lovely roll. The wind is fairly strong still. We are travelling only at about 8½ Knots per hour so far as we have one slow old Tank boat in the Convoy but as soon as we break away from this crowd which will be most likely Friday or Saturday we shall increase our speed up to 12½ or 13 Knots. We are evidently going via the Cape of Good Hope. At 2 pm 7 of our convoy & four T.B.D's bore off\n\nSouth from us leaving us 2 Aux Cruisers & 4 T.P.Ds – it is presumed they are making for the Mederterrainian (cant spell it) via the Gib as they got away from us they looked very fine only trust they as well as ourselves reach our destination safely. The weather is cold altho' bright, and the sea has a heavy swell on – the rolling of the shipcauses no end of inconvenience to the one arm & one leg men but in spite of all their discomfort they laugh heartily over the many funny things which happen to them.\n\nOne thing I omitted to mention before and that is that the ship is a \ndry\n one both for Officers\n\nand Rank & file – that will be pleasant news to some people I know – but I for one am glad it is so altho' there are many growls from others.\n\nNot a light of any description is allowed to be exposed after dusk all port holes are closed shuttered & blinds drawn should any one \nwh\n wish to go out for a stroll after dinner, the one dim light in the passages is switched off by the opening of the outside deck door, besides this percautionthere are heavy canvas curtains over each door. Our greatest trouble is the cigarette smoker who will strike a match in the open but after the first culprit was caught\n\n& made an example of it stopped but to see it does not occur again 4 police are constantly walking the different decks & the Orderly Officer also watches them until the men have to retire. The crews on the other ships in the convoy if they see the slightest glimmer signal it to our skipper who requests the Commanding Officer to put a stop to it. I understand the light regulations continue until we reach the Australian Harbour we first call at. The only lights in the saloon are 4 small green ones the same in the smoking room so one takes a walk quickly up & down the leaside of the ship & then into their\n\nown Cabin where the light is so much better there one can smoke & read, if the air gets thick you turn on your electric fan & thus clear the atmosphere.\n\nThurs\n","6":"\nWoke up this morning to find a rough sea on & weather fresh & cold it was quite a work of art to shave – during the night the T.B.D's left us so we have now only the 2 Aux Cruisers with us. It was quite cheerful to see the Capt of the ship (Claydon) at breakfast, this is his first meal with us since we left L'pool so it looks like a good omen. Capt Claydon is a man about my\n\nown build not quite so stout but what I use to be like but not so tall he has blue eyes & brown hair, moustache, & close cropped beard, & looks acautious & capable man & certainly has a will of his own.\n\nJust now I noticed a big liner on the horizon evidently travelling on her own – appears to be very fast – any boats who can travel 18 to 20 Knots per hour get escorted out for a day or perhaps 2 then they dash off on their own account & are not escorted until within about 2 days of home again.\n\nAt 1-30 pm we parted company with the rest\n\nof the Convoy they going Westward & we Southward the only escort we have now is one Aux Cruiser, the sea is rough the water coming right over the bows of the ship.\n","7":"\nRose as usual this morning sea still very rough & wind screaming thro' the port holes – of course we are now on a track which is never used by passenger ships and being so far out we get it much rougher - we are steaming at 12 Knots per hour & should (DV) soon be westward of the Azors & then when a safe distance west of them turn our nose\n\nSouth keeping the Cape Verde Islands well over on our port (or left side). If the Almighty guards us south of them for a few days we shall be able to drop our life belts back into their racks. The first 3 days out we wore them now we carry them round with us & I have caused some amount of amusement bymaking the Officers pay me sixpence each time I catch them without their belts – this money I hand over to the Purser for the widows & orphans of the Fishermen & Mariners Society, so far 30 Officers have paid me. Should one forget it (the life belt) now the others\n\nsay look out here comes the Colonel or Sixpenny King – then theres a wild rush for their belts.\n\nThe C.O. of the Boat – Major Higgins late of Hd Quarters Tidworth has asked me to take in hand the organisation of Sports & Concerts so am preparing things but at present can do nothing in this weather.\n\nToday the Aux Cruiser sent us a long telegram about the War and the good news has caused us to feel quite happy.\n\nSeveral of us retire to our Cabins immediately after meals & smoke & talk or else read until one falls asleep. I'm always sleeping now – every afternoon & night. Have cut out afternoon tea\n","8":"\nNothing much to write about I slept well last night although the ship jumped about fairly well. The sea is still rough & the decks are smothered in spray. She must be loaded up below heavily but owing to the troop decks being light she becomes fairly lively besides she is only a 9000 ton boat – we had Holy Communion this morning at 6.45 when I suppose all my people were asleep & comfortable.\n\nI notice the Aux Cruiser (the old Oratava) has a big sea plane on her decks but so far has not been able to use it owing to the rough\n\nweather.\n","9":"\nNothing to enter for yesterday evening the sea was rough & the wind high. Today the weather has somewhat improved & is certainly warmer. Influenza has broken out amongst the ships crew but every precaution is being taken to prevent it spreading. Some of our poor lads would have a bad time if it got to them.\n\nHad a meeting of the Committee to commence sports &cfor those able to take part but am afraid there are few who can do so except the 80 who are acting as Submarine Guard & are returning to Australia on leave.\n\nWe are anxiously looking forward for our escort to\n\nsend us some more good news of the war. Quoits were commenced today I saw some of our fellows playing – they have rope quoits & chalk rings on the deck at a distance of 20 feet & toss along the deck the quoits going into the rings count according to the number in each ring – 3 for a bullseye.\n","10":"\nNothing to put in this, yesterday weather improved except for a few rain squalls. Last night we had a Eucha Tournament (Cards) which caused some fun. Today is fine & muggy in fact at night time with all the Port holes closed it is very very hot. It makes me think of some\n\nladies who would have rather a bad time of it. The nurses appear to feel it but as they are on duty & occupied they do have much timeto think very much about the weather except perspiring pretty freely. There are about 200 officers & men to have their wounds dressed daily & a large number of cases for massage – out of the 12 Nurses 2 are for the latter work – 2 are Invalids & 8 are on duty. I have had little or nothing to say to any of them beyond bidding them the time of the day as I have been enjoying two good books sitting in my cabin to read – \"Mons to Ypres\" &\n\nthe \"Land of Veiled Women\", both very interesting – we have music day & night several of our Offrs & NCO's play well & some sing, they do not know that I understand music at all & are not likely to. Our escort is still with us.\n\nWe are now getting well into the Tropics the weather is very warm & the people in the lower cabins are feeling it. I have a nice breezeycabin on the top deck – an order has been issued that Port Holes may be left open at night so long as no scrapeof light is shown. We appear to be getting into a safer area thank God.\n\nJim asked me about a naval gun with a shoulder \npref\n buffer & trigger guard & I could not give hime a full answer, I notice the Howitzers on board here have a kind of a buffer, it is used by the gun layer he rests his shoulder against it & leans forward to see through the sights which are on the side of the gun, another man works the breachblock which has a rifle bolt at the end & is fired by a trigger – that is what Jim saw in the pictures probably.\n\nWe started a pea guessing competition this afternoon that is so many peas in a bottle & we give 3 guesses for 3d– I bet some will be considerably out as\n\none of the Sports Committee & myself put a pill box in the middle which could not be seen – we open the bottle tonight & count them there are really 603 peas in it but most of them have gone from 700 to 1200, a few have gone from 200 to 500. We went to the Barbers shop & bought 2 prizes for this & two for the Eucha Card Tournament and I have the honor to present them tonight.\n\nI forgot to mention that last Monday evening we got the S.O.S. signal from some ship some distance west of us who stated a big Sub was shelling him, we or our Escort could not of course go to his assistance\n\nlet us trust some one else did.\n","11":"\nThe weather is fine & warm sea calm & although we must be close to the Equator we are still Zig Zagging for safety. I understand our escort leaves us today or tonight some time so that looks like a good sign.\n\n7 pm - The Aux Cruiser \"Oratava\" ran up alongside us & we cheered each other then their Band played the \"Long Long Trail\" \"Auld LangSyne\" & one or two other tunes, wished us good luck & safe voyage & left us. So we are now battling along ourselves. Tonight I foolishly put my hand whilst talking against\n\nthe electric fan in the O.C. Troops cabin and got a nasty cut on my little finger, as the fan was brass & not toclean, I'll have it dressed in the morning.\n","12":"\nSea calm but raining all the morning nasty damp heat – the poor fellows in their swinging cots in the Hospital are feeling it pretty badly. Last night we disconnected our elec light in the cabin & opened the Port Hole & even lying on bed without clothing it was very hot. While I think of it I made a mistake about the Howitzers we have on board they are 7.5 B.L. with a range of 2100 yards, not 4.7 as I first wrote down.\n\nAs my finger was looking\n\npretty sick this morning the Drput a Nurse to dress it, she first amused herself by putting plenty of hot water & squeezing blood out of it & then swabbed it out & over with Iodine – for which I said \"Thanks\".\n\nI had another misfortune I dropped my patent tobacco pouch & some one has picked it up so I must start old Christie searching the ship.\n","13":"\nWeather calm & hot as usual – expect it will continue so from this on – expect to cross the Line on Monday. Dropped my watch again today but it still keeps ticking away. At 4 pm today the alarm was given &\n\ndashed for their life belts & to boat stations – some had anxious but brave faces – I was exceedingly cool for I had happento hear the Captain mention in a whisper that he would give the alarm as a test – after all were in their places & the fire alarm was given & the ships crew flew to their own particular job in case of fires, smothered all the air ventilators &c, &c, after that the signal was given to dismiss & many heaved a sigh of happiness.\n\nThe same old routine everyday sleep, eat & sleep, smoke & read, patience of course. The other people play Bridge or Ventyaune- (gamble). The Sisters play bridge of a\n\nnight with the young fellows who shout them drinks, Rosses Ginger Ale or Soda. Old birds like myself smoke & talk on the deck until my bath time at 9.30 then I get into my bunk turn the elect fan on & read, we burn lights or use elect current as we like, no coupons or restrictions thank you. The bill of fare is just as good as ever. We hope to reach Cape Town about 12th Octr D.V. .\n","14":"\n5 pm. Usual Communion & Church Services this morning. Weather calm but hot – we are just passing a sailing vessel a barque a Dane – caused quite a\n\nsensation – we sighted her about 2 hours ago & have just passed her – she sent a signal to us but what it was I have not heard.\n\nFancy it is just over a fortnight since I left Fircroft it seems in some ways over a year. The sun sets are glorious lately. The saying comes home to one - \"They who go down to the sea &c\". We passed a shark about 8 or 9 ft long yesterday, not a nice fellow to bump into. The temperature of the sea was tested this morning it was 81° Far. .\n","15":"\nPassed another sailing ship & later a steamship but both some\n\ndistance away towards the American coast. Last night was most trying my pyjamas this morning were wet through with perspiration. The Flying fish are darting away from the ships sides – they come out of the water & fly about 30 or 40 yards & into it again. Wonder what you are all doing at Fircroft, the week ends always keep me thinking of what is going on, if tennis is still the rage &c.\n","16":"\nToday there is a nice cool breeze blowing two sailing & one steam ship passed us on the westward side but a good distance off.\n\nInfluenza has not been beaten yet Major Higgins the O.C. is now down & I have to take command. We had a burial today one\n\nof the Ships firemen died from pneumonia the Drs & Nurses had a great struggle but the poor fellow died early this morning & was buried at 4.30 p.m. We all paraded at the stern of the ship alongside the big 6\"gun & as the Padre said \"unto the deep we commit his body\", foursailors tilted the board & the body shot out & down – hope we have no more of it. I have not spoken a dozen words to the Nurses they are quiet & fully occupied – they are not good looking by any means.\n\nWe have stationery bicycles & rowing boats &c in fact all sorts of weird instruments to get the poor cripples some exercise for their limp &\n\njoints, besides the massage & electrical treatment. We have 6 Doctors on board & although 4 of them are passengers & need not work they all turn to & give their best to benefit the poor lads who so need it.\n","17":"\nLovely cool breeze all day. We had our first concert on the after well deck this afternoon & it proved a great success. I promised to sing at the next but do not know if I shall as I'm not keen to sing in the open. I am enclosing our programme we have a marvel of an accompanist a Sergt Sidon. It does not matter what the song is he seems to know the accompaniment & plays\n\nwith great taste & without a note of music before him – plays any key suitable to ones voice – when one fellow gave a rotten rendition of Songs of Araby – my thoughts were miles from here.\n\nWe crossed the line at luncheon time today.\n\nPoor Higgins the O.C. is still bad had a tem of 104° yesterday better this morning but has risen again tonight, hope he improves tomorrow for I'm afraid he will make a poor fight for life if he gets really bad. In about 8 days D.V. we should be in C Town.\n","18":"\nWeather fine with cool breeze until 7 p.m. when we had a few showers of rain. Nothing to note except usual ship's\n\ninspection – one of the Officers had a snapshot at me do not know what it is like but will send to Mollie if I can get a copy of same.\n","19":"\nWeather bright with cool breeze sea fairly calm. One thing about the morning inspection of the ship one gets a fair amount of exercise going all round & up & down the gang ways. We held our Sports meeting this afternoon & shortly after we had finished the wind turned cold & showers of rain came on. We had bicycle races for one legged men & skipping for same they were very good indeed. The bicycles are frames of bikes with treadles & saddle fixed\n\nfixed on a heavy stand, there is a heavy fly wheel which is regulated by a spring to make it as if running down hill or by tightening the spring up it is like going up hill, in front it works a dial showing how many¼ of a mile you do.\n\nAnother event was putting the pigs eye in (similar to putting on the Donkey tail) Egg & Spoon Race & a pillow fight on a spar over a big canvassbath. These events caused no end of fun – after starting the show I cleared out to my cabin & laid down as I had a beast of a headache.\n\nSports are to be continued on Monday afternoon.\n\nThe wireless war news we\n\nrecdtoday was very cheery, hope it continues. I shall not be a bit surprised if the Turks do not give in in a few weeks.\n","20":"\nStrong wind & rain squalls during the morning but cleared towards the afternoon. Had an alarm today everybody was in position in 5 mins. I went round & inspected the whole crowd 841 all told – we appear to be getting the best of the Influenza thank goodness. Food still continues good. Had a good game of Bridge tonight with 3 officers & won the large sum of 3\/-.\n","21":"\nWeather fine – fresh breeze – sunset very fine – Usual Communion & Church Services – Collection at C of E £2-12-0R C 11\/-(out of 80 present at latter). Inspection not on this morning.\n","22":"\nWeather is fine sea smooth. Had fairly heavy work in Orderly Room about 12 men brought up for neglect of duty also one Officer. Rubbed it in pretty strong to Officer & men fined several of the latter (4 bad wretches). Inspected the Officer on Guard at 2 a.m. & returned to bed at 3 a.m. Fancy while I write this at 8.15 pm having finished dinner about a quarter of an hour, we are at the same time as at\n\nat Greenwich – suppose you are just commencing dinner at Fircroft.\n\nI got up a Boxing Tournament on the ship and we had the first lot of fights this afternoon some were pretty willing between the sailors & soldiers – one lot was between 2 Red headed fellows they made a comic show of it and the on lookers screaming with laughter.\n\nIt looks as if I'm to be O.C. until we leave the Cape – Higgins does not feel strong enough to take over yet but by jove he will have to do so next Monday he asked for the job & he can keep it. Quite a cold wind blowing tonight.\n","23":"1918\nWeather cool, sea calm, nice breeze. I find that the fireman who died on board leaves a wife & 4 children with another expected, from inquiries made it appears the poor widow receives£5 only from the Firemans Union, so Christie & I have commenced to collect for the poor unfortunate family, we expect to get£40 at least that is one good thing about the Australian, he always gives what he can to such a case – we have with Church collections &c &c got in fully£20 for the Widows & Orphans of the Seamen's Fund.\n\nUsual inspection of ship this morning Troop Decks very clean, Capt of ship very pleased. Fancy I was\n\nwas offered a whisky & soda by the Purser from his store and I refused it, please chalk it up.\n","24":"\nWeather Bright with a cool breeze sea calm with a gentle swell – usual inspection this morning – we had an Interstate Tug of War N.S.W. entered at last min.with a scratch team and their opponents began to gradually pull them along over the mark when the anchor man (the last on end of rope) a big fat fellow clung with one hand to an iron rail, when his team was immediately disqualified, his mates\n\nasked him why he had been such an idiot, or words to that effect, and he answered \"well if I had not got hold of that rail the other sidewould have pulled us through the eye of the pulley block\" every one laughted. On board here the ships Doctor is a elderly man named Whitcombe, he & I had most interesting hour this morning told me all about his travels & the different ships he was on, his last was the \"Arabia\" which was torpedoed – gave me a graphic discriptionof the rescue.\n\nAfter dinner tonight I filled my pipe & hands in pocket strolled up & down the deck by myself – the moon is\n\njust beginning to give a nice light & looks lovely on the water – but the wind is quite cold so did not stay long – well if all goes well we shall be at C T early Saturday morning, we have still hope of getting to Melbourne by 4\/11\/18 in time to see the great Melbourne Cup run.\n","25":"\nWeather fine but cool sea calm – usual inspection men are keeping troop decks, cutlery, &c in first class order. This afternoon we had the final of the Tug of War – and Victoria was declared winner . Tonight we saw the Southern Cross for the first time (for many of us) for four years.\n","26":"\nWeather fine but jolly cold wind sea has a nice gentle roll and the ship on list to Port which makes it awkward. The coal trimmers have been working the coal bunkers too much on one side everything is on the slant, I asked how we should get on if a heavy storm rose, the Captain said, Oh all right but she is more difficult to handle. The final of the Boxing Tournament took place this afternoon but it was quite cold and as the shi was pitching about a bit it made it very awkward for the boxers. This dreary view of nothing but water every day is getting on everybodys nerves expect to see land early tomorrow.\n","27":"\nWeather fine but strong cold head weather– we did not sight land until 6 am, we were delayed during the night as we had a very strong wind against us – this morning the mine catchers were put out each side & we travelled only at 9 miles an hour so did not reach the harbour at Cape Town until about 12 midday when a tug dashed out & we were told to drop anchor about¾ miles from shore – later another tug came out & I recda letter from the Dist Commandant of C T saying on no account were Offrs or others to be allowed to go ashore as there was a terrible outbreak of Spanish influenza.\n\nWhen I sent this news round you can imagine the deep disappointment but later when I recd further particulars & pointed out the danger the Offrs & Men settled down.\n\nThere have been as many as 300 deaths per day and at time of our arrival there were 42,000 people down with it. All Theatres, Churchs& Public places were closed, Train & Tram service cut down to the lowest – we thought the Authorities would send us round to Durbin where the populace were getting better but no such luck, we are to remain at anchor for 4 days & night while they give us coal & water. Tonight it is a sight to see the blaze of electric lights on shore\n\nlooks like Fairy land. We have ourselves burst forth into light & some of the Officers asked my permission to have a dance, so I saw the Capt.& he got one side of the Promenade deck covered along the side, put up more lights, shifted one of the pianos out & our Sergeant was got hold of to play and then the fun commenced, the Sisters are quite busy. I had a look & there are some splendid dancers amongst them, then I had a look at the card players Bridge & Poker going hard at it, then I came in to my Cabin to read & write this but as I'm on the side were the fun is you can guess that it is hard work to do either, hope they do not\n\nkeep it up too long – I posted my letters & sent 2 cables so hope they get to their destination safely – our A.I.F. Representative came on board for returns &c so took my letters &c, have also asked him to send an Iced Cake to Fircroft.\n","28":"\nWeather Fine & warm, Sea calm, Table Mountain looked splendid not a cloud about and the Township nestling at the foot looked all that could be wished and yet death was being dealt out hourly. We had Communion & Church Service as usual which included prayers for both white & black inhabitants ashore – C of E collection amounted to£2-11-8&\n\nR C 11\/-,afternoon passed off quietly – took on 250tons of drinking water during the day, a big tug boat use to steam out & connect up to our water tanks then pump the water aboard – each trip she brought 6600 galls.\n","29":"\nAgain the weather is lovely, a big barge was brought alongside convey 200 tons of coal & 50 niggers, the coal is hauled up on to our deck in bags 10 at a time & the niggers get hold of them and run along the deck dumping the coal down the shutes, they are a happy race always laughing & shouting to one another – we have been\n\nputting all these tons of coal & water on to the starboard side at last we are on an even keel, we are supposed to leave here for Durbintomorrow to finish coaling hope we can get ashore there, it is 2½ days run round from here along the Eastern coast – our lads are busy all day catching fish some splendid lots so are getting an extra feed, they must have caught between 40 & 60 or even more, sharks about 10\"to 15\"in length – some they killed some they tied pieces of wood to & let go & it was funny to see the antics of the fish to get away, some\n\nthey tie tails together and let them go – anything to while the time away. Today when the barge of niggers came alongside they threw pennies down & it was the fun of the world to see the niggers scrambling in the coal & tossing one another about to get the coins.\n\nTuesday\n14\n","30":"\nWeather lovely still in C T deadly works trying to kill time, several more boats have arrived today for coal but they will have to wait for awhile about 20 ships waiting for coal – we got another barge alongside as it was urgent for us to push on being a\n\nHos ship.\n\n5 pm we have got sufficient coal & water on now & the anchor is being hauled up once more we are on the move.\n","31":"\nWeather & sea all that can be desired we are out of sight of land once more. Porpoises are thick about here I watched a big batch of them jumping in & out of the water 2 kept together just under the surface & leaped out together just like two races,neck & neck going over the hurdles.\n\nI handed over command of troops to Major Higgins again but do the ships inspection for him every\n\nmorning for him for awhile until he is a bit firmer on his legs – we had got rid of the fluewhen a day out from C T going in but since we left we have about 10 cases, do hope it will not prevent our landing at Durban.\n","32":"\nWeather the same as yesterday but getting warmer saw some whales spouting today away on our starboard (right) side – we had a concert tonight and I think you all (as well as myself) would have been surprised & pleased at the great & kind reception I was given when I went to sing and again afterwards they cheered\n\n& clapped for more but I sat down. The deck we held our concert was like an oven & at last I escaped on to our promenade deck & had a seat & a smoke, the moon was bright and the sea glorious so I sat & thought & dreamt of all the pleasures that had passed.\n","33":" \nWeather cool & fresh wind blowing sea getting up & as we are very light in weight the ship is like a cat on red hot bricks, have had to slow down as they will not let us go into Durban after daylight. Another beautiful night.\n\nSaturday morning","34":"\n7a.m. & we are just going into the harbour, we notice\n\na girl in white standing at the end of the break water, she commences to semaphore with two small flags & is quite an expert she says Australians you are welcome but sorry there is little chance of you coming ashore we are sorry for you but will do our (Y.W.C.A.) best to send what we can to the ship – as we passed her she waved her flag jumped into a car & drove away. I am informed she is about 25 years old & is the daughter of a Dr Campbell at Durban & is a great worker. The last Australians here before they left presented her with silver hair brushes &c.\n\nAfter anchoring about¼ mile\n\nfrom the wharves two big tugs came alongside and began to pump fresh water into our tanks – we also got a cable stating the Minister of Defence forbid any one to go ashore under any pretext – so here we are gazing at the splendid City of Durban but not a chance to stretch our legs ashore or leave the ship – again it was at first a bitter disappointment but the men have settled down now – they are amusing themselves by throwing hot pennys over tothe niggers on the tug boats, one nigger got one down his shirt & you would scream with laughter to see the antics he cut\n\nall his mates laughing & rolling their eyes – they are a happy race. I threw 6 coppers over & the scramble was just like a Sunday School scramble amongst children after sweets.\n\nThis is a fine city & harbour much before CapeTown – we hope to get away Tuesday morning & arrive at Freemantle in 15 days after, then after disembarking about 110 Offrs & other ranks we go for 5½ days until we reach Melbourne, shall we not be heartily sick of this ship – what glorious war news we received today if I had been at Fircroft am afraid I should\n\nhave had more than Mollie's limit.\n","35":"\nWeather lovely but very hot – perspiration streams off me hence no necessity to exert oneself (hold on a minute while I turn on the Elec fan). Church services as usual but owing to some misunderstanding attendance not so good – C of E Collections£2-2-9,R C 5\/7d.\n\nParties of ladies & gentlemen came out in Elec launches during the day & had a run round the ship about 100 yards off – & waved handkerchiefs &c.\n","36":"\nWeather still lovely but blooming hot – coal & water still being poured into us day\n\n& night – and still makes little impression on the ship. Our Engines use 90 tons of coal per day & we use about 6000 gallons of water daily.\n\nTwo Sergts came along & played the piano & violin for couple of hours.\n","37":"\nWeather still hot & fine – finished taking all stores on board tonight. The City looks splendid at night time all gaily alight – we can see the trains & Elec trams running.\n","38":"\nWe sailed at 5 pm, the steam ships in harbour whistled & wished us a safe trip. The last we saw was Miss Campbell in\n\nwhite standing alone on end of the break water semaphoring Good bye & good luck – our men manned the sides of the ship & cheered her & cooe'd to her.\n","39":"\nWeather fine & hot sea calm but we certainly get a breeze to keep one alive, nothing else to mention except that we saw a few whales.\n","40":"\nWeather has changed to the cool side with a fairly strong wind & sea working up – makes it quite a work of art to shave without cutting ones face.\n\nThis morning an extremely funny but at same time serious affair happened, the fish given to the men in a great number of cases was bad & after they ate their bread & jam & tea they piled the bad fish on to big dishes & formed up into a procession headed by a fellow playing the Dead March on a cornet, they marched round the ship & then opposite the saloon. While we were having our breakfast they sounded the Officers call & dumped the fish overboard amidst groans – fortunately some two or three wags amongst them started up a comic touching on the matter & all broke into song &\n\nlaughter & thus saved further trouble – the worst of it is that the lads always look to the old Colonel or Dad to help them but as Higgins has taken over command again I'm simply a passenger now.\n\nI suppose we are all getting very tired & livery over this trying & long voyage not having been off the boat for now nearly six weeks.\n","41":"\nWeather boisterous & sea rough boat rolling about like a drunken man, it is also much colder no good to me this cold after being so hot lately. Had a few games at Bridge but had bad luck. Nothing else to mention.\n\n\n","42":"\nCold strong wind with showers – sea very rough & ship rolling a good deal, if we had not had the fiddles on the table yesterday & today most of the meals would have been in our laps. Communion & Church Services as usual – Collection as usual for English Sailors, Widows & Orphans – C of E £2-2-3,R C 13\/-. We are doing on an average 330 miles in 24 hours so today at 5 pm we shall be 1650 miles from Durban & about 2200 miles from Freemantlewhich we hope to reach D.V. by","43":" It is hard to say how long we shall be delayed there but I believe only a few hours. Col Martin said\n\nto me last night in the Lounge, come for a stroll before turning in but I refused as it was too cold so went to my cabin, he came running in shortly after looking like a drowned rat a big sea atstruck the side of the ship and all the heavy spray had reached above our Promenade deck & of course came down on him. I roared with laughter he looked so comical.\n","44":"\nAll day yesterday & last night strong wind & heavy sea boat tostedabout in all directions wind very cold – same today the ship is only 9000 tons (so does not go like a 14000) all day long she has\n\nrolled about and one is constantly walking at an angle of 45° – we have a measured mile so many times up & round the promenade deck. I walked 1¾ miles this morning &½ mileafter lunch but have not much since, just coiled up in my cabin with a book – we are now 7 days out from Durban & D.V. the next 7 or 8 days will see us at Freemantlewhere I shall try & get off & go via the Transcont'l Railway a distance of 5000 oddmiles by train to Melbourne.\n","45":"\nSea & weather still very rough in fact the waves look like mountains & we are rolling\n\nabout. Shall not be sorry when it changes for the better.\n","46":" 10 18\nAt last the weather has change, the sea has gone down a lot and the sun is shining bright but we are still on a gentle roll but every body appears to be more cheerful.\n\nRecdgood war news yesterday but none today, we should have it from Australia now, no doubt will get some tomorrow.\n","47":"\nWeather perfect but still a roll on. I'm getting quite a walker do 2 to 3 miles each day. Belt had to be taken up another hole that is two less than when I was at Fircroft.\n\nSome of the lads are having fun with two Red Cross Officers on board, one was placed under arrest for being found in bed after hours – he was confined to his cabin and they had Biscuits & water sent to him at lunch but allowed him out for dinner at 7 pm but to go straight back after. ACourt Martial was held and he was in a great way; if he had known anything about Military Law he could have laughed at them.\n\nWhen I saw it had gone far enough, I got him by himself & gave him a hint how to act but he let out that he had recdadvice & found it was a joke so the matter went no further.\n\nThe lads who started it and the Members of the Court were quite annoyed over it but little\n\ndream it was I who gave the advice. We have Sweep Stakes every other day on the number of miles travelled & two Offrs got themselves up as \"Book makers\" with the usual big bag slung round the neck of the man who collected the money, & the names of the firm on it – yesterday they found some one had \npinched\n or otherwise stolen it out of their cabin and they are in great distress. It was removed as a lark by another Red Cross Offr as a set back to them for having had the loan of his comrade – a little bird whispered it to me so I told the \"Bookies\" & proposed they should hire a private detective to search round quietly amongst the cabins and if they found\n\nit the occupants should be charged with \"stealing from brother officers\" & a mock Court Martial formed for their trial – this has so far been done and the poor Red + Offrs are in for a bad time, the trial is to take place tomorrow morning.\n","48":"\nWe had a sweepstake on the Ships running, I missed the prize by one – just my luck – weather good but cold – usual walking exercise today – nothing to report. The Albertross's are still with us some of them must be from 6 to 10 ftfrom tip of wing to tip – we also have a batch of Mother Careys chickens, they are a dirty brown or black bird about the size of a fowl.\n","49":"\nWeather fine – sometimes sunny sometimes rain but worst of all jolly cold. Fancy this is the 7th Sunday I have been away from Fircroft. Suppose it is cold there by this. Church Services as usual this morning. Collections C of E £2-1-6½ R Cs 15\/-so you see the widow & orphans of the English sailors are still being remembered by Australians. One Offr named Sheldon painted a picture & we raffled it½ to go to the late ships firemans widow the other½ to an Australian Charity – the affair was not taken on too well but still I got another 25\/-out of it for the widow so in all our fellows alone gave£70& the Ships people£45– I believe the Captain cabled the amount to\n\nthe Ships Coy in London & asked them to pay her so much per week until the£115was exhausted. Do hope the poor woman got some before the arrival of her other child.\n","50":"\nOne day nearer the end of this long journey. I suppose in our round about way getting away from Submarines & possible Raiders we shall have travelled about 16,000 miles by time we disembark.\n\nThe weather is fine but cold the sea has a good swell on. The Western Australians will D.V. land on Wednesday morning then we cut across the Great Australian Bight to Melbourne where I get off – hope the Bight behaves itself for once it is generally very rough across that part.\n\nThe Western Aussies are in great heart as they are so near home, the cripples & sick have greatly improved – only one case to be carried off, a poor fellow who was gasedhe has now rapid consumption & looks very bad indeed; looks as if he is just hanging out to die at his home.\n","51":"\nThe Great Australian Cup Day. Weather fine & warm sea calm getting bit nearer the Aussie Summer. Nothing to report so far. 9pm – There is a great thunder storm on, I have been walking round the deck watching the lightning play all round the ship it is a grand sight but very solemn – will turn in now & read.\n","52":"\nSighted the Australian Coast at 5 am & at 7 we were anchored \nas usual\nin the outside of the Harbour, we are getting quite useto disappointments now, word has just come off that as we were at Cape T & Durban we were to be quarantined & up went the yellow flag. The Authorities here have got the pimps properly, I never saw such silly idiots – we have what they call a \"clean ship\" yet in spite of this they keep away from us as if we were lepers. The 6 Offrs & 100 men who go off are to be sent straight to a Quarantine Island – Oh the language – we have sent off a letter of protest but by time they\n\nit fumigated & read we shall be moving off. It is simply maddening. The Red +People sent us 40 cases of lovely apples & heaps of newspapers. The Minister for Defence will hear a bit from us as soon as we do land. We who get off at Melbourne are, we understand, to also go to a quarantine Island for 7 days & those getting off at Sydney the same.\n\nWe had another great storm during the night I got up & had a look at it but as it was blowing great guns I soon sneaked into bed again.\n","53":"\nWeather fine it was 100.7 degrees of heat yesterday – today the\n\nWestern Australians were taken off in a launch to an Island & will remain there 7 days – we then got up anchor & came into the mouth of the Swan River & tied up to a bouywhere we are at present taking water which is pumped up through a canvas hose into our ship.\n\nThere is no doubt some amusing fellows aboard, yesterday after the Port Health Doctor had put us in Quarantine, \nthe\n everyone was hanging about with long & unhappy faces watching the steam launch alongside which had brought the Dr – as he went down the gangway on to the launch he looked quite pleased with himself\n\nwhen some wag yelled out, \"Look out Doc I saw a germ jump on to your launch you better get the hose out & drowned the brute\", he glared up at the men and everyone roared with laughter and commenced throwing off all kind of jokes about him until he was too far off. All this cleared the mens feelings & things were quite good. It is not so much the words or jokes that cause the fun but the way some have of saying them.\n\n7 pm and we are just off again hope to reach Melbourne about Wednesday next just a little over 8 weeks on the voyage without a walk ashore, deadly is it not. Suppose we shall be quarantined again.\n","54":"\nWeather fine & cool sea fairly calm and we appear to be making fair headway. At 10.30 this morning I saw land in the distance we were evidently just rounding Cape Lewin so shall see no more until Wednesday.\n","55":"\nWeather all to be desired but rather cool – usual boat station Fire & man overboard drill for us & the ships crew – nothing more to mention.\n","56":"\nWeather fine but quite a cold wind the sea absolutely calm - usual Communion & Church Services held today but we had no collection – great weather for walking excercise.\n","57":"\nWeather very cold sea calm it is quite an exception to travel down this part without heavy seas but our luck appears to be in. The Albertross'sare still flying with us, wonder how they sleep, they go round the ship with scarcely a movement of their wings, some times they rest on the water to pick up some refuse thrown overboard but soon pick us up again – expect they will not leave us until we go into the Heads of Melbourne Harbour. I nearly won the sweep on the ship run today, I backed 287 knots for the 24 hours but she did only 285 so the four pounds did not reach me.\n\n\n","58":"\nWeather calm but cold wind – the great & glorious news of the surrender by Germany & the end of this awful war was recdby us early this morning, what rejoicing there will be throughout the world, how I would love to be in Blighty to take my girls out from Fircroft but such a pleasant matter is now beyond me. Today we held a Thanksgiving Service at 3 pm, which took the form of a short Church Service with special hymns. Tonight the Captain of the Ship agreed to let us have some wines (but not whiskey or beer) for dinner to celebrate this the greatest\n\nday in the worlds history, we have all smiling faces & feel very happy. The Aust Govt wired out to find what time we should arrive tomorrow & the Capt replied about 10 am or noon D.V. .\n","59":"\nWeather cool but fine, we have had a wonderful good run across the Bight werethe ships generally get it very rough nine times out of ten. The Diggers have been influenced by an immigrant, he has bad \nUnion\n socolisticspeeches & the whole of the men refuse to budge off the ship, some of us who were well known got amongst the men & pointed out that we had to go ashore\n\nashore for 3 days at the Quarantine Stn at Portsea just inside the Heads for the purpose of passing through the inhalation chamber once each time for 10 mins for 3 days, we had got it practically fixed up when a few rowdy rotten brutes with the two English Socialists got round them again & the matter was held up – matters really looked very serious for a while so I advised theO.C. to get the boats ready for taking the men ashore & give it out that those who wished to go could do so, before long the men of the better class commenced to hand in to the Quartermaster their ships kit (blankets, hammock, knife, fork, spoon & plate & Lifebelt), this was followed\n\nby a perfect rush, the agitators being amongst the first to hand over and the consequence was that by 9 pm we had the 741 all ashore & quite happy.\n","60":"\nThe quarters here are splendid and the rations all that can be desired, the \nwhite\n \nbread\nmade us stare & oh the toast – but for all the care people are taking for us & themselves – every ship now will go out to dear old Blighty filled with wheat, beef, & butter, and I presume wool – at Freemantlethere were piles of wheat waiting for shipment. We go aboard our old hooker on Sunday Evening & arrive at the Pier in Melbourne at Daybreak, the other men from South Australia, Queensland & N.S.W. go on\n\non by special trains to be received with flags & cheers. The Victorians of whom I'm one temporarily will be recdin the same way about 10 a.m. Monday.\n\nThe smell of the bush & burning wood is quite refreshing after nearly 9 weeks afloat, the weather is warm & fine (about 89º in the shade) but the beastly blow flies are tofriendly – so far no mosquitos, but the ring tailed opossum got very friendly with the men, they went into their tents & crawled over the men, some were grabbed & pulled in bed but the little beggars bite the fellows on the fingers so they soon got free again. I suppose you saw by the papers that a ship from South Africa\n\ncarried the epidemic to New Zealand and they have been dieing in hundreds over there – the N.S.W. Quarantine people stopped the first ships from N.Z. to N.S.W. & put them in Quarantine & before the time expired had 60 cases, 30 of which will be fateful hence the most careful percautionsare being taken everywhere. I went through the inhalation chamber this morning (about 50 at a time), we stand in this chamber and there are steam jets belching out steam in to this air tight compartment – the jets go into a jug of holding some chemical (like formalian do not know if that is spealtcorrectly) & then rises all over us, into our mouths & nostrils, after 10 minsthe door is unlocked & we\n\ncome out & go into another room where our names are checked off – we are to do this once each day at 9 a.m. when we are supposed to be free from carrying the disease to anyone.\n","61":"\nWe expect to leave here tomorrow afternoon & go back on to the Arawa which is timed to arrive at Melbourne at 10 a.m. Monday – when all will disembark. Those belonging to Victoria will be taken round the Town in cars &c the South Aust, Queensland, & New South Wales go on at once by special trains – I have to remain in Melbourne. The weather has been fine but is cool with a light shower or two.\n\nSome of the ladies & officers have been picnicing, others & the Diggers playing cricket, quoits, & strolling about the bush. My time has been spent in reading, smoking, playing cards & a gentle walk with the O.C. , or some other officer.\n","62":"\nWe all returned the ship by dinner time the boat was sweet & clean after her thorough clean up.\n","63":" \nWe arrived alongside the New Pier Port Melbourne where the Govenor General & Lady Munro Ferguson came on board. I was the first officer to be introduced, they shook hands & chatted for a few minutes then I handed them over to\n\nto Major Higgins the O.C. . The G.G. gave a speech & we gave him cheers – next work was to get on the good side of the Customs Officials who questioned us as to what we had in our boxes &c. & if satisfied they put a mark on them – I got all mine through – we then marched off the ship and got into motor cars (about 300) & were driven into & all round the streets of Melbourne between lines of cheering people waving flags &c then up to the Barracks where we got leave & cleared. I came on to the Port Phillip Club Hotel and have been looking round the place. The flowers &c are glorious everywhere & the Public Gardens are very fine,shall\n\nreturn to N.S.W. next week. The Runic (Carrier D 23) is to arrive here on Saturday, hope to see Oscar – Mary & Roma are coming to Melbourne on Thursday morning for a few days.\n\nSo ends my diary for the time being.\n\n"}}