{"Document Name":{"0":"Diary_0206","1":"Diary_0206","2":"Diary_0206","3":"Diary_0206","4":"Diary_0206","5":"Diary_0206","6":"Diary_0206","7":"Diary_0206","8":"Diary_0206","9":"Diary_0206","10":"Diary_0206","11":"Diary_0206","12":"Diary_0206","13":"Diary_0206","14":"Diary_0206","15":"Diary_0206","16":"Diary_0206","17":"Diary_0206","18":"Diary_0206","19":"Diary_0206","20":"Diary_0206","21":"Diary_0206","22":"Diary_0206","23":"Diary_0206","24":"Diary_0206","25":"Diary_0206","26":"Diary_0206","27":"Diary_0206","28":"Diary_0206","29":"Diary_0206","30":"Diary_0206","31":"Diary_0206","32":"Diary_0206","33":"Diary_0206","34":"Diary_0206","35":"Diary_0206","36":"Diary_0206","37":"Diary_0206","38":"Diary_0206","39":"Diary_0206","40":"Diary_0206","41":"Diary_0206","42":"Diary_0206","43":"Diary_0206","44":"Diary_0206","45":"Diary_0206","46":"Diary_0206","47":"Diary_0206","48":"Diary_0206","49":"Diary_0206","50":"Diary_0206","51":"Diary_0206","52":"Diary_0206","53":"Diary_0206","54":"Diary_0206","55":"Diary_0206","56":"Diary_0206","57":"Diary_0206","58":"Diary_0206","59":"Diary_0206","60":"Diary_0206","61":"Diary_0206","62":"Diary_0206","63":"Diary_0206","64":"Diary_0206","65":"Diary_0206","66":"Diary_0206","67":"Diary_0206","68":"Diary_0206","69":"Diary_0206","70":"Diary_0206","71":"Diary_0206","72":"Diary_0206","73":"Diary_0206","74":"Diary_0206","75":"Diary_0206","76":"Diary_0206","77":"Diary_0206","78":"Diary_0206","79":"Diary_0206","80":"Diary_0206","81":"Diary_0206","82":"Diary_0206","83":"Diary_0206","84":"Diary_0206","85":"Diary_0206","86":"Diary_0206","87":"Diary_0206","88":"Diary_0206","89":"Diary_0206","90":"Diary_0206","91":"Diary_0206","92":"Diary_0206","93":"Diary_0206","94":"Diary_0206","95":"Diary_0206","96":"Diary_0206","97":"Diary_0206","98":"Diary_0206","99":"Diary_0206","100":"Diary_0206","101":"Diary_0206","102":"Diary_0206","103":"Diary_0206","104":"Diary_0206","105":"Diary_0206","106":"Diary_0206","107":"Diary_0206","108":"Diary_0206","109":"Diary_0206","110":"Diary_0206","111":"Diary_0206","112":"Diary_0206","113":"Diary_0206","114":"Diary_0206","115":"Diary_0206","116":"Diary_0206","117":"Diary_0206","118":"Diary_0206","119":"Diary_0206","120":"Diary_0206","121":"Diary_0206","122":"Diary_0206","123":"Diary_0206","124":"Diary_0206","125":"Diary_0206","126":"Diary_0206","127":"Diary_0206","128":"Diary_0206","129":"Diary_0206","130":"Diary_0206"},"Date":{"0":"unknown","1":835.0,"2":836.0,"3":843.0,"4":844.0,"5":845.0,"6":846.0,"7":848.0,"8":849.0,"9":851.0,"10":852.0,"11":853.0,"12":854.0,"13":855.0,"14":856.0,"15":859.0,"16":861.0,"17":863.0,"18":870.0,"19":872.0,"20":873.0,"21":875.0,"22":876.0,"23":877.0,"24":878.0,"25":897.0,"26":899.0,"27":906.0,"28":907.0,"29":908.0,"30":909.0,"31":910.0,"32":911.0,"33":912.0,"34":913.0,"35":915.0,"36":916.0,"37":920.0,"38":921.0,"39":922.0,"40":925.0,"41":926.0,"42":933.0,"43":938.0,"44":939.0,"45":940.0,"46":942.0,"47":943.0,"48":944.0,"49":945.0,"50":948.0,"51":949.0,"52":950.0,"53":951.0,"54":952.0,"55":953.0,"56":954.0,"57":955.0,"58":956.0,"59":959.0,"60":962.0,"61":964.0,"62":970.0,"63":971.0,"64":972.0,"65":974.0,"66":975.0,"67":976.0,"68":977.0,"69":979.0,"70":980.0,"71":985.0,"72":986.0,"73":990.0,"74":991.0,"75":992.0,"76":993.0,"77":994.0,"78":996.0,"79":998.0,"80":999.0,"81":1000.0,"82":1014.0,"83":1015.0,"84":1016.0,"85":1017.0,"86":1021.0,"87":1029.0,"88":1030.0,"89":1031.0,"90":1034.0,"91":1036.0,"92":1038.0,"93":1042.0,"94":1044.0,"95":1045.0,"96":1047.0,"97":1048.0,"98":1051.0,"99":1053.0,"100":1054.0,"101":1059.0,"102":1061.0,"103":1062.0,"104":1063.0,"105":1065.0,"106":1083.0,"107":1091.0,"108":1092.0,"109":1103.0,"110":1104.0,"111":1106.0,"112":1112.0,"113":1120.0,"114":1121.0,"115":1128.0,"116":1138.0,"117":1139.0,"118":1142.0,"119":1144.0,"120":1145.0,"121":1146.0,"122":1152.0,"123":1166.0,"124":1173.0,"125":1174.0,"126":1178.0,"127":1179.0,"128":1180.0,"129":1204.0,"130":1205.0},"Entry":{"0":"\n\nInstead of running into Paris as we had hoped & expected we changed lines at a village siding of Juwiey thereby passing through the outskirts of the city seeing nothing but the Eiffel Tower & the Palace of Versailles. Here we received a great welcome from the people & from the numerous soldiers along the route. At one place our train drew up alongside \nthe\n a French troop train. Enthusiasm knew no bounds on either side, our men if anything outrivalling the Frenchmen. At 4 PM on the ","1":" we passed through Amiens stopping at Abbeyville at 9. Another night in the train & we arrived at our destination of Ebblinhem at 4 AM on the","2":" The morning was rainy & foggy & the boom of the Somme 20 kilometres to the north came plainly to our ears. Marching along a cobbly stone road past thatched country houses we arrived at the village of Renescure with it quaint old church. After breakfasting in the street we marched to our various billets. Eventually the MG Section were set up in a warm barn with several feet of straw on the floor. This was attached to the farm house with its usual stinking duck pond & manure heap its pigs dogs & cattle. In the village we found as a set off to our Egyptian experience that things were cheap – including beer & wine which can be purchased for 1d per glass. The place was already full of Tommies – men of the Royal Fusiliers who proved \nno\n a surprise to our men who had been in the habit of thinking the British soldier as the lowest form of humanity \n\nWe were not long in settling down to our daily routines. Route marches & gun drill were daily gone through while on","3":" we were \"gassed\" – after having been fitted up with gas helmets. On Saturday the","4":" came our first excitement. A German aeroplane was observed at about 2 PM approaching as very low altitude from the south. Little notice was taken of it till it was right overhead when the black crosses could be plainly made out. Excitement reached its highest pitch when the plane was observed to turn abruptly & come down in a plowed field to the west of the village. There was a rush of soldiers to the spot. The aviator a short sturdy German was soon the centre of an inquisitive throng until at length he was marched away to the guard room. Attention was then turned to the plane which its tail in the air had buried its nose in the old trench which had been dug by the French during the retreat from Mons. It proved to be one of the latest of the German monoplanes a Fokker bearing the date","5":" This was quite new & this may have been its first trip. Ill luck had favoured it & its occupant as something having gone wrong with the engines it was forced to descend & was now a valuable prize in the hands of the British. It was the picture of speed & the machine gun fixed to the forepart of the box just to the rear of the propeller was the object of a good deal of attention.\n\nOn","6":" we received orders to make a move, & accordingly on the following morning we left our billet in full marching order at 6 A.M. The march lay the cobble-stone road to Hazbrouck some 13 kilos from Renescure & as there were few shops we were rather tired by the time we arrived at the former town. The streets were lined with munition workers as we marched through to the tune of Boys of the Dardenelles. From here we marched through Borre towards Bailleul, the cannonading to the north getting louder each Kilometre we advanced & incidentally the column getting much shorter through men falling out. At 1.30 P.M. three hours before time we arrived at Meteren after\n some 4 kilometres from the Belgian frontier after a fifteen mile march. We were billeted at a prosperous farm-house but the proprietor did not seem to be too friendly. His house was held by Germans during the advance of winter 1914 and the farms around are dotted \nby\nwith the graves of fallen soldiers.\n\nOn","7":" we were inspected at 6.15 A.M. by General Plumer. The morning was raw & foggy & we felt the cold keenly standing to attention on the boggy ground. The remainder of the day continuing wet. We were given several lectures on the M.G.s in the trenches on the notes gathered by the party who had visited the trenches. Thursday \n","8":" training was continued by going for another route march & incidentally getting lost in the maze of country lanes. The country-side here-abouts although the menacing roll of artillery comes constantly to the ear resembles much the same as it does in peace time. All the fields are cultivated, & the hop yards, hedges & roads are in good condition. As in other parts of France, old men, women & children do all the work. Australia does not mind lending a hand & passing down the country roads one sees a soldier at work ploughing or throwing sheaves from a straw stack. Most of the farm houses have been used since the beginning of the war for billeting soldiers with the result that the bourgeous are beginning to understand a little English. Our second billet is typical of the farm houses of the country. First is the house usually built of brick with a railing in front ranging from the \nthis\n the front of this at right angles are the farm-houses the third \nforming the\n completing the hollow square. In the centre of this is the manure pit with its pool of water which in a warmer climate would spread disease for miles. Here wallow the farmyard pigs, great white lop-eared beasts which roll & grunt careless of rain or shine.\n\nIn the stables are the rest of the farm animals, mixed up with soldiers. But on the whole the calves & horses are well behaved & give little trouble\n\nOn","9":" April, the \"showers\" for which this month is noted hereabouts continuing. We marched to the outskirts of Bailleul, a fair sized town just a few miles to the east of our billet. On our way back we had our first practice on the range with our guns, which proved to be quite up to expectations. During the night the German planes which were subjected to rather heavy bombardment from our anti-aircraft guns bombed Bailleul doing a considerable amount of damage.\n","10":" dawned fine & a beautiful spring day followed. After the cold showery days it was an ideal time for aeroplane activity & accordingly numerous planes both German & Allied were flying. One was brought down a few miles from our billet but whether it was an enemy or friendly plane we could not ascertain. As we expected to move into the firing line at any time, we were on the","11":" issued with steel helmets with instructions that they were not to be used as frying pans or \ncertain\n to serve as certain other utensils.\n\nWe completed the third stage of our march on","12":" marching to Estaires some 7 miles\n\n To S.E. of Meteren passing en route through Doulieu where we saw another sign of the German advance in the shape of a ruined church. Indeed the report that Germans were \"severe\" on churches during their advance, was well borne out during the remainder of the march to the front as during the seven miles between Estaires & \nfront\n the firing line we passed numerous others in like condition. We arrived in the firing line about 12 o’clock on","13":" passing to our position of Cellar Farm Post through numerous saps which were floored with duck-boards, under which the water squelched. Cellar Farm is a ruined farm house in the centre of a labyrinth of support & communication trenches. Around it unkempt & straggling are the one time barracks between the farms – the hedges & growing on the intervening land battered & twisted are the fruit trees. Of the one time inmates of the building only a cat half wild remains getting a good enough \n\nMadeline Bafeor \n\nrue In eul In sue\n\nestaires post\n\nfrance\n\nliving from the scraps & the rats which swarm through the ruins.\n\nThe quietness of the trenches was rather surprising. Here & there a bullet cracked & at odd intervals during the afternoon. the artillery from both sides fired a few shots. Late in the afternoon the Germans shelled the road holding up the battalion for some time in the dreary rain & wind swept road. The following day","14":" they continued with the bombardment of the billets in the rear accounting for numerous casualties. The same night saw considerable activity. Flares mounting on the intervening spaces between the trenches, lit the lines like day for a time only to die out leaving all in a bewildering darkness. Machine guns traversed the trenches on both sides the bullets cracking overhead with their numerous snap & at intervals the search lights flashed skywards as if anticipating the presence of air-craft. Good-Friday broke with sunshine, our first for a week or so & the still day gave the aircraft the opportunity for which they waited. The whole day biplanes & other airships displaying the bulls-eye of the allies or the Maltese cross the Germans alternately whirre overhead each licking a salvo of shrapnel \nfrom\n as it approached enemy lines. But anti-aircraft gunnery with its many difficulties, has not yet reached any formidable dimensions so that when night again fell with its attendant rain no aeroplane had apparently been injured on either side. Saturday passed very quickly with rather heavy rain which again eased at night, giving us\n\na fine day for Easter Sunday\n","15":" In consequence considerable activity was exhibited in the aerial sphere one or two rather exciting duels taking place & numerous shells being uselessly expended as usual by both sides. Our airmen however show a considerable amount of daring more than the Germans who with their fast machines fly at a very great height. One of ours in particular flies at rather low altitude backward’s & forwards with rather monotonous regularity over the enemy lines. Whether he finds it monotonous is rather doubtful for he is constantly under both shell & machine gun fire. Early in the morning, the Germans who we are told are usually most busy on Sunday began to drop shells behind our lines.\n\n\"Whiz-bangs\" ( the popular name for the German 77m) had fallen at the head of our communication trench.\n\nAnzac Day –","16":" was kept up in the trenches by the Germans who gave our lines a little ‘strafing’ accounting for several casualties and working parties. On Wednesday the bombardment was continued our guns however taking the chief part in the action.\n\nThe beautiful weather following on Easter Sunday saw considerable activity in construction work. In the second line we constructed two battle implacements\n\nas a reserve in case of the first line falling. Pioneers worked at the parapets & artillery-men at mortar implacements, while new bombing posts were erected at various intervals. Things had begun to stagnate before our arrival. Continued wet & cold weather prevented the previous regiments from doing any important work & even the sniping and artillery duels between the opposing parties had by mutual agreement been reduced to an almost negligible quantity. Our first couple of nights things had been extremely quiet but now the rattle of musketry & machine gun was loud & constant.\n\nOur M.G. Section took over the patrolling gun in the front line on","17":" & we had a glance over the German position. Their line with its handle of barb wire & irregular sand bags runs parallel to ours at a distance of about 70 yards. The intervening space has, has an odd tree at intervals for the present resembles a quagmire. A little to the right of our centre is our mine crater from which of the bombing forays take place, while a little over is one of which the Germans occupy at nights. At the rear of the German lines the principal feature is a village while scattered about among the woodlands, ruinous & blackened are the remains of the once prosperous farm houses. On Thursday night we had a little taste of the real thing. About sunset a heavy bombardment began several miles on our left, slowly extending in our direction. Just after dark a red flare went up from the enemy lines & as if this was a signal the bombardment burst on our lines. The sight was rather beautiful. Flares without number illuminated the space between the trenches like day & the German shells with a swish & a roar burst in the darkness beyond our second line lighting up for an instant\n\nThe ruins of our farmhouses and hurtling splinters & schrapnel with their musical drone earthwards. Our artillery replied, doing some execution to the front line of the enemy & rifles & and M.G’s cracked & scattered along the parapets. For an hour the bombardment lasted & then died down as suddenly as it began leaving as the total damage one burning farm house, two slightly wounded men & a few craters in the fields behind the lines. Such is the terror of the German Strafe. The rest of the night passed quietly. Two rather disappointed M.G’s strolled up & down the lines putting bursts into the quiet parapet opposite or driving from a gunery were parties headlong into their trenches (Perhaps)\n\nThe following days passed rather quietly with the usual whizz-bang activity. On","18":" we handed the patrol over to our relief & went into reserve .\n\nOn coming out of the wintry communication trenches one was struck by the range in the landscape. What was on our entry, bare desolate & sodden country-side was now bright green with the coat of spring. Fruit trees, apple & pear appeared in masses of beautiful blossom, hawthorne hedges of delicate green with white flowers lined the roads & grass dotted with yellow buttercups covered the fields. Only ruined houses & the crash of bursting shells or the roar of answering artillery could make one realise that war was so close at hand.\n\nWe were roused from \nour\n game of cards on the night of","19":" by the sonorous banging of the gas alarm. Our helmets were soon adjusted & we could see & hear that activity extraordinary was in progress on our sector. Flares made the night like day & the roar of bursting shells & answering artillery, the crack of the rifles & the rattle\n\n & laugh of the M.G’s. came plainly through the stinking but protective texture of our helmets. No gas however came, but hundreds of rumours. It evidently was a little German Strafe of unusual violence, a proved later by the casualty lists\n\n(This was attack of German patrols on","20":" Brigade –","21":" Battn losing 2 M.G.s – 2 Trench Mortars & prisoners – reported in papers","22":" in German & British communiqués).\n\nThe week following on this was one of great quietness on the sector. There was a little aerial activity & occasionally a shell dropped \non\n near the billet where the MGs lazed away the long spring days.\n\nOn","23":" we left the reserve billet going by a night march to Sailly-sur-le-Lys. This is an insignificant village situated on the River Lys. It was held by the Germans during the first two months of the war but the reprisal took place","24":" by the British. This however was done at the expense of the church which edifice is now partially in ruins. The tall square structure of the tower battered but majestic still stands, a haven for nesting sparrows & a source of admiration to the troops.\n\nOur time was spent on gun drill & marches through the country lanes. There was little excitement. Unusual German aircraft activity was exhibited during the first week & on Tuesday night","25":" the Germans delivered a very heavy bombardment against our lines. Our artillery replied, but nothing resulted save the usual casualties & rumours.\n\nOn","26":" Mr Wm Hughes Prime Minister of Australia addressed the troops, but he failed to raise much enthusiasm as his arrival had been delayed & \nall\n by the time we marched off all estaminets had\n\nclosed.\n","27":" saw us again on the move for the trenches. A soaking steady rain fell as we marched in making the foot-hold on the duck-boards very unclean & as usual stirring the unboarded trenches into a gummy slush which adhered to everything it touched. Everything was very quiet. The German lines at this point were from 250 to 450 yards apart & grass a yard high mingled with the mangled stumps of trees & the wire entanglements in the intervening \"No-mans land\".\n\nOur artillery on the","28":" aggravated Fritz to the extent that he threw over a dozen or so coal-boxes which made an awful noise & and scattered a few loose sand-bags but did nothing further. However had he been allowed to persist at the game he may have rendered some of us homeless or at least \"dug-out-less\" for the night but our light field guns & quick firers began to play havoc with his parapets he desisted. As the afternoon cleared off there was considerable aerial activity both our A.A. Guns & the German’s – but particularly the latter’s – wasting hundreds of shells & covering half the sky with a canopy of shell-smoke.\n\nThe","29":" saw further activity in the artillery line. Our guns & mortars began to spread German sand bags over the landscape, continues for a few minutes quite unopposed. Then the answer came by way of a rifle grenade, whizz-bangs & and heavier shells. This was kept up for the best part of the afternoon but very little damage resulted.\n\nThe Glorious month of June – Summer 1916\n","30":"\n\nThe Effect we Hope For\n\nOur artillery further annoyed Fritz on the","31":" & during the night he had another shock. At 10 oclock (PM) the loud bomb explosions began to reverberate through our lines & on standing to we perceived the \nuneven\n space dividing our trenches from the Germans was left as bright as day by flares while machine guns rattled & rifles cracked & bombs crashed intermittently. It was our bombardment keeping the German sentries awake. Looking over the parapet we saw on the German front for about 100 yards a dense cloud of fumes & dust rising in the light of the flares. As each new bomb burnt a fountain of earth & parapet flew upwards & the Germans failing to root out their tormentors by means of machine gun & rifle fire sent their red & green flares streaming skywards as an appeal for artillery aid. It came in the shape of shrapnel which gave our lines a good peppering & with a final salvo from our howitzers, the night resumed its normal conditions.\n\nThe following day","32":" saw considerable artillery activity, & at night our guns aided by numerous trench mortars delivered a sharp & short bombardment against the trenches opposing us. The Germans replying sowed our lines with shrapnel but a raiding party managed to get into their first line capturing six men & one Machine gun, returning with two men slightly wounded as their total casualties. \n\nAfter a week of rain, cold & slush the wind veered in the","33":" to the north & the sky cleared. German patrols were beginning to get rather audacious. On the","34":" they sent one of our bodies in with 5 men peppered with bomb splinters. As a result several patrols watched our front on the","35":" The usual machine fire whipped our parapets with unusual violence. At stand to it was that covering fire for these patrols. At dark this died down & the sentries watched for the approach of a hostile body. We has been watching with the M.G. to sweep the track along which the German ration party could usually be seen moving & had just taken the gun down when some seven or eight bombs burst along side of us. Luckily no one was hit, neither were the German bombers for although we could see them bolting right in our field of fire we were unable to fire owing to our own patrols being in front. The party returned later & landed several bombs in our view. A heavy bombardment was carried on opposite Armentieres & about ten thirty the banging of bullets empty shell cases & the noisy blare of the horns proclaimed that a gas attack was being launched. It failed however to reach as far as us & we again stood down at 1 AM.\n\nThe following day saw a good deal of bomb activity, several of our men being shot by the bombs from the German Minenwerfer.\n\nWe secured a good target on the evening of the","36":" for the M.S. Watching the section of the trench where the German trucks sometimes come within view of our lines we saw about sunset a lorry loaded with cases & pushed by several men approaching the open space. One of the sentries firing caused the men to crouch low but nevertheless we obtained a fair target. On the first burst the truck stopped dead, & the men dropped out of sight so that we finished the magazine into the cases, The trench mortar was sent for & after a time the truck began to move forward again. A second magazine brought it to a halt in a good position. The first bomb landed well \nto\n into the trench but to the left of the five others which landed only one fell near the target. It was then too dark to continue so the truck splintered a good deal by our bullets was left to resume its way. At 12 oclock our guns began a furious bombardment on the German position on our left. The constant burst of gigantic shells flares & signals of various kinds & colours formed a most majestic spectacle while the crash of bursting bomb & shells & the growl of answering artillery was terrific.\n\nA gas alarm sounded with it usual clangour of bells & shell cases & blare of horns caused a stand to on the","37":" It was being used on our \nright\n left & we could see the gas going over by the light of the flares in white dense drifts. Nothing however took place on our direct front. The","38":" saw considerable artillery activity as indeed it had been since our\n\nentry into the trenches. On the","39":" however Fritz peppered our corners with \"whizz-bangs\" & high explosive. This knocked our parapet in pieces towards the heavens , smashed in duckboards, knocked corners off dugouts, made a \nterrific\n terrific row but killed no- body. That night we went out to reserve billets in Fleurbaix. This rather once flourishing little town is now a straggling battered collection of houses, where the German vents his fury if anything in the nature of a reverse takes place. The houses looped-holed barricades & mined are prepared for street fighting in case of a German advance. On the outskirts is the church a once imposing edifice but now a mass of ruin. Shells & bullets have smashed through the walls & roof. Images of splendid workmanship, bas-relief & mural decorations are smashed & battered or lie ruined the brick-strewn floor. The organ smashed by a shell to matchword \nlies\n hangs into few remaining pipes over the gallery railing while the magnificent stained glass windows are \nsmashed\n hand broken & blackened. The tower with its monstrous bell still stands in \nfair\n fairly good order. \n\nOn the","40":" we left at 10 P.M. for fatigue to the trenches. This consisted of taking up some two hundred of more to the firing line. It had been raining all day as usual . The rail road, a wooden one, difficult enough to negotiate in dry weather with a truck was a slippery mire. The truck wheels clung to the sodden rails & ones feet either sunk\n\ninto puddles a foot deep or caught under the iron sleepers. To make matters worse the trucks would occasionally slip clear of the rails, thus holding up the whole \"train\" & and necessitating the unloading of the truck. Rain fell steadily the whole time & in the darkness rendered more obscure & confusion by the intermittent flashes of the flares men would occasionally fall into a shell crater of in passing over the \nsmall\n boards acting as bridges, plunge headlong into a rushing stream. Bullets from enemy machine guns played continually around the line. At best we suffered no casualties other than a couple of sprained ankles. Despite \nthe\n all this there was very little grumbling. It was to use that the popular term \"backsheesh\" for the Hun & nobody minded a bit of overtime.\n","41":" the first load of - to be used by the Australians in France was brought to the firing line.\n\nDuring the following week German long range artillery put some big shells into the billets of Fleurbaix accounting for a few casualties.\n\nOn","42":" we left Fleurbaix during one of the usual nightly bombardments. A few shrapnel shells landed in the village but we reached our billets near Sailly safely. Here we remained for a week in a perfect turmoil of rumour.","43":" we set out to our old billets neat Outersteene arriving there at about 10.30.\n","44":" we marched to Bailleul \nto the\n Railway Station entraining for the Somme where the \"B.P.\" was in progress at 11 PM. Early on the morning of the","45":" we reached the\n\nvillage station of Candas in the Dept. of Somme. Marching about eight miles we reached the reserve billets at Domart-en-Ponthieu a little village nestling in a most beautiful little valley. Small copses of larch, beech & spruce in full leaf were scattered over the gently sloping hillsides down which the road with its avenue of line trees twined. Fields of wheat & oats interspersed with blaze’s of poppies rose in terraces from the clear brook which ran through the valley.\n\nDomart-en-Ponthieu is a rather ancient village with a queer church commanding a view of the valley perched on the hill-side. This edifice is some 900 years old, & of an architecture quite unique though it probably is of the Roman type.\n\nLeaving Domart at 9 oclock12th July we marched some 7 miles southward\n\nto the straggling town of Vignacourt. This town is situated in the centre of a wide undulating plain resembling somewhat the New England plains. In all directions rose the spires of the various churches, in the direction of which the white roads twined through green & waving fields.\n\nMany regiments Colonial & British are quartered here in reserve behind the firing line where the Allied offensive is in progress. We are, however, likely to remain out for a good time before taking our place in the great struggle around Peronne.\n\nWe rested at the wrecked town until 1 oclock on the","46":" when we \nleft\n continued our march. Passing out of Vignacourt across the plains yellowing with the ripening crops, we reached the town of Freselles. From here we marched through Bertangles arriving at the wattle daub\n\nvillage of Allonville with the city of Amiens smoking some five miles to the South. Here we put up for the night. Cannonading on the Somme battle front could now be dimly heard while convoys etc were passing & repassing on their way to the firing line.\n\nNews from ahead","47":" British have taken three villages almost unopposed & the Indian Calvary Division has gone through 7. \n\nWe rested in Allonville until","48":" The time for the greater part was monotonous. It was a miserable village with a few tired looking inhabitants. Nothing could be bought with the exception of biscuits & soap which brought abnormal prices. On the night of the","49":" an enemy plane squadron bombed the aerodromes in the vicinity of our billets causing a little excitement.\n\nLeaving Allonville on Sunday morning we marched to the town of Walloy. Here all was bustle. Men of a hundred British Regiments were quartered here resting or waiting to take their turn in the struggle ahead. Redcross ambulances & wagons passes to & fro; long lines of ammunition \nwaggons\n limbers & food & fodder vans, strung out in long queues along the white road to Albert; despatch carriers dashed through the mule trains on their way to & on their way from the firing line, where the rumble of guns sounded almost unceasingly.\n\nWe came in contact with many interesting figures during our stay. None liked to talk of their experiences during the battle. Most of them \nwere the\n belonged to Battalions who had been decimated during the advance, but who spoke rightly with pride as they detailed \nthe\n how the various attacks of the crack Prussian & Bavarian Regiments broke before the steadiness of the \"contemptible little army.\"\n\nWe marched from Walloy at 4.39 P.M. \nof\n on","50":" reaching the town of Albert, at about 6.30. The whole of the town is practically in ruins including the beautiful church on the top of the tower of which the brazen statue of the Holy Mother, its footwork shattered by a shell clings in a diving position over the street. Marching in through countless numbers of batteries we \ntook\n arrived at the head of the communication trench to the old line just at dark. Here we took our guns from the limbers & carried them forward. As usual we took the wrong road & had advanced about three miles over the old firing lines before we discovered our mistake. There was nothing to do but return & this was no pleasant job what with our heavy & awkward loads & the shells bursting continually on the road. However we got back & and lay down for a little rest while our O.C. went to look for the route the Brigade had taken.\n\nA guide was found at about 6 A.M. on","51":" & we again started. The freshly made road lay over the country where some of the most severe fighting had taken place. The original German line was almost levelled. Barb-wire lay strewn about, unexploded shells, Mills grenades, equipment rifles both German & British, limbers & clothing were scattered between the lines where \n\nthe earth was scared and blackened by the ceaseless rain of shells. Here & a body sometimes a German lay half covered in the debris waiting to be buried. Here and there a huge crater showed where some important works had been blown up. A few twisted rails & blackened sleepers marked the position of the German heavy railway while now & again an enemy howitzer or gun spoke of the trueness of our artillery fire. We occupied an old German communication trench to the left of Contalmaison. The Germans were situated in what at one time was a fair sized village but which now under the hail of shells which fell ceaselessly upon it nothing but a blackened waste amid which the scarred stumps of trees shorn of limbs & foliage reared themselves, for all the world like so many scarecrows. Lying both between our trenches & on \"no man’s land\" were numerous blackening corpses both \nBrit\n of British & German – the result of the last attempt to take the wood.\n\nAll through the 20th & ","52":" our guide kept up a constant bombardment on the village. Shrapnel rained unceasingly, while the High Explosive tore up the ground or flung bricks on great trees skywards like as many feathers. At night German artillery replied with heavy shrapnel, but never a rifle shot \nbroke\n came from their trenches.\n\nWe received instructions to take their first line on the night of Friday 21st June, but after making every preparation this order was for some reason or other countermanded\n\nHowever on","53":" definite orders were given to storm the village at 12 P.M. The usual bombardment was kept up all day & at about 12.10 we went over. Simultaneously our artillery opened a \n\nbombardment of unusual severity. The Germans knowing something was toward replied & the intervening space between the two lines became a perfect tornado of bursting shells & flying shrapnel. We advanced to the edge of the wood crossing the first line. It had evidently been vacated for some time for nothing but German dead were in occupation. From here we again went out into the clearing. By this time all battalions were mixed up & \nas\n owing to the quick advance, our artillery had not lengthened its range so that both it & the enemy’s was thinning out our line.\n\nHowever a second line was quickly formed which on entering the wood took the German second line of defence, with a good number of prisoners. From here we pushed to the outskirts of the village where we dug in, There were a good number of Germans in the village, but\n\nowing to the fear of a counter attack we were forced to allow them to escape. During Sunday","54":" morning we were harassed a good deal by snipers but made up for this by plenty of good shooting at the Germans dodging about among the ruins. Included among the booty captured were two 9 inch siege guns & a couple of field pieces. The ground taken was to a depth of 750 yards on a front of 1 ½ miles which included the Germans first, second & third lines of defences. We suffered heavy casualties but these were more than paid for in German blood & prisoners.\n","55":" the German artillery gave us particular hell in the advanced position. All throughout the day we lay cramped in the narrow trenches while the high explosive & shrapnel tore away our parapets or peppered the shell from the ground. To complete the day they sent over a lachrymatory shell. The gas having \nthe\n usual severity on the eyes.\n\nEarly on","56":" the 4th Battalion attacked the new German line their bombers either killing or taking prisoner all Germans who did not succeed in escaping. This completed the final act of taking Poziers which had so long defied the attempts of our army. Included among the captures were six machine guns & a field battery.\n\nThroughout the day the German heavy guns levelled our trenches completely with the ground \nfurther\n extending operations later on our position in the newly captured lines. We lost very heavily during this bombardment & when \nwe\n our battalion massed in the old German fort in the rear of our lines we numbered about","57":" of strength of six days before. Of these casualties 400 were wounded & the remainder killed or missing. We got safely out on the \n","58":" & we went into bivoauc outside of Albert. By easy stages we reached our rest billets at on the","59":" at Pernois passing through Herrsart & Bonneville.\n\nA number of us received orders to attend the M.S. School near Boulogne on the","60":" Leaving Pernois-Hallory we \npass\n entrained at Acheux near Albert on the","61":" reaching Etaples at about 5 P.M. the same afternoon. From here we marched to the camp at Le Touguet situated near the sea, the camp is situated on the edge of a pine wood on a small sandy glade which runs down to the sea shore. Representatives of every regiment British & Colonial were in camp. The Tommies proved a rather lively lot quite different to what we had been lead to believe they were. Most of them were direct from the Somme & the rest was greatly appreciated. \n\nThe fashionable watering place of Paris Plaza is situated within a few minutes walk of the camp. It consists of a collection of fine houses, edging a beautiful esplanade. The beach \nwhich is\n runs for miles along the coast & every afternoon is the scene of much bathing.\n\nThe class ended on the","62":" – Thursday & we received orders to return to our battalion on the","63":" Entraining at Etaples we returned to the Detail Camp of Telmas on the","64":" The same afternoon we rejoined out unit at Rubempre marching to Harponville billets on the","65":" From here we marched to the outskirts of Albert & bivouaced in the rain for the night of the","66":" The firing line had been pushed further to the north & German shells could be seen bursting in the distance on the ridge where the firing line of June had been situated. The first train for two years had entered Albert on the","67":" & the trains could be seen\n\ncrossing the plain at intervals. We shipped up to the trenches in the ruins of La Boisselle. This village is nothing but a pile of broken brick & stone. Of the church only a vault now remains & each shell crater marks the grave of a British of German soldier.\n\nOn","68":" German planes showed a good deal of activity. One was brought down in flames by one of our Battle-craft in our lines. For the best part of the descent the Hun pilot steered the plane which shot like a comet from a great height. However nearing the earth, the flames evidently overcame him the vessel crashed headlong down.\n\nWe remained in supports until the","69":" going up on fatigue each evening. Pozieres is desolation in the extreme. Shells of every calibre continually bursting in the ruins add to the destruction caused by the British bombardments. Huge craters of great depth lie between heaps of pounded earth which look like mountains rising among the splintered remains of the wood. Dead, mangled & nothing be about among \nthe ruins\n broken rifles & equipment.\n\nThe communication trench battered out of recognition \nnow\n is now on a ridge instead of in a hollow & along this one is chased by German \"whizz-bangs\" & coal boxes. The whole line is strewn with battered corpses, equipment, rifles, rations & water. How anyone ever reaches safety in the front lines is a mystery. Wounded men are forced to struggle miles to safety to the dressing station & with \nthe\n any serious cases requiring the attendants of the S.B’s. it takes about 3 hours to reach Pozieres.\n\nWe marched in easy stages to Doullens from Albert on the","70":" & left the latter town on the","71":" by train arriving at Popeninghe near Ypres on","72":"\n\nWe were camped in the St Lawrence Camp situated about three mils from the ruins of Ypres & a mile or so from Popeninghe. The latter is a fair sized town & is prospering under military regime. The country around is covered with hop fields already in flower & to the N.E. over the tops of these shows the ruins of the once famous Cloth Hall. It rained as it only knows how in these parts. On the","73":" & on the","74":" we made another move for the line. We took trains to the outskirts of Ypres & at dark entered the city, or rather the remains of it. Not a building is left intact. On each side of the wide cobble streets the \n\nDeserted ghostly structures stand as grim witness ‘s of the struggle which has been waged here for two years. Ypres, once the prosperous community of southern Belgium treasuring in the Cloth Hall some of the most valuable works of art in the world was thrown into desolation in a few days under the battering German artillery. Half their population is said to have been killed during the terrible period. Of the famous Cloth Hall all that remains are a few charred walls, perhaps the buttress of a tower & huge piles of blackened & fallen masonry. Little one thinks that when a few years ago he read of the glories of this building that he would live to see it in this state, its treasures lost or scattered & its towers & arches mangled by the side of the streets in heaps of broken stone.\n\nContinuing through the silent streets we crossed the Yser Canal, where \n\nduring the fighting of the early part of the war the British had more than once prevented the Germans from crossing. Passing through the ruins of Zellebeke we soon reached the fire trench. This was in an awful condition owing to the late rains & the mud squelched around the bed in a quaking quagmire, reaching well over the knees. Everywhere was still almost as death & despite the fact that the trenches are only from seven to twenty five yards apart no bombing takes place or at least has taken place, or at least has taken place lately. In fact it seems to be an understood thing that their sentries must not snipe ours, or ours theirs. This then is Ypres \nwhich if\n on the","75":" How vast a change from \nthe\n last June & preceeding months, when the bloodiest battles of the western front have taken place. On our right \nfront\n is the famous Hill 60, now in possession of the Germans. It is a hill no longer but just one section of the picture of desolation here about. The country is a waste of craters & tangled were protected French of the remains of woodlands & the ruins of villages & farm houses.\n\nA ll day no sound breaks the silence save an occasional salvo from our guns, the crack of a sniper rifle or the crash of the German minenwerfer.\n\nThere is plenty of opportunity for sniping. The enemy at a range of 25 yards can be seen continually at work in his lines, or even asleep in his dugout. But there seems little inclination on the part of either us or our enemy to make things hot.\n\nOn the morning of the","76":" while on post watching the Huns building a machine gun position I was seen by two of the Saxons, who were baning against their parados discussing probably the fate of Ypres as they continually pointed to the\n\nspot where the ruins of the Cloth Hall reared itself among the piles of stone & brick which marked the position of the city. They immediately ducked down & a short time afterwards grinning faces appeared like so many rabbits right along their parapet. Although I made a good target no shot was fired & one of the first whom I had seen saluted & waved to me. These actions they kept up for some time until \nthe\n evidently on the appearance \nmust\n of an officer they all disappeared. This is the Saxon.\n\nBut we got a little more of the Saxon on the","77":" Early in the morning a tremendous explosion shook all the sleep from our eyes & caused us to \"duck\" round the corner of the traverse.\n\nIt was an oil can & bomb fired from the \"minenwarfer\".\n\nThese are clumsy looking affairs filled with a large quantity of H.E. bursting with a terrific report & and sending showers of burning phosphorous - the Germans latest weapon – streaming with scraps of iron, in all directions. Should they land in or near the trench their distinctive power is quite in keeping with their \"bark\". Not satisfied with these Fritz sent over numbers of the ordinary shell bombs \"dumb.bells\" & aerial torpedoes.\n\nFrom this period on the evening mortars gave us a bad time until we were relieved on the morning of the","78":" We then proceeded to our rendezvous at Lille Gate at Ypres & from here we were taken to out billet in the Hospital of Notre Dame which lies on the northern side of the square within sight of the ruins of the Cloth Hall. However we did not remain long at this place shifting the same night to the Zellebeke Lake dugouts. This was until the","79":" the centre of fatigue operation to the trenches when we \"evacuated’ – going into the Railway Reserve Line.\n\nOn the evening of the 13th we went out to the\n\nMachine Gun Section\n\nFatigue ","80":"\n\nNo 9\n","81":" Sarg 18 men of M.G.S. Report to Lieu McBride or rep at corner of Observ Ridge & Knoll Road at 20.45. \n\nWork repairing firing line at Nr Sorrell. Sgt Barker \n\nParade at 8 oclock\n\nMen to go\n\nSgt Barker + B\n\nPte Gilkes\n\n Simmons\n\n Bissill\n\n Bayley\n\n Scott\n\nLcpt\n Williams\n\n Boyd\n\n Rose\n\n Graham\n\n Grant\n\n Gardiner\n\n Pownall\n\n Hunter\n\n Hutchings\n\nLcp Agate\n\nPte Wood\n\n Dight\n\n Clutterham\n\nOttawa Camp – Here the usual camp routine was carried out & on","82":" we held our annual Sports at the Gas School.\n","83":" we left for the trenches (Gender’s Gap) to the left of Hill 60, taking over the the","84":" Battn on","85":"\n\nOur line here is situated on the edge of a shell battered forest. Great activity in the trench mortar line prevails but Fritz seems to have very few guns.\n\nOn the night of the","86":" after a fierce bombardment with trench mortars & shrapnel the","87":" Battn raided the enemy line on our front. Killing seven & gaining a good deal of information.\n\nOn the","88":" we were relieved by the","89":" Battn & went into Reserve at the Chateau Segarde. For the night we were billeted in a little shell torn chapel on the edge of the grounds. By moonlight the place presented a most beautiful scene. In the centre the little lake surrounded by century old oaks, the whole chateau, battered by shells, looking smart enough in the half light. However we did not stop long here shifting round to a new position in the reserve trenches. Here we remained until","90":" when we returned to Ottawa Camp.\n\nFrom here we marched to Steenvoorde in France on","91":" crossing the border near Abeele. Sunday saw us en route to Arneke passing as we went the town of Cassel. This is the most beautiful little town for standing as it does on the summit of a hill, it overlooks the green undulating plains which clothed in the dark green & yellow of early autumn stretch out in all directions.\n\nOn","92":" we set out along the road to St Omer, passing Fort Wathen, now practically in ruins, at about mid-day. The fort commands a wonderful stretch of country. For miles it\n\nStretches out one \nlong\n wide sweep of hedge, canal, fields & road. Our destination was Bayinghem & here we remained until","93":" when after marching to St. Omer we entrained for a destination of unknown name. However the following morning we awoke from a cramped sleep to find the fields snowy with frost & that we were about to detrain at Longpre . Marching about six miles from here we came to our billets at a village near Etoile. About twelve of us left with the transport en route for the front at Albert \nthe\n on","94":" & after passing Picquigny & Flixicourt reached Argoeuves \nof\n about 5 miles from Amiens.\n","95":" saw us again on the track & after some four miles we passed through Amiens coming out on the main road to Albert. This road was thronged with \ntroops\n transports passing to & fro & with German prisoners working at drainage work. At dark after a march of some 35 kilos we ‘arrived in the ‘ city of Albert. The lights of the various camps resembled a large city while roads were just \"a –chock\" with traffic which rendered it most difficult to make headway. However after numerous stops we reached the battalion camp on the captured ground of Friecourt.\n\nThe following morning we again set out. The rain which had fallen steadily all night caused the roads to be beaten ankle deep in mud. Progress was necessarily slow – so that we reached Marmetz at about 4 P.M. the scene from the woods was wonderful. On all the hills, in the rain, both infantry & calvary were \n\nBivaouced. In the hollow where the road was marked with a river of slush, feet deep, transport, horses, mules & artillery passed in a \nswiftly\n hurrying stream. Here & there a water tank or limber either bogged or smashed held up the \nhurrying\n stream. When night fell, the twinkling lines resembled some great city. Men huddle under sheets of tin or tarpaulins, others less lucky lay down in the mud or walked up & down swathed in blankets & great coats to wait for the dawn.\n\nAlthough the","96":" dawned clear it again commenced to rain early. Dozens of planes went up but even these withdrew as morning advanced. The same lines of transport passed to & fro. These excited a good deal of anticipation & little wonder. Two roads junctioned at the foot of the hill where the brigade bivoauced. The bottom road solid enough though covered with slush was seething with transport. Limbers, water carts, ammunition wagons mingled with pack animals loaded with shells. But on the road branching up the hill was where the excitement occurred. A limber laden with shells & pulled by some six or eight horses woefully charged up the slope over knee deep in sticky dough-like mud & shuddered here & there with \nholes\n hidden holes. The wagon would suddenly drop onto one of these craters & the horses checked in their stride would \nwould\n sprawl forward\n\nsending rider & drivers head long into the mud, After a struggle the men would right the horses & if the wagon could be extricated the limber cart would be unlimbered & the horses struggle away leaving the derelict settling down in the quagmire. Other teams would rush on behind & by lucky chance may fight their way through. Thus the ceaseless procession went on.\n\nRain cleared off on the night of the","97":" & there was in consequence great aerial & artillery activity. However the wind changing again brought up cold \nwind\n rain.\n","98":" we received orders to move to the line & in consequence set off at 8.30. Rain still continued to fall & by the time we reached Delville Wood we were in a soaked condition. Here we bivoauced for a couple of hours building shelter & lighting fires. At about 4 P.M. we moved down the road to Fleurs passing en route numerous howitzer batteries on the edge of the wood. The road was heavy with mud & progress necessarily slow. Here & there broken or disabled transport wagons lay foundering in the slush by the road side, while in places mules & horses struggled in hidden craters.\n\nAt dusk after an exhausting march we reached the sunken road near Fleurs. Passing into a communications trench it was soon evident that we were lost – as usual, so that a halt was called. Near by this place lay the ruins of one of the tanks – Having evidently been disabled \n\nthe Germans artillery had vented its wrath on the much feared monster so that now nothing remained save the battered frame work. A guide was found & scrambling out of the trench we scrambled on towards the distant flares. Men slipping fell headlong into pools of mud & water. Others bogged & had to be helped out. Eventually we reached a dry trench & say down for an hours spell. Then after, a further two hours struggle we reached our destination in the front line about 12.45.\n\nSleep being an unknown thing in this part of the line, the remainder of the night was passed in watching & shivering. With dawn reciprocated bombardments commenced our guns keeping up a heavy thunder all the day. Rain fell heavily in the afternoon, filing the trenches with water & causing the holes in the sides graced by the name of the \"dug-out\" to cave in. Parpaets toppled in upon the water caused a thick mud knee-deep to be soon beaten up. Night fell with the men in the line wet & half-frozen & in this condition they remained until dawn of the","99":" Fritz here commenced a rather heavy bombardment in reply to our guns & this was kept up intermittently throughout the day. About 4 P.M. the sky cleared & there was great aerial activity on our side. \n\nHundreds of our planes were up the whole air seeming alive with the buzzing.\n\nAnother miserable night was passed & we were relieved on the morning of the","100":" After wading waist-deep through the accumulated mud\n\nin the communication lines we reached the sunken road to Fleurs. Here a tank lies having been put out of action by a direct hit from a German shell. This evidently set fire to the engine & the crew met a terrible fate as the remains show.\n\n We arrived at Delville Wood at dark & for the first time for three days & nights were able to change our wet sox & boots & be down.\n\nWe rested at Delville Wood until","101":" when we again shifted up & in the vicinity of the line relieving No 1 Gun on the following Wednesday. The trenches owing to the continual rains were worse in mud \nof a\n than on the previous occasion. German artillery was exceptionally busy on the night of the","102":" & early on the morning of the","103":" as a prelude to a days heavy bombardment our light batteries set up a heavy barrage on the enemy line. The air seemed full of the rushing & bustling shells which burst so rapidly over the enemy line that he found it difficult to keep flares alight!\n\nWe were relieved on the","104":" & struggled out to our bivouac at Bonife (?) Wood (Bernafay). Here I was removed to hospital in Rouen arriving at No 12 on the race course on the","105":"\n\nArrived back with the Battn on","106":" Resting at Flesselles. Move to Ribemont","107":" Weather extremely \n\ncold, frost & fogs.\n\nWe remained at Ribemont until about the","108":" when we shifted to Melbourne Camp in the vicinity of Fricourt. The weather continued wet & cold & a light fall of snow was experienced","109":" we again moved up to a camp near Longueval. The usual & knee deep mud was on this occasion frozen hard as iron & while one was able to keep food dry the cold accentuated by a light fall of snow was intensive. Rain again set in on the","110":" that when we moved from the line (near Geudecourt on the","111":" mud & slush were again the prevailing elements. Fritz gave us a warm reception shelling us the whole way in & when we finally reached the supports at Bull Run the German artillery kept up a lively barrage through out the night.\n\nOn Xmas Eve we went up to relieve No 1 Gun in the front line 2.30 P.M. We were in safely & with all fairly quiet. Stan to 4.30 everyone agreed it was the quietest Xmas Eve they had ever experienced. All were of a very different opinion when about 8.30 German artillery opened with fury on our lines. A bombardment of quite Pozieres like violence was carried out for about 20 minutes & as we crouched low in the mud our opinion on quiet Xmas Eves changed. Rain set in on Xmas morning & when day dawned & showed a very sorry group in a water logged trench. Rum rations did not serve to rouse the sagging spirits. Cold feet (properly cold) take a lot of rum to eliminate. Soupy like warm tea arrived at about 8. The morning was filled\n\nin singing hymns & sniping at the opposing Germans alternately. The wind was bitterly cold as it swept up the trench. After a slice of bread & quince jam for dinner we stood up in the trench to listen for shells & to gaze disconsolately at the bleak desolate ash heap of Geuedecourt. One of the team was struck in the stomach by a piece of shrapnel from a whizz-bang. This relieved the monotony a little. At tea time comes hot stew from reserve. It was brought up by a fatigue party of about 20- strong. Fritz enjoyed himself wonderfully sniping at the party accounting for one casualty. The primus stove which had \nreduced\n refused duty all day was at least coaxed into action & a dixie of coffee & milk (Nestles best Milkmaid Brand) was made. Then add to this a little delicacy \nby\n in the way of a little plum pudding - \n\na present from some person or persons unknown – was partaken of. This finished our Xmas supper & we settled down \nfor\n once again for our long nights vigil. Xmas Day 1916 was battered into a thing of the past by our heavy batteries. Fritz was silent so we passed a fairly quiet night. We were relieved at 2.30 on Boxing Day & struggled out to supports to find that we had again suffered fairly heavily in the line of casualties – four men being wounded out of 13 – two seriously. One reported killed, one of the finest specimens of manhood that ever stepped into Rank is gone. Unless one knew him it would be impossible to realise the waste. His loss will be generally felt throughout the Battn.\n\nWe again went into the lines on the","112":" putting in a most miserable night in the rain. The following day, cold & dreary, Fritz made the post rather warm by shelling it with whizz-bangs. One landed almost on top of us but fortunately did not hit anyone although shrapnel was scattered all round.","113":" relieved & we struggled out into Bernafay Wood where we remained for 8 days shifting per train to Buire & then to Ribemont where we landed about the","114":"\n\nOn","115":" we marched to Contay where we remained until","116":" January, when we shifted to Becourt Camp. The snow which had fallen on the","117":" still remained on the fields hardened by nights of continuous frost. Over this the wind arctic in its intensity blew dead against us, as we marched over the old road across the plains round\n\nAlbert.\n","118":" we left Becourt Camp en route for the line. The day was bitterly cold & the roads frozen hard as iron were slippery as glass. Shell craters ere frozen sold & when finally we \"slipped\" off the road on to the tram line leading to the ruins of Euacourt L’Abbay. The countryside with the columns of men filing silently across the white valleys in the weird moon light, looked like some scene in the Antarctic, At about 8 P.M. we relieved \nin\n the D.L. I. in supports. These supports are the strangest I have ever had the pleasure of being in, inasmuch as they are the cloisters of a famous monastery. Since the expulsion of the Germans they have been occupied by our troops, & in the various passages, a fair number of \ntroops can\n men can be \nplaced\n housed. Here under the massive brick arches one is safe from shell fire although at one point a \"heavy\" has dropped through. Mystic stones are attached to these vaults, such as secret passages leading into Bapaume &c. In times of invasions in olden days the monks & probat by people of the towns took \nto this\n sanctuary in the vaults & with the supply of pure water always on hand & it would stand a\n\nfair siege\n","119":" the miners sapping in search of the \"secret\" tunnel broke through into it but no further news was forth coming. Weather still continuing cold & on the","120":" the fine bright days of which we of the cloister saw but little, gave place to more snow.\n","121":" We relieved the front line. The light with the snow was almost bright as day. Frtiz’s snipers taking advantage of this. Thursday was shivered away without incident until just at dark when an artillery stunt began on the right. Fritz nervy as usual spread the S.O.S. down his line until the burst of his star flares on out direct front warned us to keep low. His bombardment began by a few whizz-bangs on our right, soon his heavies were flying dangerously close. They ploughed up the landscape on front of the parapet. His shrapnel bursting at the moment the shells struck the steely surface swept in consequence with greater impetus like a gale overhead. They skimmed the parapet & burst inches behind the parados. None however fell in the post & \na\n the bombardment eventually died out.\n\nAt about 12.30 AM on \nthe 20th\n Friday morning we were relieved \nto\n owing to the severity of the weather & went out to close supports for a sleep. We again relieved the front line during the early hours of Saturday & spent another day shivering in our post. We were relieved at about 10 P.M. & and went out just as Fritz was summoning a barrage on our life. He sent\n\nover some tear shells which did not take much effect as our eyes had been some what broken in through living in smoky dugouts. We reached Bazentin-le-Grand camp at about 1 A.M. on Sunday morning passing a rather cold night in a drying shed – the only accommodation we could find.\n\nOn","122":" we set out we C-Coy en route for the Div School at Tirancourt. We were marching in light order, so that the various shapes were by no means unpleasant. The first day we marched to Henenecourt Wood, the second at Villers Bocage & the third at our destination Tirancourt. While at Henenecourt we saw one of the many mysteries which give promise of issuing forth for the spring campaign. This was an aeroplane \nstan\n remaining perfectly stationery in mid-air. The engine was almost silent & when the plane eventually \"shoved\" off it showed remarkable speed.\n\nLa Chausee Tirancourt is a typical Somme village, lying on the edge of the sedges. It has historic surroundings. The village of Picquigny on the opposite side of the river are the ruins of a chateau perched on a beetling cliff. In this the famous Treaty of Rivas was signed.\n\nAbout a mile up the river from T is an old Roman camp built up in the river marshes & commanding a view of the river valley. From here one can obtain a rather fine view. Although the country is browned by the long winter frost there is yet a hedge of green in\n\nthe scenery. On each side of the river at intervals \nrise\n are the villages, each dominated by the imposing steeples of a church. Beyond the brown winter fields lawns rise to the undulating wheat lands beyond. On the river pools we have had some good skating but the breath of spring in the air about the","123":" freed the ponds from the thrall of King Frost. We rested in T. until","124":" when we got orders to return to the Bn Marching to Longpre we entrained & reached Albert at about 6.30.\n\nOwing to the withdrawal of the German foxes the cannonading had dropped far to the north, & when on the following morning","125":" we marched to Bazentin Camp we could see the effect of his retreat.\n\nRumour was naturally plentiful but the nearest we could get to news was that at Laucourt L’Abbaye where our battalion had been holding the line we had as yet \nfallen back\n advanced about 3 miles, meeting with little resistance. The Germans have retracted much further than this but our troops have to be exceedingly careful so that the advance is slow\n","126":" we set out for our position in reserve – Switch Trench lying between Fleurs & Laucourt L’Abbays, but nearer the latter. A few shells were dropped about wildly by the enemy whose planes, although there was great movement of troops seems unable to direct his fire. He was also dropping shrapnel along the Gravelliers -Baupaume Road, which when last we left the position was safe territory practically for his .\n\nRumour held it that one of our divisions was astride this road & the few flares which he sent up at night shows that he was well beyond this. One of our patrols was captured by him during the night of the","127":" & on receiving the news another body raided his outpost rescued the men & captured all the Germans in occupation. \nThey\n ","128":" we took a walk to the Butte de Warlencourt & thence round the German front line & supports. \nThere\n Once one has seen these there is no doubt whatsoever as to the reason why the Germans fell back. His line has been battered out of all semblance by our guns; dugouts have been blown in, & the whole country as far as the eye can reach to the back of the lines, is in a terrible state of desolation offering no decent pathways for bringing in supplies or taking out wounded. Hundreds of his dead lay about unburied while \nburying\n parties were burying our dead which had lain on no-man’s land.\n\nOn the night of 4-5th we again had a fairly heavy fall of snow which once more transformed the broken plains into smooth white stretches.\n\nTo Be Continued\n\nGANDER’S GAP\n","129":"\n\nMortar operations wrecking part of his first line caused activity among his working party. Stand down. Fired one magazine at party, dispersing it. Following this fired 3 ½ others during various periods of the night.\n","130":" ½ magazines – 200 rounds.\n\n"}}