{"Document Name":{"0":"Diary_0496","1":"Diary_0496","2":"Diary_0496","3":"Diary_0496","4":"Diary_0496","5":"Diary_0496","6":"Diary_0496","7":"Diary_0496","8":"Diary_0496","9":"Diary_0496","10":"Diary_0496","11":"Diary_0496","12":"Diary_0496","13":"Diary_0496","14":"Diary_0496","15":"Diary_0496","16":"Diary_0496","17":"Diary_0496","18":"Diary_0496","19":"Diary_0496","20":"Diary_0496","21":"Diary_0496","22":"Diary_0496","23":"Diary_0496","24":"Diary_0496","25":"Diary_0496","26":"Diary_0496","27":"Diary_0496","28":"Diary_0496","29":"Diary_0496","30":"Diary_0496","31":"Diary_0496","32":"Diary_0496","33":"Diary_0496","34":"Diary_0496","35":"Diary_0496","36":"Diary_0496","37":"Diary_0496"},"Date":{"0":"unknown","1":1605.0,"2":1606.0,"3":1607.0,"4":1608.0,"5":1609.0,"6":1610.0,"7":1611.0,"8":1612.0,"9":1613.0,"10":1614.0,"11":1615.0,"12":1616.0,"13":1617.0,"14":1618.0,"15":1619.0,"16":1620.0,"17":1621.0,"18":1622.0,"19":1623.0,"20":1624.0,"21":1625.0,"22":1626.0,"23":1627.0,"24":1628.0,"25":1629.0,"26":1630.0,"27":1631.0,"28":1632.0,"29":1633.0,"30":1634.0,"31":1635.0,"32":1636.0,"33":1637.0,"34":1638.0,"35":1639.0,"36":1640.0,"37":1641.0},"Entry":{"0":"\n\n \n\n","1":" Lavieville\n\nSlept well and almost unbrokenly, except for breakfast etc, until about noon. The General then called in for a talk and says that still identifications are wanted so after lunch I went up and endeavoured to organize a party to catch one. Offered 100 francs blood money dead or alive. The day was fine and quiet. Walked along Pioneer Trench and had a yarn with Kennedy and King. Back and saw Colonel James – a shrewd nut. While there BM. Bridges came and we argued. Then Harris of the Engineers was round. I put up a request for better cooperation between the Brigade Staff and the Engineers but the General was unsympathetic and did not agree. Our 6th flying pig fired a few rounds today under cover of a light artillery barrage. Matthews and others came up when the rations arrived and I took the former up the line and round the posts with me. A sniper has been annoying \"le vieux Major\" very much and wounded Sammy Dyest and nearly got Harricks. This devil has now killed and wounded a number of our chaps. Our snipers are still superior and captured Huns tell of losses sustained in their platoons. It was a pleasant walk round the front line posts. We called at all the company headquarters on the way. All our efforts to catch a Hun proved unavailing. He moves abroad very little. Returned to Barracks and there found orders for relief tomorrow night. Also a particulars of a minor operation of artillery & on our left but this turned out to be a very small affair and not at all worth bothering about.\n\n \n","2":" Did not get up until about 10 am and then went round the Trenches round the Bn H.Q.. Things were extremely quiet the whole of the day. The Battalion was relieved without incident by Colonel Dawson 25th and Colonel Duggan 21st \nwithout any incident\n. Returned overland to our Bn H.Q. this time located in a cellar reeking of potatoes and onions and there slept on beds brought from our other H.Q.\n","3":" Walked round our positions here in part and had a talk to some of the men. The day misty and the enemy shelling a lot. A crop runs behind and in front of our trenches. The village of Lavieville was not being strafed today but 4.2’s and 5.9’s were falling in front and heavily plastering the Amiens – Albert road. Met Capt Coughlan of the Engineers and went round with him and with Major Dooley to set tonights tasks. The men had built bivouacs right over the trench with the result that they had completely destroyed its use for fighting. Plotted out L heads for the bivouacs and arranged for all the shelters and obstructions to be shifted tonight. The town of ALBERT is gradually crumbling into brickdust under the bombardments of our guns. The Holy Mademoiselle long since knocked of her perch. The once watered and macadamised streets of 4th Army H.Q. now are traversed by Hun soldiery instead of the dud equisites of an effeminate staff. At stand to bombardment and heavy machine gun fire on the left.\n\n \n","4":" Lavieville\n\nDuring the night the Hun dropped several shells very close at hand and one splinter went right through a threshing machine close by. There is a perfectly good farm wagon in the yard and I ordered a team of horses to be brought up to shift it away to the rear and save it from shell fire. The morning was dull and foggy and the outlook was blurred by the mist. Last night our working parties were kept busy nearly all night and we also bathed a company. My representations to the General regarding Engineering work in the Bde, have had a livening up effect and brought forth maps and a definite works policy. Took Stewart and made a round of all the companies in their positions. They have put in a great deal of work on their positions and made some very good bivouacs. On the right of our sector between there and the Amiens -Albert road there is an area of ground which has not been strafed at all hardly. Saw the different company commanders and found them all O.K. Paraded Sergt Major Jack Blackmore and put the acid right on him. I am afraid that he and Boxing Dick R.S.M. Porter are too thirsty for the good of the cause. \"A\" Coy’s rum reached them in a very diluted condition! After dinner a thick fog came up and hung round all the vallies. Inspected \"C\" Coy at stand to arms & found them all correct and alert. Jack Cowan & Billy Green marched in as new subalterns in the regiment.\n\n \n","5":" Lavieville\n\nHad a hot bath on getting up. The day is dull but not wet – the really cold days we seem to have left behind us. Received intimation of forecasted moves upon our relief here by Tommies. It looks like our being right into proper battling very soon. We go into Corps Support near Amiens itself and just at the rear of the very place that he must attack from. According to the papers he is expected to attack in a few days and we shall probably be pushed well into it by that time. It really is astonishing how little gear one can exist on. It is 3 weeks since I saw my valise – a small pack suffices for all needs hereabouts. Our wiring parties last night were not satisfactory and the reason no doubt was the darkness and wet and the fact that no reconnaissance of the job had been made by the Engineers. But in hand all preparations for the shift by getting Matthews on the job down below. Took Stewart with me and visited all the companies in their positions. It is astonishing what salvage can be collected one way and another. A Co send back a limber full last night. Passing up the track to \nthe\n Kennedy’s place we passed the scene of a tragedy. There where about 10 scattered equipments covered with blood and little nameless pieces of human bodies. Alongside a few rough graves. The Hun was putting a number of shells round our positions but\n\n \n\nnothing out of the way. The Q.M. came up with the rations. About 10 pm a heavy strafe began and much stuff from both sides was whirring overhead. At our village baths we managed to bathe two companies and to give them fresh clean clothing. I sat up and sent all the others to bed having in my mind to go out and inspect our wiring party. As the light was bad they did not go out on the job until well after midnight. The men have put in a tremendous amount of work on their trenches making new bivouacs. The mistake of building the shelters in the trench will not recur. They now cut an L or I head back from the firetrench to a depth of 5 feet and then cover the top with iron or board and wood. These little shell slits are comparatively safe and the men make themselves very cosy there. The two Coy H.Q’s that our men have put in under the supervision of the Engineers are quite good and ought to stop a 5.9. The occasional dud or the use of delayed action fuses puts the acid on fine reckoning though. The country is very lovely now and blossoms are showing on the fruit trees. Deep dark green and dark grey skies are the predominant colours. There is regular mist and some rain but the air is warm and you can almost hear things growing. The presence \nand\n of shells and responsibility put one off admiring the scenery. To wander round quietly in plain clothes in Springtime in times of peace and to walk this lovely land must indeed be beautiful. \n\n \n","6":" Lavieville\n\nDuring the morning an English Colonel","7":" London Regt. and some of his officers came up to make a reconnaisance with a view to our relief here tomorrow night. Took Thewlis and went around all the companies. Things were extremely quiet and during the whole of our journey we only had one shell near us. Found Colonel Duggan in his new big dugout under the road and stayed there talking for a while. Coming back topping the rise above Lavieville one gets a splendid view of Henencourt to Millencourt and over towards Warloy. Pleasant mild country this. The villages are rarely more than a kilometre or two apart and not a fence is to be seen anywhere. It only wanted the civilian life about to make believe that there was no War on but everything is absolutely deserted. Even the troops have to lie low and cling to the security of their trenches. Late in the afternoon we received an order regarding our move and Mills and Bourke together with Sutherland came in to get instructions. We live only from day to day and have no knowledge of what our movements shall be after Warloy. Most likely we shall be en route for Querrieu very few hours after we march in. At dark walked up and inspected the Coys at stand to arms. All standing equipped in their trenches waiting. One Hun battery was throwing over a few shells from an emplacement at the rear of Albert. Otherwise quiet complete reigned on the whole of the front. The smell of damp earth filled a quiet spring twilight.\n\n \n","8":" Lavieville & Warloy\n\nIn a salvaged bath had a splendid bath with plenty of hot water and my batman Charlesworth had also for me a complete change of clean clothes. Visited all the companies during the day and settled on the dress for tomorrow. Everything continued abnormally quiet & the men were strolling about outside their trenches and playing cards etc. At dark our relief arrived (21 London Regt). Very many small youths of 18 in this unit & it does seem a shame to put them at it so young. The relief was over very soon & we walked down to our horses. The streets of the village were congested with much traffic of men and horses and had the enemy shelled he would have made a good harvest. He did not shell probably because any retaliation would have got on to him himself in his own villages. My horse seemed in excellent nick and was tended by Murphy. A silent ride across country over grass and growing crops. The scene weirdly illuminated by gunflashes. The delightful and picturesque towns of Baizieux & Warloy are crammed full of troops and horse lines and camps disfigure what is probably one of the prettiest places in France. Arrived in the town we found our Band playing the companies in and were then conducted to a fine house where all the officers were put up. A good mess and pleasant to see all the officers together. I have a good room luxuriously furnished and lacking only one thing. Why these people don’t move their furniture I don’t know. If left it must unfailingly be blown to pieces by bombardments.\n\n \n","9":" \n\n Warloy\n\nIn the air this morning is a touch of summer and we were early astir to the waking sounds of our band. The house we are lodged \nout\n at looks from the street just the same as any other typical village house but evidently the people have been persons of some importance for the house is comfortably – almost luxuriously – furnished. Why the people do not shift their belongings is hard to say. Only five or six short kilometres away is abundant evidence of what will in time happen to this place too. Warloy was one of the most delightfully situated villages in the Somme. No mention of it would be complete without recalling \"The Belle of Warloy\" who was far better known on the Somme than any other woman on the British front. Her scarlet stockings, her afternoon teaparties and the crowd of visitors made her very well known. Entertaining of platoons \"the flag days\" were known to all the Army in these parts. This morning the village streets are full of troops. Such a mixture of units of our Force and thenTommies as well. Transport passing and repassing. All night long there was in the streets the sound of tramping feet as troops marched in from the trenches. A steady muffled tramp that recalls the same sound heard in many places in three years past. In Egyptian streets in old red Flanders and Picardy villages. A changing and endless flow on the highway of Death. It never ceases.\n\n \n\n2\/5\/18 Warloy\n\nLeft Warloy at 10.17 a.m. with the band playing. It was hot marching but the men stood it well. Our route lay through Vadencourt Contay Behencourt and Montigny. The country was, in looks, delightful and a sheen of green covered all the trees. Delightful dips and hollows in which nestle peaceful villages. The roads were busy with many troops and a lot of transport. Just outside Montigny we pulled up and had lunch. All the roads and bridges are mined. Some whippet tanks passed us going at a good rate of speed. They look comically like ships as they cruise along. Passed through little villages down towards Pont Noyelles. The drivers of artillery and other units are bivouacked on the terraces of the ground. Passed through Pont Noyelles and gave the men a spell before we swung into Querrieu to the strains of the Band. All our packs and valises were here awaiting us and all were soon in billets. Mine is a fine and comfortable room with a most elaborate bed and some daring pictures. Here again we have an example of a house full of good furniture abandoned to ruin. The people according to Leon Barbier are much upset about the way their places have been pillaged. One lady says that in 1914 the Huns came – they paid for all they took – now everything is taken and ruined without any excuse or compensation. After mess had a conference re our defence scheme. Our task is to C.A. if Villers Bretonneux is lost. An air raid being made on Amiens and many searchlights were concentrated about on certain sectors of the sky.\n\n \n","10":" Querrieu\n\nWent to Bde HQ at 9.30 am to attend a conference. The Chateau is situated in delightful grounds and is a fine place. The trees and the green open spaces make it very lovely indeed. Inside the Chateau has been partly denuded of furniture and one room was labelled \"Private\" and there evidently most of the best things were stored. The General and Bde Major ran over details and we then got our horses and rode down to the Somme. Crossed the river in a pleasant and pretty spot where pontoon bridges had been put across and made for Blagny-Tronville where we picked up guides. Another short ride soon took us to some ground from which the town of Villers Bretonneux could be plainly seen. Corbie was situated very prettily in a bower of green trees. The great importance of the Villers Bretonneux ridge was apparent at once as all our movement was quite concealed from the Hun except that he had one balloon up. Looking behind us in the blue we could see the outline of Amiens and the spire of its Cathedral standing up. If the Hun gets this ridge he gains direct observation right onto the city. This morning our people and the French tried a local operation which was not successful. Here at this point is the junction of the French and the British Armies. We rode right up in and through the 18 pounder line and right up to firing line Bn HQ\n\n \n\nat a chalk pit only 1200\" behind the front line. The ridge hid all our movement and there was no shelling. It is the first time that I have ever been able to ride up to the H.Q. of a line Bn. in daylight anywhere let alone on a front as touchy as this. Saw H. Crowther who is well. Their losses seem to have been light though heard with great regret of the death of Colonel McConachy who was with me at Flixecourt such a little while ago. We now rode over to Daours leaving Corbie right behind us and there we saw a crowd of civilian kiddies where a few families still hang on. The day was hot and everyone was feeling tired as we rode back into Pont Noyelles. After a late lunch I did odd jobs and listened to our Band playing – promoting the Sergt to full rank on the spot. Later on Leon Barbier came in for a yarn and to stay to mess with us. After mess I went up to Bde H.Q. again to attend another conference provided over by the General. He read an order from General Birdwood about our chaps disparaging the Tommies but orders will not stop it. The other three CO’s were also present here. Hun planes were over and dropping many bombs. A satisfactory method of dealing with air raids has yet to be devised. To make great play with searchlights and to frantically loose off many rounds of high explosive and shrapnel is to only play with the matter.\n\n \n\n4\/5\/18 Querrieu\n\nAt 9.45 all reinforcements who have joined up the Battalion since we were at Warmeloy were paraded under Green and inspected by . They seem not at all a bad lot of chaps and comprise a few jockeys who had joined the \"Sportmen’s Battalion\". I addressed them on esprit de corps and they then moved off under their officers and were played along the streets by our band. Returned to my billet and there picked up Murphy and my horse. First drew up a small tactical scheme involving attack and counter attack on some pontoon bridge at Blagny Tronville and sent off some officers to reconnoitre and write the orders. Rode along the road until I struck Smith and all his Lewis gunners. Stayed with them for a while and then continued on through grassy fields to St Gratien, on my left all the time was a splendid forest the Bois de Mai, in which all tones of green blended. Here and there were a few dark trees like pine on St Gratien the 3rd DHQ are located. Passed on to Molliens au Bois and found Capt Davis at his billet there with Kohn & Dundas. Our nucleus here have been having rather a bad time for rations. Where the officers are lodged is an old house of the usual style. The people are ‘convenable’. There are 3 daughters – none beautiful. In the mess was an old weaving machine and they explained that the old man was a weaver but lack of supplies prevented him from carrying on. The back garden of this house is beautifully trim and \n\n \n\nevery inch is sown and cultivated with some vegetables. The old man spends most of his time here. The outlook is very beautiful. Words cannot describe how this lovely land appeals to one in Spring time. Came back the same route and reached Bn HQ about 3 pm. Brown then came in to tell me that we are going to relieve","11":" Divn on","12":" in the line and that Lanyon is to be tried by F.G.C.M. on the 6th. Tomorrow there is to be a presentation of medals by General Birdwood at the Chateau. Had Stewart and Sutherland up and gave them a rousing up about the Adjutant’s work. The former is most unsatisfactory lately and am determined to take some steps with him unless there is soon a very considerable improvement in his work. The French people here speak in the most disparaging fashion of the English and run them down. It looks as if England will come out of this War without a friend. The Hun is expected to attack about the 8th inst. At mess our Band played very well and drew quite a crowd. A lumbering crowd of tanks went rumbling past along the road. A very pleasant and balmy evening and I spent it talking with first old Major Dooley and, afterwards, various others. A Sergt Mjr. told me that he is losing his nerve and \"I am not afraid of the Hoch but in spite of myself, my nerves are all of a tremble. It’s a bit of war weariness\". What is one to do in a case like this. The case is genuine – a splendid brave soldier – always to the front. Nerves can’t stand it interminably. The Army makes no allowance for a thing like this. \n\n \n\n5\/5\/18 Querrieu\n\nAt 9.50 moved the Battalion less 2 companies down to the Chateau grounds for church parade. It was a brigade parade and General Birdwood was delayed in turning up so the service went on without him. Later he arrived and presented medals to a number of men following with his usual speech so bluffy and characteristic. The Brigade then marched past to the time of the Bands. All officers then fell out and listened to a few remarks about reliefs etc. After lunch did writing, tried a couple of orderly Room cases and made a reconnaissance of a piece of ground for parade. After Mess Matthews gave a lecture on tanks and I followed. Then took 4 officers for a short talk on how to write orders. During the evening some of our chaps got at some wine and caused an amount of trouble. Strict guards were necessary. Sent out for DeBoos and had a talk to him. There was a heavy warm thunder shower early in the evening.\n","13":" The battalion paraded out in a grassy field and was drawn up in mass for the first time for a couple of months. Devoted the morning almost entirely to specialist work and our Lewis guns were firing away at a terrific pace into the bank of a road. Grives had men firing the new long range rifle grenades and \n\n \n\nthey seem to be very effective. Scouts observers and signallers were all on their own jobs round the field. The cookers came out and served dinners and our mess cart had brought out chairs tables and table clothes and we had an alfresco lunch on the grass. It was all very delightful. After lunch we put a good many more men on the specialists work and I had to stop the Lewis guns as they were sending too many bullets over. The battalion marched in at about 3.30 pm. Attended early at the Chateau and gave evidence against Lanyon. The 3rd Division seems to have done a good stunt last night and captured 200 prisoners. We saw some of the price paid going past in ambulances. Made preparatory arrangements for a dinner on our anniversary of leaving Aust. but find difficulty in getting supplies. Big guns round here are emplaced in back yards so as to be close to the officers billets. After mess went down to the 21st Battalion and there saw Duggan. Yarned there for a while. The streets full of our chaps and Yankees. They seem to fraternise very much and ought to get on well together. A warning order came to hand for our relief of the 10th Bde and Matthews and others will go forward afternoon tomorrow to reconnoitre. \n\n \n\n6\/5\/18 Querrieu\n\nRain falling in warm steady showers and must be splendid growing weather. All the fruit trees in the gardens are covered with blossom Owing to the rain I cancelled the parades called for the morning and ordered them in the billets to carry out indoor training. An inspection later on proved necessary and disclosed dirty billets and other irregularities. Last night an aeroplane of ours had to make a forced landing and the two \"birds\" came to us for food and shelter. One was a dear little boy not more than 18, typically English and who had only been out a few days from his Cadet School. On my round of the billets I struck a very old couple who were refugees from Ribemont. Poor old folk they were crouching over a stove, homeless and forelorn and broke into tears when we spoke of the War and of their homes. The old woman was tiny and scrupulously neat and cried when she told of her two dead sons. Where is the glory of War when you see its product in a sight like this – one of thousands! The village looked very pretty under grey weepy skies, with green border of trees and fruit blossom and old fashioned redtiled houses, some with little turrets and dovecots. Found a man lying sick in a billet and arranged to send the doctor down to him.\n\n \n","14":" Querrieu\n\nAfter lunch two companies moved out to a little piece of open ground towards Allonville. This was the most delightful of places. Here we carried out an attack practice on a trench using men with flags to represent tanks. The operation went off quite well. These companies formed up and moved off and the other two then arrived and did the same. Major Dooley took charge of the operation and criticised it at the pow-wow afterwards. I also said a few things. Rode home and at 5 pm went up to Bde HQs. to see a demonstration of rifle grenading. General Phillips the CRA. was there as he and staff are moving into the Chateau too today. After a yarn with the other colonels returned to Mess and found Jack there. He stayed after dinner. By gas shelling Amiens and doing others things Fritz seems to have given signs of carrying out his anticipated attack on tomorrow so we have taken special precautions re the issue of S.H.H. and bombs. It was a splendid fine warm evening and on the front there was a continuous and sustained bombardment. The lurid light of gun flashes flicks over the sky. I think that it is nearly all our shelling as our guns are out to search every hollow and valley where his troops might assemble. We have an officer on duty all tonight.\n\n \n","15":" Querrieu\n\nToday we commence the fourth year of service overseas. Marched out the Battalion to the high ground behind the village. D Coy was late on parade and I don’t think Patterson will forget in a hurry the chillingly sarcastic and polite address he received when his company did march on. Had to stop Smith firing his Lewis Guns because of the bullets going over the stop butt. Groves took his bombers away and used them for life bombing. Others carried on with a syllabus. While we lunched the Band played. The full high green grass and meadow flowers smelt very sweet as we sat on them and ate our lunch. After lunch we received orders to send up advance parties as our relief of the front line is to take place tomorrow night. Carried out the company in attack and had the four o0perating in different directions. Then flagged out a J.O.T. and did the Batt n in attack on a frontage of about 600’. The usual perpetual faults came to light in the advance – bunching, loss of direction etc. We had flag signallers to represent the barrage. Fixed up a small upright post on our limbers for the purpose of using Lewis Guns for anti-aircraft work. The companies marched back to the village headed by the Band and then dismissed\n\n \n\nTried a couple of cases at Orderly Room and awarded punishments. For the men tonight we tried to put on a few extras at dinner and got the cooks working a little overtime. Unfortunately we had difficulty in getting enough liquid refreshments and a motor lorry will probably arrive about an hour late. However always better late than never. Our printing press struck off Menus for the officers’dinner and a concert programme. The men’s dinner tonight was a success and they all speak of being very well pleased with their turnout. The officers mess put on a good dinner. There were very few visitors and we had a few toasts only. \"The Day we Celebrate\" was proposed by myself supported by Dooley & Kennedy and Gorman made a rousing speech on \"Our Native Land\". The Band played during mess. We then adjourned to a barn where L\/Cpl Herz had a concert rigged up. There was a crowd of all nations here and we had a regular good rough up \"Digger’s\" concert. A U.S. Army chap gave a couple of songs. Wiseman once with J.C. Williamson was a good help and a chap of the 21st came forward and offered his services. He had a fine voice and a good command of all the latest topical sounds. A balmy, dark night full of gun flashes & rumble of guns\n\n \n","16":" Querrieu\n\nA lovely sunny day. No work doing as all preparations had to be made for going up the line. Packs and blankets had to be dumped and soon every hat had been exchanged for the steel helmet. The place is full of changing troops – a mixture of units of all kinds. Motor transport – tractors, lorries, guns passing and re-passing along the road. I went down to the Chateau and saw the General. They had arranged for an aeroplane to come over and pick up their ground signals done with a signalling sheet. After lunch had a conference of a few officers on the writing of Operations Orders. Went round the billets and inspected them. It was a hot afternoon and the men felt the heat as they moved off laden with 220 rounds SAA & 2 bombs in addition \nthe\n to their other gear. The platoons were at 100 yards interval and Matthews took charge at the head of the column. I passed up the column after we passed through Pont Noyelles and did a canter across country. Just as the column was about to enter La Houssoye the enemy put over about 10 shells and killed and wounded a few people there. Our column made a detour & struck off overland towards Heilly. The black burst of crumps & of shrapnel was plainly to be seen from there. Rode up to Franvillers and had a look round our billets. Some Americans here\n\n \n\nin squashy little caps. One presented arms with funny movements. Rode after the battalion and caught it up. The perch pole of A. Co. cooker had broken and capsized their tea. The cooks refilled out of the River Somme and boiled up a fresh supply. On the pleasant shady banks outside Heilly we spread the men about for rest, the Band played and they had their tea. Met General McNicoll here and had a yarn to him. He has a German messenger dog as a pet. It was captured some weeks ago and has become quite an Australian by now. Rode back to Franvillers . From the high part of the road one can look right into the Boche lines in parts. Corbie lies in a hollow and Villers Brettoneux is on top of a rise. Back in Franvillers I found the Q.M. store and found that we were well located for a mess and for officers quarters. On the premises is a good looking Madame and two girls – one of 20 and one of 15 – both rather powdered and I think a little easy of virtue. This remains to be seen. Yarned with Madame and found that she had stayed when the Australians commenced to arrive. She ran the English down to the ground and the girls did so too. No praise is too high for the Australians. In Italy I saw the hatred of England grow and here in France the same feeling seems to be commencing. After mess we yarned until 11 and the Brazenor and myself found a good billet at Rear Bde HQ located in a fine and comfortable 2 – storey place.\n\n \n","17":" Franvillers \n\nOrders (and wise ones) came that all men were to be quartered outside the town. There were very few shelters of any sort but the weather is mild & not likely to bring much rain. So I ordered everyone out into a grassy paddock and bivouacs sprung up alround. Made the men dig into the back of a trench. After breakfast rode over to the Wood which was crammed full of tanks, men and transport. The Boche dropped some bombs round about it early this morning. Came back into the town and had some lunch and then had a good ride around the wood again. Returned to the village and had a yarn with an old lady of 80 years who still stays on here in spite of the closeness of the firing line. Today has been most enjoyable in the way of enabling one to ramble around and see the country. Moved out in an open field and bivouacked in a clover patch under a trench shelter. Very wrath with Brigade for not supplying any better cover than this and intend to move tomorrow unless there is an improvement generally. We had dinner right out in the open. The rations went forward at about 7.30 pm. He was heavily strafing some of the villages during the afternoon. With King and others discussed Egyptian & Ceylon days.\n\n \n","18":" Franvillers \n\nSlept all night in a bivouac that was a rude enough shelter. The little canvas cover was dug down about 2 feet below the level of the surrounding clover patch. Despite cold and too much air we all slept well. The day broke dull and chilly and looks like rain. There is a great tendency among our men to get hold of irregular dress. The morning when the horses went to water two men were wearing caps and two others wearing cap comforters. Intend to give Burke the SO a rousing \nin\n up about this. Breakfasted out in the open field. There is nothing but green grass and young crops everywhere. Last night was talking to two old Frenchmen who recalled the War of 1870 and the Battle of Pont Noyelles. These men were ploughing but their work as they said was \"without heart\" for they never know when an enemy advance will ruin all their labour and everything will destroyed. The spirit of this wonderful French nation is marvellous. In the village the little children and the women carry on where troops have been shifted out owing to the place being considered unsafe. The cellar is a very present help to them and their refuge in case of need. All have their gas masks of a French pattern for use in case of need.\n\n \n","19":" Franvillers \n\nDuring the night there was rain. Being Sunday did not get up until late. It was a dull rainy looking morning. From the wood came the sound of bands practising. Word came back from the line that our fellows had a collision with the Boche last night and that one of our men is missing. One of ours died of wounds also. We were most uncomfortable out in these fields with rain falling and generally cold conditions. After lunch called for my horse and with an orderly named set off for the front line. Passed a number of heavy batteries en route and saw a terraced hillside covered with shelters and dugouts quite like Gallipoli. Rode down along the Somme to Heilly. The river is fringed with low lying ground covered with green trees whose leaves have that yellowy tint of early Spring. Heilly was quiet. I found Bde H.Q. in a Chateau which was a modern house on an old site. The walls were massive and supported a big terraced garden from which there was a fine view in all directions. The General’s mess was in a smaller house which was beautifully furnished evidently by someone with money to burn. There was stained glass worked in all kinds of fantastic designs, and made to show out in quaint rivers of colours under artificial light. Yarned with the G. about operations for the future.\n\n \n\n12\/5\/18 \n\nRode on to Ribemont. As the main crossroads was being heavily shelled I made a detour along the river and missed it. A bridge near here was quite intact despite a terrific bombardment of its locality. There was a big crater only a few yards off it and the whole area for hundreds of yards round was a churned up rubbish heap. Rode through here and across open fields to a hillside at the foot of the Mares Wood and here found Matthews presiding at a conference of the Coy Commanders. Last night it seems that Cowan and a few others blundered into a Hun post and one man was shot through the head and left dead in the enemy hands. Our guns did two shoots with heavy stuff while I was here and provoked only a very little retaliation. Rode back through Maricourt to Heilly. Tonight we are sending up some limbers to salvage tents from the old C.C.S. at Edgehill. It is very close to the firing line and I doubt not the tents will be well shrapnel riddled. Returned to Camp and found M. Leon Barbier to Mess. We yarned and translated some French doing Cazottes \"Amoureux Diable\". A Boche plane came over early and dropped some bombs round the Wood. All our archies and L.Gs. opened up & they succeeded in turning him back. The tracer bullets we fire are not as good as the German. Our rifles are now being issued to the Americans and in the streets of Franvillers tonight Billjines were telling them its secrets\n\n \n","20":" Franvillers \n\nDuring last night there were several air raids and a good many bombs were dropped roundabout. The morning broke wet and continued to rain. I sent King out in search of billets and he eventually got to Martigny where we will be able to get our old officers’ billets. Walked over and saw Colonel Brazenor who is camped in a tent beside a grassy bank. They have pinched some marquees &! No wonder the reputation for horse thieving is not peculiar to Australians. They have other qualities. Received a summons to Bde H.Q. regarding a proposed stunt on Ville sur Ancre. Met Colonel Brazenor and with him rode to Heilly where at the cottage all the other C.Os. were assembled. The General unfolded plans for an attack to be carried out by 22nd on a front of 1250\" to a maximum depth of 750\" having for objective the trench system known as the Caterpillar. We fully discussed the plans and decided to launch the assault at 2 am or one good hour before dawn. Barrage to travel fairly rapidly as the going is so good. Determined on 48 hours after relief as the best time to do it. The Division opposite us is tired and a letter found on a dead man says \"The Australians are opposite us. They are cunning and alert and creep up to our trenches\n\n \n\nlike cats. The other night they came right into our trench and killed 2 men taking another away\". After conference went up to Bn H.Q. with Matthews and from there went up the line and saw Major Dooley. After conferring decided to let Matthews conduct the attack and returned to Ribemont with Miles. It was a nervy walk as the Hun put some shells quite close enough. Left Miles here and riding his horse went to Maricourt and had many adventures in the way of getting lost until I landed right back in Ribemont again on the other side of the River. Made the pace from here to HEILLY where I called in at Bde H.Q. Then went by road to Franvillers . Heavy 6 guns were firing the flash and explosion of some nearly blew me out of the saddle as we passed close to their muzzles. Returned to the Transport Lines and there met Murphy. It was now raining dismally. Rode over to Montigny reaching there at about 2.30 am. and found a billet in a house. The old lady got up and let me in. Charlesworth made a bed. A rude enough place but better than an open bivouac anytime. \"The worst billet is better than the best bivouac\" is a true saying and worthy of all men to be received. My waterproof coat was well saturated and mud covered and I turned in tired out. The bed was a wooden one of ordinary French type and its bugs soon joined my body lice in rendering sleep difficult.\n\n \n","21":" Montigny\n\nUp at about 11. Madame is an old woman full of the cry of hard times damage to crops and the misery of War. These poor people see the fruit of the labour swept away in a night by marauding troops and carelessness - of which evils a certain amount is not avoidable. Madame has a son who is a Francisian friar and lives at Jerusalem. His photograph shows a bearded and comfortable looking Monk. Walked round the street to where our mess is established and there saw all the officers Smith Gorman King Braithwaite Hunter and Anderson are here and Sutherland Miles and Bourke remain at the wagon lines. After lunch went out for a walk rambling over green ploughed fields. It is a lovely green restful land this France. There are little copses full of yellow leaf and wildflowers. All the woods are trim and neat and a joy to the eye. The \"Chateaux\" nestle in among the woods. Tommies of artillery lines, R.A.M.C. orderlies and M.P.s make up the crowd seen. On the main roads plenty of lorries pass and repass. I rested awhile on a grassy bank and enjoyed looking round. Last night I got rather shaken in the nerve by the shelling and to rest back here away from it all was splendid. We hear today that Kennedy and others are wounded in a patrol encounter or something else \n\n \n\nlast night. Sgt Smeaton of Reinforcements was killed in the action. At about 3 am the Boche attacked the 5th Brigade and got well through their line. Our chaps got on to them & captured 50 prisoners drove out & killed the rest and re-established our line. Groves was walking round the posts last night with a runner & captured a Hun all on his own and brought him in. This man appears to have been lost and wandering around. The Battalion is coming out tonight so I sent Sutherland and others up to get everything ready for them. A flight of our planes flew over Montigny while we were finishing mess and one of the English aviators dropped his bombs on us!! Pretty hot. We could not see whether he had got anyone with them or not. The little village was extremely quiet and peaceful in the evening. I went back to my billet and carried on a great discussion with a very old Madame. She had been to Paris once only – to the Exposition. All the old people went to the Exposition evidently! A Monsieur also came in and denounced the bad Administration of France. He was brokenhearted about his crops being destroyed. One does not need to talk to these people for long to realise what a tragedy this War is to them. This last advance of the Germans has aggravated everything and made it so much worse. Amiens deserted.\n\n \n","22":" Montigny\n\nA fine sunny spring day. Upon rising had a hot bath in one of the usual wooden tubs and breakfasted. At 10.30 Murphy had my horse waiting and I rode to Franvillers . The stream L’Malleu is bridged and mined. On the roads was any amount of Tommy transport. Had a very pleasant ride over into our Transport Lines there seeing Bourke and others. Went into the village of Franvillers and saw Cox at his office work. A couple of shells which landed close there this morning did not derange him. Now saw Blatchford at work in his Printing office. Here there is quite an array of type and printer’s material. The press is a small one and can only take one page at a time. Blatchford has had five brothers killed but still has the offensive spirit. He is going up tonight to join in the hop over. Rode back to Montigny for lunch. The day was superb. The warm sun made the beautiful countryside dotted with villages and woods look at its best. After lunch I took compass, map and field glasses intending to go for a long walk but the heat of the sun was too much and I lay on the first grassy bank. The war seemed far away but along the road the traffic was extraordinary. Hundreds of motor lorries were\n\n \n\npassing much wheeled horse transport also. A few cartloads of household goods and furniture and some French people driving and leading their cattle emphasised the ravages of War. Sutherland called in having returned from the line but he had no fresh news to give us. Wrote and read until late in the afternoon and at 7.30 went round to mess. Returned and had quite a long yarn to the old Madame who is 77 years of age and very active. Her father and mother both put up a score of 90. They say that Picardy is healthy because of the chalk being in the water. A Monsr. came in and said that the weather had been much more showery and wet during the war than it hitherto was. He described the reason as the cannonade. We then discussed the question of the low birth rate of France as compared with Germany and Monsr. said the laws of France and their Govt. rules and regulations together with conditions of life were such as to be conducive to small families. Madame recalled that in the War of 1870 a German officer who was billeted here told her that he was the 11th child in his family. On the Continent it would seem that a country like Germany by encouraging large families must score because it thereby assures more recruits for its Army.\n\n \n","23":" Montigny\n\nWent for a walk after breakfast and soon threw myself down on a grassy bank for the day was as hot as an Australian summer’s day. Passing traffic sent up clouds of white dust on all the roads around. A German aeroplane flew leisurely overhead and archies and machine guns fired wildly at it. Later in the day one was crashed by our airmen. Snowden brought my horse around after lunch and I rode into Franvillers first calling at the Transport Lines. Our Orderly Room Sergeant (Cox) amuses me with his wholehearted zeal for his work. Rode along the main Albert road which is under direct observation in parts. There was plenty of traffic (motor and other) and batteries are emplaced all along. Camouflaged piles of shells are stacked by the roadside. Turned in towards Ribemont on a side track and located our cooks who salvaged a milch cow. Galloped along over pleasant grassland until I came to a high tree covered bank or cliff where 2 of our companies had dug themselves in and were not only comfortable but safe to boot. Walked from here across to Battn H.Q. and things were so quiet and tranquil one would never know there was a War on. Saw them all there and promoted some N.C.O.S. Also made \n\n \n\nrecommendations for decorations. Greene was attacked by Germans the other night and went back alone firing his revolver and brought in a man who was wounded and lying out in No Mans Land. Yarned with Matthews and Dooley. As I came away the Hun was shelling the ridge in front rather heavily. Rode to Bde HQ. and at Heilly saw the General. Discussed the plans for our attack which is now postponed and also discussed the matter of Honors and Rewards. This is a decidedly weak point with him and we are very far behind other Brigades. Coming back from here one could get an excellent view of the village of Villers Brettoneux high on the skyline. After calling at the Transport Lines I went on to Montigny and had a late dinner. The few inhabitants are of the lower class of peasant and their women are stolid hardworking and as heavy of feature as the Flemish. Very rarely does one see a good looking girl. Nearly all the troops here billeted are Tommies. The Transport Lines are very thick round here and to see the horses going to water is a remarkable sight. Every wood and hollow disgorges hosts.\n\n \n","24":" Montigny & Doullens\n\nUp and away on horseback before 9 am. It turned out a hot summers day and before evening I had ridden 54 kilometres. Passed through Mollieres and Bois and Villers Bocage. The latter place full of Zouaves– a motley looking crowd but famed as fine fighters. Rode on to Talmas and from there along the fine Route Nationale to Bayeux. At this place there is a fine modern Church in a commanding position. Reached Doullens about noon. The town is prettily placed in a valley and nearly hidden by trees. The bastions and ramparts of the old Citadel are the first sight of the town. Rode down the street and put up my horse. Had a wash and brush up at a miserable Rest House place and then paid 8 francs for a poor dinner and some vin ordinaire. Had as table companion a Canadian doctor who was an interesting talker and told me that their men are splendid (like ours) and very fed up with the English (like ours). Did some shopping in the newspaper shops and everywhere was greeted with smiles. There were not many Australians about mostly Tommies of different units and French people. All the newsagents now stock cheap translations of very risqué French novels and these sell like hot cakes. The town of Doullens in a nice place but really too small to be very good.\n\n \n\nThere seems to be a new town of unlovely red brick dwellings and shops. Rode out at 4 pm and returning homewards passed some ambulance cars full of nurses. There is an aerodrome near Talmas and the planes were all drawn up ready for a night flight. Shells are stacked all along the roadsides and there are sentries on them. There are an enormous number of men on back jobs in the Army. Saw a crowd of Chinese coolies on the march just like children and all dressed anyhow. One had an umbrella. Saw also plenty of Indian soldiers. God knows we have enough different races fighting on our side. Began to get very sore after riding such a distance and developed a great thirst. In every French village they dam up a certain amount of the drainage into an evil smelling pond in the centre of the place and use it for watering the horses. Covered with green bubbling scum these ponds are not an ornament. In the wood near Molliens au Bois are large shell dumps. The lives of the dwellers in these lovely woods is Arcadian. Many French women and children toiling late in the fields. Reached Montigny about 7 and after dinner yarned with Gorman about many things. Gothas hummed overhead in the stillness of the evening.\n\n \n","25":" Montigny\n\nBeing tired after yesterday’s long ride I was not astir until about noon when we dined pleasantly at our mess. The day was close and oppressive so I returned to my billet and went to sleep. A thunderstorm blew up and very heavy rain fell for an hour after which the sun came out again. After mess I rode up to the line first calling in at our Transport. A busy road is the main Amiens – Albert road and much transport was on the move. Rode up to the high bank where A & B companies were camped and found everyone getting ready for the attack at dawn. Evidently the men were full of fight as I saw two having a scrap with many preliminary challenges of \"Hop out you bastard!\" – and in a few hours they will both probably be poor dead souls in Hell! Went to Battalion H.Q. and saw Matthews and Stewart. All their arrangement were complete and the attackers were to move up to their Assembly places in about two hours time. This morning our 18th Battn in broad daylight made for a Boche post they had located. The German sentry had ample time to warn the garrison but simply put his hands up when our men were quite a distance away. The result was that our men surprised the garrison – some asleep, some sunning themselves\n\n \n\nand brought them all back – 20 men and one aspirant officer. Took leave of Matthews and Stewart and wished them the best of good luck. The Tommies do large raids on our right on a front of 2000 yards and the 5th Bde & 5th Divn on our right also demonstrate. Now went across and saw old Major Dooley who was in good fettle. I hope the old chap comes through well. Sutherland and I then rode to Heilly where I called in at Bde Hqs. We then rode fast back to Franvillers . The big guns had now commenced their evening bombardment and the skies were lit up by their vivid flashes. The roads were crowded with all imaginable kinds of transport and the warm earth after its heavy soaking during the shower today was giving off the pleasantest of perfumes. We rode back into Montigny about 11 and I sent King back into Franvillers to be my liaiason officer and arranged a relay of mounted men to bring me news of the attack. Also arranged for Braithwaite to find out the prisoner’s cage and the ambulances there to get news of wounded etc. For many good men must die within the next 24 hours and it is rather fascinating to speculate who is going to get killed & who wounded. About 26 officers are going into the attack and a proportion must inevitably become casualties. Who are they going to be! The next few hours will show. Had some supper and then went to bed.\n\n \n","26":" Montigny\n\nSoon after 1 am I was outside waiting for our guns to brisken up for the attack. It was a fine warm night with a faint moon and the deep boom and flash of an occasional heavy gun was all that broke the peacefulness of the scene. From the saturated earth rose a hundred warm and pleasant odours. At 2 am a heavy rumble commenced soon intensifying into a loud and continuous roar and flash all along the front. Under that barrage my boys were jumping off to the assault south of Ville sur Ancre and it was the first attack in the history of the Regiment in which I had been back. I went back to bed but my thoughts were with the gallant chaps I knew were dying or being hit up forward. At 4.25 a mounted orderly arrived from King who I had sent to stand by a telephone at Advanced DHQ in Franvillers . It said that some prisoners were coming through and all appeared to be going well. An hour after came another message saying that we had captured 100 prisoners 10 machine guns and 2 minnenwerfers up to date. Gorman & Braithwaite then came in from a visit to the Heilly Dressing Station where they had seen some of our wounded. Major Dooley, Wall, Fulton, Green, Greene, Southwell and Hunter are all wounded.\n\n \n\nWho the dead are we do not yet know but I anticipate fairly heavy casualties. Unfortunately getting into our own barrage seems to be the cause of a good many hit. Dooley was stung through the leg near The Big Caterpillar and lay in a shell hole. He collected some Huns who were skulking in the vicinity and made them carry him in. All hands seem agreed that the Germans were of poor fighting quality and gave in easily. It was one more success to the credit of the 22nd Battalion – all objectives captured and consolidated. The situation would now appear to be that we are holding about ¾ mile of new front with roughly 350 (or less) men so the garrison will have an anxious time holding on and beating off counter attacks. The day turned out sunny and clear and I remained abed waiting for more news of the bloody battle. Suddenly from the little church opposite the bell commenced softly calling the people to Mass and we realised for the first time that this day is Sunday. And God laughed! The number of prisoners about noon rose to 8 offcrs and 200 others. Our wounded say that a good many of them were caught in our own standing barrage and evidently they found the shells falling short of the road all were\n\n \n\n19\/5\/18 Montigny\n\nmaking for. The 5th Bde on our right did well but the English on our left seem as usual to have failed. They town of Ville-sur-Ancre is in our hands. The Hun officers are said to have remarked on the poor quality and youth of their men and also say that they were on the point of attacking us. A request came down for more officers to be sent up but I was not having any. With a loss of almost 2 companies and only 6 officer casualties the request was not a reasonable one. So I decided to send up Lanyon and King into action and only to be used as necessary. Set off on horseback to arrange things with Sutherland when I met King handed all orders to him and then returned to my billet. The other battalions seem to have suffered lightly compared with ours and the 24th talk of only 20 casualties. The village by Ville sur Ancre is definitely in our hands. Fair numbers of Huns have been seen moving down the roads towards the village and tonight there ought to be a heavy counter attack. My theory re our standing barrage causing us loss \n\n1. The guns are right & the map is wrong.\n\n2. The Caterpillar is marked wrong \n\nThe road is marked wrong\n\n3. The guns are wrong.\n\nIt remains to be seen which of these theories is correct.\n\n \n\nLater It transpires that an English battery asked for and got permission to shoot on our front. Voila la raison! After mess went down to the Transport and saw Colonel Brazenor thence to our lines and through Franvillers to Bdes H.Q. at Heilly. There was a heavy bombardment going on. All at Bde. were in fine fettle over the success of today and the General complimented me. He has complimentary letters from Generals Rawlinson Birdwood and Smythe. Got a good deal of inside information about the reorginazation of our Force and shifts and changes of Generals. Jack seems to have done a splendid job of work in Ville–sur-Ancre today and killed a German officer who is said to have treacherously shot one of our men. The booming of the 23rd for a V.C. have already commenced. What a game it all is. Rang up all the different C.Os. up the line also gave them cheeri-oh and congratulations. There was a fair amount of transport on the roads and the guns were active as we returned. The Hun is using new flares which remain a long time stationary in the air. It was an enjoyable ride home over ploughed and sown fields with a good moon overhead and the scents of the country in the air were almost intoxicating in their way. On arrival back at Montigny I made shift to do some writing. Old Madame was waiting up for me – they take no risks about locking up these French. Braithwaite and Anderson came in to talk of the stunt.\n\n \n","27":" Montigny\n\nAnother lovely summer day. Bourke the T.O. was wounded last night in a barrage and got a fractured leg. Both he and his orderly were found this morning lying wounded and the horses dead. Busied myself with the question of promotions and will be putting up some N.C.Os. for their commissions. The question of honours and rewards is also a one that requires going into. We had an early dinner and I rode out into Franvillers . Found that not a tremendously satisfactory amount of billeting had been done and had to butt round myself. Saw Colonel Travers (D.S.O. & bar) of the 26th at Mess with his officers and yarned with them. Then took a walk around the trenches which are wide and full of quite good bivouacs. Met a little French kiddie whose Mother (a nice woman) I had been fixing up domestic arrangements with as she is the patron. She is going away tomorrow as a refugee owing to the shelling. The little boy is 4. I asked him where his Father is and he said \"a la guerre.\" Ah! la pauve petite, son papa est mort sur le front depuis trois annees. A good air fight took place just about dark, but it was too high up to see the distinctive colourings. The road Amiens – Albert is now being covered from lateral view by camouflage.\n\n \n\nYarned with Colonel Travers for a long time. Heard a furphy that Capt. Hunter had died of his wounds. This lacks confirmation as yet. Thewlis came down from the line first and one could see that he was tired out. I sent up a limber to bring out the captured M.g’s. and other trophies. All the chaps came down very late and quite tired out with their experiences. Old Habel had a good dinner ready for them and they were soon all chattering about the number of Huns they had killed and all their experiences of blood. A frequent remark was on the callousness of many of the men. A rather critical situation was saved by Abercrombie and others on the left of A Co where their flank got well up in the air and some fainthearts started to go back. A bayonet sent after them persuading them that safety lay forward proved a good thing. Our star seems to have been Sergeant \"Rusty\" Ruthven whom I intend to recommend for a V.C. Madden is also said to have done good work. Smith was in charge of a limber full of machine guns which we sent down and we also brought out a minnen werfer gun.\n\nTurned in after yarning with Matthews just as day broke\n\n \n\n21\/5\/18 Franvillers \n\nUp and about at 10 o’c and started on recommendations for promotions and for decorations. Then took a walk round the trenches and found the men very tired but very happy and full of their victory. Nearly all had plenty of souvenirs. Fatty Gould the Lewis M. G Corporal of D Coy had a fine collection and all his rowdy lot but the champion assortment was that of Sergt. Ruthven who seemed to be possessed of everything under the sun. Stayed here and talked for a while and after lunch rode over to Frechencourt where I found that I was a member of a Court of Inquiry to examine into the question of the short shooting of our artillery. This job is likely to take up a lot of time. I saw the General and had a good talk with him about things in general and our recent stunt in particular. Heard of General Birdwood going to 5th Army General Smythe to 5 8th Divn and General Rosenthal to command us here. The Brigade are quartered in a Chateau here and there is a battalion of the 3rd Division in the village too. It was a very hot day and was glad to get back to Franvillers . Kept very busy writing until late at night.\n\n \n","28":" Franvillers \n\nLeft at 9.30 per horse for Bde H.Q. when I had a hot ride. All the countryside is now covered with crops that are fast ripening. Today has been quite as warm a day as one could wish to have. On reaching Frenchencourt I met Colonel Cohen CMGDS and Major Clowes Mc & Serg. WhiteEagle and we proceeded to sit as a Court of Inquiry and took the evidence of many people regarding the question of our artillery firing short during the recent attacks. We had a table covered with maps and really made a great ceremony of it – thus trying to find out how so many brave men were killed and wounded. Our total losses were 23 killed 180 wounded and we took over 300 prisoners and counted a good many dead Huns. Rode down in motorcar to St Grahen and dined with General Phillips and Staff at","29":" D HQ. Later in the afternoon heard that General Monash goes to Corps. Generals White & Birdwood to 5 Army and General Gellibrand to 3 Divn. Saw General Rosenthal our new Div. Commander and had a long talk with him. Truly a day of Jews and Generals!! Found C.G.W. Bean the War corres. at Mess when I returned so took him in hand and gave him a lot of war news. A decent chap is C.G.W.B.\n\n \n\n","30":" Franvillers \n\nAnother warm day. Some of the airbombs last evening landed close enough. Sat on a Court all day with Colonel Cohen & Clowes re artillery shots. Heard a great many different witnesses. Formal mess in the evening and we had the Band out and playing well. Most of the men were out tonight on engineering tasks. Very busy all the evening on the question of honours and awards there is a tremendous lot of work in these things. Just about dark the enemy put over a fair number of shells some of which landed close to here. Tried a few cases of a.w.l. and desertion at Orderly Room tonight. The War is a pleasant business these days lying as it does in pleasant places and in good weathers. All the higher Commanders are awaiting the push and in the meantime he appears to be holding his line thinly and no doubt is resting his men well in rear. Last night here a number of artillerymen and a few civilians were killed and wounded and horses were also hurt by bombs from the planes. Down at Lassoussage they have also had a good deal of trouble from the same thing. Our painters are busy painting Crosses and also marking our machine guns and m.w’s captured.\n\n \n","31":" \n\n Rode to Frechencourt to a conference at Bde HQ. All the other Colonels were there and we sat in close conclave all the morning on the lessons to be learnt as a result of the stunt. There was good deal of valuable discussion about different points and we made a number of suggestions. I put in all my recommendations for decorations and hope to get a good lot through. Some rain fell during the morning and laid the dust. With Colonel Brazenor I had a fine gallop back across country and had a hurried lunch before going to the Conference or rather Court of Inquiry. We sat in the Mess and had many artillery men before us hearing their explanation of shorts etc. Very nearly went to sleep while Colonel Cohen was painstakingly crossexamining. The Court closed at 5.30 and I arranged for Clowes to bring a car for me tomorrow and run me down to Pont Novelles. Put up Willoughby & Kennett for their commissions and put Pat Gorman on to the job of writing up the history of the battalion. Passed a busy evening writing and doing the many odd jobs that fill in so much of our time. There is a good deal of artillery fire on the front tonight and no doubt a large amount of it is our own as there seems very good reason to expect that the enemy will by strong attacks recommence his offensive tomorrow. Flash and rumble of guns. The wetter conditions will not make the trenches out in front the most desirable places to live as the life is rather too outdoor. My Australian mail is till missing tho’ others got plenty of letters. \n\n \n","32":" Franvillers \n\nIt was about 8.30 when I went down to breakfast. Walked down the village street then to our Printing office and read some proofs for our next paper. The type setting arrangements are here and the place has a very office like appearance. Went into the Regtl. office and did a little paper work and then went out on a walk round the trench where my men & officers eat sleep and have their being. There were not a great many available for work because we are on several digging jobs. Those who were to do parade were doing signalling and the usual Lewis gun cleaning etc. As I went round I stopped and had a talk to a number of the N.C.Os. and men and also made a descent on the cookers and inspected them. We have now been in trenches or forward areas for nearly 3 months and consequently we have had very little drill of late. Saluting is noticeably weak & the men are very apt to look on you as too much of a friend and to lose that instant awe so to speak that one only gets out of men by drilling them. We could do with a hard fortnights drill and ceremonial mixed with some open fighting training – advanced Guards etc. Discussed with my company commanders the question of Lewis gun proportion to the rest of the platoons & companies and decided to have 1 gun section in each three. The companies\n\n \n\nhave each available for trenches just about 70 men – except D Co whose casualties have reduced theirs to about 50 odd. After lunch the Artillery car called for me and I met Colonel Cohen and went to Pont Noyelles where were the Colonel and officers of the 108 RFN whose evidence we proceeded to take as a Court of Inquiry. Some of these chaps were very old gunners and had had much active service. From here we drove to Dion to get our shorthand evidence typed and I had afternoon tea with General Phillips having some interesting talk. The car then took us back through Querrieu where a big shell today accounted for 50 men of a Labour company killed and wounded. Noticed a very fashionably dressed man with a tall and very chic lady. These must have been Billjims dressed up I think. Home through La Houssaye to Franvillers . Many camouflaged dumps of shells en route here and some big guns emplaced. Had Mess and then did some writing. Went down to the Battalion office and fixed up a number of matters there. It was a quiet evening on the front. 100 of my men were away digging. Word came back of a German wireless intercepted which said our front line would be strafed between 3 and 5 am. Posted extra sentries and put an extra officer on duty.\n\n \n","33":" Franvillers \n\nDown to Regimental office fairly early this morning and signed a few papers. Then took a walk round the trenches and talked to some of our men. The enemy did put down his barrage on our front line as anticipated this morning but nothing further transpired. Rode down to Heilly this morning with Matthews and made a very thorough reconnaissance of all the posts around there for which we have to supply nucleus garrisons. While engaged on this met Colonel Martin just near the Chateau grounds, and had a yarn with him. From here one looks right over the valley of the Somme from Corbie up to Buire and it is a very fine sight. The Ancre winds along and the trees grow densely all along its course. The Boche was shelling desultorily around Hurelf Wood. Rode over Bonndey way and had a race across country with the other horses. Some of my men are working digging a deep dugout and I found them hard at work and raising the spoils by a windlass. There was a descent of about 30 feet and then I found some sappers and others picking on a chalk face. Came back to Franvillers by way of the old C.C.S. and in time for lunch. After lunch we yarned for a while. I then met Thewlis and walked\n\n \n\nover to the Transport Lines there to see our collection of war trophies. There is a fine lot of German light and heavy machine guns and also many other trophies captured. Old Geddes was sitting on these guns and was the picture of Faithfulness watching over them. Our painter Needham is a character and gaily decorates all the grave crosses for the Regiment. Returned to Bn H.Q. and there met Colonel Cohen. We sat once more as a Court of Inquiry regarding the \"shorts\" of the artillery barrage and we examined many artillery officers. One could but be struck with the fine type of men these battery commanders are. Vast experienced smart & capable chaps and very full of skill, in gun handling. Just as we finished Mess in the evening in walked Jacky Rohn, Davis Chalmers and others. So we had quite a reunion. After mess I had a busy evening interviewing different ones and had several chaps who wished an understanding with me about different troubles. Later in the evening we had a good air raid and the planes kept circling round and round flying so low that we could plainly hear their engines and dropping plenty of bombs upon us. Some of the explosions shook my house to its foundations. Received a letter of congratulation from the Army Commander on our work in collecting intelligence. They got the plans for an attack and several maps of importance from Ville sur Ancre.\n\n \n","34":" Franvillers \n\nAround the bivouacs at 9.30 I found out many little things which might be considerably improved. Yarned with different N.C.Os. A good many of the men were fast asleep as they were working on cable burying all night and did not return until late. It was a lovely Spring day with a cool wind. Rode over to Frechencourt and had a long yarn with the General who asked me to dine with them which I did. They are located in a rather neglected Chateau. The G. was in a benevolent mood and we had a long and intimate confidential conversation about many matters of interest and affairs of State. Coming back from here I raced my horse over the soft tracks and had an exhilarating ride. At 2.30 with Colonel Cohen I sat as a Court of Inquiry and we further inquired into Artillery shorts & narrowed it down to those cursed Tommies who seem incompetent in everything they touch. After Mess I made some arrangements re odd details of interior economy and then took a walk around the coys. Fritz started throwing about a good deal of stuff in a scattered sort of way and I believe he put one right into the back of my billet. I stayed out until after he had finished\n\n \n\n28\/5\/18 \n\nMy 27th birthday. Rode over to Frechencourt at 11 am and had about a dozen of my officers there. General Birdwood said farewell on the occasion of his going to take command of 5th Army and there was no doubt he was much moved and sorry to leave us. He gave us news of the German push on the Aisne and the consequent retirement there. The unfortunate 9th Corps seem to have caught it once more and the Chemin des Dames so dearly bought is now in enemy hands. After he had finished with the others General Birdwood had a talk to the other 3 Colonels & myself. Rode back to Franvillers for lunch and inspected some new drafts who had joined up. After lunch tried a couple of malefactors & then took a walk round the trenches in front to decide on where to shift our people to out of the village – the Boche has been shelling it too much to be healthy. He put one beauty right into the Cemetery tonight sending debris of all kinds flying up in one big shower. The safest course is for us to clear right out of the place completely and this shall be done by midday tomorrow. An artilleryman had his leg blown off out in the street. A little group at the Cemetery were burying others. We recovered today the body of a man drowned only a few days ago – Byrne D Co\n\n \n","35":" Franvillers \n\nA dull day at first but afterwards it cleared and became one of remarkably clear visibility. Shells commenced early coming from the directions of Marett Wood and some landed unpleasantly close. One dudded in the back yard and shook this house to its very foundations. The official photographer appeared early on the scene and took some groups. He remained with us all day. After lunch I inspected the Transport at their lines and had a good turnout. There was little to find fault with in the appearance of the men as they were well and neatly turned out. Had a look in at the Q.M.’s store. The old trouble of lack of material for Australian hats & tunics has again cropped up. The Hun sent a plane over late in the afternoon and he flew very low. Our machine guns etc. did not do much execution against him. The afternoon was sunny with a few clouds and a light cool breeze – just the conditions under which observation is best here. Villers Brettoneux stood out very clearly on the top of the ridge to our right and something was on fire just behind it. At Marett Wood we could see the Bn H.Q. and all the Boche trenches etc. on the next ridge. In the evening shifted out into the trenches where the Pioneers had dug a fine place for me. As long as the weather keeps good it will be alright. The front was a mass of red cored balls of fire tonight for the guns are active. Groping fingers of searchlight spring out from Amiens way.\n\n \n\n30\/5\/18 Franvillers \n\nAnother lovely day. Old Habel the mess corporal had very rashly spread the mess table fair in the middle of the crop just behind the trench and it was right under view of the Hun. I went into the village where the official Photographer took my portrait for our Regimental history. Met Dr MacMahon and with him commenced a round of inspections finding the usual little irregularities. While at A Co a Hun plane came across and flew very low. Our Lewis guns engaged him heavily and brought him to the earth undamaged to a place about a mile off on a small rise. At once the very earth seemed to vomit men as Billjims from a hundred dugouts scattered over the landscape rushed up towards the ‘plane. They were like wolves round a carcass. The Hun was unhurt and was taken away in a motorcar to D HQ. After lunch Colonel Cohen and Major Clowes came and we sat as a Court of Inquiry and made our findings re the artillery. After mess I went across and saw James of the 24th. The view from here across to Villers Brettoneux was fine Corbie lying in the wooded river valley and was covered with smoke. The Hun put a good many shells into Franvillers and wounded 2 bandsmen there. I saw one being carried out on a stretcher as I returned from the","36":" where I had been talking to Colonel James. Received orders to take over up the line from","37":" Bn tomorrow night. Preparations & writing took till midnight.\n\nThe \"Red\" Strain came up to the Line as bearer of a message. I said \"How’s the Band getting on.\" \"Tres bien\" says Red \"they've dropped all the gob sticks!\" (i.e. reeds). & taken on brasses!\"\n\n"}}