{"Document Name":{"0":"Diary_0010","1":"Diary_0010","2":"Diary_0010","3":"Diary_0010","4":"Diary_0010","5":"Diary_0010","6":"Diary_0010","7":"Diary_0010","8":"Diary_0010","9":"Diary_0010","10":"Diary_0010","11":"Diary_0010","12":"Diary_0010","13":"Diary_0010","14":"Diary_0010","15":"Diary_0010","16":"Diary_0010","17":"Diary_0010","18":"Diary_0010","19":"Diary_0010","20":"Diary_0010","21":"Diary_0010","22":"Diary_0010","23":"Diary_0010","24":"Diary_0010","25":"Diary_0010","26":"Diary_0010","27":"Diary_0010","28":"Diary_0010","29":"Diary_0010","30":"Diary_0010","31":"Diary_0010","32":"Diary_0010","33":"Diary_0010","34":"Diary_0010","35":"Diary_0010","36":"Diary_0010","37":"Diary_0010","38":"Diary_0010","39":"Diary_0010","40":"Diary_0010","41":"Diary_0010","42":"Diary_0010","43":"Diary_0010","44":"Diary_0010","45":"Diary_0010","46":"Diary_0010","47":"Diary_0010","48":"Diary_0010","49":"Diary_0010","50":"Diary_0010","51":"Diary_0010","52":"Diary_0010","53":"Diary_0010","54":"Diary_0010","55":"Diary_0010","56":"Diary_0010","57":"Diary_0010","58":"Diary_0010","59":"Diary_0010","60":"Diary_0010","61":"Diary_0010","62":"Diary_0010","63":"Diary_0010","64":"Diary_0010","65":"Diary_0010","66":"Diary_0010","67":"Diary_0010","68":"Diary_0010","69":"Diary_0010","70":"Diary_0010","71":"Diary_0010","72":"Diary_0010","73":"Diary_0010","74":"Diary_0010","75":"Diary_0010","76":"Diary_0010","77":"Diary_0010","78":"Diary_0010","79":"Diary_0010","80":"Diary_0010","81":"Diary_0010","82":"Diary_0010","83":"Diary_0010","84":"Diary_0010","85":"Diary_0010","86":"Diary_0010","87":"Diary_0010","88":"Diary_0010","89":"Diary_0010","90":"Diary_0010","91":"Diary_0010","92":"Diary_0010","93":"Diary_0010","94":"Diary_0010","95":"Diary_0010","96":"Diary_0010","97":"Diary_0010","98":"Diary_0010","99":"Diary_0010","100":"Diary_0010","101":"Diary_0010","102":"Diary_0010","103":"Diary_0010","104":"Diary_0010","105":"Diary_0010","106":"Diary_0010","107":"Diary_0010","108":"Diary_0010","109":"Diary_0010","110":"Diary_0010","111":"Diary_0010","112":"Diary_0010","113":"Diary_0010","114":"Diary_0010","115":"Diary_0010","116":"Diary_0010","117":"Diary_0010","118":"Diary_0010","119":"Diary_0010","120":"Diary_0010","121":"Diary_0010","122":"Diary_0010","123":"Diary_0010","124":"Diary_0010","125":"Diary_0010","126":"Diary_0010","127":"Diary_0010","128":"Diary_0010","129":"Diary_0010","130":"Diary_0010","131":"Diary_0010","132":"Diary_0010","133":"Diary_0010","134":"Diary_0010","135":"Diary_0010","136":"Diary_0010","137":"Diary_0010","138":"Diary_0010","139":"Diary_0010","140":"Diary_0010","141":"Diary_0010","142":"Diary_0010","143":"Diary_0010","144":"Diary_0010","145":"Diary_0010","146":"Diary_0010","147":"Diary_0010","148":"Diary_0010","149":"Diary_0010","150":"Diary_0010","151":"Diary_0010","152":"Diary_0010","153":"Diary_0010","154":"Diary_0010","155":"Diary_0010","156":"Diary_0010","157":"Diary_0010","158":"Diary_0010","159":"Diary_0010","160":"Diary_0010","161":"Diary_0010","162":"Diary_0010","163":"Diary_0010","164":"Diary_0010","165":"Diary_0010","166":"Diary_0010","167":"Diary_0010","168":"Diary_0010","169":"Diary_0010","170":"Diary_0010","171":"Diary_0010","172":"Diary_0010","173":"Diary_0010","174":"Diary_0010","175":"Diary_0010","176":"Diary_0010","177":"Diary_0010","178":"Diary_0010","179":"Diary_0010","180":"Diary_0010","181":"Diary_0010","182":"Diary_0010","183":"Diary_0010","184":"Diary_0010","185":"Diary_0010","186":"Diary_0010","187":"Diary_0010","188":"Diary_0010","189":"Diary_0010","190":"Diary_0010","191":"Diary_0010","192":"Diary_0010","193":"Diary_0010","194":"Diary_0010"},"Date":{"0":"unknown","1":1065.0,"2":1066.0,"3":1067.0,"4":1068.0,"5":1069.0,"6":1070.0,"7":1071.0,"8":1072.0,"9":1073.0,"10":1074.0,"11":1075.0,"12":1076.0,"13":1077.0,"14":1078.0,"15":1079.0,"16":1080.0,"17":1081.0,"18":1082.0,"19":1083.0,"20":1084.0,"21":1085.0,"22":1086.0,"23":1087.0,"24":1088.0,"25":1089.0,"26":1090.0,"27":1091.0,"28":1092.0,"29":1093.0,"30":1094.0,"31":1095.0,"32":1096.0,"33":1097.0,"34":1098.0,"35":1099.0,"36":1100.0,"37":1101.0,"38":1102.0,"39":1103.0,"40":1104.0,"41":1105.0,"42":1106.0,"43":1107.0,"44":1108.0,"45":1109.0,"46":1110.0,"47":1111.0,"48":1112.0,"49":1113.0,"50":1114.0,"51":1116.0,"52":1117.0,"53":1118.0,"54":1119.0,"55":1120.0,"56":1121.0,"57":1122.0,"58":1123.0,"59":1124.0,"60":1125.0,"61":1126.0,"62":1127.0,"63":1128.0,"64":1129.0,"65":1130.0,"66":1131.0,"67":1132.0,"68":1133.0,"69":1134.0,"70":1135.0,"71":1136.0,"72":1137.0,"73":1138.0,"74":1139.0,"75":1140.0,"76":1141.0,"77":1142.0,"78":1143.0,"79":1144.0,"80":1145.0,"81":1146.0,"82":1147.0,"83":1148.0,"84":1149.0,"85":1150.0,"86":1151.0,"87":1152.0,"88":1153.0,"89":1154.0,"90":1155.0,"91":1156.0,"92":1157.0,"93":1158.0,"94":1159.0,"95":1160.0,"96":1161.0,"97":1162.0,"98":1163.0,"99":1164.0,"100":1165.0,"101":1166.0,"102":1167.0,"103":1168.0,"104":1169.0,"105":1170.0,"106":1171.0,"107":1172.0,"108":1173.0,"109":1175.0,"110":1178.0,"111":1179.0,"112":1180.0,"113":1198.0,"114":1199.0,"115":1200.0,"116":1201.0,"117":1202.0,"118":1203.0,"119":1204.0,"120":1205.0,"121":1206.0,"122":1207.0,"123":1208.0,"124":1210.0,"125":1211.0,"126":1212.0,"127":1213.0,"128":1214.0,"129":1215.0,"130":1217.0,"131":1218.0,"132":1219.0,"133":1220.0,"134":1221.0,"135":1222.0,"136":1223.0,"137":1224.0,"138":1225.0,"139":1226.0,"140":1227.0,"141":1228.0,"142":1229.0,"143":1230.0,"144":1231.0,"145":1232.0,"146":1233.0,"147":1234.0,"148":1235.0,"149":1236.0,"150":1237.0,"151":1238.0,"152":1242.0,"153":1243.0,"154":1244.0,"155":1245.0,"156":1246.0,"157":1247.0,"158":1267.0,"159":1268.0,"160":1269.0,"161":1270.0,"162":1271.0,"163":1272.0,"164":1273.0,"165":1274.0,"166":1275.0,"167":1276.0,"168":1277.0,"169":1278.0,"170":1279.0,"171":1280.0,"172":1282.0,"173":1330.0,"174":1331.0,"175":1332.0,"176":1350.0,"177":1353.0,"178":1364.0,"179":1395.0,"180":1396.0,"181":1406.0,"182":1407.0,"183":1408.0,"184":1413.0,"185":1414.0,"186":1415.0,"187":1425.0,"188":1428.0,"189":1436.0,"190":1438.0,"191":1470.0,"192":1471.0,"193":1479.0,"194":1480.0},"Entry":{"0":"\n\n","1":"\n\nGetting into Australian Bight which means rougher. Result of Melbourne Cup by wireless also other news. Church parade & spars. Very rough in the evening but not sick yet.\n","2":"\n\nLight exercises, plenty of reading & good tucker. Boxing. After dinner exercises with life-belts. Extremely rough weather, a lot of sick.\n","3":"\n\nNone rough weather, boxing & usual routine. Lost watch.\n","4":"\n\nReconing on calling at Fremantle to-morrow. Had a spar. A big sports tournament coming off shortly.\n","5":"\n\nSome fair sport after dinner having perks at Albatross. Fair weather. A couple ","6":"\n of good boxing contests & a fair concert.\n","7":"\n\nMore wireless news ","8":"\n dealing with war news & the labor & coal trouble. Fairly slow to-day. Nice & smooth weather. Just beyond W.A.\n","9":"\n\nLovely weather, washing in the morning. Using foils after dinner. A concert after tea. Fair.\n","10":"\n\nChurch parade, reading & writing. Wind rising. Over a weeks run to Durban yet. Jim & & I have slight colds. Jim went into Hospital sick flu.\n","11":"\n\nFairly rough again. Excitement through just seeing the masts of a ship. Went up & saw Jim. Got measles now & is just ordinary. Hopes of seeing Durban in a week or so.\n","12":"\n\nUsual Draughts & euchre.\n","13":"\n","14":" as usual.\n","15":"\n\nPlayed off heat in draughts & euchre & lost both. Same evening pillow fights in which I got beaten. Sent some reading & a note to Jim who\n\nis in isolation ward & can’t see him, good weather lately.\n","16":"\n\nJim almost well again. Single stick drill. A spar.\n","17":"\n\nSports in evening, wrestling etc. A young chap died. Concert put off.\n","18":"\n\nBurial of young chap, boat stopped & ceremony gone through. Church parade.\n\nMon.\n\nAnother chap died this morning. Supposed to be meningitis. Place fumigated & decks disinfected. Chap buried at 6. Saw Jim through door after looking vainly for a week. Posted a few letters lately – mail closing. Weather getting warmer.\n\nTues.\n\nWeather still getting warmer but nice & calm. Supposed to be in Durban Wed. night. Concert after tea very good. Wild rumours floating about too numerous & rediculous to mention. Had a chat with Jim.\n\nWed.\n\nGreat excitement on board about seeing land tonight. Got paid & had a few words with Jim. Have had a crook cold now for over a week. ‘Benalla Sun’ a very interesting edition which comes out about 4 times a week. Concert postponed on account of critical condition of 2 men. Just after tea great fuss lights sighted","19":" land for 3 weeks. Great commotion.\n","20":"\n\nWoke up & told to be dressed at 5. Two chaps died one out of our lot so our company had to be present. Military funeral gone through & then came back from sea & into port. Puts me in mind of Newcastle from a seaward view. Fair scenery round the one big bluff head. Several other large steamers in port. Lay in harbour till about 12 & then sent ashore & marched to Town Hall & then dismissed. With two other chaps we had a look at Railway\n\nstation. Had dinner then took a tram (free) & went out about 3 miles. Beautiful Suburbs. Knocks Sydney easy. Back had tea & then had a rickshaw down to the beach & baths. Said to be one of best laid out in world. Very pretty when all lit up with colored lights. Tram back to Town Hall & out to another terminus. Back just in time to fall in in time for ship. Had one of most pleasant days out, full of bustle & saw almost all what there is to be seen in that short time, 2 till 10.\n","21":"\n\nGot up & came up on deck & watched the Kaffirs or niggers loading coal. Steamed off at 10 o’clock & sailed out through the big bluff & away. Went down stairs wrote & read. Jim almost better. Couldn’t send cables.\n","22":"\n\nUsual.\n","23":"\n\nChurch parade & usual reading & chatting. Could see land. Jim out now. Got to Capetown before we were out of bed. From the boat you could see the Table Mountain well a good view. Flat on top & sloping down to Capetown at very steep angle. In the morning it was ½ covered with clouds but as day wore on cleared off. The place doesn’t seem very high but still the clouds are there. After breakfast marched to sports ground & quarinteened there, but a lot scaled out. We were served with lunch by a few ladies. In the afternoon marched to a big place where they entertain oversea troops. We had a nice tea, tea, meat-pies & different assortment of cakes. Post cards handed out to write home on. Sent home some views. Town full of niggers same as Durban. Boarded again at sundown.\n","24":"\n\nHad a spar & usual drill etc. Wrestling.\n","25":"\n\nBoxing at night in tournament, some good goes.\n","26":"\n\nHeavy weight boxing heat a good go. On guard duty. Getting well up the African coast. Wireless news that Bucharest is taken by Germans.\n","27":"\n\nTug o’war. Boxing.\n","28":"\n\nA concert at night.\n","29":"\n\nHad communion & went to church.\n","30":"\n\nYoung chap buried this morning meningitis more cases. Said to have crossed about centre of equator to-day. Fairly warm. Wireless news about German cruisers escaping at a Portugal port. Will get to the old dart about Christmas, hope to before. Lights out at dark, no striking matches & an extra lot of guards as submarine watches & walk about day-time with life belts is the order in a couple of days.\n","31":"\n\nVery hot.\n","32":"\n\nditto.\n","33":"\n Fri.\n\nSighted land about 7 o’c & landed in harbour about 10. Pretty warm. Place Freetown & colony of Sierra Leone, Portuguese or French but chiefly inhabited by niggers. Great place for fever. On arriving in harbour there was already 3 cruisers & transports in. Niggers came alongside & we tried a cocoa-nut. Town about as big as Bangalow or a bit bigger.\n","34":"\n\nStill in harbour. Terrible hot. No idea when sailing. Our lot on guard tonight.\n","35":"\n\nChurch parade & hot again\n Intense heat. At about 11 we were pulled ashore in pulling boats & \nla\n dismissed. Curious place. About 6 whites & all the rest black. Most buildings tumbled down\n\nbricks, but with a fair amount of green trees. Streets dusty (yellow) & irregular. Had a good walk about & went off again to Benalla at 4. Got some war news in town from English papers.\n","36":"\n","37":" as usual, buying fruit from natives in canoes & watching lights of town & searchlights from cruisers. Playing cards.\n","38":"\n\nDitto to yesterday.\n","39":" \n\nLeft about 6 in morning & we were sailing","40":" of 5 in a line. Saw J. Hawkins in Capetown & is in ship behind us now.\n","41":"\n\nCards & reading.\n","42":"\n\nSaw land about 9 o’clock & went through heads about 10.30. Seems to be a better place than Freetown. As soon as we lay in harbour niggers came round in boats & were diving for\n\npennies & other coins. This is a French port & latest reports are we \nare\n can’t get ashore.\n","43":"\n\nLaying off wharf about 50 yds. Watching niggers fishing very adept. Buildings seem to be built on old Italian Column Style.\n","44":"\n\nLet go swimming in harbour. Swam across to French Battleship & another chap & I were conversing in a way with sparse French to a nice chap. Distance about 200 yds. & almost knocked me up. Put the gun on the back of our ship. Wrote home mail.\n","45":"\n\nBefore dinner we went for a swim ashore & were only allowed to walk about edge of wharf. Talking to a nigger who spoke English. Some Moors kicking \n\n \n\nboxing, wrestling, high diving (60 ft.) & swimming races.\n","46":"\n\nThinking of what you’re doing at the Bay to-day & Christmas Day yesterday, in fact thinking fairly often. Playing cards from Breakfast till tea-time – nothing much out of ordinary. Concert good performance. Steamers continually going & coming in & from port. Card playing all day.\n","47":"\n\nLeft port this morning escorted by the 2 French cruisers 5 troop ships in the escort. Played 500 all day. This game is the rage on board. Great excitement about a couple of miles from port. The third boat in front of us was seen to turn out & back. We saw a life-buoy float by us & then\n\nlooking about we saw a man floating out about level. We sent out a boat & rescued him. He was saved through orders going out that morning that we were to wear lifebelts all day. At night we have to keep them handy too. Jim has a fairly crook cold.\n","48":"\n\nInstead of sailing N sailing W to avoid submarines. Nobody allowed to smoke on deck. At night all lights out at dark. The lights are not put out till nine but portholes closed. 50 days on the water now, 7 weeks & no mail just fancy. Played cards from breakfast till tea time. Haven’t had any drill for about 3 weeks now.\n","49":"\n\nMore excitement, we met the other convoy consisting 4 troopships & a cruiser that we saw at Freetown & which never called at Dakar.\n","50":"\n\nGetting colder also a bit rougher. Right into the danger zone now. A good boxing bout for £10 a side best fight yet.\n\nSun. 31st\n\nGet up at 6.45 now instead of 6 as it is even dark at the latter time now. Wherever you go now you have to have your lifebelt on.\n","51":"\n\nRumours going about that we’ll strike England about next Sun. Still getting slightly colder. Jim almost better of cold & both feeling fairly well. By this time you must have our first mail. Not so rough as yesterday.\n","52":"\n\nDitto to yesterday.\n","53":"\n\nKit inspection getting fixed up before we arrive. A bit of a delay something went wrong \none\n with one of other transports engines. Every day you can feel it growing colder. Chaps beginning to wear\n\nmufflers & overcoats on.\n","54":"\n\nOn the outer edge of the Bay of Biscay & getting fairly rough & cold winds. Got up at quarter to 7 but it is pitch black. A little war news & watching the other boats dipping & lurching. Sometimes it would splash right over the front.\n","55":" \n\nSame as yesterday with increasing cold.\n","56":"\n\nSupposed to reach the ‘old dart’ on Sun. or Mon.\n\nSat.\n\nCleaning all the place up before getting into port, scrubbing & doing.\n","57":"\n\nLast Church Parade on board. Just about dusk great excitement about 16 Torpedo-boats or some kind of destroyers met us. They seem to be about 2 or 3 times as big as a fair pulling boat. Very low in the water manned with quick firer & full of torpedoes. From then\n\nwe started to race. Our boat was leading till bed-time. Fairly cold.\n","58":"\n\nThe news this morning is we’ll reach port to-night. We’re running second all else out of sight behind. Running well all day. Very rough sea about as rough as in the Bight & a terrible strong sea. About 12 or 1 we entered Plymouth Sd.\n","59":"\n\nUp at 4.30. Brekker at 5. After, in the grey light of morning, had a look at the old historic Sound also saw the old Eddystone Lighthouse flashing or some one or other. About daylight we moved \ninto the\n down the sound & up to a wharf. By jove its fairly cold too. Disembarked & onto a train. From then to dark (which is about 4) travelled through farming country intensely cultivated. Every paddock is from 1 to 2 acs. & has a hedge round & about every\n\nacre with a green hedge it looks alright. The trees are stripped of leaves at present. The farm-houses are real old fashioned style just like you see of an English homestead, made of brick, oblong in shape & with thatched rooves with in some cases ivy over it & no verandahs. The biggest herd I saw was about a dozen or 15. At Exeter we were given a cup of tea & a bun & waving to all the young tarts of course. From dark to our destination we played 500, a matter of 3 or 4 hrs. Got out in dark & cold & marched about 4 mls. to camp \nwhich\n with the wind blowing bitterly. Almost got me fagged. Had a bit of bread & jam & went to bunk. Had 3 blankets on me & pillow underneath & my overcoat over me & freezing. Another very big day.\n","60":"\n\nUp at 6.30 here but pitch dark switch on lights. Cold as blazes. It rained & snowed\n\nbefore we came & all the little puddles would crack under your feet. Hands red & almost numbed but have to tumble out to parade. Had a bit of a march about & inspected by Major & told we might be in the business in 6 or 7 weeks. Medical examination. Another novelty aeroplane flying about. I saw 4 up at once. You can hear the hum of their engines as they go over. Got innoculated again. Had a stiff arm to go to bed with that night.\n","61":"\n Thurs.\n\nNot as cold as yesterday. Dental parade. Snowed a bit during the night.\n","62":"\n\nSnowed fairly heavily today about an inch deep.\n","63":"\n\nHad about a 12 or 15 mile route-march. By jove I was knocked up at the finish, feet aching a treat. Went to picture show that night.\n\nBought a pipe a few days ago.\n\nSun.\n\nChurch parade.\n","64":"\n\nUp had breakfast dressed & rolled our blankets etc. before day break & marched for station (4 mls.).\n\nReached London about 11.30 (Waterloo Station) & then marched to Horseferry Rd. (Aust. Headquarters). Told what & what not to do & then dismissed about 12.30. For a while we had to think, in the heart of largest city in the world & didn’t know a yard of it. So we walked up a couple of little streets & came to Victoria St. We first tried to find our way to Acton Town but failed. Wandering about & went to pictures & booked a bed at a small hotel 4\/6 for bed & brekker. My jaw a bit swelled. Went to a theatre fair performance.\n\nTues.\n\nUp & had breakfast & walked round to War Chest Club (Opp. Headqtrs.) & took a brake for a round\n\ntrip of London 4\/-. First of all we went to Tower of London. On our way saw Houses of Parliament, Hotel Cecil (1000 rooms), Scotland Yard, Bank of England, & through the city of London which is inside the one time old wall now pulled down & indicated by a slab on the \nstreet\n side of the street. Saw the Thames. The Tower is built on the","65":" Century type of Castle. ","66":" of all was the moat which was filled from Thames. Then a high wall then another high wall & then the inner stronghold. Saw \nwhere\n such as Prisoners Gate, the room where the two little princes were shut up & murdered, where Raleigh & Mary Q. of Scots was imprisoned & lots of others. The block & axe also the exact spot where Mary & 2 of Henry VIII wives were beheaded. Then all the old armoury & implements of war of former times. All in the jewel the sceptre\n\n& crown of H.M. A courtyard too the very same as the old castles we’ve read about. From there we journeyed to St. Paul’s. Absolutely the dome the best work of art I’ve ever seen. Most beautiful you could gaze about you all day. Went down into crypt where some our greatest men have been buried, Wellington, etc. After dinner we passed War Office and then went through W. Abbey another beautiful work of art & a big place too. More monuments. Saw the place where the King is coranated where he sits & everything else, Big Ben. From there we went through Hyde Park saw where Queen Alexandra & the King lives (Buckinham Palace). A lot of snow & a bit heavy for horses so we got out & were snow-balling each other & young tarts too – good sport. Theatre that night. Bed about 12. Getting mumps.\n","67":"\n\nBreakfast at nine\n\n& a read & smoke till dinner-time. After dinner free entrance to a theatre. Theatre again that night.\n","68":"\n\nNext morning went on sick parade, Mumps, that evening sent to N.W. public H. for infectious diseases not military Hospital different to camp. Nice bed & fine & good food & bonnie nurses.\n","69":"\n\nIn bed but in best of health only for slight swelling of jaw. A great explosion 10 miles away, munition factory but seemed just out side our window.\n","70":"\n\nReading & usual.\n","71":"\n\nDitto getting better.\n","72":"\n\nDitto getting better.\n","73":"\n\nReceived 2 letters from Jim – a real treat, almost better.\n","74":"\n\nO.K.\n","75":"\n\nRecorded to be the coldest day for a long time 29° or else 25°.\n","76":"\n\nAnniversary Day. Got up. Reading by nice fire.\n","77":"\n\nDitto doing a bit of \n\nlight work.\n","78":"\n\nCan only go out on balcony & then too cold to stay long. Another letter from Jim.\n","79":"\n\nWent down below & had a walk round. Talking to tabbies.\n","80":"\n\nA light fall of snow.\n","81":"\n\nA very heavy fall of snow about 5 ins. Great fun snow balling.\n","82":"\n\nSnow balling & walking about the joint.\n\nFri., Sat., Sun.\n\nHaving the best time since I left home having walks & smoking & reading before fire & good fun.\n","83":"\n\nA \nfair\n heavy snowfall. Pelting every body & beat 5 Ward another mob of Australians. That night the tabs brought down a force & we had a bosker time only we had to go in at 8. They’re fine little sports, moonlight. Snow all over the joint & reported. A fuss kicked up & supposed not to go out but break rules.\n","84":"\n\nExamined by Doc. & supposed to go out in a day or 2. Rotten. Sun came out this morning.\n","85":"\n\nA little more sun marvellous. British serving on Front.\n","86":"\n\nUsual good time leaving to-morrow.\n","87":"\n\nGot on the old Khaki again. Didn’t like leaving just like leaving home. Caught a buss to Vic. St. & walked back to Horseferry Rd. Went to \na Theatre\n London Opera House, ‘Cinderella’. Back & had supper at 12 & beddo.\n","88":"\n\nReported in morning & caught train at Waterloo Stn. for some camp on plains where you are classed if fit or not. Reached there about 3. After tea had a smoke & think over in C of E Club.\n","89":"\n\nFooling about & inspected by Doc.\n","90":"\n\nLeft there & travelled by train to Amesbury & then out to camp.\n","91":"\n\nExamined again by doc. & went to Y.M.C.A. in afternoon.\n","92":"\n\nOut on parade a b— going all day & up to your ankles in slush. When your finished in the evening you’re mud from knees down. Dueced cold too.\n","93":"\n\nditto. Received a mail of 5 letters & 3 Mags. & 1 from Jim in Hos.\n","94":"\n\nSick parade N.D. Fool about in your hut.\n","95":"\n\nSick parade again.\n","96":"\n\nAll under 19 not allowed to go to front till 19 so put on jobs. Me working on reading Room. Cleaning up in general.\n","97":"\n","98":" Pictures.\n","99":"\n","100":" Vaudeville.\n\nWed.\n","101":" letters from Jim.\n","102":"\n","103":" Pay. Pictures.\n","104":"\n\nIsolated in huts off job. No parade so sit in huts all day long\n\nby the fire.\n","105":"\n","106":" old Larkhill Camp.\n","107":" 26th,","108":" 28th\n\nUsual. Big push on Ancre to Baupaume . Pictures & a couple of letters.\n","109":"\n","110":"\n","111":" old joke. Got 2 teeth out. Snow.\n","112":"\n\nTill","113":" Isolation. A good time doing nothing. Pictures occasionally, & a letter every few days from Jim who is at Bristol & having a bosker time. Very few letters from Ausy. British take Bapuame & other important positions. Also big gains in Mesopotamia & Palestine. Snow.\n","114":"\n\nPut on a job in a dining or mess-room cleaning up tables.\n","115":"\n\nUsual.\n","116":"\n\nDitto. 5 Ausy mail.\n","117":"\n\nEvening went for a walk to Amesbury about 4 miles.\n","118":"\n\nWent for another walk to Durrington & Bulford, two little villages about 2 miles. Saw a plane down & went across a \npadd\n field & had a good look at it. Also went to another village Ficheldene & saw the old original chestnut tree & blacksmiths shop. Got a couple of chestnuts & a piece of stone off old church 800 years old. In all the villages very old churches & grave-stones.\n","119":"\n\nUsual pictures.\n","120":" \n\nWed.\n","121":" \n\nJim came back after an absence in hos. of 2 months. Pleased to see him & had a good long chat. Got a job as officers batman.\n","122":" –\n","123":"\n\nWent for a walk with Jim & Bert Wilson.\n\nSun.\n\nAnother walk & forwarded papers at different intervals lately.\n","124":"\n\nGot 5 letters from home.\n","125":"\n","126":"\n\nA few more letters from Ausy.\n","127":"\n\nA bit sunny.\n","128":" Sat.\n\nUsual Camp life.\n","129":" Another little walk. Came in about 9 & few minutes after \nBill\n Ern Davo & Tom Woods came in the hut. It was some surprise. Had a good chat for a time.\n","130":"\n\nFairly cold again. Saw Ern & Tom again that night & they gave us all the latest of home, Coopers etc. Gave them a couple of papers & letters to read as they hadn’t received any since lobbing.\n","131":"\n\nOn the same old job of clearing up the mess table. On nippy morning it makes your fingers very cold handling cold plates. Still more of our lads going over.\n","132":"\n\nWrote a few & received a couple of letters. Evenings getting longer. Every time I finish after each meal I generally go over to Jim’s room where I write or have a lay down. Ern lobs in occasionally too.\n","133":"\n\nUsual. Still a bit nippy but place beginning to look a lot brighter. Trees coming out in leaf & birds beginning to twitter etc.\n","134":"\n","135":"\n","136":"\n\nAn aeroplane came down in Durrington a little village quite handy. The chap was killed & the thing dived in ½ out of sight making a big hole. It lobbed in the backyard just missing in a street of houses. Got a little bit of a splinter from it.\n","137":"\n","138":" old job.\n\nTues.\n\nRevue by King of all Australian troops on Salisbury Plains. Jim went right down, but I just saw all the troops from ½ way. Left too late. Jim was standing about 10 yds. from saluting base.\n","139":"\n\nPictures.\n","140":"\n\nPay.\n","141":"\n","142":"\n\nPic. & Vaud.\n","143":"\n\nWent to Salisbury for an evening. Had a fair time. Car there & back & saw the church which is a bosker for size of place. Highest in England. Told us all its history. Had 3 or 4 lunches in the evening altogether & came back about 12.\n","144":"\n","145":" job with always morning & afternoon tea. Not\n\nmany of our chaps left now. All gone over which makes us feel it a bit. Weather bosker now. Jim likes his batman’s job. Concert.\n","146":"\n\nPic. & vaud.\n\nWed., Thurs., Fri.\n\nReceived a couple of letters. Jim writing well. Pict.\n","147":"\n\nConcert\n","148":"\n\nA little walk.\n","149":"\n\nNice weather.\n","150":"\n\nNice weather.\n","151":"\n\nA great surprise, Hector McPherson only camped about 100 yds. or so from us & didn’t know it. Ern Davo found him & Ho. Hollingsworth too. He was on draught the night we saw him too & only had about ¼ of an hours chat. He hardly knew us. Ern brought down a few papers he had\n\nreceived from home.\n","152":"\n\nWriting home every week generally twice.\n","153":"\n","154":"\n","155":"\n\nWent over to Flying School & saw all the planes & a R.F.C. chap gave us a wash & brush up in his quarters. Very good of him. Never got a ride as none were going up. Lousy with skylarks also a few hares & partridges. The streams are full of salmon & trout & pike but not allowed to fish. Same as with hares & birds. All the trees & hedges are a lovely light green, good grass & wild flowers of different kinds all over the paddocks.\n","156":"\n\nPlenty of Huns working here. \nTwo\n 3 escaped from here to-day but were captured the same evening. Concert.\n","157":" till","158":"\n\nWhen we came on Bull Ring again received about 6 & wrote more. Pictures about 3 times a week & generally a walk on Sat. or Sun. evening.\n","159":"\n\nSoldiering on again out of War - Babies. A bit stiff","160":" day. Received a batch of 12 letters. Goodo. Concert.\n","161":"\n\nNot too bad only kept going. In 4th week.\n","162":"\n\nConcert.\n","163":"\n\nWeigh 12.4\n","164":"\n\nInoculated after church parade. After going to pictures that night coming home we got\n\nbiggest surprise out when who should we meet but Jim McLatchie. He had been in France 13 months & then got a smack in the arm. After coming out of hos. he had just been down a few days when we struck him. Had a real bonser chat about old times. Fairly warm.\n","165":"\n\nAfter parade we went over & saw Jim Mc. again. Wrote 8 letters between us. \nNight operations\n","166":"\n\nNight operations. Very warm days now.\n","167":"\n\nWent to pictures with Jim Mc. & had another pleasant chat.\n","168":"\n\nGot leave to London & caught train at Amesbury at 8.52. Country going up a vast difference. Everything beautiful now.\n\nArrived at Waterloo Stn. at about 12 midday & then walke to Horseferry Rd. & had a nice meal at War-Chest Club. After dinner \nwent\n walked down \nout on\n Victoria St. & branched off into Hyde Park. In Jan. it looked like a swamp would. Thick with snow & all the trees old & dead looking. Now it is all out in leaf & bloom. The ducks on the ponds & \nchaps\n pulling-boats being rowed about too. It was beautiful. Saw Rotten Row too. Went back to War Chest for dinner. Had a smoke & read in lounge room & took a taxi from Picadilly to Mme. Tussauds Wax Works. We got up-stairs without a guide book & then I said, How about buying\n\none, (they sold them down-stairs) & old Jim started to walk up & ask a dummy girl figure which was seated at a desk with some in front of her, when I grabbed him by the Back of the coat & pulled him back. Gee! I did laugh at him. Had tea & went to a play called ‘Bubbly’ just off Trafalgar Square a bit, very good. Got lost coming back as its fairly dark. Ran across Charing Cross (Under.) & took the tube to Westminster & then we were right.\n","169":"\n\nBreakfast & then went to Waterloo Stn. to find what time train left that night.\n\nJumped on a bus & went out for about an hrs. ride in the suburbs. Came back another way to Victoria Stn. Had a rest in Hyde Park then to Pictures where tarts in front were smoking, drinking & carrying on in a manner disgraceful with a couple of soldiers. Thence on to Waterloo & home to old Larkhill about 2 o’c in the morning.\n","170":"\n\nVaccin\n Inoculated & while off duty wrote a couple of letters. Went to pictures.\n","171":"\n\nLaying about & cleaning up. After dinner wrote a letter & after tea went over & saw J. McLatch \n\nM. Hindmarsh\n\nC\/- Aust. Y.M.C.A.\n\nB.A.P.O.I.\n","172":" My birthday till","173":"\n\nContinued our training, threw live bombs, went through gas & musketry. Went to Salisbury 3 times. Good times. Walked over to aerodrome but never got a fly & had a fairly stiff time training. Warned for draught.\n","174":"\n\nGot exchanges & fixed up.\n","175":"\n\nMarched off amidst the usual carryings on etc. Reached Amesbury almost dark. Travelled all night in the train & reached Folkestone about 4 in the morning. Billeted in houses till about 2 then marched down to pier & crossed channel to Bolougne in about 1½ hrs. Small destroyers\n\n& a French dirigible escorted us over. Sometimes it was just over the top of one of the masts. Marched through Bolougne & up on top of a hill to a rest camp. Bolougne is a fair sized joint but nothing up to date about it like most European towns. The boys do a lot of calling out & yelling etc. & it makes things a bit lively. Next morning marched down to station & entrained for base Havre. It took us about 2 days only about 60 miles. Nice country we passed through. Stayed ½ a day at Rouen. Very nice place what I’d seen of it but weren’t allowed out from our river side Promenade.\n\nReached La Fluer about 2 miles from camp on morning after leaving Rouen. Put in about 2 weeks at Base which is about 5 mile from centre of Havre. Not a bad joint. Saw most of the place. Met Miss Hindmarsh at a Base Y.M.C.A. Very nice lady & a few very nice yarns. Trained on Bull ring. Left Havre on","176":" & reached billets with Batt. on","177":" Spent a night at St. Omer another fairly big place. Batt. just came back for a rest for a month or so they say. Route marches occasionally but better than base or Larkhill. \nSt. Omer\n Had a good walk round St. Omer that evening.\n\nNext morning caught train & took about 5 hrs. to go 20 mile. Very tiresome. Got off at a small place Lottingham & marched part of way to Batt. getting a motor-ride the rest a matter of about 20 kilos. Very tired.\n\nNext day we received some Ausy mail.\n\nWe were put in a Froggies Barn. The farm-houses are all built in a circle or square with generally a big puddle-hole in the centre or water-hole. The farm-houses are all together & it forms a small village always with a church & a few estaminets in it. Every farmhouse about here has an apple\n\nwhich we raid fairly often. Also there’s a lot of black-berries about here. We often hear the guns from here booming up the line & we guess there’s a straeffe on. Fritz raided Bolougne the other night & next day there were a lot of planes about ours or Fritzs we couldn’t tell. \n\nThe route marches here are rotten & we drill same as any-where else. Last night we heard a plane or more go over & then booms & we concluded Fritz was raiding some of our back towns.\n\nDoing guard to-day. Nice warm day. This week we have received 3 lots of letters at 5 or 6. Goodo.\n\nLeft there after staying about 6 weeks. While there got a fair amount of mail all the time. Left late in Sept. & it took us 4 or 5 days to get up near the line. Camped just behind Ypres for about 3 days & then went over the top in our","178":" stunt on","179":" Ypres is knocked about a lot not one whole building & the place is a large one. We both came through the stunt after a fairly trying time. Back to camp again after being in 48 hrs. Fritz is over every night bombing everywhere.\n\nWas in","180":" go on","181":" worse time than","182":" saw some awful sight & hard job to get out through mud & bog. After a day back we went right back to our old\n\nContinued.\n\nbillets at Zoteux. Its tres bon back here but beginning to get a bit cold.\n\nFrom","183":" till about","184":"\n\nStayed at Zoteux. Doing a little drill etc. Had a terrible time with the chats. Used to buy eggs & de lait off madame & also make custard on her stove. All the rest of a chap’s time was put at gambling two-up, poker & snap, which is a chap’s only relaxation in reserve & supports.\n\nMoved away on","185":"\n\nMotors to Hazelbrouk & stopped at Merris. Two days marching & we entrained on light railways from Steenwerke . Got out at famous Hyde Park Corner or Plugstreet & into catacombs in Hill 63 just behind Messines. Long chambers fitted electric lights & bunks. 8 days there in reserve working parties every night carrying up duck boards, wire etc. Terrible fatiguing. About 2 mile a trench to walk up.\n\nThen we took over front line for 8 days. During that time usual routine of trench warfare, patrols, a few straefes, ration carrying & looking over the top.\n\nAlmost freezed to death for 4 days up to our knees in slime & freezed from arsole down. Enough to make a man howl.\n\n8 days in reserve & then 8 in front line again, raided Fritz in last 8. Took some prisoners & gave him a good towling up. \n\nHad a few close goes with machine guns & whizz bangs.\n\nWent back a few miles to Neuve Eglise & put in a month tunnelling. Had a terrible time cold feet & very sore too. Came back from tunnelling & spent 3 weeks doing nothing. Going to quack. Had Christmas there. Just before we went back I went to Hosp. or C.C.S. with Scabies. \n\nHad a bonser spell of a fortnight. Only in markees & stretcher to lie on but thought it was a palace. Went back & put in another 3 weeks in line in same place opposite Warneton (right of Messines). Went back to near -- & just had a week & Fritz opened up on","186":"\n\nRushed straight down to Somme near Albert. From train two days marching till we came in contact with Fritz.\n\nHopped over 2,000 yds. dug in for 4 days 4 days supports which was in Mericourt. (J. McLatchie killed here.) People gone. Beaucoup wine, champagne, fowls, rabbits etc. & troops had run of joint. Dossing in beds, sheets etc. Put in 50 days at this game front line etc. & kept Fritz getting to Amiens. Had a rough time near the last. Pulled back 10 kilos for a\n\nfortnight. Back to Villers Brittoneux . Up there a week & got cracked in the ribs. Went right back to C.C.S. & operated on piece of shell taken out, & part of two ribs & part of liver. A decent left swing. Put in 6 weeks at C.C.S. too crook to move & then to Transport on coast. Sister at C.C.S. very good to me.\n\nA week or so at Transport & then up to Havre & across to Southampton. From there train to Bristol. Put in 2 weeks there during which time I got up a few times in a chair. Then to Clevedon V.A.D. where I spent best 5 weeks ever. A proper home. Could shot a rock into sea from Hosp. & nice esplanade. From there to Dartford London, 8 days there. On parties nearly every day, Theatres, dances, etc.\n\nWas boarded & marked C.3. To Weymouth & then to Verne. Boarded (final) & still C.3.\n\nGreat events happening. Clearing of Belgian coast & all along the front. Turkey surrended","187":" Armistice signed with Austria","188":" Armistice with Germany","189":" Finis war great peace celebrations went into Weymouth that night. Things were a bit lively.\n\nOn","190":" left for my 4 days, warned to be back Friday.\n\nHit London 2 o’c there till 8.45. Things still very lively. Old London was going stone mad. Glasgow next morning about 10. Very hilly & would be pretty in Spring. Went to Overseas Club & good welcome. Brekka & knocked about till dinner. After matinee Tea 6 & fooled about the city till train went at 9. Also received\n\na telegram to return Euston (London) next morning at 7 & struck out for Waterloo Stn. Something to eat & hit out for Portland again. Home about 7 that night. Next day all fixed up for going, inoculated, kit inspection, etc. Pictures & concerts started again every night. Applied to go via America but seeing going in few days I withdrew .\n","191":" I’ve proved it since as I’ve just been passed off another boat beside","192":" one I was on. Been shifted back to Weymouth again. Just before I left Verne I went to a dance there. Had a decent old time. Getting close on to Christmas & no snow yet. Marvellous. Haven’t written or received a letter for over 6 weeks now. Feeling pretty fit & pictures or play every night.\n\nHaving plenty of . I had plenty of suppers, vaudeville & picture shows. On another boat roll & leaving tomorrow. Last night in old Blighty. Screwed off a Fritz U Boat & went on board as it was on show. Had a good look over it & quite interesting you may guess.\n","193":" New Year\n","194":" Up at 5 & marched to station at 6. Boarded & hit Depot Devonport & Plymouth about 12. Once aboard the ‘lugger’ and we stayed in all night. Moved out next morning after breakfast down the old sound. The usual Hurray & Cooeeing. Christmas dinner was up to shit as per usual. That night I was a bit crook, in fact I ‘heaved my guts up’. First time crook on either journey. I was right straight away after.\n\nAfter about 6 days sail passed through Gibralter. One of prettiest coast sights I ever saw was Range of Sierra Nevada running along S. Coast of Spain seeming to rise from the sea making a big bluff of about 8000 feet. All the top was glistening with snow or sand (arguments) & with near dark in the foreground it looked tremendous as I remarked previously. Usual routine of troop ship life only no parades. \n\nBreakfast 8 lay on decks reading or cards, most of my time at chess. A sing-song at piano every night & once a week a concert. Passed by \nGib\n Malta about a week from\n\nGib. Seems a barren little square rock. Big Naval Base at Valleta (Capital). Nothing unusual till Port Said. Amongst the Gippos & niggers again. Quite a lot of shipping. Not allowed off on a\/c of Flu. Usual mob of Eastern vendors of all nationalities selling wares of different kinds. Left here after a day’s stay & started through the canal. A great piece of work. Sand on either side as far as you can see except an occasional oasis or a Ave. of palms & green vegetation presumably a creek or something. Canal only about 200 yds. or \n\nor less in width & boat goes about 4 knots. Saw a lot of trenches etc. along canal where they dug in when Johnny made a dash in ’14 or 15. Port Suez same as Port Said. A surprise to me was high range of mountains behind. Kicked out & rocky hilly country. No wonder old Moses couldn’t get food & couldn’t find his way out. \nOne\n Some one pointed out Mt. Sinia . He! He! through Hell’s gate in Red Sea & past some inhabited Is. near Aden & headed for Colombo. Saw most W. point of Africa a promentary. About 5 days & hit old Colombo. A fair sized joint, trams etc. In all these Br. eastern\n\nThe Eng. & native part of the town niggs. doss in huts. People live well with beaut nig. servants. Got some Ceylon money & little elephant as souvenir. One chap got one about 20 ins. high, a beaut. Not near as much shipping as Port Said. Some of the nigs well educated, speak fluent English. The Cingalese are physically a better race than at the other two ports. They coal the ships out in the harbour off barges. A lot of young nigs scaling about the sides & we had some fun with them boxing, singing & doing tricks. A very beautiful sunset that evening\n\nnot descriptive enough to describe it. Town nestling amongst groves of palms, bananas etc. Saw Mt. Adams Peak in the distance. Coast very low lying & verdant. Left after two days & had another fortnights stretch till Fremantle. Had a fancy dress Ball. Goodo. All kinds of characters. Coming into Fremantle Harbour crowds on wharf cooeeing, etc. Something more I can’t describe the thrill of something which passed through me again & again as I hoorayed & gazed on the gesticulating people & land which God granted me to see again or fate luck whichever.\n\nRottnest Is. just a few mls. out. Not a very big harbour – poor I thought. Not a very spectacular place a bit dusty & slow trams & a bit above itself. Hadn’t time to run up to Perth. Had 3 buckshee feeds people very kind & gave us a storming off. Usual lot\n\n"}}