{"Document Name":{"0":"Diary_0289","1":"Diary_0289","2":"Diary_0289","3":"Diary_0289","4":"Diary_0289","5":"Diary_0289","6":"Diary_0289","7":"Diary_0289","8":"Diary_0289","9":"Diary_0289","10":"Diary_0289","11":"Diary_0289","12":"Diary_0289","13":"Diary_0289","14":"Diary_0289","15":"Diary_0289","16":"Diary_0289","17":"Diary_0289","18":"Diary_0289","19":"Diary_0289","20":"Diary_0289","21":"Diary_0289","22":"Diary_0289","23":"Diary_0289","24":"Diary_0289","25":"Diary_0289","26":"Diary_0289","27":"Diary_0289","28":"Diary_0289","29":"Diary_0289","30":"Diary_0289","31":"Diary_0289","32":"Diary_0289","33":"Diary_0289","34":"Diary_0289","35":"Diary_0289","36":"Diary_0289","37":"Diary_0289","38":"Diary_0289","39":"Diary_0289","40":"Diary_0289","41":"Diary_0289","42":"Diary_0289","43":"Diary_0289","44":"Diary_0289","45":"Diary_0289","46":"Diary_0289","47":"Diary_0289","48":"Diary_0289","49":"Diary_0289","50":"Diary_0289","51":"Diary_0289","52":"Diary_0289","53":"Diary_0289","54":"Diary_0289","55":"Diary_0289","56":"Diary_0289","57":"Diary_0289","58":"Diary_0289","59":"Diary_0289"},"Date":{"0":"unknown","1":1756.0,"2":1757.0,"3":1758.0,"4":1760.0,"5":1761.0,"6":1762.0,"7":1763.0,"8":1764.0,"9":1765.0,"10":1767.0,"11":1768.0,"12":1769.0,"13":1770.0,"14":1771.0,"15":1773.0,"16":1774.0,"17":1775.0,"18":1776.0,"19":1777.0,"20":1778.0,"21":1779.0,"22":1780.0,"23":1781.0,"24":1786.0,"25":1787.0,"26":1788.0,"27":1790.0,"28":1791.0,"29":1792.0,"30":1793.0,"31":1794.0,"32":1795.0,"33":1797.0,"34":1798.0,"35":1799.0,"36":1800.0,"37":1801.0,"38":1802.0,"39":1803.0,"40":1804.0,"41":1805.0,"42":1808.0,"43":1809.0,"44":1810.0,"45":1811.0,"46":1814.0,"47":1815.0,"48":1816.0,"49":1818.0,"50":1820.0,"51":1821.0,"52":1822.0,"53":1823.0,"54":1824.0,"55":1825.0,"56":1829.0,"57":1831.0,"58":1832.0,"59":1833.0},"Entry":{"0":"\n\n","1":"\n\nWalked over the hills. A lovely view of the valley of the Somme is got from these hills. Had to do fatigue work fixing up a tumble down cottage as a billet for the Major, this afternoon.\n\nWalked along the banks of the River Somme. A number of Aussies were out on the river in a flat bottomed boat fishing. They had got the hold of a lot of Fritz bombs, tons of which are lying around here. They threw them one at a time into the water, the result was a terrific explosion, the water rising thirty feet high and by this means the fish were killed and they got a good catch. An easy but risky way of fishing but they must have destroyed nearly everything that was in that part of the river. A beautiful evening.\n","2":"\n\nWent on a commission along with Cpl. D. to get some butter, eggs, wine, for Major R. We had a definite village, Glassy near Amiens, to go to but no definite means of getting there.\n\nAfter walking about three miles carrying a big, heavy basket, we were fortunate in getting a Motor Transport which was towing a broken down M.T. in the direction in which we were\n\n \n\ngoing. We travelled through country which had lately been devastated by war, right to Villers Brettaneaux the place we Fritz had been turned in his late big advance. Villers Brettaneaux is very badly smashed about, but the village La Motte which is before it is much more so, this I am told was done by our own Artillery. This road is a straight road lined with trees and is at least fifty miles long. Large numbers of German prisoners were doing labouring work right along this road.\n\nWe reached our destination and we found it was situated 4½ miles from Amiens. We could see this city away in the distance with its beautiful Cathedral conspicuous above everything.\n\nAfter a great deal of difficulty we managed to purchase a few of the things we wanted and we then made our way back with our heavy basket. To get these few things we had already travelled over thirty miles. After waiting some time on the road we got a M.T. which was going part of the way. This we were very thankful for as it began to rain and big black cloud were lowering above us.\n\nSpinning along the road we covered the distance much more quickly than we expected.\n\n \n\nWe had to descend at another smashed up village called Proyart. The rain began to pour and as we were miles from our destination we thought we were in for a bad time. We got a lift for a mile in another light car, then we had to descend again. Walking another mile or so in the rain another car came along. The Officer in it seeing our predicament asked us to have a lift at the same time handing us his cigarette case and we finally reached our destination, Bray.\n\nA War Correspondent writes:-\n\nWhen the name of a place is mentioned in all this desert region, it merely means a position covered with ruins and rubble, without food, without water, without inhabitants. This correctly describes it.\n","3":" \n\nLarge numbers of 1914 men came into this town to-day. They are gathering in the next lot for the trip home to Aussie. From a deserted village this place has been turned into a place full of life, that is soldier life.\n\nTwo civilians, presumably husband and wife came into the village to-day. They had been former inhabitants and had come back to see their home. What a home coming it must have been. One could see from the\n\n \n\nexpression on their faces as they pointed out to each other ruined houses which they must have known under different circumstances. We are still uncertain as to going away. It is said that everything is all right at this end.\n","4":"\n\nWaited all afternoon on General Birdwood. When he arrived he gave us an address and he appeared to be deeply affected. He said that he wished he could say that we would not require to come back again, for in spite of the brightness of things at present, he did not think that the war would end this year.\n\nThere being no intoxicating liquors to be had here there are no drunks and there being no drunks the men are very quiet and orderly.\n\nWalked around the civilian cemetery. Even the dead have not been allowed to rest in their graves. Headstones and graves had been uprooted by the explosion of shells and the cemetery was a wreck of a place.\n\nHad met quite a number of chaps whom I have not met for years.\n","5":"\n\nOn parade in the square 6 a.m.\n\n \n\nWe were marched off in batches of 26 men to each waggon. There we were, eight hundred men, ready to go to the other side of the world, while flying in the air above were thousands of swallows preparing to go away also.\n\nWe were allotted a Goods Wagon to travel in. We left Bray sur Somme at 10 a.m. After passing slowly over the late battlefield for over thirty miles we reached the city of Amiens having just left all the desolate country behind.\n\nWe happened to stop at a railway siding when one or two of our number disappeared. A few minutes afterwards they hurriedly brought a bale of straw which they had pinched from somewhere. It might have meant the cancelling of our trip had it been found out. But as it was dark no one saw. This straw was used to cover the floor to sleep on and made a very comfortable bed. We expected to be seven nights travelling, so that something soft was necessary as one can well imagine in travelling in a goods waggon.\n\nWe reached the outskirts of Paris at midnight.\n","6":"\n\nWe passed through charming country to-day. The largest town we passed was Dijon which we reached at 10 p.m.\n","7":"\n\nWhen we awoke early this morning we found ourselves at a place called Germaine au Mont D’Or. We left the train at this part and were marched a short distance to a well conducted rest camp where we had breakfast and a hot bath. A few managed to get the hold of some liquor and made fools of themselves. Saw some troops coming back from Eastern parts. They looked physical wrecks. \n\nLeft Germaine au Mont D’Or at 12 mid day. Next stop 20 kilos away and is the city of Lyons.\n\nAt this station most of the troops amused themselves throwing pennies, cigarettes, etc. to children on to the streets below the station. This was the cause of a great deal of sport.\n\nWe then went rapidly through most charming country by river, hill & dale. At some parts we ran parallel with the wide river Rhone.\n\nWhen I passed this way two and half years ago it was spring time, now it is autumn and the trees have taken on their varied autumn tints instead\n\nof the beautiful pink blossom of spring time.\n\nLying in the railway siding are truck loads of baskets of grapes and at every opportunity the troops are of the train and pinching baskets of these grapes. This is all right for themselves but what about the poor people who belong to them?\n\nThere does not seem to be much twilight in these parts. Gradually this beautiful and charming scene is hidden from our view by the growing darkness, a light or two marking a roadway, a number of lights grouped to-gether marking a town, the stars twinkling in the heavens above, the dark outline of hills and trees, a quiet peaceful air pervading all and we then unroll our blankets, spread the straw on the floor\/ground and we turn in to sleep, packed like sardines in a tin, and don’t awake till day breaks the next morning.\n","8":"\n\nWe are right into eastern climate again. Early this morning we reached Marseilles. From there we sped over hills till we reached Toulon. From Lyons downwards, grapes seemed to be the principal fruit grown but round and about this district olives are predominant. We have come right along the Riveara passing Nice, Cannes,\n\nMentone, Monte Carlo. We got a splendid reception all along the way. A stop was made by the train on the sea shore near Mentone. No sooner had the train stopped than out jumped the men in hundreds and stripping themselves quickly they plunged into the briny.\n\nWe passed Monte Carlo in the darkness.\n\nAbout 10 p.m. we entered Italy.\n","9":"\n\nWhen we awoke this morning we found ourselves well into Italy at a place called Savona where we were taken in charge by the Electric engine. Very high mountains in these parts.\n\nHad a long stop at Geneva. It is strange to see the many large towns built high up on these mountains. These mountain sides are well cultivated apparently with vines and fruit trees.\n\nThe houses are all painted a yellow or pink colour. They look cheap like. Even paintings are done on the houses but to my mind they are not artistic.\n\nThe Italians have a peculiar way of waving their hands. They hold up their hand with the back to you and bring their fingers forward\n\nto themselves.\n\nWe have gone through tunnel after tunnel since we reached Italy. These parts seem to be nothing else but tunnels. One of the tunnels which we went through at a place called Roneo must have been at least eight miles long. After passing through these many tunnels we came on to more or less flat country with small hills on one side. The produce seemed to be of a mixed character, Vine, Olives, Almonds, Apples. Huge bullocks are used for tilling the soil. The people are very dark skinned. To go without boots seems to be the fashion amongst the working classes.\n\nIn England the children ask for pennies, in France for souvenirs, in Egypt for Buckshish, and in Italy one cigarette. Cigarettes seem to be at a premium in this country judging by the joy that is expressed on receiving a cigarette.\n","10":"\n\nExcitement as to which way we are going to travel, east coast, or west coast. If we travel west we have a chance of seeing some of the ancient cities, Rome etc.\n\nThe trains run very slow in Italy.\n\nVery rich agricultural land\n\nin the North of Italy.\n\nIn the evening we reached the Rest Camp at Ferenza . It was a fine camp with a fussy little Colonel in charge who looked as if he had just come out of a band box. He impressed upon us that he was giving us a privilege by allowing us to march through the town of Ferenza.\n","11":"\n\nThe trip is now becoming monotonous. The country is very poor looking down the east coast.\n\nAfter passing Ferronza we journey down along the coast. A great many Italian troop trains passing up and down the line. They are nearly all on leave from Salonica. Numbers of British troops are coming from there also. They are more or less breakups. Malaria seems to be rampant there. Some of there number told us that large numbers of them had died on the way home.\n\nNews from the various fronts is good. We here that Turkey and Bulgaria have thrown up the sponge.\n","12":"\n\nArrived at Toranto Rest Camp for the night. A very large camp it is. Large Canteens here. All along the journey from Amiens to Toranto we\n\nhave been well looked after by the Y.M.C.A. They have provided us well with Tobacco, Cigarrettes, Biscuits, Chocolate. Very hot here.\n","13":"\n\nLarge numbers of Naval men here. Numerous battleships in the bay. Reminds one pretty much of Lemnos Harbour. Up at four o’clock this morning. Sailed over in barges to the fine big vessel \"Ormonde\". It was well camouflaged with blue & black. I have not landed into very good quarters. We are well down below the water line and there being no port holes, there is not much air getting in.\n\nWherever one sees crowds of men to-gether and if there is any waiting to be down one finds them playing cards, games of house, pitch and toss. These games of chance seem to have an intense fascination for men. Means are provided on board for the change of our foreign money. This is very convenient and very necessary.\n","14":"\n\nA big number of Hydroplanes flying about the Harbour. A big number of young Tommy Officers came on board, said to be going to India. Plenty of Fatigue work going about. Officers and N.C.O.s full\n\nof business and their own importance.\n","15":"\n\nAs we sailed down the harbour towards the narrow entrance we passed an upturned Italian battle ship which owing to an explosion had turned turtle. A terrific noise of sirens from all the ships as we passed and loud cheering from the people on shore made us wonder what had taken possession of the people. We had not read the newspapers for days so that we could not account for the immense enthusism of the populace.\n\nOne of the sailors on board told us that he had sailed out of this harbour many times with troops aboard but he had never witnessed such a scene amongst the people. Passing through the narrow entrance of the harbour we anchored in the bay outside. News came aboard the ship that Germany had asked for an Armistice, but we had all been in the Army long enough to put no faith in rumours.\n\nThere is very little reading matter aboard this ship. The Colonel of the ship is endeavouring to put down gambling.\n\nPut on hospital duty to-night.\n","16":"\n\nFrequent visits are being made\n\nby the Motor Boats of the Landing Officers to the Kaiser I Hind & the Ormonde and also another smaller ship all of which are lying in the Bay with troops aboard.\n\nIn the afternoon three large Italian warship passed down between our transports.\n\nA number of Japanese warship have come in and are lying along side of the transports.\n","17":"\n\nAbout eight o’clock this morning we quietly moved off. So quietly did we sail out that we were well into the Gulf before we were aware of it.\n\nA sickly and crowded deck is the result of our sailing out to sea to-day.\n\nWe are being escorted by four Japanese warship. They look well as they cut through the water.\n","18":"\n\nThe troops seem to have got over their attack of seasickness. There is more life about them to-day. Gun practise by the gunners in charge of the guns on the two troopships. Some substance was thrown overboard into the sea which gave off a yellow smoke which continued rising for a long time. At this the gunners fired and they struck bulls-eyes every time. This looked bad for any submarines which should come in our way.\n\nThe sea is beautifully and calm. The troops on the whole are looking well but there are a big number, mostly Tommies coming into hospital with very high temperatures.\n","19":"\n\nSong Services are being held by the C of E padre and they are being well attended and greatly enjoyed.\n\nAll men are to sleep on deck. The weather is very hot. Read Stopford Brookes \"History of English Literature\". Matches are very scarce on board the ship, food is not plentiful, neither is it well cooked.\n","20":"\n\nQuite a big number of sick in hospital mostly Flue. Arrived in Port Said at eight oclock to-night. Anchored outside the canal.\n","21":"\n\nA big number of ships at Port Said. All busily engaged loading or unloading stores. We have also taken on extra stores. Some of the Tommy troops are getting off here.\n\nLeft Port Said and sailed down the canal this afternoon. For miles and miles along the banks of the canal troops are camped and there must be millions of tons of stores there also. A huge contrast to what it was like four years ago\n\nwhen these places were nothing but sand, sand, as far as the eye could see.\n\nA splendid swing bridge has be built across the canal and by this means the railway runs right from Cairo to Jerusalem. Anchored at Kantara. Sick went off here.\n","22":"\n\nReturned hospital gear to ship’s stores.\n\nDisembarked at 7 p.m. Marched along through the large camp across the bridge to the railway siding.\n\nA hospital train was lying there and the patients looked absolute wrecks. They were all of a very yellow colour. Malaria seems to be rampant amongst the troops in Palestine.\n\nLeft the siding and travelling via Ismaelia, we reached Port Suez at 4 a.m.\n","23":"\n\nPlenty of \"chats\" here in this camp. A disturbance caused by the troops in Port Suez the previous night put the town out of bounds to troops.\n\nPort Suez does not look much from the ship but it is quite a big town when one is in it.\n","24":"\n\nTravelled in trucks to Port Tewfik. Went aboard the \"Port Sydney\". Lay outside of the harbour till (8 in the afternoon and sailed at) 8 in the evening and then\n\nsailed.\n","25":"\n\nWhen we awoke the next morning there were rugged hills on either side of us. The sea is very calm.\n\nFood is very plentiful on board. On hospital duty again.\n","26":"\n\nAwoke this morning and found that there was no land to be seen.\n\nWe have struck three squalls to-day. The rain fell, the lightening flashed, the thunder rolled and the wind blew terrific. Suddenly the sky cleared and things brightened up a bit only to come on again during the night.\n\nThe weather has been exceedingly hot since we left Suez. The Officer in Charge of the ship is making life unbearable. It is Parade, Parade, Parade never ending parades.\n","27":"\n\nConcert to-night.\n\nHospital full up with sick. Chatting their shirts is a favourite pastime amongst the troops on board.\n\nPlenty of books aboard. They have been provided by the Red Cross and the Y.M.C.A.\n\nThere being no intoxicating liquors aboard the effect of this is seen in the quiet behaviours of the men. The crew seems a very decent\n\nset of men.\n","28":"\n\nThe O.C. seems to be taking a special delight finding jobs for the men on board. Most of them under the circumstances, unnecessary. The thick mist has gathered all around and bare outlines of mountains can be seen very faintly.\n\nHospital still full up. Two pneumonia cases aboard. Passed the head lights of Aden at 8 p.m.\n\nAway in front of us we can see the Red and Green lights of a hospital ship.\n","29":"\n\nVery hot this morning. No land is to be seen. Away in the distance we saw a whale spouting water through its nostrils.\n","30":"\n\nPassed the island of Socotra. We have been sailing along side of it all day. From our ship we could see no sign of habitation or inhabitants.\n\nLarge numbers of porpoises are frolicking about in the water.\n\nThere is a marked improvement in the appearance of the troops on board the \"Port Sydney\" since the time that they come on board, no doubt as a result\n\nof their enforced temperate lives.\n\nHave read Hazlitt’s \"Essays\". They are delightful.\n\nLooking over the rail of ship watching the propellers stirring D. I. & J. were discussing the places we had been, the people we had met and the question also arose what are we going to do when we get back into Civil Life again?\n","31":"\n\nDelightful Concerts are being provided by the Impromptu Concert Party.\n\nThe climate is so hot here every one is perspiring freely. Beautiful evenings and magnificent cloud effects.\n","32":"\n\nThe ship seems to be putting on greater speed since we entered the Indian Ocean. Not so many in hospital. Flying fish are flying about in droves over the sea. They do not fly for any great distance. They kept up for a short distance then drop into the water with a splash.\n\nThe crew of the ship are busily engaged painting it.\n\nThis is a splendid sea going vessel. One can hardly believe that they are on a ship so smoothly does it glide and there is\n\npractically no vibration. The only gambling game that is allowed amongst the troops is the game of House.\n","33":"\n\nOperated on.\n","34":"\n\nPassed a light house. It is said to be on the Maldive Islands.\n\nMen paid to-day.\n\nAn issue of new under-clothing.\n","35":"\n\nArrived in Colombo ","36":"\n 8 o’clock this morning. A thousand of the men were allowed ashore. We had to climb down from the deck on rope ladders on to barges and these barges took us over to Colombo. The chatter, chatter, of the natives as they coaled our ship from both sides, was a source of annoyance to us. They coal by hand labour at this port. A series of three platform all slung to the side of the ship. The barges bring bags of coal over and men standing on the platform sling them up in relays till they reach the entrance to the coal bunkers.\n","37":"\n\nWent on leave to Colombo with a few others to-day. Y.M.C.A. provided a free dinner.\n\nWe also got a ride in a Motor Car round Colombo. This also was provided free by the Y.M.C.A.\n\nThere are some fine book shops in the Town.\n\nJ.B. and I went round the various sights in a Rickshaw, visiting amongst others, the Cinnamon Garden and the market. This place was crowded with native people selling fruit and vegetables. We bought a couple of huge bunches of grapes also oranges and limes.\n\nBlack Ebony elephants were also a great favourite as a purchase by the troops. They were large assortments of beautiful silk goods for sale and many soldiers bought these things to bring home with them.\n\nWe had a most enjoyable stay in Colombo. I liked the city very much.\n\nThe average native is much cleaner here that the native of Egypt.\n","38":"\n\nLeft the harbour at midnight. A bit of a swell on so the ship is rocking a good bit.\n","39":"\n\nCrossed the equator about seven o’clock to-night. We had a good concert on at the time we were said\n\nto have reached that part.\n","40":"\n\nNews by wireless still continue good. The contents of terms of armistice to Austria seem pretty stiff also the terms put forward to Germany. The weather is wet this evening. Have read Walton’s \"Compleat Angler\".\n\nAn order has come out that all men are to wear boots on board ship.\n\nThere is some sense in this order however, as the men have been in the habit of going without boots, on the voyage, and as we are coming pretty near to landing it is necessary that the men should become accustomed to wearing their boots again, before going ashore.\n","41":"\n\nMuch cooler to-day but inclined to be wet.\n\nTroops are being issued with receipts to hand to the bank to give them their money owing to them.\n\nNew clothes are being issued to the troops.\n","42":"\n\nBoxing Contest on to-day. An issue of Fruit as been given us to-day.\n\nAlthough the sea has been pretty rough these last few days it has not had much effect on the ship because\n\nit has been going steady enough.\n\nSpeculation is great amongst the men, \"When are we likely to reach Fremantle?\"\n\nIn the morning the news by wireless was that the Kaiser had abdicated and that Germany was in a state of revolution.\n\nIn the evening about nine o’clock news came through by wireless that the Germans had accepted the terms of armistice.\n\nOne would have thought that these troops who had all seen over four years active service would have gone made\/mad with joy at hearing this good news. The very opposite was the effect of this news.\n\nThe news was received very quietly, a few tried to raise a cheer, but it was very faint indeed.\n\nIt would have been quite different if we had all been in France when the news came through, but, as it was we were daily leaving a great distance between us and the trenches and the news by wireless had prepared us so much that it was no surprise to us to hear that Germany had signed the armistice. I did hear many of them\n\nexpress the wish that they would liked to have been in France when the armistice was signed.\n\nAfter all is said and done however we are probably best where we are. We will get all our affairs settled up and into civil life before the rest come home and we will not have the trouble and worry of being pestered and being knocked about from pillar to post.\n\nA rather heated argument arose on the \"Prevention of War by the League of Nations\".\n","43":"\n\nNo parades to-day in honour of peace but strange to say there is no Divine service being held.\n","44":"\n","45":" Service conducted by the officer in charge of the Y.M.C.A.\n","46":"\n\nThese last few days the ship has been rocking a great deal. There is a tremendous swell on the sea. About 4 o’clock in the afternoon we reached outside the harbour at Fremantle. The Port Medical Officer came aboard and examined the crew and the troops. A few of the sick have been suspected of Pneumonic Flue, the result is we are\n\nnot allowed to land.\n\nWe had been told that great preparations had been made to give us a good time so that we were keenly disappointed. All that we saw of the people of Australia was a few who came out on a small steam boat and cruised around the ship looking for some of their friends.\n\nMany sharks are to be seen swimming around the ship. Some of the troops are trying to bait them with a lump of meat. Others have been successful in shooting some.\n\nCases of Cigarettes and Fruit have been sent aboard by people from the town. We can see the town away in the distance.\n","47":"\n\nSick patients sent ashore. The West Australians left the ship and went ashore to-day.\n\nWe sailed away from the vicinity of Fremantle at 4 this afternoon.\n","48":"\n\nSince we left Fremantle yesterday the ship has rolled considerably. This has been the worst part of our voyage.\n\nHuge birds are following in the rear of the ship.\n","49":"\n\nA heavy sea. Feeling a bit squamish.\n\nThe weather is very cold.\n","50":"\n\nGood Concerts have been held these last two nights.\n\nTo-day has been a day of washing and preparation for landing. The troops are taking things seriously now and the thing uppermost in there minds is, What are they going to work at? now that the war is over.\n\nThe Colonel of the ship is not looked upon with favour. He is considered to be too strict altogether. My own opinion is, that he has kept the men well in hand, no easy job where over a thousand men of all kinds are. The troop deck and mess tables are kept spotlessly clean and everything is kept in order, whereas, under a weaker man things would most probably have been chaos.\n\nWe are nearing the end of our voyage. Some excitement there is but not noticeable unless closely observed.\n","51":"\n\nThis afternoon the V. & S.A. troops are eagerly watching for the heads near Melbourne. We are passing along by the side of the coast. As we neared the heads\n\nthe Pilot came out to meet us.\n\nAs we crossed the bar the sea seemed treacherous looking.\n\nWe entered into the bay about 7 o’clock and anchored at Port Sea opposite the Quarantine Station.\n","52":"\n\nTold that we are to go over to Port Sea to the Quarantine Station.\n\nThe troops are going off in small tugs.\n\nI had to remain behind to fix up the transference of hospital gear.\n\nThe ship is to be fumigated. The Pneumonic Influenza has got a firm hold of New Zealand and America, in fact, the whole world has suffered from the ravages of this disease. Drastic efforts are being made in order to prevent it from spreading to Australia.\n\nLanded at the Quarantine Station in the afternoon. All that were left on the ship was the guard.\n\nThis quarantine camp is situated in an ideal spot on a peninsular. On the one side is the Ocean and on the other side is the bay. It is about 40 miles from Melbourne.\n\nY.M.C.A. & Red Cross have\n\nbeen very good to us providing us with a tent, plenty of reading material and an outside Cinema show at night time.\n","53":"\n\nWalked through scrubland to the Ocean on the other side of the Peninsular. News has come through the \"Devon\" with the first lot of troops arrived in Melbourne and had a magnificent reception from the people.\n","54":"\n\nWent through the inhalor to-day. This is an iron chamber with a few perforations in the side. Through these holes medicated steam is put through and about seventy of us standing in this chamber for ten minutes are supposed to be immune from the deadly germs of Pneumonic Influenza.\n\nSaw a very pretty sight to-day. Sailing down the bay was a five mast schooner. This gave the place an old world appearance.\n","55":"\n\nOur time here is spent walking through the scrub or along the beach. At meal times we have to scramble for to get into the dining room.\n\nI have never seen men fight and struggle as these men do in order to get there meals. It would be unnecessary if some of the officers would take them in hand and make them form a queue. It is not that there is not plenty of tucker, but more a reaction from all ranks against the late military restraint.\n\nAn indignation meeting held by the N.S.W. men. They object to go back on to the ship again, because if they do so, they will be quarantined again on reaching Sydney. They also make out that the ship is \"chatty\". Addressed by a young officer who explained away the grievance very well.\n","56":"\n\nEmbarked on the \"Port Sydney\" at three o’clock to-day.\n\nIn the forenoon the sea was very rough, but it gradually calmed down in the afternoon. We have had a splendid time over in the quarantine station, plenty to eat, nothing to do.\n","57":"\n\nSince coming on board\n\ngreat preparations are being made amongst the troops cleaning clothes, polishing boots, etc.\n\nThe burning question, \"Will we be quarantined at Sydney\"?\n\nOwing to a heavy fog being on this morning we have gone fifteen miles past the Sydney Heads. The \"Port Sydney\" is splendidly decorated with flags \n(with flags)\n in honour of the occasion.\n\nThe troops are looking well with their red, white and blue decorations on their shoulders.\n\nAnchored in Watsons Bay awaiting the inspection of the L.M.O.\n\nGreat cheers were given when we knew that we were not to be quarantined. As the Ferry Boats past us they honoured us with their call Cock-doodle-doo. As we sailed up the harbour a boat gaily decorated, crowded with young people, gaily dressed, waving flags of all description and a brass band playing music escorted us almost to the wharf at Wooloomoloo . On the wharf young ladies dressed in white were there, and as each man went\n\noff the gangway he was presented with a flower of some description.\n\nA Brass Band discoursed popular music as the troops disembarked. Motor Cars were at the wharf and as they were each filled with soldiers they drove off to the collecting ground.\n\nWhen every man was in a car they all moved off through the crowded streets of Sydney.\n\nIt was indeed a Triumphal ride through the city. The streets were crowded with people in holiday attire, flags, bunting of all description were to be seen everywhere. We were simply showered with Flowers, Lollies, Cigarettes etc. It seems that the pleasures of a life time were being put into an hour. The scene was magnificent indeed. Our Triumphal ride ended in the Domain at the Anzac Buffet. There I met George and a few friends. Glad to get away from the scene of festivity and the crowded thorough fare, a motor car was provided and we were driven to Golf hill, there we were entertained to tea and met a big number of\n\nfriends who had there house gaily decorated with flags in honour of our return.\n","58":"\n\nParaded at the Anzac Buffet. There we were provided with our leave passes and priveleges granted to us as soldiers on furlough.\n\nMarched through the streets with rifles on our shoulders amidst scenes of great enthusiasm to the Town Hall. Addressed by the Lord Mayor and others. Provided with refreshments. On two months furlough. This I have spent visiting friends with a trip to the Blue Mountains and Jenolan Caves and to Newcastle.\n\nStarted work on the","59":" at the Coast Hospital.\n\n"}}