{"Document Name":{"0":"Diary_0111","1":"Diary_0111","2":"Diary_0111","3":"Diary_0111","4":"Diary_0111","5":"Diary_0111","6":"Diary_0111","7":"Diary_0111","8":"Diary_0111","9":"Diary_0111","10":"Diary_0111","11":"Diary_0111","12":"Diary_0111","13":"Diary_0111","14":"Diary_0111","15":"Diary_0111","16":"Diary_0111","17":"Diary_0111","18":"Diary_0111","19":"Diary_0111","20":"Diary_0111","21":"Diary_0111","22":"Diary_0111","23":"Diary_0111","24":"Diary_0111","25":"Diary_0111","26":"Diary_0111","27":"Diary_0111","28":"Diary_0111","29":"Diary_0111","30":"Diary_0111","31":"Diary_0111","32":"Diary_0111","33":"Diary_0111","34":"Diary_0111","35":"Diary_0111","36":"Diary_0111","37":"Diary_0111","38":"Diary_0111","39":"Diary_0111","40":"Diary_0111","41":"Diary_0111","42":"Diary_0111","43":"Diary_0111","44":"Diary_0111","45":"Diary_0111","46":"Diary_0111","47":"Diary_0111","48":"Diary_0111","49":"Diary_0111","50":"Diary_0111","51":"Diary_0111","52":"Diary_0111","53":"Diary_0111","54":"Diary_0111","55":"Diary_0111","56":"Diary_0111","57":"Diary_0111","58":"Diary_0111","59":"Diary_0111","60":"Diary_0111","61":"Diary_0111","62":"Diary_0111","63":"Diary_0111","64":"Diary_0111","65":"Diary_0111","66":"Diary_0111","67":"Diary_0111","68":"Diary_0111","69":"Diary_0111","70":"Diary_0111","71":"Diary_0111","72":"Diary_0111","73":"Diary_0111","74":"Diary_0111","75":"Diary_0111","76":"Diary_0111","77":"Diary_0111","78":"Diary_0111","79":"Diary_0111","80":"Diary_0111","81":"Diary_0111","82":"Diary_0111","83":"Diary_0111","84":"Diary_0111","85":"Diary_0111","86":"Diary_0111","87":"Diary_0111","88":"Diary_0111","89":"Diary_0111","90":"Diary_0111","91":"Diary_0111","92":"Diary_0111","93":"Diary_0111","94":"Diary_0111","95":"Diary_0111","96":"Diary_0111","97":"Diary_0111","98":"Diary_0111","99":"Diary_0111","100":"Diary_0111","101":"Diary_0111","102":"Diary_0111","103":"Diary_0111","104":"Diary_0111","105":"Diary_0111"},"Date":{"0":"unknown","1":1767.0,"2":1768.0,"3":1769.0,"4":1770.0,"5":1771.0,"6":1772.0,"7":1773.0,"8":1774.0,"9":1775.0,"10":1776.0,"11":1777.0,"12":1778.0,"13":1779.0,"14":1780.0,"15":1781.0,"16":1782.0,"17":1783.0,"18":1784.0,"19":1785.0,"20":1786.0,"21":1787.0,"22":1788.0,"23":1789.0,"24":1790.0,"25":1791.0,"26":1792.0,"27":1793.0,"28":1794.0,"29":1795.0,"30":1796.0,"31":1800.0,"32":1801.0,"33":1802.0,"34":1803.0,"35":1804.0,"36":1805.0,"37":1806.0,"38":1807.0,"39":1808.0,"40":1809.0,"41":1810.0,"42":1811.0,"43":1814.0,"44":1815.0,"45":1816.0,"46":1822.0,"47":1823.0,"48":1824.0,"49":1827.0,"50":1828.0,"51":1836.0,"52":1837.0,"53":1839.0,"54":1843.0,"55":1845.0,"56":1846.0,"57":1847.0,"58":1848.0,"59":1849.0,"60":1862.0,"61":1880.0,"62":1881.0,"63":1882.0,"64":1893.0,"65":1894.0,"66":1895.0,"67":1896.0,"68":1916.0,"69":1917.0,"70":1918.0,"71":1922.0,"72":1923.0,"73":1925.0,"74":1926.0,"75":1927.0,"76":1928.0,"77":1933.0,"78":1934.0,"79":1935.0,"80":1936.0,"81":1937.0,"82":1938.0,"83":1939.0,"84":1940.0,"85":1941.0,"86":1942.0,"87":1943.0,"88":1944.0,"89":1945.0,"90":1946.0,"91":1947.0,"92":1948.0,"93":1949.0,"94":1950.0,"95":1951.0,"96":1952.0,"97":1953.0,"98":1954.0,"99":1955.0,"100":1956.0,"101":1957.0,"102":1958.0,"103":1959.0,"104":1960.0,"105":1961.0},"Entry":{"0":"\n\n","1":"\n\nFilled my last book (No. 3) on","2":" & was not able to get another untill today. A lady in the Y.M. got me this one for 6d. Slept most of the first day in Hospital (19th). Left there on Sunday 22nd for Skin Con. Camp about a mile away. Had a slight rash would not have thought of it only the man in the next bed told the Dr. he had one. Was examined here by the funniest little Dr. about 4 ft. high manners\n\nlike a cannary & a very deep voice. Have to rub greese on every day. Have had my hair cut with clippers all over. We go on paraide every morning for about ½ an hour. Have a march about 2 miles twice a week. See the Dr. every 2, 3 or 4 days acording to how you are. There is a fair amount to eat, but it is badly run & is dirtier than in most camps. There has been a good deal of rain. One night our marque was nearly blown down. Marched to Rouen one afternoon \nto\n 3½ miles\n\nto the Tivoli, a good show. There are Pictures, Concerts & Lectures in the different Y.Ms & Halls every night. Sports one day, Football & Baseball at other times. There are Yanks as well as all sorts of English & Oversee Troops here, other camps over the road with W.A.A.Cs, Indian, & Black troops, a horses convalese home not far away. We are high up & look over the town with higher hills all round. Have been marked out to day.\n\nWednesday 2nd\n\nSpent most of the day getting settled in K. Co. Was asked out by a lady in the Y.M. to see an ancient Church but could not manage it.\n","3":"\n\nSaw Dr. am moveing again tomorrow. Marched to Tivoli, Rouen, good veriaty show.\n","4":"\n\nLeft per ambulance at 9 for Rouen entrained at 11 reached Hafleur – 5 miles from Le Havre – about 15 marched to Con. Camp 1 mile. Had dinner also ate more than was good for me on the train. Have a bow Hut\n\nto sleep in 3 blankets issued the cleanest & freshest I have ever had in a camp & a mataras with very little straw in it.\n","5":"\n\nWent before Dr. & Dent. & haveing my back rubbed with liniment.\n","6":"\n\nGood service in evening at Y.M. Have heard the same Padre before he has a strong Yank acent (Robertson).\n","7":"\n\nA bit of messing about.\n","8":"\n\nNothing in particular\n","9":"\n\nA nasty day heavy showers of hale.\n","10":"\n\nInnoculated TAB yesterday arme is very sore. Did nothing. Started writing Xmas letters. This is a pretty place, a valley with wooded hils all around. An electric tram goes along about ½ a away it reminds me of a ferry boat at night.\n","11":"\n\nGot a pass from 4 Oclock for Havre\n\nso Collier & I went in per crowded tram. It is a fine City wide streets & clean looking buildings, but we saw very little of it as it started to rain soon after we got there. Had 2 meals 2 eggs each, each time.\n","12":"\n\nNothing in particular except the usual C.Os inspection in the morning.\n","13":"\n\nWent to church in evening. It was really a lecture on Repration, not very briliant.\n","14":"\n\nFirst frost, did nothing.\n","15":"\n\nWar news still good. The rumers here are wonderfull, have even heard that orders to cease fire have been given. Some of them come in with all sorts of tales at night from Havre & the others are disapointed when they are not in next day's paper. It won't last long maybe a week maybe a month is my opinion. Went to Pictures evening.\n","16":"\n\nClasification Marked B. A lecture on soil in afternoon. Pictures at night. The remarks one hears are better than the pictures themselves. Some of them take quite a personal interest & allways stick up for the right side. The villan gets no symphity.\n","17":"\n\nHeard that a man was wanted in Y.M. so asked the S.M. & was put on the job. It is to help cleaning up serving tea etc..\n","18":"\n\nThe chap that is cooking had leave this afternoon so I took his place got through 8 urns of tea & Coffee. Taken all round have had quite a strenious day. But prefur it very much to doing nothing.\n","19":"\n\nMy job is to clean up the Lecture Hall & look after it generally. A fagigue is sent in each day. They do most of the sweeping. There is plenty for all hands to do when tea is being served from 01100 to 01200 oclock & from\n\nabout 1700 to 2100 oclock.\n","20":"\n\nAn extra bit of cleaning to do as the Major or I believe he is a colonel inspects.\n","21":"\n\nAs usual.\n","22":"\n\nAs usual. The 3rd lecture Conquest of the Soil by Cap. Priestly today not quite so interesting as \nyesterday\n the last.\n","23":"\n\nLeave from 1000 Oclock went to\n\nHavre with Morison. Tram to the Ocean Front, Quite a nice place. Several very nice hotels now used as hospitals or for other military purposes. The architecture quite reminded me of Mosman. It is not quite so prudish. We walked back to town & polished off 2 meals.\n","24":"\n\nWas cook this afternoon as it was the regular mans days off only got through about 60 Galls of tea & coffee.\n","25":"\n\nAs usual.\n","26":"\n\nNothing startling.\n","27":"\n\nAs usual.\n","28":"","29":"\n\nThe same.\n","30":" to","31":"\n\nNothing startling to record. Was on the same job all the time. Leave to Havre has been stoped on account of flue.\n","32":"\n\nTook on the cooking for this week as the cook wanted\n\na spell & no one else seemed anxious to take it on.\n","33":"\n\nThis cooking stunt is fairly strenious. About 40 or 50 Galls. of tea or Coffee are used between 11 & 12 in the morning & 70 to 90 Gals. at night from about 5.30 to 9. The coal is very bad & the wood the same only for using the boxes would never keep the supply up. There are 8 of us to cook for besides the tea making\n\nonly breackfast & dinner & only meat & vegetables to cook.\n","34":"\n\nAm getting better with the fires so have an easier time.\n","35":"\n\nAn Officer announced in the Hall to night that an \npea\n Armistice had been signed. No great excitement a little more beer than usual was evidently used.\n","36":"\n\nFind to day the Armistic was only a yarn. But it is only a matter of days.\n","37":"\n\nQuite a heavy frost this morning but a beautifull day.\n","38":"\n\nExpect peace tomorrow.\n","39":"\n\nThe troops were fallen in & the signing of the armistice anounced at 11.30 we heard of it about ten, Were also warned not to break camp\n\netc. The boat whistles & bells in Havre sounded like a big squadron of planes. Had leave & went to town at 1.30. It was a great day. Everyone was rejoycing. All busines including trams was stopped. Consequently the main streets were packed. The Rue de Parie was the most popular allthough not the best street. Everyone wore colours & shook hands or kissed if one prefered it. We 3 went into the American Café for Tea & payed\n\n(4\/3)\n\n5-65 for a pot of black tea & a handfull of biscuits later we had a decent meal for 8-1 at a less stylish place.\n\nEveryone behaved well as far as I saw. Expected to hear more music. Got to the train early to get a seat but it was about 1½ hours late starting & very slow when it did. Whally is doing the cooking this week.\n","40":"\n\nNo thrills.\n","41":"\n\nGot my wrist watch\n\nback from the watch maker, let it fall & it stopped first time since I got it. Thanksgiving service in Hall tonight must go & put it straight.\n","42":" to Saturday 16\n\nAs usual. Pipes frozen this morning.\n","43":"\n\nNot a word about War in the big headlines of the Daily mail today for the first time.\n","44":"\n\nStarted cooking again this morning.\n","45":"\n\nCooking all week. Nothing startling happened. Went to R.G.A. Concert one night good. Had a parcel from Aunt Mima.\n","46":"\n\nWhalley has the cooking again, I am cleaning up the lecture hall.\n","47":"\n\nWent into Havre with Newton. A wet afternoon. Had tea at Y.M. & came home early. The A.I.F. educational\n\nscheme is in operation here now.\n","48":" to","49":"\n\nThings have moved as usual. Rain nearly every day. A parcel from Aunt Mima.\n","50":" to","51":"\n","52":" little to put in lately that I seem to leave it for a week at a time. Was in Havre on Tuesday not raining but not a fine day. Poked down some of there dirty little side streets. Had 2 f. worth of Photos taken 20 of them. Had 2 meals & came home about 8 p.m.\n\nOur jobs have all been changed. L\/C Turner has a burst of energy & has taken the cooking, I am cleaning 3 of the small rooms & back yard an easy job. Turner has more rules for running the kitchen than the army. These little jilos & squables are very funnie. A batch of Aussie letters yesterday. Went to a very good lecture by Norwood one night. Weather has been mild. Armistic Dinner for the troops today Wallnuts & applies besides plenty of meat & vegetables also\n\na very pudding. We have to go to the Mess Huts for meals now rations haveing been stopped still get enough for breack & tea.\n","53":"\n\nWent to a Lecture by Rev. Norwood good. Last night the Tommie in a camp about ½ a mile away kicked up. From what I hear they are not getting a fair deal. Some Canteens Officers & Sap Mess were burnt & looted. There was some fireing at least am not sure & have not heard\n\nfor certain if they were bullets in the fires or shots. Many tales as to killed or wounded 39 Deaths acording to one. The latest & most likely to be correct is two admitted to Hospital. \n\nAttended the Motor Macakanacs Class this evening. It is on Tue. & Friday.\n","54":"\n\nChanged jobs with Whalley on Friday now have the Lecture Hall to keep clean. There is nothing of interest to put in for the week that I can think of.\n\nHave a new Hut leader Capt. Pike. We now get 5 francs per week as pay.\n","55":"\n\nAttended Bookkeeping Class from 10 to 11 A.M. My day off went for a walk with Martin (he has been helping in the Library lately) through Montevellen had several Vermecassies in a Boozer a nice afternoon except for a shower or so. Martin is a decent Chap a bushie like myself\n","56":"\n\nBookkeeping.\n\nFriday 20th\n\nA lot of us went out to get green stuff for Xmas decorations. It was cold & wet even some hale a rotten turn out. Motor Mecanac class reopened this evening. \n\nFriday 28th\n\nHave had a very busy week, decorating the Hall etc. A very good dinner on Xmas day Beer instead of tea also a box from the Red + tob. lollies\n\ncake etc. The ladies here gave us a Xmas stocking each & the Y.M. gave us 10 francs each. Mrs. Macgeorge gave me Playgraves Golden Treasury Poems.\n\nXmas day started well beautifull sun shine. But Defaulters blew as usual making a jaring note. Went to the Panto in afternoon Boo Peep a very good show & very well got up. All diggers some of them made splendid girls.\n","57":"\n\nHave sliped considerably about writing this up. Have had rather less time than usual. Chief events, Bookkeeping Class 3 days per week Motor class twice. The B-keeping takes up a good deal of time with home work & notes. Last Sat. went Chateau Gorshea with the Pardre. It was a wet afternoon but we had (9 of us) a good walk & saw some of the country. There is a fine wood at the Chateau\n\nwith avenues running in all directions. Some look out on the Scenic & it is like looking through a window. Have bought a camara 50 Francs developed the first spool today 3 failures 3 fairly good, 6 films cost 5.70 so it is rather an expensive hobbie. L\/C Turner who was in charge here is on Blighty leave, I am supposed to be filling his place. Capt. Peake has allso gone on leave today so I ocupie his room to guard the cash\n\nThings have quietened down since N. Year eve. The camp is comparitively empty at present, & we can get to bed in decent time. Cencoring letters has been cut out. Have forgotten to mention one of the best items about Xmas. It was a dinner given to the staff by the Ladies in there mess room. The dinner was good & sitting down at a proper table with Ladies was better.\n\nSunday 12th\n\nDeveloped\n Printed \nsome\n one of the snaps last\n\nnight. It is very good. Do not have much time for this sort of thing.\n\nSunday 19th\n\nAnother week uneventfully passed. Things have been quite slack not many men in camp. Two or three drafts of 15 men on there way home have been here. Our own camp is so empty that we have had Hun Prisoners on fatague several mornings. They are hungry as they pick the scraps out\n\nof the slop bucket & any odd pieces of biscuits that have been sweept out. The chaps here seem more ready to give these Hun fatagues a drink of Coffee than they do to our own chaps when they are on the job. Maybe it is characteristic of the Aussies to be charatible to a fallen foe. Quite a frost this morning.\n\nTuesday 28th\n\nHave missed more than the week this time.\n\nIt has been fairly cold all week a shade of snow last night & several heavy frosts.\n\nA big crowed of 15 men in yesterday but they have gone again so things are quiet. A Company of 3rd Pioneers are here working, several of my old mates amongst them. Whaley is away on leave so have his work as well as my own to do. Missed bookeeping class this morn.\n\nTuesday 4 Feb. 1819\n\nHave had some snow this week. The camp is very full at present & we are kept on the move. Have missed Bookkeeping all the week. Hope to pick it up on Thursday next.\n","58":"\n\nHave picked up a good deal of the BookK. The frost has changed to rain. Most of our pipes have been burst with frost. 3 men have been taken of the staff & more put on. Turner has left, I am in charge. Mrs. Taylor has gone to\n\nChariliroi. We have all been transferred to A.G.B.D. the Con. Camp has been closed & I don't think anyone knows just where they are. Plenty of men in camp & plenty to do.\n","59":"\n\nThings much the same as usual. Very busy & don't feel much like it as I have quite a fair cough cold etc. One of the Dr. comes to see the Ladies & he has a look at me & give me\n\na chit to get cough mixture. I won't die like the soldier of the Leigon for \"lack of womans nourseing\"etc.\n","60":" of our staff left today & I don't know when we will get some more.\n","61":"\n\nThe Chap in the Library left so am doing it. Mr. Peak came home.\n","62":"\n\nStill feeling seedy & as cough is no better & I have lost most\n\nof my voice arranged to be sent to Hospital.\n","63":"\n\nThe Hospital seemed a very decent place plenty to eat but I did not feel like it. The Dr. had a look at me this morning asked my age, mocked my wispering & Marked me for a Board. So have just got back to the Y.M. am to report in the morn. Was under 24 hours in Hosptl. It is a funny way to do things.\n","64":"\n\nFell in on Monday morning & after a good deal of waiting the Dr. turned up, there were only 3 of us. The Dr. got his stecoscope on me & tapped my chest & decided there was something wrong. He was the same chap that marked me for the Board the day before. Someone was hammering outside. The Dr. cursed the noise a bit, & I think that is where my weak chest came from. Went back & was told to stop on at the Y.M. On Tuesday\n\nevening Martin came in to say he had seen my name go through to leave today. Looked them up at the Orderly Room about 11 this morning & they sayed yes be ready at 1 oclock. Was struggling intoo a pair of pants Pat had given me they are very tight about the knees looked through the window & saw the draft falling in. Had to bustle some but got away allright. Went to Havre by\n\ntrain & marched to the Wharf. Had to put in about 2 hours there severall showers of rain. Got on board about 4.30. Have just about enough room to sit down now, 7 oclock. One thing on the wharf there was plenty to intrest one. Chows loading bullie & Biscuits. Yank English & our own troops Lorries trains Dirty French wemen & dirtier kids selling us chocolates oranges etc. the latter\n","65":" for a franc were very poor.\n\nLeft in such a hurry that I got no dinner but had a packet of good biscuits in my pocket also my dinner which Whaley had wraped up in a hurray ait it on the Boat & got some hot water for a tin of cocoa & milk I had with me.\n","66":"\n","67":" A.M. About 3.30 we dropped anchor\n\nin Southampton & soon after the troops started to come to life. Had a few minutes sleep once but picked a bad place when we came on board – where every one walked up & down. Everywhere else they were packed like sardines. Fortunately it was calm – there was no sickness. About 10 when every one was settling down two old marines – Scotchmen made a diversion by\n\nsinging & arguing. They were the only men on board who were at all drunk as far as I saw. They were hooted cursed counted out things were thrown at them at last they wanted to fight especially the Yanks so a steward induced them to go & sleep some where & peace reigned once more. Moved up to the Wharf & got off about 8. Found an A.I.F. Embarkation chap to take care of us\n\nhe got us some tickets & the A.N.C.B. supplied us with a mug of cocoa a cake & stick of chocolate. Then we got a bag with a meat pie packet of biscuits & piece of cheese for dinner. Marched about 1½ miles to Southampton W. station & started for Warminster at 11.18. Got to Sutton Veny per boot from Warminster about 5 had our particulars taken & were put in a hut. No one seems to know much about anything we are supposed to\n\nget 7 days leave & may sale at any time.\n","68":"\n\nBack to the old camp life. Parade at 9 A.M. & 2 P.M. Some fatagues folded a few blankets this morn.\n","69":" ","70":"\n","71":"\n\nPaid this morning £12.0.0 to go on leave on Monday morn. Met my old mate N. Bell went to Warminster for a walk. Had the studs taken out of my boots & rubber heels put on a great improvement.\n","72":"\n\nWaiting at present to be fixed up by Q.M. \n","73":"\n\nWe were left to ourselves yesterday morning did not even get any breck. Reaced London about 12 & came straight to the Y.M. in the Strand booked a bed & had a good meal for about a 1\/-. Went out to Aunt S afterwards & bought more tucker went on \n\nto Ettie Murray afterwards & had more food got to Y.M. about 11 & found the beds very good.\n","74":"\n\nWent to Aunt S in morning for a few minutes & met Ettie at 1 P.M. had lunch & went to the tower a quaint old shop. Not as much to see as I expected & the Beef eaters had no ruffles on came\n\nback for tea (Afternoon) & went on to Aunts. A wet day. It is now 10.30 so will seek my downey. \n","75":"\n\nLeft Shotley yesterday morn & got here (Sutton V.) about 8.30 last night. Got 5 blankets & a place in a hut without much trouble just been moved to another hut. Had a few hours in London. Saw Aunt S & picked up my bits o' things then met Ettie M. at Padington had afternoon tea & a \n\ntalk before the train left. At Shotley the wether was not the best but went for a walk every day to no where in particular except on Sunday Mab & I went about 4 miles to a farm for tea just the sort of place one reads about a nice house plenty to eat nicely served & fresh & none of the hard commercial spirit. Mab was just the same as ever & being there does not make camp life any\n\neasyer to put up with. Went to British Museum with Aunt S a most uninteresting place. The chief value of a thing seems to be its age & I cannot say a piece of broken stone with a plate on it saying it was someones Venue is of much interest. If there are more than one statue of the same man they are quite diferent so they were not much in the way of artists. I am a bit like J. Cesear. Most of these old birds\n\nhad rather small heads the same thing applies to the armour in the Tower. It is more interesting they were big men. Henry 8 started life a fairly slim figur but his","76":" suit was well filled out. It must have been nasty stuff to wear & as all the joints are upwards all the rain would run in. Judgeing from the old prints. Printing has not improved much except in the way of pace. London is more crowded than I have seen it.\n\n& it is easyer to get a decent meal. Found Alf Izzard one afternoon. They were very nice to me.\n\nIt is a rotten wet day. Have just been inoculated. Flu I think this time.\n","77":"\n\nStarted on Book keeping again. Station books this time a little snow today between showers.\n","78":"\n\nA lot of mucking about on paraide\n\ntoday princapily to see if we had more than 5 Blankets each. 2 G.S. Wagons full were collected so that some had a fair supply.\n","79":"\n\nAs usual. Met Pat Buckman just over from France.\n","80":"\n\nAs usual. Two parades & Bookeeping. Pat & I walked to Heytsbury in afternoon.\n","81":"\n\nParade in morning. A joyfull moment as my\n\nname is on the Boat Roll of the Kildonan Castle to sail in about a week. Walked aroun Warminster with Bill & Pat & had tea at Y.M. Manorhouse in Sutton Veny. A decent meal 5\/- for the 3 of us.\n","82":"\n\nBill left this morning by the Passies.\n","83":"\n\nA good deal of paraide work going through Q.M. etc. Pat B. & I went into Warminster & made some purchases for the voyage.\n","84":"\n\nMore messing about inoculation etc. Wrote to most of my friends on this side.\n","85":"\n\nA fair bit of messing about. Am really fixed up I think. Went to W-minister with Pat – he is to sail on Sunday - & made some final purchases a bottle of Cod Liver Oil amongst them to replace one I spilt the other day.\n","86":" \n\nRevalie at 4.30 fall in at 5.30\n\nwere the orders last night. I was awake but heard no revallie. In fact nothing was done about calling us. Had to give our blankets in take kits up to waggon & have breckfast. The Salvation Army was open but too crowded when I got there to get anything. Got a drink of very poor tea & a bit of mince at the Mess Hut. Fell in at 5.30. The roll was called 3 times were given embarkation cards & started off at 6.45.\n\nGot a good cup of coffee from the Y.M. in Wminster got on the train & she started right away 7.50. Lady Mayress of Exter gave us a cup of tea & a bun & one could buy things. Arived Plymouth about 1.30. Train went right to ships side. I am on table 39 No. 3 troop deck. It seems about as good a place as there is.\n\nFortunately I it has been a beautifull day yesterday it snowed nearly all day & it was still\n\nlying about this morn. The country is very wet & flooded in many places. Wen we got on the boat were given a ticket with no. of table & mess deck & told to wait at the table untill we got a meal. It came allong in time quite a decent feed. If we get our scale of rations as given in a list we should do fairly well.\n\nThe blankets & hamocks were rushed so quite a lot of us got none. After some trouble we managed to get at least 2 blankets\n\neach. Had no hammock so got under the table put 4 or 5 life belts down for a bed – They are the Kapock kind nice & soft for a pillow – much handier than the cork ones.\n","87":"\n\nHad an excellent nights sleep & a good breckfast porage & herrings. Paraide at 9-30 some orders were read about smoking on troop decks etc. A nice day but fairly cold. Nothing to do but lie about & read. Was put on as a \n\nboats crew for No. 3 life boat. My job is to hang on to the rope at one end of the boat & lower it when we get wrecked. Started about 2.30 on the trip that should have a joyful ending. It was a very interesting harbour with many sorts of ships but did not seem to be a busy place. The Warspite was berthed beside us with 2 planes for scouting they put a platform out along the big guns for them to get a start off. All sorts of war\n\nships from Submarines to old wooden Battle ships 3 of them tied end to end with roofs on them for training ships. Also a mother ship for planes. Not many mercantile boats. The harbour is quite small & windes about a lot but must be deep for these big boats to come up. It is quite a pretty place when you get away from the town. Think we left Keyham Dock. Can see a Lighthouse now on the Starboard\n\nbeam 5-P.M. The last of England a country we have all learned to apreaciate. I was reading on deck & was really asleep when we first moved off. Don't think I realized fully untill yesterday that I am really on the way home. There is a lot of gambling brown & Anchor House etc. The old favourate 2 up cannot be played very well so three 3d. takes its place. One cannot tell the boat is moveing at present.\n\nGot 3 nice new white blankets & a hammock this evening so am set up especially as I have a good place to hang it. Have a fair amount of space on each side of me & being right opposite the hatchway get some fresh air.\n","88":"\n\nHad an execelent night. The hammock is just the thing to sleep in. It has been rather a wet windy day not very cold. Passed quite a lot of ships & steamers.\n\nIt is fairly rough tonight & a fair number are sick but not as many as I have seen.\n","89":"\n\nWet most of today & fairly rough at times. Cleared up in evening for a time. One paraide at 9.30 & medical inspection. Y.M. gave us some games pens ink etc. The canteen is open at times allways a big queue at it.\n","90":"\n\nFor once did not sleep well. A fairly rugh night & some of\n\nthe woodwork just over my head keeps creeking. A good many sick. Warmer to day some rain. Passed C. St. Vincent about 10 A.M. Lights on the coast in sight at bed time.\n","91":"\n\nThe day perfect went through the Straights of Gibralta last night & are now in the sparkling Mediteranean. Warm bright & calm. \nCan\n Could see the mountains in Spain clearly in morning. Enjoyed the warmth & read most of the day.\n","92":"\n\nCloudy & much cooler today. The Y.M. opened a libery today. Got a fair book, was just about out of reading. The Educational Officer took names for Classes yesterday. Am down for Bookkeeping & General Agriculture. Put on my slacks & sand shoes today much comfort.\n\nFriday 28th\n\nBeautifull day warm enough to sit in the shad. Passed an island on port\n\nside. Just a big rock. Sea quite calm. Put the paravanes out this afternoon. Band played tonight & Officers had a dance. A concert last night the 2nd for the trip. Sports on deck in afternoon.\n\nSaturday 29th\n\nParavanes were put on board early this morning so the danger from mines must be less. Weather warm – calm. Fancy dress Ball for Pasengers & Officers. Plain for Diggers. Educational Office opened\n\non Saloon Deck. Y.M. put up a chart also gives days run 2229 to midday. Canteen closed for P. Said.\n\nSunday 30\n\nFairer & warmer.\n\nSevices etc. Left Davenport","93":"\n\nDays – run – Total – Day – run – Total\n\nSunday 23 – 282 – Fri. 28 – 330 – 1905\n\nM. 24 – 320 – 602 – Sat. 29 – 324 – 2229\n\nTu. 25 – 306 – 908 – Su. 30 – 333 – 2562\n\nW. 26 – 336 – 1244 – M. 31 – 312 – 2874\n","94":" – 331 – 1575\n\nThis is our run up to","95":" date & Read most of day.\n","96":"\n\nBook-keeping class opened. As it started\n\nright at the beginning went into the Acountancy Class in afternoon. Agricultural Lectures also started. The Sgt. who is giveing them is good at it. Better than the Book keeping chap who has a star up. Am on Picquet to night it is more or less a farce. Our Corp is about as sad looking as a man can be & is nicknamed Sunshine.\n","97":"\n\nCame into P. Said about 6 A.M. & anchored in the canall\n\nvery soon the Coal barges came with there niggers & the air was full of dust & noise. They sold exceptionaly nice oranges @ 2d. each but some of the digs who were swiming got into a boat & threw all the fruit on board. No more boats came about except selling lace silk & other stuff. All the pasangers got off & some nurses & officers came on. The niggers struck on one coal barge. It was funnie. A few Digs got boats\n\n& went ashore a few drunk tonight. Think they all got back. Some got into a row in town. Does not seem to be a big place. A lot of shipping. Big boats tied up nearly tutching each other. Some Nurses Officers & Light Horse got on.\n","98":"\n\nLeft Said about midnight was asleep at the time but got up once to see what the canal looked like. They put a head light on that just shows each side. Got up at 6 very early for me.\n\nIt was more interesting for a time traveling through a canal instead of just open sea. But soon lost interest. It is mostly open sand instead of sea. A \"Teare\" every few miles. A lot of wireing & trenches on the Asiatic side. Reached port Suez about 3 & left at 6. Anchored well out in the Bay so could not see much of it. Agricultur & Accountancy classes as usual.\n","99":"\n\nComfort fund gave Tob. & Cig. & Biscuits out also tined fruit last night.\n\nLand was still close this morning.\n\nFriday 4\n\nCalm but hot decidedly so. Major A.B. Paterson (Banjo) started a class, \"Care & Management of live Stock\". Dealt with horse breeding Sadle & Thouroughbreed say it will not pay & is about right. 36,000 horses were exported for war purposes in 14 & 15 for £70,000 about £20 per head. Cocoa & Milk from A.C. Fund.\n\nSat. 5th\n\nA hot day wind behind changed in\n\nevening & things were much better. A sail has been riged in aft well deck for a bath in morning. Can get tea at 6 A.M. & 8 P.M. from cookhouse.\n","100":" – 190 – 3064 – F. 4 – 298 – 3672\n\nW. 2 S. Canal – 70 – 3134 – Sat. 5 – 296 – 3968\n","101":" – 240 – 3374 – Sun. 6 – 306 – 4274\n","102":" – M.","103":" – 287 – 4561\n\nW. 9 – 304 – T. 8 – 311 – 4872\n\nA nice day. Strong head wind. Had quite a fair book so read all day except when asleep.\n\nMonday 7\n\nQuite a busy day. Agriculture Lecture in A.M. Stock afternoon – Bean\n\nthe A.I.F. corespondent lectured on Galopili this evening. He had been there lately only heard the last few sentences as I was teaching C\/pl. Wilson to play chess. Bean has a poor voice but I think he would be interesting. Saw quite a lot of land yesterday comeing out of the Red Sea one place is only about 3 or 4 miles wide. It is baren dead country. Passed a cable boat at anchor today. Comfort fund gave 3 pr. sox between 2 men lost the odd\n\npair also Cocoa & Milk. Get a drink of tea at 6 A.M. now so far have been bright enough to get up in time for it. The morning stew has been changed. \ninto\n Now get cold meat an improvement & we get some sort of sweet for tea & meat only twice a day also an improvement.\n","104":"\n\nOur Boat was heading West when I came up this morning soon found she was only doing a circle for some unknown reason. Sighted land to Starboard this evening – Sacotra –\n\nI believe it is. Have even heard some say it is Cocos Island wish they were right. Fancy dress ball on tonight.\n","105":"\n\nNot a ripple today. It is a strange way to put in ones time nothing to do but moveing along all the time. Someone else is doing the work. The number of people on this boat would populate a fair sized town in Aussie. Went to 3 classes to day. Major Paterson is not a profesional lecturer but he is interesting \nall the sam\n\n"}}