{"Document Name":{"0":"Diary_0126","1":"Diary_0126","2":"Diary_0126","3":"Diary_0126","4":"Diary_0126","5":"Diary_0126","6":"Diary_0126","7":"Diary_0126","8":"Diary_0126","9":"Diary_0126","10":"Diary_0126","11":"Diary_0126","12":"Diary_0126","13":"Diary_0126","14":"Diary_0126","15":"Diary_0126","16":"Diary_0126","17":"Diary_0126","18":"Diary_0126","19":"Diary_0126","20":"Diary_0126","21":"Diary_0126","22":"Diary_0126","23":"Diary_0126","24":"Diary_0126","25":"Diary_0126","26":"Diary_0126","27":"Diary_0126","28":"Diary_0126","29":"Diary_0126","30":"Diary_0126","31":"Diary_0126","32":"Diary_0126","33":"Diary_0126","34":"Diary_0126","35":"Diary_0126","36":"Diary_0126","37":"Diary_0126","38":"Diary_0126","39":"Diary_0126","40":"Diary_0126","41":"Diary_0126","42":"Diary_0126","43":"Diary_0126","44":"Diary_0126","45":"Diary_0126","46":"Diary_0126","47":"Diary_0126","48":"Diary_0126","49":"Diary_0126","50":"Diary_0126","51":"Diary_0126","52":"Diary_0126","53":"Diary_0126","54":"Diary_0126","55":"Diary_0126","56":"Diary_0126","57":"Diary_0126","58":"Diary_0126","59":"Diary_0126","60":"Diary_0126"},"Date":{"0":"unknown","1":932.0,"2":933.0,"3":941.0,"4":942.0,"5":944.0,"6":946.0,"7":947.0,"8":948.0,"9":949.0,"10":950.0,"11":951.0,"12":953.0,"13":954.0,"14":956.0,"15":957.0,"16":959.0,"17":962.0,"18":963.0,"19":964.0,"20":965.0,"21":966.0,"22":967.0,"23":968.0,"24":969.0,"25":971.0,"26":972.0,"27":973.0,"28":974.0,"29":981.0,"30":987.0,"31":988.0,"32":989.0,"33":992.0,"34":993.0,"35":994.0,"36":995.0,"37":1004.0,"38":1005.0,"39":1006.0,"40":1007.0,"41":1008.0,"42":1009.0,"43":1010.0,"44":1013.0,"45":1017.0,"46":1018.0,"47":1019.0,"48":1020.0,"49":1021.0,"50":1025.0,"51":1030.0,"52":1033.0,"53":1035.0,"54":1045.0,"55":1046.0,"56":1048.0,"57":1049.0,"58":1054.0,"59":1055.0,"60":1056.0},"Entry":{"0":"\n\nunclean & overrun with vermin of every size & discription. The food is poor & one has to fight to get it, the boat is usually shamefully overcrowded & there is seldom a square foot of deckspace that someone is not sleeping on.\n\nI shall never forget the S.S. Itonus Late in May last year we were embarked early in the day on this boat – a detail trooper between Alexandria & the Dardanelles – She was empty when we went on board. We spent the day most of us in Alexandria – we had no horses at that time - & did not return until\n\nuntil nearly eleven o’clock, when we found the boat crowded with a representative of every ally black & white; without exaggerating there were English French Australians Indians, big black French Senegalese niggers & also some of the native Egyptian army & a few Maoris It was like an enormous bad dream, the baggy red trousers of the French, the black leering faces of the niggers & to crown all a gang of native dock labourers were loading the holds with steel rails for a light railway. I gave up the idea of sleep & spent most of the\n\nnight in Alexandria with McWhirter. One finds oneself in queer positions now & again in a job such as we had then. I remember one night at 11 o’clock making an excellent supper off tinned salmon & beer clad in my shirt on the wharf at Alexandria. Another afternoon not 200 yds away Yeats & I took afternoon tea with a young lady of the Red X who sold tea & cakes on the wharf. & so on & so forth.\n\n","1":"\n\nJust arrived back from a stunt last night. We started at 2 o’clock \n\non Saturday morning & went to Katieh. At 6 oclock Saturday evening we started out for a place about 6 miles beyond Bir el Abd where, according to the aeroplane, 300 turks were encamped. We, going with the","2":" Reg. as supporting force, did not go right out to the scene of action; but according, to an eyewitness, events fell out in this manner. The second Bgde, the attacking force, reached the camp just before dawn & with infinite care completely surrounded it. Then a desultory fire took place during which the aeroplane hearing the firing & having in mind, I suppose\n\nthe number reported there yesterday \ncamp\n came over & dropped two bombs to help matters along. The camp was rushed & found to contain in all five Bedouins, two killed, two wounded, & one intact whom they immediately took prisoner. He was a man of exceptional physique for a native & when we saw him trotting behind his guard, he was clad in a rough cloak & hood of goats hair which came just down to his hips.\n\nAs things turned out this stunt was pure murder. We reached here again at about 8 oclock on Sunday night.\n","3":" ‘16\n\nAeroplane scare yesterday morning again. The machine came right over the camp & we had two shots at it with a 3\" gun which is mounted close to the camp here, the second was a good shot & must have been unpleasantly near him; he cleared off anyhow. It is very curious how one instinctively ducks now when hearing a gun. I, for one, simply can’t restrain myself from so doing even though I know it is our own gun. It is instinctive & natural & everyone does it, in fact some people do the most\n\nabsurd things for protection. I remember last year when we were living up Chalaik dere on the peninsular – I think it was on the","4":" August, - we were standing about outside our dug outs after sheltering from half a dozen shrapnel that had just come over without having done any damage, when we for our first experience of high Explosive.\n\nThere was a noise like a train coming straight above our heads & everyone made a dive for their dugouts, little fat Major Halsham threw himself into his & three fellows standing by piled up on top of him.\n\nwhile a fourth who could not see any harbour of refuge near enough threw himself on the ground & pulled a wooden box over his head!! The shell exploded about thirty yards off & did no damage at all.\n\nOf late there have been rumours of a rest camp being established at Alexandria & getting a weeks leave there, one of the fellows in our tent knows one of the headquarters officers who says that the subject is under discussion. He also declared that things are pointing to the evacuation of El Arish\n\nby the Turks & a subsequent advance by us right up Palestine – God forbid – \n\nWe get a lot of innocent \nab\n amusement out of our worthy Warrant Officer, he is a terrible old woman, who has never \"run\" a man in his military career & is, I think, now afraid to break the record.\n\nHe was positively oracular the other night when, on walking down the line after ‘lights out’ & finding one tent lit up like a gin palace & everyone gambling, he sang out \"Now then, its time these ‘ere lights was out, if I find the lights alight\n\n‘ere tomorrow night at nine they will be out at eight\" (8.30 is lights out). delightful wasn’t it?\n","5":"\n\n \"Now am I in Arden\" says Touchstone \"the more fool I, when I was at home I was in a better place\" ‘Now am I in Egypt, the more fool I' etc etc.\n\nNow for his sentiments I am beginning to admire the wisdom of Touchstone, who was self confessedly a fool; hence comes the unpleasant question, what am I?\n\nI am beginning to think that I must belong to that insufferable\n\norder of fools, namely those who refuse to recognise their foolishness. It would certainly be difficult to show anyone a less profitable way than that in which I have spent the last two years.\n\nI have fitted myself sketchily for the position of Groon. Crossing sweeper, stevedore, railway porter & warder for a lunatic asylum. In addition I have picked up enough Arabic to swear at the ‘wallads’, a certain discrimination in the matter of wines & liqueurs & a possibly useful faculty for living, sleeping, & eating anyhow & anywhere.\n\nTrue, I have knocked a great amount of laughter & amusement out of those years and I have been through experiences both tragic & farcical which will afford me a fund of reminscenses when in the sere & Yellow leaf if I ever reach that somewhat questionably pleasant state.\n\nBut for the last two months I have been completely in accord with Touchstone, for the golden thread of humour which runs through the fabric of one life here has been increasingly difficult to follow. Just picture it – a camp in the middle of the\n\ndesert under an almost vertical sun, with no recreations beyond eating & sleeping, the greatest of which is the latter for, though I hate to insinuate that the cooks are incompetent, any self respecting camp would have kicked them out long ago, but with us I am afraid \"inertia prevails\"\n","6":"\n\n Another aeroplane scare this morning just as we were finishing our humble breakfast. Nothing doing however, we had two absolutely rotten shots at him with the 2.10\" & then our battle plane came\n\nover, & Johnny sheared off for home. But now there are much too many horses in the camp now to be able to spread out properly at short notice & as for the English regiments they are always late; one day he will come over with a few bombs & catch us all before we are properly scattered & do a good deal of damage I expect.\n\nI used to think that the sailor of fiction who used to mutiny of account of weevils in the biscuits & other little inconveniences such as that was an unduly fastidious person,\n\nbut now, however, I can quite see his point of view, as throughout the last stunt we had weevily biscuits. It is not so much the actual taste of the weevil that one objects too, because really the taste of the biscuit preponderates, but it is the idea …\n","7":"\n\nWe actually had some news last night. A force of turks was reported by ‘Plane at Bir el Abd and at twenty minutes to six last night a patrol of the","8":" Reg engaged them At Oghratina.\n\nWe got order to be ready for an\n\nalarm and had to ‘stand to’ this morning, but got no further orders. The Second Brigade went out last night & engaged about 3000 of them at Oghratina & a brigade of New Zealanders went out to Bir el Bayud & held 1500 there or so they say. the latest rumour is that we have fallen back on Katia but I don’t know whether that is right. We shall probably go out this evening.\n","9":"\n\nThe alarm came at 1 o’clock am. on the","10":" yesterday. We went out as far as Katia. the idea, I believe, being to get in touch with the turks & retreat in front of them to Romanih\n\nin fact to lure them into the mouths of the 18 pdrs & howitzers we have here. But I will take my hat off to anyone who can lure Johnny into the mouth of an 18 pdrs. they can show us points in sort of fighting.\n\nJust imagine 3 days ago there was apparently hardly one turk for 30 miles around, now at Oghratina Bir el Bayud & other oases there are troops numbering about 10,000\n\n Yesterday an observer in one of our planes was hit by a machine gun & died before reaching Port Said. We had one casualty yesterday a fellow badly hit over the eye\n\nwill be very fortunate if he dosen’t snuff out.\n\nSix of the","11":" Reg. were caught by 30 turks when patrolling yesterday afternoon this fellow was hit & they brought him under cover over their saddles.\n\nWe pumped 10 rounds from a battery of 18 pdrs onto Oghratina & then came home reaching here about 12 oclock. Stand to again at 3 - I shall sleep well today.\n","12":"\n\nWent out to Katia again at 2 am yesterday morning & came back again at midnight. We all lay on our backs for about half an hour in the morning watching\n\na tophole scrap between our ‘plane & a taube. They had four distinct rounds but it was – as far as we could see – indecisive as at the end of the fourth round they Taube cleared for home. The Brigade made a demonstration in the afternoon in conjunction with a battery of 18 pdrs & took 18 prisoners: we had no casualties. \n\nout again at tonight I expect\n","13":"\n\nBy a special dispensation of a beneficent providence made manifest through the Great Ones of the Camp I did not have to go out last night as usual, but instead I was put on\n\nPicket & had the diabolical pleasure of waking the camp at 11.45 pm. We have had several taubes over this morning one is over now, the conclusive appearance of the \"d\" in \"had\" on the first line was an account of the first shell being fired at it. The first time he came over, he came over us & Hqs. at a tremendous height they fired on it of course & then when all the excitement was over & the machine nearly out of sight, a red white & black streamer fluttered down almost at the door of Headquarters – who says the Turks don’t know our disposition of troops? – It was really quite dramatic of JT to drop a message\n","14":" accurately from about 5000 feet!\n\nThey tell me now that the message was - & quite probable too – \"Refrained from bombing as Hospitals too indistinct\".\n\nOf course very likely it was a bit of boasting, very probably he had no bombs on board, he has been over twice since them & not dropped any, but anyway it was very decent of him to give us the warning.\n","15":"\n\nThis midnight stunting still continues unfortunately. If one looks at it in the right way it is really a great boon to us because we have a day of 24 hours, then in the next twenty four hours a\n\nnormal days’ work as well as well as a double sleep has to be squeezed in. So really we are living twice a fast as in normal times & instead of living only about 16 hrs out of the 24 – the rest being lost in swinish slumber – we live 20 hours – Better than any quantity of Daylight saving devices – Though our slumber, when we take it, is , I must say, exceedingly swinish.\n\nShortly a division of Infantry is going out to attack our friend John! There will be some sparks flying Ah’m thinkin’.\n","16":"\n\nNot quite so dull at Katia yesterday. The officer of the patrol left out there was killed & we made a very cautious entry into the palms there. The Turks advanced slowly on us all day from the NE in a semicircle to the S.W. Six wounded only one badly finally at dusk just as the turks got within shot of our bivouac we slipped out and came home.\n","17":"\n\nThings are beginning to hum now not so much on land, here the position remains much as it was – as in the air: also a new element\n\nhas been introduced, namely the sea – two monitors have anchored off Oghratina; it is going to be quite a miniature France.\n\nThe Turks made an air raid on the camp here one day – when we were out fortunately - & dropped 24 bombs without doing any proportionate damage. 4 killed 32 wounded & a few horses.\n\nThe next day our planes visited the Turkish camp & dropped 72 bombs & now today two of our planes were at it again, and in addition the monitor was plumping 12 inch shells over too. I pity the poor Turk, it may not kill many but\n\nwill make most of them terrible nervous wrecks. I escorted a sand cart with wounded back to the camp this afternoon so I shall have a whole night’s sleep for a change tonight.\n\n6th August\n\nThe turk must have a certain sense of humour. He attacked the camp on","18":" & to some purpose too. At 1oclock we arose as usual expecting to have the usual wild & ineffectual stunt out to Katia, only to find out that rumours ament our brigade having already turned out were true & to hear firing on the weak end of\n\nthe Camp. We proceeded as far as the extreme end of the south west side of the camp & waited until daybreak. Thereupon the whole outfit proceeded on over a ridge where a goodly number of strays were lobbing up to the held horses of the brigade who were stationed there under a big sand bank. Proceeding still further to cross the next ridge, a machine gun opened right onto us & we beat a hurried and I fear somewhat ungraceful retreat only one horse being seriously hit. As however it was absolutely necessary to take at least some transport\n\nfurther on. No 1 section including Kemp esq (honorary corporal) Robertson Fraser & I & two saved carts had to go on.\n\nBy this time the fun was fast & furious; a battery of mountain guns – made they say by Austrians was shrapnelling us with really admirable precision and the machine gun bullets & strays were landing thicker & thicker.\n\nFor myself, I might have been drinking bad champagne all night from the state of my mouth & I am quite sure I haven’t been so mortally frightened since\n\nSari Buir this time last year. In future I shall spend the 1st week of every August safe in bed I think.\n\nHowever, we clapped our spurs in & away we went hell for leather over the ridge into the next little dip & after us came the sand carts rolling & ploughing up the sand like ships in a heavy sea. After them came some ammunition limbers. The enemy evidently spotted these & began to put shrapnel systematically into this hollow. It was really marvellous how well the horses stood it for the shells were bursting in some\n\ncases only a few yds overhead or to the side. We filled up one cart & it went back. Then they got one shrapnel right in killing three horses but luckily only one man, an officer got wounded. While putting him into the cart, the machine gun started again & one got Robertson in the back dangerously \nto\n near the spine, however I hear he is going on allright now. Having fixed him up we again went back as fast as ever we could manage to where the regiments’ horses were; finally retiring with head quarters after the regiments\n\nSeveral more horses got bullet wounds & another man belonging to this outfit got hit in the foot.\n\nThen until 5 oclock pm. we stood by back in camp while the infantry held the turks. All this while the Turks could shrapnell all the camp, & - which was a great surprise – had a couple of 6\" g howitzers in Katia with which they bombarded the redoubts & railway unmercifully but fortunately a great part of their effect is lost in the soft sand.\n\nAt 5 pm we started off & made a big detour to the N & \n\nW. & commenced to drive the now repulsed ‘enemy in a southerly direction. We caught up the regiments at about 8 oclock & had a sleep until 3 am & then started again in pursuit. The desert to the W & South of the camp was strewn with our shrapnel shell & cases & clothing, boots, ammunition & camels, abandoned by the Turks. About 2600 turks were captured including a German M.G.S. & FA. complete. At about 10.30 we met the 3rd Brigade LH. advancing from Duweidar.\n\nat\n Everywhere the eye could see over the desert there were mounted\n\ntroops advancing on Katia.\n\nAt 1.30 we had Katia surrounded at 2.30 a general attack was made & kept up until dark but we had, I think bitten off a bit more than we could chew & at 7.30 out crowd came home followed by the regiments.\n\nI believe today our infantry is out there attacking it, but I don’t know how they are getting on. About morning again a mob of 50-60 prisoners were escorted past the camp.\n\nOn the","19":" there was also an attack at Muhammadiyah by 2000 turks which also failed.\n\nAt Kautara it is reported that we have taken 4000 prisoners. I don’t know whether it is so, it is probably somewhere near that. The fellows left in camp here had a thin time the night before last, strays were lobbing all over the camp & big 6\" high explosives not so very far off. The two fellows left in out tent had the audacity & impertinence to make a barricade our our kitbags in the tent to keep off the strays. To the west of the camp the air is heavy with the scent of dead horse – there are a great number of horses killed.\n","20":"\n\nCasualties for the Anzac Mounted Division in the Romain affair are estimated at 700 odd I believe. After returning from Katia on the night of the 5 &","21":" the first i.e. our L H Brigade rested until 3 pm of the","22":" during which time we learnt that Robertson’s name had been sent in to be mentioned in despatches – also I believe the Colonel will get a DSO. out of it: - It was the chance of a lifetime anyway as the Brigadier I noticed was close by all the time.\n\nAt this time – 3 pm of the","23":"\n\n- The anniversary of Threlfalls death by the way – the brigade went out accompanied by the Second Brigade.\n\nWe reached Katia – by then occupied by our infantry at about 7 oclock waited there until 3 am & then proceeded to Dubarbos direct where we left our base.\n\nComing out we had occasion to notice the Turkish fortifications of Oghratina, also we could see the tracks of their howitzer battery which they brought to Katia & the manner in which they managed this stupendous business.\n\nJust imagine bringing such guns as those 60 pdrs i.e. almost the size of the naval 6\": across 30 miles of shifting deep loose sand. It is almost a par with Hannibals passage over the Alps. They achieved their purpose by putting down bushes in front of the wheels & running the wheels on planks when the gradient became too seep. There are piles & piles of thick planks out their some still in position left after the gun had run over them. An enormous number of men & - they estimate – 30 men to each gun must have been\n\nemployed. Another marvellous piece of organisation was that in which they managed to keep these guns supplied with their munitions, as they always had plenty.\n\n-To continue, Leaving our Base at Dubarbos we went on about 2 pm to find a very warm scrap in progress just in front of Bir el Abd. This was the first stand they made since the Katia scrap on the","24":"\n\nThe whole Division attacked & scrapped all day but were unable to shift the turks, in fact about 6 oclock, where we were in\n\nthe centre, the turks attacked and we had to retire hurriedly for about a mile. That night 9\/10th the Division retired to Oghratina. Next day the three LH Brigades took up positions & watched the Wily Turk; there was a little shelling but no real fighting. \n\nWe had our Bivouac at Hod el Kirba about 2 miles to the left of Dubarbos. Patrols were sent out; the remainder did nothing.\n\nImmense stores were abandoned at this place, the Turks evidently used it as an advance depot cases of dried apricot compressed into strips like brown paper\n\nmakes excellent jam if boiled up. A sort of pollard which they evidently made into porridges. Any quantity of dates & olives & numbers of bags of barley, which last was very fortunate as our transport had not arrived & we had no feed for our horses. I may mention, in passing that our horses had nothing but neat corn for the whole five days we were out.\n\nThe following day – the","25":" – we did nothing.\n\nOn the","26":" we went out with a scouting regiment to the left. During the morning I was for some\n\ntime at one of our signalling stations. They are a queer race they speak another language. When one wishes to communicate to another he says Esses, groups, Bir toc don e , group ac toc pip don, group ac ac ac. The other says \"right O\" & the thing is done.\n\nIn the afternoon we went to \nKatia\n Bir el Abd which the Turkeyman had now evacuated. Here we found evidences of a large camp, a number of wells & pumps & notice boards – the german touch – announcing that this was Bir el Abd & Katia\n\nwas so many miles distant – written in German & \nArabic\n Turkish.\n\nWe had just drunk some water out of the best well there which is hardly brackish at all. When a doctor came up & told us that Cholera had broken out & cautioned us against the water. You can imagine our feelings!\n\nWe then returned to Hod el Kirba to find the brigade starting for home, so we went with them to Katia.\n\nA long day, - we had started a 4 am & reached Katia at 11 pm\n\nThe next day","27":" we came back to camp here, where we were met by the news that we were off somewhere for a spell in two days, either Alexandria (unlikely) Baler – a place near Ismailia (likely) or Kantara (likely).\n\nOne stumbles across some delightful little incidents \nsome\n here sometimes.\n\nThe other night about three weeks ago we had just reached camp after one of our daily stunts to Katieh and were passing the","28":" Reg. Camp when one of the reg fellows came riding past us with another fellow following him. Not three yards in front of us his\n\nhorse puts his leg down a hole, comes down & breaks its leg. (The time was about midnight). The rider comes a good smack into the sand then examines the horses leg & then turns for sympathy to the man following him & is met by the remark \"Kick the barstard in the guts, cobber & lets get ‘oing\"\n","29":"\n\nOur project of moving down to the canal has been knocked on the head by this cursed cholera. I believe there are quite \nof\n a number of cases now. I hope they manage to get it under soon.\n\nAccording to documents & orders found in the abandoned camps of the turks they imagined that this camp was occupied by two brigades of ALM. only, their Intelligence reported that the rest of the camps & redoubts were were dummies. Their intended scheme was to take this place in two hours drive us out make trenches facing the canal & hold them until reinforced by 40,000 infantry from El Arish.\n\nA wet canteen has just opened in the brigade, the result being of course that the first day was a positive Saturnalia, three\n\nparts of the brigade were paralytic & the remainder looking for a fight.\n","30":"\n\nA horribly persistent rumour is on foot that we are going out to relieve the","31":" Brigade at Bir el Abd where there will be taubes alarums & excursions everyday. A taube was over the railhead – now about 4 miles out - & bagged a crowd of natives yesterday three killed & seventeen knocked I believe.\n\nI have seen a translated copy of the orders issued to The Turks. The papers were captured at Katia & I have copied the\n\nthe most interesting & inserted them here.\n","32":"\n\nEnemy planes over again this morning & dropped several bombs on the new railhead but did not penetrate as far as our camp so after a short pause we resumed our breakfast.\n","33":"\n\nThis evening by way of introducing a new flavour someone dropped a lizard in the stew; fortunately it could swim & was got out fairly quickly anyhow the stew was eaten & no one has died yet, I took good care not to get any until\n\nthe top half was gone.\n\nTomorrow four others & I are going to Port Said for 6 days to a rest camp. This will be the longest leave -of a kind- that I have yet had.\n\nSix days in two years!! I ought to have a good time if I get a proportionate amount of amusement out of it. But I doubt me. Anyhow. us’ll see\n\nSept 12th\n\nPort Said has changed very much since my last visit there is 1913. For one thing it is in the \"Suez Canal Zone\" & thus no\n\ncivilian can come to Port Said unless he has some very excellent reason. Hence there are comparatively few civilians there.\n\nAs I predicted I did not have any delicious amusement there though I enjoyed my stay very much.\n\nBut the place is chock full of soldiers & so there are many restrictions & thus one has to make ones own amusement; and to do so a companion who has much the same tastes & temperament is essential.\n\nThis\n Such a companion I did unfortunately did not have down there, as D Maclean was my usual companion at meals & other distractions. Now he is a very nice fellow and all that he should be – I am not attempting sarcasm - but though I like to take my amusements quietly yet his ways are not exactly my ways & he is even a little too quiet. He has a way of speaking continually of trivialties which I at times found utterly boring. His conversation seems to \n\n to lack body & to be rather a pallid affair altogether and I found myself \ncont\n frequently unconsciously ignoring his conversation & thinking of other things – which is a very rare occurrence with me.\n\nOf the others down there there was J D Torrens, whom, though I have lived with him almost without cessation for two years, I cannot yet understand. I feel that I cannot interest him, & though I am not sure, I don’t think he likes me. Another was\n\nwas J H Kemp who strikes me in some ways as being somewhat callow & crude, & is apt when enjoying himself to become a trifle boisterous & uncouth. Many was the time I wished for Yeats or Tommy Rutterford to be down there.\n\nHowever on the whole I enjoyed myself very much. I would get up late & at about 10 go into the sea remain there till 12.30 then to lunch at the Café du Nil – I would like to know how many Café’s du Nil there are\n\nin Egypt – 3 oclock would see me again going into the sea. Afternoon tea at 5.\n\nShop, stroll around or read until about 7.30 then another excellent meal at the Café du Nil – where they have a French chef - & so to bed generally not later than 10.That was my usual programme for the day – and very nice too.\n\nThere seems to be a scheme for an attack on a large Turkish Outpost camp near El Arish shortly. A risky proceeding I think\n\nas there lies between our farthest out post & the objective a waterless stretch of 20 miles. So it will go hard with us if we are repulsed. Rumour says","34":" & ","35":" Bgdes & Camelry to attack","36":" Bgde to be supporting force. So with any luck we may keep clear of it, anyway I hope so. This fighting job may be all right in the regiments but it is too cold blooded a job for your in this open country without a scrap of cover.\n","37":"\n\nRumour is very strong now everywhere leaving Egypt shortly for Salonica or England. It is feasible, as a Camel Corps has come out here & may relieve this division here.\n\nBir el Abd.","38":"\n\nHere I am at Bir el Abd, again stunting\n\nWe left Romani last night at 6 oclock, or rather 1800, travelled all night & got here at 5 or 0500, very irritable, very tired & with a very unwashed feeling.\n\nThe","39":" & ","40":" Bgdes are at Bir Salmana, they will attack at dawn tomorrow.\n\nBy the way I think we have been a little too ambitious this time as we - 12 \n\nltus Division – are attacking – as far as we know 2600 turks with 4 mountain batteries & 10 machine guns, all of which are well entrenched & will take a deal of digging out unless we make a complete surprise; which is almost an impossibility for an enemy ‘plane has been over two or three times this morning. I am afraid it will be a failure.\n\nWe are supports & do not leave here\n\nuntil 1.30 am & should reach there about 6 am.\n\nThere is no water, I believe for our horses after Bir Salmana so from tonight till tomorrow night theye will get no water.\n\nBir Salmana","41":"\n\nI have just breakfasted & feel as a result much better.\n\nSpent a miserable time last night trying to get to sleep. It was insufferably close & one had to have one coat on to keep off the mosquitoes whose name was legion. And there I lay with Camel ticks crawling all over me from the ground and mosquitoes from above, sweating\n\nand, I fear swearing in about equal parts, knowing that I had to get up at midnight & every was lost if not asleep.\n\nHowever I got in about three hours & then came on here our section being Camel escort which duty consists in driving the camels & saying \"iggerre\" & \"Etla –a-a Ia-el Kel-p-p\" to the natives.\n\nReached here about 4.30 am & found everyone but the Camel escort had been in bed an hour - very amusing.\n\nThis is a very pretty little grove now on account of the ripening \n\ndates.\n\nAs possibly you may not be aware, the date passes through three distinct colours at first green, then pale pink deepening into raspberry red which in its turn darkens to the finished article purplish black. They hang in enormous bunches, as big as a man can lift on a fibrous stem coloured orange so it can be understood readily that the contrast of colours is very beautiful. Here now they are a deep red in dark green leaves – very fine.\n\nA fellow has just come in to say\n\nthat the attackers walked straight through the place they were to attack – Bir el Mazar as it is called – meeting only 8 men as opposition, but have gone on and are now engaging outposts. This is at about 9 am.\n","42":" place Same day 6 pm\n\nHave just heard that though the above was true yet the attack was a hopeless failure. the Camel Corps being lost, did not turn up until 5 hours after daylight. The","43":" & LH Bgds failed to link up & when our fellows got about 3 miles past Bir el Mazar they found the\n\nTurks strongly entrenched with loads of artillery, had a two hours scrap & had to give it up & came back with their horses pretty done up.\n\nTonight I believe we go to Bir el Abd & home tomorrow.\n\nI am down with the signallers now, to take any messages or orders which may arrive.\n\nIt is too dark to w rite any more.\n\nNequilliet Monday 9 am\n\nIn all we took 20 prisoners & nine camels & sustained in casualties two killed & 20 sick & wounded. We collected the whole crowd at Salmana from the other two\n\nBgd’s Ambs. & brought them on here to Nequilliet or Kilo 60, a distance of about 14-15 miles reaching here about 6 am. Rather an unpleasant ride owing to weariness; for the first time I was unable to stop falling asleep in the saddle. The first time & fell asleep I landed up against a wagon wheel, the second I got nearly kicked by a draught horse. The third time I was soundly wrapped in pleasant little dreams when my cussed little pony took me right ahead alongside of one worthy Colonel & Major & my innocent slumber was broken by bitter words from the latter.\n\nThe fellows reckon that we did great execution with our two batteries & also that the ‘planes did excellent work bombing at about 500 feet with a battery of AA guns on her all the time. I expect we shall continue our journey back to Romani late this afternoon.\n\nRomani also Monday 11.30 pm\n\nHave just taken off my clothes for the first time since Friday morning washed, drunk a cup of tea & crawled into my blankets, where I am about to luxuriate for a short time with a priceless Ramses\n\nWe left Nequilliet at 5.30 pm & \n\ngot here at about 10.30 pm\n\nThere you have the Complete Stunter by one who is heartily tired of it.\n","44":"\n\nSand, Sand, Sand Everlasting shifting sand that gets in your bed o’nights & your food by day; that gives off a dazzling glare from the blazing sun that makes one pucker up one’s face & shield the eyes with the hand – I am so deadly sick of it all.\n","45":"\n\nThere is a sudden rumour afloat that the Brigade is going to Kantara next thursday & from there to & Maadi to Heliopolis y Zeitun S upper Egypt to try conclusions with the Senussi once again. It seems to have a sort of indefineable sense of being right somehow but as yet I can get no reliable information concerning it.\n\nAnyhow Heliopolis would be like coming home again, and even Upper Egypt – in the wilds of Sohag & places such as that – would not be so bad; there at any rate be something to look\n\nat in place of this inhabitable & monotonous desert.\n\nMan is ever a discontented animal.\n\nI am tempted now to transfer into one of the regiments if possible, but then it is so terribly like starting afresh one would lose preference for leave or any job that might be going & fall out of the proverbial frying pan.\n\nI see a fly, contrary to custom flying about in a dopey manner – it is about 9.30 pm - : He has flown into the candle & now his corpse lies at the foot of the\n\nwick well basted in hot grease …. I think I shall take it as an omen.\n\nI don’t think I am very popular in the tent just now; four blanket wrapped forms looking more like contorted corpsed than men are lying down preparatory for sleep, and from the exaggerated sighs & polite requests to shade that – candle I gather that they are wooing Sweet Lethe in vain.\n\nBut then, the time honoured maxim in the army seems for the most part to be \"Blast you Bill I’m all right\".\n\nNext day\n\nThe","46":" Regiment is packing up today; so it seems that we are going all right.\n\nThis morning out came the well thumbed old map of Egypt & a hot discussion raged as to the merits of our probable destination, its proximity to towns of note, etc etc. It is the same every move.\n\nLater\n\nIt transpires now that out dreams of waiting at Luxor & Khartoum are destined to vanish into thin air We are apparently going only as far as Hill 70, which\n\nis just as miserable, of not more so, as this place: The only essential difference being that there is fresh water both for us and the horses. I think the idea is simply to get the horses on fresh water for a spell.\n","47":"\n\nMy prophecy was a true one, I said that the Thursday rumour had an indefinable air of being \"dinkum\", and we have proved only too thoroughly unfortunately that it is very much so.\n\nI am now sitting in a mangled heap up against a shed. I will relate the events that led\n\nup to this sad state of affairs. We got orders at 3.30 pm yesterday to shift our stores to the station by 5 pm.\n\nJackie’s Lead (our S.M.) immediately ran down like an overwound watch, the palpable result of which being that I & several others spent from","48":" pm down on the station loading trucks minus our tea.\n\nAt 3 am this morning we arose & started from this place, our section unfortunately was detailed Camel escort with the result that we dawdled & meandered & messed around & got here at 3.30\n\nabout 2 hours after the others & as tired as dogs,\n","49":"\n\nAccording to the latest from HQ we are continuing our journey to Kantara on Monday morning.\n\nBy accident yesterday I stumbled over an amusing incident. It appears that out at the Cholera Camp (which is now mafisch) on one occasion a fellow died suddenly & there was no parson available. So they had to improvise. Neither of the officers would read the service so one fellow took on the job & got they say, horribly tied up with the directions.\n\nThey had no ropes to cover the unfortunate corpse with so they had to use the hoop iron bands off the bales of ‘tibn’. All went well until the corpse was lowered when they found that the natives had made the grave longer at the \nbottom\n top than at the bottom with the result that the corpse stuck half way & an axe had to be brought & the sides chopped away underneath.\n\nAltogether as an impressive ceremony it was somewhat of a failure.\n","50":"\n\nWe have a good camp just on\n\nthe edge of the Canal, in fact, it promises well for quite a decent camp here.\n\nDawn of","51":"\n\nI have conclusively proved that St Paul of whoever it was had never on Last Picket when he wrote \"Short as the watch that ends the night\". Personally I can find no difference.\n\nOf Late everyone has been brawling here, due, I believe to the potency of the beer here, as they tell me it is the same in the regiments.\n\nThere was a good fight over some blankets – Somebody\n\nreckons someone’s blankets were lousy & he wasn’t going to stand an insult like that No By--- he’d be seen in --- ---- Hell first- biff-bang & they were into it.\n\nAnyway if trial by battle is any criterion to judge by, his blanket must have been very lousy for he got the deuce of a hiding. Lord, what fools these mortals be!\n\nBy Jove, it is amusing to watch a camp at reveille.\n\n The snores slowly die out to be replaced by inarticulate grunts & growls. Presently a tousled head\n\nemerges out of the blankets only to be hastily withdrawn on striking the cold morning air. Next the blankets are pushed down and a semi naked form emerges usually partly covered by a little short shirt & stands up shivering in the cold blast & yawning & blinking the eyes. Then comes the performance of entering a pair of britches, an awkward business this for one half asleep, necessitating standing on one leg & waving the other in erratic circles.\n\nCollapse is the almost inevitable result followed by a drowsy oath\n\nBeing partly clothed a search for food is often the next performance the consumption of which occupying until the fall in for morning stables, on which every one parades with the exception of the Last Picket who meanders about the lines with an overcoat over his defective clothing, unlaced boots & an unshaven & unlovely countenance, pallid in the morning light.\n","52":"\n\nThe Labourer has been well worthy of his hire the last few days. There have been 103 horses to be looked after by about 16-17 men\n\nThis meant watering (about ¾ mile) then in two lots, one after another & with other camp duties quite a full days work.\n\nI have the tent to myself tonight. JHK. has gone down for 24 hours to the Vet Corps to look after 6 of our horses these. D.M. is in charge of the picket. The rest are at Alex. Very nice & quiet.\n\nI go to Alex. on the","53":" the day after tomorrow. I don’t anticipate a wildly amusing time but it should turn out better than Port Said.\n\nagain, went to bed & woke up in the morning perfectly all right.\n\nThe next night I went with Sturgeon & a fellow named Woodstack (going home for a commission lucky fellow to the Kursaal\n\nOn Monday – the next night I dined with Mrs & Miss Leathes. The next night & the ensuing nights at the Alhambra where I saw first an operatic Concert then Lena Ashwells Concert party which was top notch absolutely, & lastly a french\n\nRevue, done by Amateuers on Alexandria & things Alexandrian which was quite clever in parts. I also had a much-needed Turkish Bath.\n\nNow no one knows where we are going though I fear it will be Bir el Abd.\n","54":"\n\nWhile at Alexandria I contracted with one Khalil Ibrahim Saffi for him to send me some cigarettes fortnightly, the first insallment to be sent \"le dimanche’ it is now Monday & elles ne sont pas arrive. The transaction was carried on in bad French which probably explains.\n","55":"\n\nThere is something in the wind though what it is I cannot find out. They have inspected everything, indented for all deficiencies & are generally refitting us out. Of course it may be (and I fear is) merely for the winter at Bir el Abd but still one would think we could have carried on as we were. I give it up anyway.\n\nWe get no small amount of amusement out of our Transport Sergeant. He is quite quite a good fellow, but he has\n\none failing & that is grammar. Indeed his wanderings into that branch of learning and his head long dives into its teeming pitfalls afford us considerable distraction. An order came out that all horses were to have salt. He interprets thus: \"All ‘orses ‘as to ‘ave salt, so all yous men must give your ‘orses salt at least three times once a week.\" And again \"There’s a brown ‘orse on the end of the lines which the picket wants for to be careful of, or ‘ell be getting’ shook ‘ands with.\" He has a style quite his own\n","56":"\n\nThere are great Rumours going around now that the Brigade is going to be split up again & a regiment is going up to Minia again, which would be \"quies Kateer\" But I am almost certain that it will be that miserable Bir el Abd. Anyway one thing is certain wherever we are going we are going to take no tents with us & if it is Bir el Abd, it will be absolute purgatory – wet mists from the sea and a very uncomfortable existence indeed.\n\nI have met a lot of fellows who have returned from Australia after a trip there, and they say that in Australia no one now has any time for the returned Soldier. Well well, the gilt is off the Ginger bread by now I suppose. By the time I get back (if ever I am beginning to doubt it) it will be, I am afraid, a case of ----\"the island princes over bold. Have eat our substance and the uni\tnstated sings. Before them of the 10 years war of Troy And our great deeds as half forgotten things ….\" In other words \"The dissolute Soldier, again\n\n\"Dulce et Decorum est pro Patria mori\" who was it who would the admirable sentiment?\n\nI believe it was Horace but I would not be sure, at any rate one of the ancient Latin poets was guilty. Well it may have been all right in those days when you went at one another hammer & tongs with a big stick & had slaves to clear up the mess afterward, But now I fail to see any glory or romance in active war, it is to my mind too sordid, man is\n\n brought too close to his animal state. He lives like an animal & dies exactly like any animal you may go out and shoot in an afternoon. What glory or romance is there when, while going about your lawful occasion there comes a sudden vicious hiss followed by a snick like a door hasp shooting home and the man next to you drops sprawling & kicking, gasping, foaming at the lips?\n\nA few days afterwards your job may take you up the same way again, there is the same man now twice his normal\n\nsize, blue black in colour & surrounded by a noisome horde of flies, & an awful & pestilential stink? Of course I am not going to bring that there may be Glory etc there but my trouble is that I can’t see it. I think a man has to be worked up to a high pitch of emotional stress before he honestly agrees that Dulce et Decorum est pro patria mori.\n","57":" pm on","58":" \n\nWe are off. I am writing this by the light of a guttering candle under the stars. The Minia rumour \n\nexploded some days back & now we are going out to Bir el Abd preparatory. I think - to occupying El Arish. We are taking no tents so I hope to God it does not rain if it does we shall plumb the absolute bottom of the depths of human misery. Despite our travelling very light I am taking a good library\" - \"Tennyson’s works, Old Omar, Measure for Measure & Antony & Cleopatra - and later out there I hope to be able to borrow \"Marcus Aurelius\" as I have been promised – I shall need some of his meditations’ to chew I think, there. \n\nMore anon\n\nDueidar\n","59":"\n\nWe reached this delectable spot this evening about 5.30 pm. And now I am in bed writing by the light of a very inadequate moon. Used as I am to this business now of making camp still even now I am influenced by the sort of glamour which is undoubtedly attendant upon a brigade of cavalry \nentering\n advancing . The noises both of men & horses & the place lit up like a gin palace by countless twinkling fires – the whole effect is decidedly picturesque and – to use an Americanism – it \"gets\" you sometimes.\n\nRomani\n\nSame time Next day","60":"\n\nArrived here today. It rained when we arrived so tonight I have rigged a diminutive tent composed of my canvas saddle cover & some palm sticks supported at my head by my saddle. I am afraid it won’t stand much but at any rate I am safely inside now writing by the light of a candle which threatens to blow out every minute. It has been thundering all the evening & I am afraid we shall have a bad night. \n\n"}}