{"Document Name":{"0":"Diary_0415","1":"Diary_0415","2":"Diary_0415","3":"Diary_0415","4":"Diary_0415","5":"Diary_0415","6":"Diary_0415","7":"Diary_0415","8":"Diary_0415","9":"Diary_0415","10":"Diary_0415","11":"Diary_0415","12":"Diary_0415","13":"Diary_0415","14":"Diary_0415","15":"Diary_0415","16":"Diary_0415","17":"Diary_0415","18":"Diary_0415","19":"Diary_0415","20":"Diary_0415","21":"Diary_0415","22":"Diary_0415","23":"Diary_0415","24":"Diary_0415","25":"Diary_0415","26":"Diary_0415","27":"Diary_0415","28":"Diary_0415","29":"Diary_0415","30":"Diary_0415","31":"Diary_0415","32":"Diary_0415"},"Date":{"0":"unknown","1":1546.0,"2":1550.0,"3":1551.0,"4":1552.0,"5":1553.0,"6":1554.0,"7":1555.0,"8":1556.0,"9":1557.0,"10":1558.0,"11":1559.0,"12":1560.0,"13":1561.0,"14":1562.0,"15":1563.0,"16":1564.0,"17":1565.0,"18":1566.0,"19":1567.0,"20":1568.0,"21":1569.0,"22":1570.0,"23":1571.0,"24":1572.0,"25":1573.0,"26":1574.0,"27":1575.0,"28":1576.0,"29":1577.0,"30":1578.0,"31":1579.0,"32":1580.0},"Entry":{"0":"\n\n","1":"\nHad a quiet time today, at 4 pm. I wandered off up Ultimo to La Basseville to Co Headquarters, met Major Grant& together we in broad day light cruised toward the debris, its a pert stunt crawling on your tummy for Warnton Tower overlooks our position, we cruised onward looking for dugouts found 3 or 4 in the Tannery in one there are quite a number of P.C.s left by Fritz, in all there is a certain amount of furniture.\n\nWith arrival of parties we commenced construction of Como Trench, 80 yds for 50 men, 5 feet deep, we struck concrete beds, burrowed under them, water pipes and railway, finished at 1.30 am camoflaged work to hide it from Fritz. The men work awfully well, of course they grumble like the devil.\n\nWandered round other parts of the line including a cruise to the bank of theRiver Lys. Fritz has a strong line wire out right down to the water.\n\n\n\nComing home I passed a dead soldier brought in tonight from No Mans Land he was killed in the raid of 10 days ago & in my heart I felt sorry for his folks.\n\nOne of our chaps in a post deserted today, this is particularly trying when one considers the information he could give away - see diary of the 3rd & 4th Mar.\n\nIts interesting to be in the dugouts forward, the yarns are fine stories of trips to Fritz wire & of contacts with patrols.\n\nAt La Basse Ville we cannot move around by day except with extreme caution, it is a \"Minnie Dump\".\n","2":"\nWalked up to La Basse Ville & taped Manly Trench, work commenced, and 3 out of the 6 parties turned up, usual stunt arrived back at my dugout, St Yves about 10 pm. Commenced to dig Manly Trench access La Basse Ville, Warneton Road, struck\n\n\n\nall sorts of obstructions, pipes foundations. Fritz wounded one of our men.\n","3":"\nWent up to La Basse Ville about 4 pm, bitter cold gale blowing, driving hail, the night was pitch black absolutely impossible to see, Ultimo Trench was blocked with parties, raiders, scouts. Lewis gun parties, working parties, ration parties every body & any body was doing his best to block everybody else, I never saw such a devil of a mess, the raiders were like lost rabbits all over this show.\n\nMy special job was Manly Trench, finishing it off, it goes across from the Covered Way to an excellent dug out the other side of the road, just finished off the roof at 1.30 am & it fell in so amidst much cursing of the infantry, we started work again, got home about 3 am, absolutley tired out.\n\n\n","4":"\nGot up about 3 pm & walked up from StYves to La Basse Ville, crawled thro the hidden saps, dug out the Major - Major Grant - in Como Sap had a yarn & came home.\n\nTonight is the night of the raid, all day we have been cutting old Fritzies wire, he hasnt said a word for days, it looks suspicious.\n\n11.45 pm was zero hour & as the time crept close the silence became intense & grim, as I lay in bed my thoughts wandered along the tracks & I followed the party from point to point untill I fell asleep being only semi conscious when one artillery opened up, slept serenely thro it all.\n","5":"\nWas awakened by a runner who gave me a note from Major Grant stating that \"Manly Trench had been hit\". My sappers who reported later went up & cleared it out. Got up at 10 am&\n\n\n\nafter dressing walked up to La Basse Ville, the morning was dull & old Fritzies country looked disconsolate, smoke was coming out of a spot 100 yds or so nearer to our trenches than the Town of Warneton, numerous prisoners passed me as I walked up Ultimo.\n\nAt Co Headquarters I met Major Grant. He was jolly as ever, the war to him is a good joke.\n\nOnly 2 of our raiders were killed 10 wounded remarkably light when you consider the number who went over.10 prisoners & 1 german officer were captured & many must have gone west. Many of our chaps had christened their bayonets, 300 went over the top.\n\nOwing to the raid we have no working parties. Tonight our chaps go over again, old Fritz will have the \"wind up\" a mile, our Barrage fell on Fritzies wire, then front line & crept back, Mr Fritz didnt wait for it but made a bee line for the horizon.\n\n\n\nThey are stopping this caper tonight by lobbing a machine gun barrage on rear first & afterwards the MG's will fall into the general line of Artillery Barrage. I wonder what sort of yarns old Fritz put up after last nights stunt, I'll bet he used some pretty long words.\n\nVerry lights from one spot kept going up right thro the stunt right up to the end, he must have been game. A sniper near the river kept going till near the end, I wonder what happened to him.\n\nOne of the raiders long dead near the Headquarters, poor chap he was badly knocked about.\n\nTonight zero hour is 12.50 am & at the time the guns opened I was engaged in a delightful chat with Capt Hawkins, he used to be a staff Capt to the 9th Brigade.\n\nWalked up stairs to watch the stunt, words cannot describe the\n\n\n\ncommotion, there was something doing. I watched it for ½ hr & then went to bed.\n","6":"\nWent to Brigade& had a yarn with Major Payne. He is a great joke but a good fellow, heard that last night's raid hadn't gone to well, 22 injured, 4 killed including Capt Brodie. The picture became disorganised in No Mans Land owing to our artillery firing short but they succeeded in reaching objective & retired without taking a prisoner. Grant came back along Ultimo today carrying a Bosch rifle & bayonet, a great smile on his face.\n\nDug trench roundCo Hqrs at La Basseville. Fritzies lights are a treat. He 'let off' a string of a hundred or so chain lights to catch our planes. They reached from the ground to sky, he also used searchlights otherwise he\n\n\"Un matin pendant l'office la soeur etait à la sainte takla, attendant la communion, le prê tenait entre ses mains le ciboire, lois-que une enorme marmite allemande tombe bruisquement sur un des côtes de la petite chapelle.\n\nTous les vitraux éclatèrent jouchant le choeur de debris de verre.\n\nLe prêtre resta impossible et recueillies tranquilles, la soeur recurent l'hostie de sa main.\"\n\nLe sac de Gerbéviller\n\nwas at La Basseville being quiet. A huge no of shells were whistling into our back area. Came home with Cpl Bipper about 11 pm.\n\nThe sunset tonight was glorious. I was charmed as I look back into the sky from Ultimo. It is the only time that this godforsaken country becomes beautiful. The colours tonight were simply beautiful.\n\nIn digging trench round Company Headquarters tonight we dug up bits of a poor old Fritz. This is of course quite a common occurrence when opening up trenches in the vicinity of positions held by our cobber.\n","7":"\nThis morning opened up beautifully, nature smiled. A Fritzie plane had a narrow shave with two of ours & only escaped by flying in a steep slope towards his own lines. I had instructions\n\n\n\nto meet Major Grant at La Basseville - Birdwood was going up also. Whilst walking up Ultimo Lane a Fritzie plane flew over awfully low. The black crosses under the wings were quite easily seen. I watched its evolutions for some minutes. Picked up Grant & enjoyed a roam round. Birdwood did not turn up. Our heavy artillery commenced to stonker Warneton - 15\" Hows - my goodness they do kick up a fuss. great clouds of dust followed each explosion. I watched 5 shells come over, the 6th hit the famous Warneton Tower a thin high concrete tower used by Fritz for observation purposes, when the dust settled a little the tower had disappeared - to the great joy of all. The Tower was of reinforced concrete 10 feet diameter & easily 60 feet high, we must have wasted tons of shells on it, our guns always registered on it.\n\nA woman was seen by our\n\n\n\nobservers in Warneton yesterday - this is remarkable & reminded me of the find our men made when Messines was taken, viz. - two dead women in oneof the cellars.\n\nIt was quite pleasant sitting & yarning in the trenches today. The sun was quite warm, made a sketch of Major Grant at No 3 Post. He was quite pleased with it. Was doing it when the tower went into space.\n\nThe 6th Field Co take over from us. Am taking them round tomorrow.\n\nLeft St Marys Lodge, St Yves this morning & sleep in camp near Neuve Eglise tonight - quite a change.\n\nMet Williams last night whilst coming home, his men were working on the parapet in Ultimo Lane, it was very low. Fritz used to sweep it with his machine guns.\n\nHeavy Guns shook my dug out all night.\n\n\n","8":"\nThis morning was quite pleasant as I walked down to Gutser Camp to pick up Gillespie. He is taking up the work at La Basse Ville, met Renshaw (used to be with Gummo Forest, Sydney). Gillespie was out but he came into our camp on my return.\n\nWalked out to La Basse Ville meeting en route Davies at Hyde Park Corner, had a good old day up there. Fritz put over a few minnies, met Major Grant, walked back to camp, arrived with a sick headache, heavy guns in the vicinity didn't improve it, after a few hours in bed it soon passed away.\n\nJack my batman is in the same condition, somehow I fancy we have a touch of fever with the filth at our last home St Yves.\n","9":"\nMarched with company to Steenwerke, entrained for Longueville met en route Davies son of Dr Davies of Kent Town, he is in the 9th Fld Amb also Mullett one time chauffeur to McKay of Geelong.\n\nIt is good to feel that we are going back to have a spell. I certainly feel ready for it. Read a book as we came along. Arrived at Devres about 9 pm & marched the 8 miles to Longueville, it was quite dark but the conditions, road etc were good, glad to get into bed at 3 am. The old lady was awfully kind giving us some hot coffee & bread & butter.\n","10":"\nStopped in bed till noon & enjoyed it too. The old lady made some glorious omelets for breakfast. We had some fun with my batman Jack. Putting on his best English he asked\n\n\n\nthe old lady to bring us breakfast. I laughed because of course \nthe old lady \nshe doesn't undertand a word of English.\n\nOur billet is in a glorious position right on a hill overlooking a beautiful valley. It is difficult to even remember when looking across it that a dreadful war exists, the scenes associated with war are easily forgotten. They do not seem to have depth or reality, nor do they stir the soul like these quiet scenes of nature. I would rather look over a quiet valley than cross a thousand battle fields.\n\nPadre Jones is my room mate. He isn't a bad sort of chap but he bores me to death. He's simply awful. There isn't a bit of humour in him, his french is terriffically bad.\n","11":"\nGlorious day got up about 9 am had breakfast & getting on a bike rode off. It was a ripping ride & I soon found that I was nearing Boulogne so kept going.\n\nWent to Officers Club & sat down to dinner, partially ate it & suddenly remembered that I had no money - a sergeant at the Club fixed me up - Sgt Robinson.\n\nCaught the 1.30 pm train for home, met Moloney. He had been to Paris. Got home at 4.30 pm after an enjoyable day.\n\nLetters from Mary Hamilton Clem Nash & Beryl Stone.\n\nHad tea & a yarn with the Padre & then went to bed.\n\nHave been put in charge of the transport, not a bad job.\n\n\n\n\n","12":"\nSent a number of letters home & to various folks, received a parcel from home & the Salvation Army, the latter thro' Miss Rooney's intervention, heard Les had started back home.\n\nIt is a glorious day, our valley is simply charming. Their isn't much doing so I am making the most of the spell. Generally it consists in a cruise round the horses with a packet full of biscuits & then a lie down on the bed from which I can see right thro the window over our valley. The sun set behind the village church was ahymn of colour.\n","13":"\nDid nothing, heard that I am allotted to a gas school early next week, am looking forward to the change.\n\nWent to look at my 'donks' during the evening they were loose in the paddock & were thoroughly enjoying themselves.\n\nReceived parcel from Lady Holder & S.A. paper from Mum. I am one of the luckiest chaps you could possibly imagine. Mary Hamilton sent me a tin of lollies.\n","14":"\nTold today that I had to leave the horses & take over No 4 Section, am rather amused over the number of swapps. I understand that CRE insists on 2nd in comand taking chg of horses.\n\nInspection by Williams CRE today in a paddock just off main Boulogne Road. In a few words of congratulation he stated that in a short period our Divisionwouldrelieve a worn out Divi in the line & the fighting would be either of two - offensive or defensive - how darned clever.\n\nThe Major is in England.\n","15":"\nGot up early (6 am) & caught the tramway at Longueville for Boulogne, the morning was cold wet & miserable arrived Boulogne about 9 am.\n\nWalked round to Officers Club, had a bath, haircut, shave & breakfast all duly appreciated my oath.\n\nCruised into Officers ordnance & tried to get some odds & ends but couldn't.\n\nCaught a Red Cross Car & dropped into Wimmereux to see Scott, he is looking pretty thin &pale but states that he is feeling on the whole fairly fit, had a good old yarn.\n\nMalcolm (Pioneer Off.) is in No 5 with consumption, Clark is to reform his unit.\n\nSaw Rutter near the wharf Boulogne.\n\nArrived home at 4.30 pm.\n\n\n","16":"\nTook the Comany for a wash to the baths at Henneveux, the morning was simply delightful.\n\nThe soldier (French) at my billet left about noon belongs to the 18 class, his people & particularly the dear old lady felt it very keenly. War is rotten. The tears of the women are bitter & in every part of the known world they have flowed. The old lady had already lost one son & in her sadness she came into our room with an handful of photos to show \"les officers Australian\". This old war isn't without a single human tear, its all very well to see the war thro dimmed spectacles & to write of its glories but I cannot cpnceive a single bit of glory in war, when you are looking down on the dead or using them for a footbridge in a morass.\n\nSpoke to some German prisoners - Cambrai Stunt - they said that they were\n\n\n\nquite content, better than being in the trenches, they were working on the roads & making quite a good job. They look quite willing & stated that they had nothing to complain of, they receive 3d per day & 2d deferred pay.\n\nVan Rosendahl turned up today. Rosy is on leave & looked quite cheerful.\n\nJack my batman is quite eager to please, two days ago he got drunk & disappeared for a whole day - got 3 days C.B. I cannot help but smile.\n\nWent round my horses today. They are shrewd & nibbled my fingers for biscuits. I always have some when I go among them. The donks are as shrewd as the rest, \"Coffin lid\", \"Annie\", \"Isaacs\", \"Spare my days\" were as good as gold.\n","17":"\nGot up rather late & after lunch hopped on a bicycle & rode into Blequin to see \"ma petite amoureuse\". It was very pleasant to ride again midst old scenes & the welcome I received was grand, all the kids in the village turned out, Josephine Cecelia etc all there, dirty as ever.\n\nThe days are sharp & bright.\n\nToday I heard from Mrs Dunn of Adelaide - In previous diary I mention finding thegrave of her son near the fort of Messines Ridge. After one or two letters to the Graves Regist Board, we (Swann) learned that the grave had been duly marked with a cross.\n","18":"\nAgain late in getting up, supposed to have chg of the transport & its a jolly good job, the day is grey & clear.\n\nReceived quite a number of letters & parcels & papers - 2 from Home 2 from May 1 from Freda 1 - Mum 1 - Uncle Joe. 1 parcel from Mrs Stone, 2 Auckland Weeklies, Mirror from Auntie Mary Elle,. paper from Walter & Swan.\n\nMy luck is right in & I spent quite a good time reading them. Haven't any writing paper so cannot reply right away. Mary Hamilton is worried about the City on the hill - Cassell & rates me for using swear words in my diary. What! What!\n\nGot up this morning (Sunday) - its months since we had a service - with that hymn running thro my mind, \"Drop thy still dews of quietness till all our strivings cease, Take from our souls the strain & stress & let our ordered lives confess the beauty of Thy peace\". The quiet life back here is evident of relieving the stress of the past few weeks, one would think that the experience at Ypres would give a chap a permanent kink, but somehow it hasn't.\n\nThe Padre & I have our own little mess, its not too bad either, the chateau where the other chaps are is some distance away. Roy Hall one of old \"B\" Co is cook.\n\nRead last night the 23rd Psalm its a glorious poem & fills the bill completely.\n\nThe French is just as beautiful, \"L'Eternel est mon berger, je n'aurai point de disette\" etc.\n\nEvening is drawing in, there is resting over everything that calm & quiet which preceeds the evening, shortly from the village church will come the quiet chimes of the \"Angelus\". With the Sergeant Burnell I climbed a hill in rear of my billet. Enroute I stopped to stroke old Isaac the donkey. Sun was setting & nature seemed beautifully grand, the clouds over tipped with red, words cannot express the charm. Another month & these quiet scenes will be memories. Heavy artillery fire was heard from the North East tonight.\n\nThe wild violets are in bloom. I noticed a few of them under the hedges yesterday, Spring is here.\n","19":"\nHad a quiet day today, wrote a few letters, including a silly one to Mary Hamilton. Padre Jones left today to join the Divi's Amunition Column, he was hard up & I gave him some money to carry him on to his next pay - funny cut of a man.\n","20":"\nMajor returned from England had a yarn with him this morning. He told me that I had been recommended for a Military Cross - what for I don't know - that is the joke of these things.\n\nHad a ride round on a new horse, he isn't too bad, I think I will keep him.\n\nWent to Bainghem le Comte to see StewWalters, he was at some school, but I saw Capt Thurkell.\n\nFound 3 parcels when I got home, Florries, Marys, & the Roberts.\n\nHad a good time reading\n\none of R.L.S. books, \"Travels with a donkey in the Cevennes\". It's jolly interesting, although its subject is ordinary and dull.\n\nWrote one or two letters of desultory character.\n\nIt rained constantly all day, the chalk roads were very slippery and muddy.\n","21":"\nThe horse lines this morning are simply awful. The horsesare chalk mud from head to toe. Fortunately, it has cleared & a dry wind is blowing. I am hoping that this will dry up the standings. Had lunch at the drivers today, tea without milkor sugar & hash dry, not too bad.\n\nHad dinner tonight at the Chateau.\n\nMoloney & Amos, old 'B' company chaps, came in to have a yarn tonight. I rather enjoy their visits.\n\n\n\n21.3.18\nBeautiful day again, got up early & visited my donks, after breakfast & took the crowdout for exercise, enjoyed it.\n\nSaw Hodgson today ('B' Co) he was riding in a limber & lookedquite content.\n\nHeard that the seniorsubs of 7th Divwere up against Calder being senior sub, it is jolly hard luck too when you consider that his seniority datesfrom the time he received his seniorstate in Australia, thatofficers here have been fighting for over 12 months, Calder has not but is reckoned senior to them.\n\nJust got comfortably into bed & dropping off to sleep when a knock came at my room, it had to knock twice before I was awake. One of the drivers entered & stated that orders had been issuedto be ready to move off in 6 hours.\n\nGot in touch with my sergeant\n\n\n\nwho stated that everything could be ready in an hour. It was onlya question of harnessing up.\n\nLater orders came throthat we are to move at 10.30 amtomorrow. Got most of my kit packed. There is only my bag to roll.\n\nI wonder what's doing, got a feeling in my mind that Fritz is making a start.The weather is excellent & suitable for battle.We came out to have6 weeks spell but this looks as if our holiday is spoiled.\n\n22.3.18\nHad a parade with harnesson this morning, heavy mist, Major tore around & reckoned harnesswas awful, he always does.\n\nReceived orders at noon to move out at 3.30 pm, devil of a push but got away at 3.45 pm,road quietly thro to Lumbres. Major was a damned nuisance at start. We\n\n\n\nfollowed rear of 9th Brigade, camped at rest camp Lumbres at 8 pm. Intentionsare to moveas follows:\n\nSt Martin au Laert,\nRenescure,\nWinnezeele.\n\nDuring trip I met Major Grant who said something of Fritz having attacked.\n\nSlept in tent tonight\n\n23.3.18\nReveille 5 a.m. Got up at 6.30 a.m. Had breakfast on porridge only. on everybody & managed to get transport into something like order & harnessed up for 10.15 am.Got to starting point at 11.12 am& moved into column, 10th Brigade under Capt. Gordon for St. Martin au Laert.\n\nWhen chipping drivers about cleanlinessof harness, one saidhe couldn't do anything without oil. \"Allright, we will dig it out for you\". Checked everything of\n\n\n\n\n\nonwaggon - it was at the bottom & gave it to them & they made a pretty good job.\n\nSent cooks on ahead to prepare tea. On arrival the driver QM was rousting a treat. I asked him what was wrong, he was extremely reluctant & being a good man, I did not force him to tell me. Thought I might learn something at cook house, so cruised round, en route heard a row in progress & asked one of the chaps engaged what was wrong, he was angry & blurted out that the cooks were drunk. Went into cook house - a rough room - found nothing ready& the cooks themselves having a good go. Took things quietly, had a yarn to Sergeant Crane, put cooks under arrest & instituted a new crowd - fun of the world.\n\nWalked into St Omer for dinner with a 10th Machine Gun officer, met a chap from La Basseville,","22":" Batt.\n\nFritz put up a Barnyfor 1½ hours in that place, raided front line& collared 3 prisoners. We got one.\n\n\n\n4.30 am was zero hour for Fritz. Came over in heavy mist, was on posts almost before they saw him. Only 2 men and one officer were alive in No6,& they bombed him untill he was close up & then hopped over , Nos. 7 & 8 were also raided.\n\n9 pm Fritz planesare up as I write. I hearhim overhead. Our archiesare putting up a barrage. We were also sending up chain lights - not as good as Fritzies.\n\nMove off tomorrow at 7.45 for Wardrecques - old plans are altered. We are to rejoin ourunitsat this area.\n\nOur billets tonight are excellent, close to creek & fine place for transport.\n\nWe have tremendous planes, 2 engine, with enormous wing speed, saw them today.\n","23":"\nLimbered up& moved past starting point at 8.15 am, taking up our correct position in the column. Morning tip top. Going over first few miles dead slow, had to stop frequently.\n\nAt Arques, a boy found great pleasure in holding my horse, I smiled.\n\nAll our orders have been altered, and when on Arques-Wittes road, we learned ofour billets. I drew of column, turned round& came thro Blendecques to Heuringhem, arriving here at noon. It is a pleasant little village & we have created quite a commotion. The sappers have roamed right round the country& did not arrive till 6 pm. The driver cooks got lost today, did not turn up till 8 pm.\n\nOrders came thro that we are to entrain at St. Omer for Doullens on the 26th.\n\nMet Capt. Galbraith of Geelong yesterday.\n\n\n\nAll sorts of \"phurphies\" are going re the war, but we know actually nothing. The situation is interesting& there is a big movement of troops, evidently we are going into the Somme.\n\n25.3.18\nSalvaged all sorts of things from mens kits, they seemed quite pleased to get rid of them.\n\nRode over tonight from Heuringhem to Sty. Omer. Orders came through for an early start tomorrow.\n\n26.3.18\nReveille 2 am, moved off at 4.15 am. Capt. picked at me for some odds & ends, will hit him up one of these days. Arrived St. Omer about 8 am, long delays. Whilst waiting at station, I walked into Vet. Hospital. The horses are well treated, some of them are frighfully injured. The walk thro Hospital was instructive.\n\nMajor states that Snelgrove\n\nBATTLES ON THE WESTERN FRONT\n\nMons - Aug.23,1914\nMarne - Sept.7, 1914\nAisne I - Sept. 11, 1914\nYpres I - Oct 31, 1914\nYpres II - April 22, 1915\nLoos - Sept.25, 1915\nChampagne - Sept. 25, 1915\nVerdun - Feb 21, 1916 July 1, 1916\nArras - April 9, 1917\nAisne II - April 16, 1917\nMessines - June 7, 1917\nYpres III - July 31-Nov 10, 1917\nCambrai:\nBritish Attack -","24":"\nGerman Ctr.-Attk (1) - Nov 30, 1917\nCambrai-St.Quentin:\nGerman attack -","25":"\n\n\n\n\n\nas detailed to go back to Australia.\n\nPadre turned up last night after a long cruise round the country, he had lost everything except a small hand bag. The Divis Ammunition column had already 2 padres.\n\nSent yesterday all surplus kit to","26":" Brigade Store - don't expect to see it again (it was lost 16.6.18).\n\nAm relieved again from transport but am rapidly getting that way that I don't give a flick of the finger where I go.\n\nWe are going down by train to Doullens, expect to see something of life in the Somme.\n\nFritz is shelling Paris, range of gun, 70 miles, this range is tremendous.\n\nTook train at St, Omer, left about 1 pm & past thro pretty country to Doullens. Train at platform St Poll was a heap of ashes & old iron. From Doullens, a lovely little place, the train continued to Mondecourt.\n\nWhen we detrained at 10.30 pm& went out to Authie after a few moments here, we left at 3.45 am for Marieux where motor lorriesat 9 am carried us on to Franvillers, aquaint little French town on the Somme, not far from Armiens. Arrived 11.30 am, no sleep all night and very frosty.\n","27":"\nâ€‹Florrie's birthday. I would like to be home today instead of wandering round these dusty roads crowded with troops& transport. Things are busy, artillery& mortar busesare everywhere, flying troops along the lanes & kicking up clouds of dust. All the people have a frightful wind up & many have gone away. We have no blankets, all I have I stand up in so I cruised round to find a billet, got one quite easily. The lady was frightened of old Fritz &remarked that there would be a bed for me tonight, if she didn't go away. The Major is tearing round and getting excited. I am much amused over the general treatment meted\n\nout to me. They have evidently decided that I am to be treated as an outsider& certainly they manage it tip top, I am sure they are to be congratulated.\n\nHave not been out of my clothes for two nights& there is every chance that a similar proceeding come tonight.\n\nGot to go back to the blasted donks. Its jolly hard to see the other chaps going up the lines& not to go up myself.\n\nThe inhabitants of this village were evacuated today, it is a sad sight. Some of the most fortunate have horses, donkeys & carts to take away their most valued possessions, the poorer have only wheel barrows & baskets, it brings tears to ones eyes. The women were continually asking if there was any danger, ought they go to save the children etc. One hardly knows what to advise. Their carts etc. block the roads& are a great hindrance to traffic of military character. One old man was pushing his wife in a wheel barrow.\n\n\n\nshells this village.\n\nThe village of Hamel& Somme flat was heavily shelled by Fritz. Some of the cottages were on fire. I watched it with considerable interest for a few minutes, some houses were burning. Got to bed about 11 pm - took off my clothes. Bought today, Madame's fowls, 15 for 5 francs each. We do not know exactly where we are, neither does Fritz. The","28":" Divis got 150 prisoners this morning in a counter attack for a small village.\n","29":"\nGot up about 9 am & cruised round village till dinner time. The French interpreter came in& stated that a cart cover had been stolen by our men. Oh! There arehundreds of troops around& it is impossible to say who took it, things disappear& candidly I cannot blame anyone for stealing if it is to make himself more comfortable. A soldier has a pretty rough time. Our men are very confident& look forward eagerly to coming into close touch with Fritz, there spirit is wonderful.\n\nCol. Henderson of the 39th is as keen as mustard.\n\nOliver Williams gives me the oil that I am to be allotted to the staff, his brother is C.R.E.& of course we are not permitted to forget the point, often we are reminded of \"Tock\".\n\nMajor Donaldson of the","30":" acting C.R.E. gave me a map of Amiens yesterday. Maps are scarce& I will hang onto this like grim death.\n\nWrote letters home etc.& played chess all afternoon with Capt, Payne.\n\nThe 38th met a patrol of 30 germans this morning, brought back 3 alive, shot the rest.\n","31":"\nHad orders to go to Treux. Cycled to Heilly, picked up Cpl. Gray there& walked up right bank of the Ancre to Mericourt and gave resistance coil to May at Ribemont. Walked then along railway line to Treux, all rail points were destroyed. Heavy bombardment was heard from the Somme Valley, evidently an attack was in progress, it slacked off about noon.\n\nTreux is a simple French village.\n\nFritz was shelling round it. The Sherwood Foresters hold a line immediately in front of it. On their right are the Cheshires. We were looking out for general engineer gear & securing general information. Wandered into many of the cottages, they are all deserted, save one, in which lived an old woman. We were just letting looseher rabbitswhen she called out. We were surprised & I spoke to her. \"Pourquoi ne partez vous pas, Madame?\" \"Je n'ai pas de marcher\". I then told her that we were letting her rabbits go because they would die of hunger if the house had been deserted. Overhead a heavy bombardment was proceeding& I felt awfully sorry for her& I told her so. Pour old soul, she wished to give me a rabbit. \"Un lupine pour vous\", she said, pointing to me. I told her that I might call coming back, she wanted to make me a cup of tea. I didn't remember her invitation when leaving the village.\n\nDuring the morning, I let\n\nloose dozens of rabbits, they were almost too weak to move. The dogs were mad with fright& rushed to& fro or crouched in a dark corner. The poor cattle looked at us with wondering eyes and \"mooed\" occasionally. A pea henseemed quite content moving quietly about..\n\nThe villagers had left everything. One does not know the horrors of war untill you haved moved amongst it. These little homes nestling so quietly in these beautiful smiling valleys have seen much of happiness& content & today they bring tears to the eyes. The fields over which so much lowly labour has been spent are now the fields of war, sprinkled with the blood of men.\n\nOn the right of the river at Treux is a lovely chateau, we wallked into it, the furniture, paintings, piano, bedroom& library were delightful. It must have been the home of a gentleman, everything was as he left it, except that the things were strewn over the floor, as though the occupier\n\nhad thrown them about in his haste to get his valuables & to rush away.I picked up a beautiful walking stick & carried it with me. The gates of the chateau are opposite almost the old mill.\n\nThe old mill was of course deserted & in it was a fair quantity of fodder oats etc.\n\nThe church had a shell hole right thro the front.A stonkeredTanklies on the road between Treux & Ville sous Corbie& the Sherwood Foresters hold a line towards river in front of \"Cafe de la Jeunesse\".\n\nCame back thro Buiresur l'Ancre& had a yarn with some of the English officers, they were awfully glad to see the Australians come in. They were living on the fat of the land, all the houses contain food, champagne wine etc & this brings me to another point, round every house particularly estaminetsare dozens of champagne bottles, in every billet are dozens of bottles, the men in their retreat must have rifled these places & got gloriously drunk, the villagers say so too. At every move we seem to be up\n\nagainst incompetence not of higher command but with the English troops they are of exceptionally poor quality, & an English Tank Officer said that he saw a whole batallion run at the sight of a few fritzies, it is disgraceful the famous 66thourold forceat Ypres went for the horizon \"hell for leather\".\n\nA small crowd of Bosch came over at Ville sous Corbieabout noon, I didnt see them \nthey\n being amidst the houses at Treuxbut I heard the Lewis guns & saw the men in front line suddenly stir & look busy.\n\nFritz put a few high velocityshells into Franvillers about 7pm, one alighted near our drivers billets, one acrossthe roadfrom ourmess. The padre got the wind up & dodged into the nearest cellar. I thought a man who was supposed to know God would be the last in the wide world to think of his dear little bit of skin.\n\nOften I wonder why this war should have been permitted, why should there exist all this desolation, itis frightful.\n\nTomorrow is Easter Sunday, a day of world wide rejoicing because Christ fullfilled his final debt of love for mankind. Overthese warswept areas stand numerous crucifixes reminding usof Godslovefor us. Today right on the top of the hill,I noticed one &the problemof war became almost inexplicable - in this countryof mans hate. The crucifix calls to my mind that glorious hymn which often we sang at home,\n\n\"O Cross that liftest up my head\nI dare not ask to fly from thee.\nI lay in dust lifes glory dead\n& from the ground their blossoms red.\nLife that shall endless be.\"\n\nWar may be an elemental force in mens nature but surely it would not exist if men knew the truer meaning of love & life & God.\n","32":"\nThis morning with 4 limbers & 2 G.S. Waggons I reported at CRE at 8 am for authority to obtain barbed wire & pickets from Vecquemont, our route lay thro\n\n\n\nthe villages of Lahoussoye, Pont Noyelles & Daours, the morning was delightful& it was most enjoyable, the country either freshly tilled or with young crops looked tip top. From a point just before getting into Daours\n\nwe saw on the left the towers of the Cathedral of\n \nCorbie\n. \nVecquemont is situated at the confluence of the rivers Hallue and Ancre, a quaint litte water wheel attracted myattention at Vecquemont evacuated also the concrete fort bridge.\n\nRest of company moved into Heilly. Payne & myself are to remain in Franvillersto look after the transport.\n\nMarch into a new billet & have quite a nice little room - Divis Headquarters.\n\nDuring the past few days we have seen new aspects of the war, before it has been its effect on soldiers - now we see its effect on civilians.\n\nReceived a parcel from home tobacco & News Years cake.\n\nRead Rodney Stone by Conan Doyle - bored to death.\n\n\n\n"}}