{"Document Name":{"0":"Diary_0224","1":"Diary_0224","2":"Diary_0224","3":"Diary_0224","4":"Diary_0224","5":"Diary_0224","6":"Diary_0224","7":"Diary_0224","8":"Diary_0224","9":"Diary_0224","10":"Diary_0224","11":"Diary_0224","12":"Diary_0224","13":"Diary_0224","14":"Diary_0224","15":"Diary_0224","16":"Diary_0224","17":"Diary_0224","18":"Diary_0224","19":"Diary_0224","20":"Diary_0224","21":"Diary_0224","22":"Diary_0224","23":"Diary_0224","24":"Diary_0224","25":"Diary_0224","26":"Diary_0224","27":"Diary_0224","28":"Diary_0224","29":"Diary_0224","30":"Diary_0224"},"Date":{"0":"unknown","1":984.0,"2":985.0,"3":986.0,"4":993.0,"5":994.0,"6":995.0,"7":996.0,"8":997.0,"9":998.0,"10":1001.0,"11":1007.0,"12":1011.0,"13":1013.0,"14":1014.0,"15":1015.0,"16":1029.0,"17":1036.0,"18":1071.0,"19":1085.0,"20":1086.0,"21":1117.0,"22":1125.0,"23":1129.0,"24":1132.0,"25":1189.0,"26":1190.0,"27":1194.0,"28":1198.0,"29":1199.0,"30":1200.0},"Entry":{"0":"\n\n","1":"\n\nReceived a wire from Lily to effect that Dad is at Eastbourne & she has wired him. No more news of leave yet. Luna Park Hosp. crowd were told today on parade that they are disbanded now & to be split up. That is good – all the more for drafts. Everybody went to Tidworth RAMC sports today – no parades – I stayed in in case dad should come. Writing letters & cleaning up generally.\n","2":" ","3":"\n","4":"\n\nDad arrived on Friday last to my great pleasure, & after we had had a good yarn, & he had made himself friendly with the W.O. Maxwell (temp while Pollard was away) he managed to get me leave till the Monday night\n\nAll my hopes since enlisting were thus satisfied, & in just the way I had hoped.\n\nLily has grown a nice young lady now, & it was a delight to see her again after my long absence. She was tremendously excited but not more than I.\n\nOn Sat. I went to see Frances she was the only one at home, except Mrs A but was expecting Violet at any moment, in response to my card Arranged for following night.\n\nDad & I went to & found Bowles manager. Thence to Lily at Prudential & lunch at Slater’s.\n\nWe saw Mr Manhattan at the Prince of Wales’ Theatre & in the evening brought a very pleasant day to a close, Am seeing “The Battle of the Somme” on the Pictures. On Sunday I saw Mr & Mrs Upjohn & Hilda & the youngsters\n\nIn the evening Lily Hammond Frances Vi & Ernest, came & we spent a pleasant evening\n\nHad to see Dad back to Caterham unfortunately at about 9, but hope to see him again soon.\n\nOn Monday early I saw Mr Hammond Senr. & spent the rest of the day in the city with Lily, Ernest, Frances & Violet.\n\nCaught the 10.43 pm back, Lily & Mrs Elerage, seeing me off. It was a very short time to have at home, & I was very miserable when I got back, but it was a very pleasant memory.\n\nI could not have wished for a pleasanter reunion of all my old associates -- except School, -- they were on holiday.\n\nLondon is not much changed & everybody was much as before, except the girls who of course are growing up.\n\nIt was strange to have the streets dark after about 8 & to see so many searchlights about.\n\nThere was a raid somewhere about Woolwich the night I reached London, or the night before --- I am not certain which.\n","5":"\n\nNo letters from Lily since arrived back, nor from Hammonds.\n\nBilly is going to town tomorrow & I hope to go for next week-end.\n\nWent to see “Within the Law” on Thursday last,\nbut of\n yesterday afternoon went onto Tidworth per motor (traction engine).\n\nBought 9 rolls of films for the V.P.K. camera which I have bought for 15\/-.\n\nI have also bought today, some printing frames & dishes, but I shall not take these away with me. They can keep them for me at home. 3\/6 was not dear for them\n\nChurch parade in Institute this morning. Received ‘Weekly Times’ from Dad.\n\nWas sent up for medical board yesterday, on account of report re eyes, by Dr \n\nPassed in A Class!\n","6":"\n\nBilly went to London with a programme of how to make the most of his four days, including two visits home.\n\nOn the following morning W.O. Pollard late of the","7":" F.A., & now in charge of A.M.C. details, asked on parade for a dispenser & clerk & also for 6 orderlies.\n\nI fulfilled the first requirements & six others were selected including Jimmy Hyde, both of whom were in the dispensary at Marseilles.\n\nGiven charge of party by seniority under Capt Rhodes also travelling with us to No 2 Command Depot, Weymouth.\n\nWent by 12-10 pm train via Andover & Southampton West, at both of which places we changed.\n\nArrived at Weymouth at 4 pm & after 2½ miles march, reached the camp which is at Monte Video out near the sea west of Portland Bill, at tea time. \n\nFirst impressions of camp good – given good tea & temporary shakedown in hut.\n\nWednesday Following morning were allocated work in Hut 83 – a ward – after medical inspection etc. etc.\n\nI, of course, explained for what I was sent down, & Sgt. said I should in due course be sent into dispensary.\n\nSubsequently found out that Cpl dispenser was to be drafted with permanently unfits for Australia on Sunday & I was to take his place\n\n(Positively refuse to conjecture on whether I shall get promotion\n\nout of this, for I know the army now, & with that knowledge I decidedly think I shall \nnot\n).\n\nMeanwhile, from Wednesday to Saturday I was doing the dirty work of the ward on excellent food – the best for many a weary month.\n\nAfter already doing 12 hours on Saturday I was told to take charge of Hut 40, the reception hut, for another 12 on night duty.\n\nTook advantage of the lack of work to take gaslight prints of the","8":" &","9":" rolls of films I have taken with\n\nthe camera\n\nThe results were excellent & exceeded my expectations, assuring me of the quality of the lens.\n\nThe first roll, which I developed myself was good, but on account of the rainy weather, not nearly a good advertisement for the camera.\n","10":" \n\nHad the day off, but after bathing spent most of it sleeping.\n\nI have now commenced my second (& I believe last)\n\nnight on duty in Hut 40. Last night we only had four new arrivals & tonight about the same will come I was told.\n\nWas told by the Corporal in change of the dispensary, (\nnot\n the Corp. dispenser) that I start there next week.\n\nIt should be a change for the better.\n\nAm now going to write a letter to dear old Rita.\n\nThe night is far advanced. A drunken soldier wearing both South African ribbons\n\nhas been accommodated temporarily here tonight, for some reason or other – I think he has no room in his own quarters.\n\nPaddy an oldish Irishman in this hut brought him in. Both of them are hardened old wanderers & for some time they conducted a semi drunken conversation about Florida, San Francisco & other places interspersed with platitudes on the war.\n\nAfter any amount of false alarms common in such cases Paddy succeeded in getting away & leaving the drunk in his bed.\n\nAt intervals since then the \n\npoor chap has been mumbling & chattering in his sleep, broken fragments of nonsense & behind them are the hard years & harder experiences he has had.\n\nTwo years hard fighting in this war & as much in South Africa, many a rough brawl in a low down saloon I’ll be bound &, drunk\n\nThat will be the end of him I fear.\n\nA patch of grey on either side of his head & a hardened & lined face\n\n are the outside indicators. A typical derilect, with no \n\ncontrolling power to keep him out of the damnable currents into which all world wanders must drift.\n\nAnd then men scoff at religion. In a community of what use are such men? as he? They do the bullocking work but then they cause brawls & counteract that by the necessity for extra police etc.\n\nThey are good soldiers, none better & as such at least are a distinct acquisition to a community.\n\nBut does it all end there? Their enemy is distinctly themselves.\n","11":"\n\nOn Tuesday I started work at the dispensary\n\nI have to keep a few stock mixtures supplied, make up special prescriptions for the hospital, & other things such as ointments.\n\nThere is not a great deal of dispensing to do, & I am under the Corpl. L\/C --- Cap. Binger There are three others who attend to the dressings; among them a Lance Corpl.\n\nMy £10 arrived from Australia yesterday, showing that Rita is alright, but I have had no letters yet. She might be sick for all I \n\nknow, it is worrying. I almost wish she would come over here & marry me. It would \nbe better I think. Anyhow letters should come soon. \n\nThis week is the anniversary week of my trip from Alexandria to the Peninsula.\n\nShall I be here or in France, or back in Australia this time next year?\n\nEither of the last two I imagine.\n\nHave heard from Dad & Lily Vi & Ernest & Frances, also from Rushbrooke, who simply sent the card with “absolved” written on it.\n\nA short way of forgiving me for not calling on him.\n","12":"\n\nReceived today a batch of letters including 2 from dear Rita.\n\nOne was written in April, the","13":" & the other on","14":"\n\nIn the former Rita refers to having seen Mrs Fothergill that week.\n\nIn another letter from Greta Mattlas of a later date I learnt that poor old Fothergill was killed in action in Egypt on","15":" just the time Rita wrote to me.\n\nI also received a long letter that I had written to Rita, back again, because I had\n\nin a fit of mental aberration, addressed it to Grafton London. There were two letters from Greta Mattlas , one from Vi Nichol & one from H. Clarence who is in Bulford Mt’y hospital with Rheumatics.\n\nBilly Molloy is an orderly at that hospital now, so they might meet.\n\nHave got leave for London this week end till Monday night. I hope to get away on Friday night & make three clear days of it.\n\nGetting along alright in the dispensary.\n\nThe fellows are very decent to\n\nwork with \n\nof that, more anon.\n","16":"\n\nHave had another week-end in London since I wrote last in this book.\n\nSaw Rushy at the School on the Monday morning and chatted with several masters, including Nixon, McNair, Hope & Kingdom.\n\nPaid 7\/-, the subscription for 2 years Elizabethan membership.\n\nWas not exceedingly pleased with reception which was hardly enthusiastic. Possibly because I have not risen above a Pte, or for other reasons.\n\nSince my return have worked\n\nfairly hard for we have been very busy.\n\nHad three evenings in town with two ladies, one of them the girl who gets my washing every week & the other, her sister.\n\nThe former, known to the boys as Rosey, has a young man at the front. He was reported missing unofficially,\nabut\n about a couple of months ago, but this week the report came through officially.\n\nShe is a good girl & as she was disposed to go out to cheer herself up, I saw no harm in taking her with her sister.\n\nHave also done some photography with fair success.\n\nMy latest ideas for pushing forward are two.\n\nOne is to apply for a commission in the infantry & the other, to take a course with the University Correspondence College, with a view to passing the London Matric. Have applied for particulars of the latter & am finding out about the former.\n\nThe weather is colder, duller, windier & rainier than a month ago. It is seldom we have a \nsunshine\n sunny day, but I like it just the same, for it is England.\n","17":"\n\nChief happenings of the week are that I have applied for commission, but failed hopelessly on the eyesight affair.\n\nMajor McWhae, who did not seem disposed for me to leave here, told me he thought it hopeless for me to send the application in. Only 3 Australians per month are sent to the School.\n\nHe offered to do his best to get me promoted to full corporal after Corp. Binger’s is confirmed. That will probably be some time ahead, but he is a man of his word is McWhae.\n\nAdverbs\n\ndiu diutius diutissime = long longer etc\n\nstatum = at once\n\n = until\n\npaulum = a little\n\nI have had two more letters from Rita of Feb & June & she is as staunch &hopeful as ever.\n\nIn reply I sent last night I have re-iterated my desire for her to come over & marry me.\n\nNo reply in connection with Corresp Schools.\n\nWork is increasing & I always go to bed tired out, these days.\n\nHave made about 6\/- from photos this week.\n\nconjunctions\n\netsi = although\n\ntamen = however\n\n diu diutius diutissme\n \n\npotius = rather\n","18":" X. 16\n\nApplications invited today for orderly on transport back to Australia.\n\nWld. not apply for there are others with bigger claims & therefore more chance of going\n\nWork slackening off a bit now since big batch left, a couple of day ago, for Australia.\n\nNotes\n\nPassage 2. Hamilcar (C.Nepos)\n\n sed its,ut In such a way that. \n\n Rule for Gerund & Gerundive:\n","19":" Intransitive verb use gerund Nom & dative of agent (or ab. If confusing)\n","20":" Transitive verb nomin. Case in agreement with noun.\n\nessent refectae \n\npares\n vicissent dedissent Orata obligua giving subjunct\n\nPassage 4\n\nEx Sententia mea = in accordance with my wishes\n\nInfesto Romanii (A.A.) = he, hostile to the Romans\n\nPassage 5\n\n-avoid two adjectives together. \n\nHic = here\n\nAssidius patus \noblesn\n oblestation =note order\n\npostquam = after that\n\n4:XI:16\n\nBusy as usual.\n\nHave been made L\/Corporal this week as the establishment is out.\n\nPromised more later, but still count myself lucky if I can get away with permanent L\/Corp. rank to France. There it will be something to work on.\n\nReceived more letters from Base including 2 from ","21":"\n dear old Rita, one from \nP.J.\n Rev Nyland, a nice Christmas card from little Andy Steen at school\n\n25:XI:16\n\nPoor old Jack died on the","22":" of this month.\n\nIn October he collapsed at Boulogne through ear trouble & after four operations at the Queen Alexandra Hosp. Malo-les-Bains, he developed pneumonia & bronchitis,\n\nThe cause of death was septic pneumonia.\n\nWent to London for three days","23":" to","24":" & had a few hours with Dad & Lily.\n\nEverything here is as it was before.\n\n9;XII:16\n\nIn the new hut am well installed with a dispensary to myself\n\nPlenty of work & no reply yet concerning establishment & my promotion\n\nNurses arrived today\n\nThe camp is slowly but surely being turned into a hospital.\n\nHope the nurses will turn out good, & not of the interfering kind.\n","25":"\n\nRather a long gap since I last wrote in here, & plenty to write too.\n\nThe sisters arrived & turned out to be splendid.\n\nWork increased & the dispensary hut was cleaned out to be renovated in common with some dozen others; the others to form a new hospital here\n\nA partitioned off dispensary was to form part of the improvement\n\nWhen work had just started Sgt Clay returned to the","26":" & on leaving promised to see about what chances I would have of getting job of dispenser with them\n\nSoon after he left I decided not to hang on any longer unless I could see substantial reasons for doing so. Told Major Betts that I wished to have my Corp rank confirmed & he sent off a strong recommendation to Col McWhae, who is now A.D.M.S.\n\nThen a letter arrived from Clay saying he could get me the job & so, having heard that the chances of confirmation were poor I decided to get over to France.\n\nNo sooner had I decided that I that I heard from the Major that a qualified chemist must be here, & consequently I should\n\nbe sent to another depot to work with a Staff Sergeant. My plans turned out to be wise.\n\nImmediately I got six days sick leave & went home on Monday night last week, returning on Saturday.\n\nLily & I had a good time; I saw dad at Caterham on the Tuesday & he came up on Saturday.\n\nOn returning I sent some music & other things including post cards, to Rita.\n\nI shall have to suspend the I.C.S. course just when I have almost finished the second subject: - Arithmetic, but that\n\ncannot be helped.\n\nThe £20 I cabled for to pay off the cost at once had not arrived when I was in London, but is at the Bank of N.S.W. as I find from a delayed letter.\n\nTo day is Wednesday & I expect to leave for Parkhouse on Friday.\n","27":"\n\nTo day is Saturday & I have not left yet, & probably shall not until next week.\n\nClarence called here & missed me this week\n\nBad news from Australia\n\nJust when I am on the of going over a letter from Rita arrives telling me she is willing to come over in the summer.\n\nI wonder if I shall be back by then, or still at it over there, or under the ground\n\n“On ne peut pas jamais dire” !\n\nI have been wondering lately what is really prompting me to go over.\n\nA conscientious desire to be in the thick of it & doing my duty like the poor beggars over there now is undoubtedly a great factor. Mixed up with\n\nthat there is a desire for promotion of a substantial kind, & also------ well I had better not write the third reason.\n\nI suppose the other two weigh equally with me & together form the principal stimulus\n","28":"\n\nGot marching orders yesterday morning to go by myself to Parkhouse by authority of the A.D.M.S.\n\nCaught 12.5 from Weymouth & was seen off by Rosa.\n\nMissed changing at Ludgershall & went a few miles over to a place called – curiously enough –GRAFTON! Delayed two\n\nhours in waiting for train to return by, but beguiled the time in taking tea & listening to a little music at a cottage.\n\nArrived at Tidworth at 8 pm & then walked three miles with pack & kit bag (through flooded roads at parts) to Parkhouse.\n\nNot worried by the cold & general bad conditions a bit, for I am feeling rather fit.\n\nSaw Major Johnson on arrival & he told me that no hope of going for week or two.\n\nParaded at 9 this morning & was made to revert to Private as rank only acting.\n\nIt seems that my chance of\n\ngetting back to the","29":" & incidentally the dispensary job, is not great.\n\nNever mind, keep a good heart & all will be well. I’ve left for the front again & am quite prepared for any misfortune that may come my way. My good luck in living so long counteracts any hard luck I have had in not getting promotion\n\nA la victoire.\n","30":"\n\nUnexpectedly put on draft yesterday.\n\nHanded in all spare kit today.\n\nOn guard from 5 p.m. yesterday till 5 p.m. today.\n\nProbably leave here tomorrow.\n\n"}}