{"Document Name":{"0":"Diary_0195","1":"Diary_0195","2":"Diary_0195","3":"Diary_0195","4":"Diary_0195","5":"Diary_0195","6":"Diary_0195","7":"Diary_0195","8":"Diary_0195","9":"Diary_0195","10":"Diary_0195","11":"Diary_0195","12":"Diary_0195","13":"Diary_0195","14":"Diary_0195","15":"Diary_0195","16":"Diary_0195","17":"Diary_0195","18":"Diary_0195","19":"Diary_0195","20":"Diary_0195","21":"Diary_0195","22":"Diary_0195","23":"Diary_0195","24":"Diary_0195","25":"Diary_0195","26":"Diary_0195","27":"Diary_0195","28":"Diary_0195"},"Date":{"0":"unknown","1":716.0,"2":717.0,"3":718.0,"4":719.0,"5":720.0,"6":721.0,"7":722.0,"8":739.0,"9":740.0,"10":741.0,"11":742.0,"12":743.0,"13":744.0,"14":745.0,"15":746.0,"16":760.0,"17":761.0,"18":762.0,"19":763.0,"20":764.0,"21":766.0,"22":769.0,"23":770.0,"24":771.0,"25":772.0,"26":774.0,"27":775.0,"28":777.0},"Entry":{"0":"\n\nDec 4\/15 \n\nThat I believe is\n Just 12 months ago today I arrived at Alexandria as a \nDrive\n member of the ","1":" Australian Imperial Expeditionary Force, we then became \"The Army of Occupation in Egypt\", then a part of the \"Mediteranean Expeditionary Force\" now today \nmy\n the men of the 1st Aust Divisional Train at present in Egypt have ceased to belong to the MEF and are now from today part of the Western \nDesert Expedition\n Frontier Force\n\nRumours have been very rife during the last few days – but it seems by sifting out \nall one\n what one hears that some Native Tribes near the Tripoli Border have risen – aided \n\nevidently by Tripoli Turks & that \ndivision\n small force is to go up to argue the point with them & we are \nwe are rather a mixed force\n to supply the Transport for that force\n\nAll our kit bags went into store 3 days ago & that same night our No 4 Coy. left by Rail to the \nnearest\n Railway Station nearest the scene of trouble. There is only a single line narrow guage railway so troops cannot be moved quickly or in quantity \n\nToday No. 3 Coy struck tents & took them in to Ordnance Stores & are bivouacing tonight – ready to move off tomorrow – so our turn will evidently come in a few days.\n","2":" at present we are ‘standing by’ with full marching order kit – that is our equipment & uniform & clothes\n\nwe \"stand up in\" \nplus\n a waterproof sheet & 2 blankets together with any small change of clothes we can roll up in our greatcoat & strap across the front of our saddles\n\nAlthough the days are quite warm – the nights now are quite cold & I’m going to take with me 2 extra pairs of socks, spare flannel shirt & undervest, scarf, sleeping helmet & gauntlet woollen gloves sounds more like a Polar Expedition than for an African Desert! But when a soldier is packing a kit for active service he should always \nremember\n think \"you can always chuck it away!\n","3":"\n\nNothing much to report No. 2 Coy is moving off at midnight & I expect we will follow tomorrow \n\nReceived a surprise in the form of \n\na letter from Mrs Parsons of Sydney only a mere acquaintance through being a cousin of Leslie Thompson her husband has been wounded at Anzac – she enclose a little pocket edition of Wordsworth. When you receive little reminders \nlittle\n like this from ladies almost forgotten makes one realize a little bit what the waiting & anxiety is to the women folk & how ours is the easier task\n\nDec 7. \n\nHad a telephone message from Katie & managed to get off into Alexandria for an hour to see her She has just arrived on the Oxfordshire with a load of sick & wounded from Gallipoli – Half our Company move out tonight & my half company move tomorrow – all tents are \n\n(Katie Hewitt – British Nurse, a sister of C. Hargreaves brother-in-law)\n\nstruck & returned to Ordnance so we shall be once more bivouacing in the open. It will come a bit hard again – after tents & the homemade bunks we had all made during our \n4\n 5 months back at the base – I have had a ‘sweet’ billet during that time as the companies ‘postman’ in the F.P.O, not too much work & plenty of liberty. \n\nBut now The Company is on the move at last I want to get back amongst them to see what’s doing. So spoke to my C.O. & \nam\n when we reach the new Base, shall be back with the horses on convoy work \n& my pla\n & a ‘B’ Class man from hospital will \ntake my\n take over the F.P.O work\n\nwhich\n as once we are on the real move no one who is quite fit wants a ‘sweet’ job. Not through any bravado but just to be in the swim \n& a job in the F.P.O would\n\nDec 8\/15 \n\n8.30 am writing this by aid of an inch of candle in an old mess hut.\n\nWe are to move off in a couple of hours to the Railway. There will be no sleep tonight as by the time we get to the station \nit will\n & load up horses & waggons on the train it will be 4 a.m. \n\nWe have a great camp fire roaring outside built up of old boxes & the accumulation of months of camp. The men are all sat round\n\nsmoking & it \ngives\n is just one of those occassional touches of glamour of which there is to little in modern war. There promises to be a ‘dry’ journey in front of us as each waggon has been issued with an 8 gallon water bag. One knows absolutely nothing definite of what is ahead yet one doesn’t worry – one has become accustomed to being a cog in a big machine – which is set in motion by someone & sets it rolling & working in its proper direction.\n\nAs soon as \nof\n news of this move got about, \nmen came\n its wonderful the cures that were made in some of our sick in the hospitals & convalescent Homes! Two\n\nmore have just come in this last minute. One of them Cpl ‘Dick’ Dawson – with no kit at all but his simple uniform, not even great coat – but guess’ll he ‘pick’ one up as he goes on.\n\nDec 12\/15 \n\nHavn’t had a single minute to call my own since last entry, except those required for sleep – am now writing this on the box seat of a waggon by candlelight at 11.45 pm while on horsepicket \n\nam on duty from 10 p.m. until 1.30 and was up at 4.30 this morning & have to be up tomorrow at the same hour. Will never forget the last \nfew\n 3 days – since leaving the rail head – a little name on the map only containing a mosque, a well &\n\na very small garrison of camel corps – we have been pushing across the desert on our trek to Matrugh, a journey of 85 miles from waterhole to waterhole – \n\nI think\n I have been thirsty before but think for the first time of my life I have known what it was \"to thirst\" for what water there \nhas\n is \nbeen\n has been \nmost unpal\n only fit after boiling & even then as tea most unpalatable & in ordinary sense undrinkable – \nIt was in\n In Kiplings words it was \"green & stunk\". But it is not nearly so bad for \nthe men\n us as for the horses – we know it is for a common cause & \nmust\n cannot be helped – but it \nis\n nearly makes one weep to see the \n\nflagging horses & to \nkn\n have to drive them on knowing that it will be hours before they can be rested & the only thing to do is to get them there. \n\nWe watered our horses yesterday at a brackish well \nclose to\n practically on the sea beach So salt the horses although parched would hardly drink it – That was yesterday midday \n\ncovered 12 miles yesterday afternoon & evening & made laager for the night at 7 p.m. no water for horses, \n up at 4.30 this morning & left camp at 6 p.m. & forced the poor\n so dry that they would hardly \nindecipherable\n eat at all. Up at 4.30 a.m. this morning & left camp at \n\n6 p.m. (?) & have been slogging along all day without any drink for the horses – in the 12 hours today we have covered about 22 miles – many horses absolutely ‘pulled right out\" & an occasional gallon of water had to be given them out of our emergency ration to keep them going. \n\nBut Thank God after 36 hours without watering & covering 32 miles on a bad desert track very heavy going – we have reached a good waterhole & I though they would never stop dinking all had a good feed of \ncorn\n barley & bran & little chaff & they are very quiet now\n\nWhile we halted at midday 2 armoured cars of the RNAS Cars \n\npassed the convoy & told us there was a fight last night near Matrugh & we had 16 killed & 30 wounded So far we have seen no sign of the enemy we travel with a small escort of yeomanry scouts out all round\n\nTold by my\n We are camped with waggons drawn up in a square & all horse inside & have to sleep with rifle & bandoliers alongside us I was told by our O.C. that there is a force of about 500 Bedouin somewhere between us & Matrugh whether they will attempt to attack us or not is for the future\n\nThe sunsets across the desert are a mass of warm colour & as we are tracking west – it is a lovely yet rather melancholy sight to look ahead & see the long column of waggons \nwaggon teams\n & dust winding into the distance with the last rays of the sun upon them One has to feel both tired & hungry to appreciate \nthe\n & feel the glamour of the sight. In fact so hungry as to look forward with pleasant \nart\n anticipation to a tin of bully, hard biscuit & a pannikin of ‘Gunga Din’ Tea \n\nWe have our funny moments however, \nwhen\n we were having\n\na midday halt for half an hour \nwhen the\n drawn up in 2 lines on either side of the track when the 2 RNAS cars passed us & we saw them coming down the track a long way off. Some of the moving spirits started making a ‘Race meeting’ of it & we all mounted on top of the waggons while the Regimental comedians Roared out the Racing ‘patter’. \nDon’t know what the English officers thought of us.\n","4":" 14\/15 \n\nHorses had a good drink at the well before leaving yesterday morning and we came straight through 17 miles & reached \ncamped before sunset\n our camping ground before sunset \n\nSoon after starting one of our\n\nyeomanry scouts brought in a \nsniper or scout\n one of the enemies scouts or snipers, a Bedouin Arab armed with rifle & soft nosed bullets, he was sent back & left with the small Indian garrison at the waterhole we had just left. \n\nThis Arab was a very different type to the Egyptian Arab we had been used to in Alexandria & Cairo. The latter are \na morally inferior\n a very inferior type in their bearing & one feels they are physically cowards – but this man was the ‘true’ Bedouin Arab as one reads of in books & songs – physically strong & athletic figure he looked very picturesque in his big white cloak with hood over his head.\n\nWe were all warned to look to our rifles & keep our bandoliers handy \n& we were\n\nbut saw nothing all day\n\nWe are in touch with civilization again as at this camp there is a telephone \nconnected\n line to Matrugh & I \nhave\n am at present on duty at it (time 8.30 a.m) just learnt that our No 4 Coy has had a small scrap a few miles the other side of Matrugh with one man killed & one officer wounded.\n\nThe roads were very bad for the last five mile yesterday – & 2 of our horses were played out, hadn’t a pull left in them, so had to hitch on a spare pair of mules from the Middlesex Regt Transport who is along with us They gave us a pull into camp through the thick dust.\n\nFoster gave the ‘Tommy’ driving\n\nthe mules a packet of cigarettes & it was to him like a sovereign \nwe old\n for they have not a smoke left. \n\nBreaking\n We are harnessing up as I write & \nhope\n expect to reach Matrugh – which is to be our base of operation – tonight.\n\nOne of the small Sikh garrison at the waterhole is here at the telephone with me – he speaks a little English & it comes as rather a shock to realize this \"simple native\" as one considers one, can signal by semaphore & Morse operate a telegraph keyboard & then produces a motor drivers certificate! \nHave\n\nDec\n They are going to evacuate this road we have come in by, as \nit\n the water supply is so poor\n\nand the distance too long to be worth the while engaging so many cars & troop patrolling it.\n\nCapt Munro of No 2 Coy \nhas ju\n arrived here at day break \nwith a\n from Matrugh with a flying column of 10 waggons, with 8 horses in \napiece\n each, rested 4 hours to water & feed & has set off to \nthe water\n our last nights waterhole 17 miles back to withdraw the small Sikh garrison, he has taken half (30) of our Yeomanry escort back with him.\n\nWe are leaving a few waggons of the","5":" Middesex Regt Transport here – they are to bring in the Sikhs at this \n\npost & come in with Capt Munro.\n\nHe may have a bit of a fight for it, as I learn that the road is closed behind us \nthe other\n","6":" 15\/15 \nMatrugh\n \n\nreached here 4 p.m yesterday & am sure the horses are not sorry after the rough time they have had this last few days\n\nPeople\n Everyone says \nthere\n we \nhas\n are lucky to have got through without a scrap & wild rumours were about the camp that we had been cut off. \n\nEvery few miles along the track we have seen signs of habitation – mud \nhuts\n & stone huts – with mud walled yards\n\nevidently \nsmall\n natives with small flocks of sheep & goats which graze off the \"salt bush\" which covers the desert But all the huts are deserted & the flocks driven away\n\nThe people have either joined the Bedouins or fled for protection.\n\nCap\n Have just been speaking to one of Capt Munro’s men who was with his flying column which got safely back here at 5 oclock today after having covered the 60 miles including all stoppings in ","7":" days\n 36 hours. He tells me that as soon as they had evacuated the waterhole & got the Sikh garrison\n\ninto the waggons & had left the place, the Bedouins streamed down the other side some hundred of them. Not strong enough to attack our fellows – but evidently watching the whole time & also it seems desperately in need of water. Pity we have not sufficient troops to hold the place safely\n\nMatrugh is a small \nnative port\n town on the edge of a natural harbour, evidently a place of call for small coasting vessels to take off the native produce wool, skins, \ndat\n etc. just a \nfew\n score of so houses of various sizes \nbut\n all of \nnow\n which have been hastily evacuated & I believe the\n\n the furniture, clothing etc strewn all over the place but a guard is all round now & there is no chance of picking up any ‘souvenirs’.\n\nWe are camped on the flat alongside the town & about a mile away there is a ring of \nhit\n low hills – along the top of which about every ¼ mile \nare a\n apart are a series of block houses with a small outpost in each. I should judge there are about 4000 of us here all told & if rumour is correct about 10,000 Bedouins some 5 miles to the west of the Camp.\n","8":" 17\/15 \n\nYesterday a regiment of our Light Horse went out reconnoitring & got in touch\n\nwith the enemy 4 miles out \nour casual\n \nWe are practically on the land\n \nExcept for the sea we are at present beseiged on\n From the land we are practically besieged but of course all supplies come in by\nship\n sea \n\nYesterday I was out of tobacco & went on board a Great Yarmouth Trawler & \nborrow\n got some from the ‘Skipper’. Had a long yarn with him – a typical north sea Herring fisher, \nwho\n He has been minesweeping in the North Sea & looks upon his job out here as a picnic if it didn’t keep him so long from the Missis & Kids\n\nWas down in his bit of a cabin with him & his \nlead\n ‘mate’\n\nthey were a strange pair arguing & talking about the war – swearing blue murder at the Germans in one breath & quoting the bible in the next breath. \"The wicked shall prosper\" quoth the skipper\n\nEvery day our cavalry patrols drive into camp a few head of cows, sheep, goats etc poor half starved specimens they are – These should all go to the Supply Depot. But most of the companies have an odd sheep or goat etc tethered outside their tents which will find their way into the pot.\n\nToday a party of friendly natives were brought in Except for the soldiers \n\nescorting them, they looked as if an old Sunday School bible picture had come to life The old sheikh – white bearded brown skinned clad in long white robe with his staff leading a donkey – followed by several women in black closely veiled \nwith children\n & several younger men driving their small flock of donkeys, goats sheep & \nthe\n the children carrying hens – It was just sunset when they came in otherwise I would have \ngot\n liked to have got a photo\n\nThe Infantry both English & Indian have been busy all day making trenches, digging building up sandbag redoubts\n\n& barb wire entanglements One of our guns let the enemy have a couple of dozen rounds this morning of course everyone turned out to watch the first few rounds & the third shot hit the ground \nevidently\n about 200 yards in front of the gun mouth & went ricocheting off into the distance.\n\nEvidently a defective shell but it must have given some Indians camped close by a surprise.\n\nof course I don’t know how \nmatters stan\n any of the ins & outs of the matter, \nnot even\n & have only a hazy idea of who we are fighting but\n\nit seems we have again been true to our British Tradition & underestimated the enemy Whether they will have the numbers & confidence to attack \nup\n us remains to be seen, but I think we would easily beat them off – But it looks as if it will be some time before we can take the offensive against them\n","9":" 20\/15 \n\nHave been attached once more to the Field PO. – Thought when the Camp P.O. in Alexandria dissolved when we moved out here, that I had done with it & was rather looking forward again to being amongst the horses & hard work – But they have started a F.P.O for the Australian Troops here & I \n\nhave been sent into it as the Representative for the \"Divisional Train\" I’d have rather been back amongst the Company & I paraded to the O.C. but he \ntold\n wouldn’t allow it – \"I had the experience & someone had to go it fell to me\". – I only hope we will move off \nwith\n along with the convoy & not be \nstuff\n stuck here with the Divisional Headquarters Staff.\n\nI am sat writing this \nnear\n at the entrance of my tent – It is full moonlight & a perfect scene only wish I had the imagination & vocabulary of Scott to describe it. \nIn front\n A couple of hundred yard in front of me are the Bell tents of my Company with a \n\nglimmer of candle in each & the dark masses of the \nhorse line tethered\n horse\ns\n lines – away to the right is the village of Matruh – deserted by all its inhabitants, flat-roofed – the whitewashed walls & minaret of the mosque gleaming like marble While if I step \nto the\n outside I can see the Bay with several trawlers & an armed auxiliary cruiser lying at anchor – quiet now but tomorrow will be again \nlike an\n swarming with activity\n\nFatigue parties of Scots Infantry English Yeomanry & Australians\n\nunloading forage, biscuits barbed wire, firewood & the thousand & one things required by an army – one can’t realize that we in hostile territory it is all so peaceful & the whining of \nsome\n a stray dog out in the hills only seems to emphazise the quiet\nness\n","10":" 21\/15 \n\nWent to ‘bed’ last night impressed with the peacefulness of the scene & the first thing my Sergeant said this morning when he awoke was \"did you hear the bullets last night\"?\n\nThey had been \"zipping\" past the tent & awoke him up but I \nsleep\n slept through it & heard nothing – a sniper had \nevidently\n got down \npast\n\nalong the shore past our pickets & had ‘pumped lead’ into the camp in the moonlight evidently with the hope of hitting something or stampeding the horses – but havn’t heard of any casualties though \nit woke\n most of the men near by lost there beauty sleep\n","11":" 25\/15 \n\nThere has been quite a small battle round here today – woke up from sleep during the night by the sound of firing by some of our outposts in the block houses on the hill – also by the ‘ping’ of several responding bullets over\nhe\n our heads \nHeard\n Time was 10 to 1. so we wished each other a Merry Xmas Sgt. Moore got into his breeches anticipating a general \"fall=in\". The rest of us sat up in our blankets\n\nbut finding the night air cold decided before taking any strong measures like that to wait for orders – so got down in our blankets again & went to sleep. At daybreak our ALH & a Regt of Yeomanry moved out with some \nof our\n AASC wagons they went west along the coast road. About 8 o’clock I heard big gun fire for the first time since Gallipoli in June – It was our cruiser along the coast giving the Bedouin some \"hurry up\"\n\nA few details came filtering through with the arrivals of some wounded who were brought in by motor ambulance the first arriving about 2 pm. Chiefly Sikh Infantry then \ntwo\n\nor 3\n several of our L.H & Yeomanry were brought in \nfollowed by some Y\n\nFrom accounts our troops were steadily sweeping them down the road – the guns from the 2 cruiser following them as they retreated. About 4 p.m. 6 Indian Prisoners who had escaped were brought in & after being questioned by the General joined their friend & a great \"corroboree\" was held – An Interpreter told us that they are part of the few survivors of a transport bound for France that was wrecked or torpedoed off the Tripoli Coast – The survivors Indian soldiers & a few white officers got to the coast - & were taken prisoners by the Bedouins\n\nThe whitemen had been sent into the interior but the Indians were kept digging trenches etc & this party of 6 were in a trench which was shelled by a warship The Bedouin fled so the Indians took their chance & ran towards our men crying \"Indian – Ingleese\". They’d had a rough time living in daily fear of having their \ncoats\n throats cut any minute & fed on a handful of dried peas daily & clad in sacking.\n\nThings have been very busy this last few days runing barbed wire right round the camp – & digging rifle trenches behind them – The few tents outside \nhav\n the barbed wire have been lowered tonight & the waggons brought\n\ninside & formed up in a \nsolid\n long line – tailboard of one up to the rear of the next one Just a last precautionary measure I suppose whether they will be needed or not remain to be seen.\n\nAll the spare men of our Coy have been sent up to form an inlying picket behind the front trenches\n","12":" 27\/15 \n\nOne of the prisoners brought in on Xmas Day was one of the deserters – a corporal – of the the party of 12 men & officers \nof the Camel\n \nwho went over to the enemy\n (all Egyptian) of the Camel Corps who went over to the enemy with their camels He was tried yesterday & shot today – The only possible sentence for his crime. – \n\nYesterday night\n\nabout 10 o’clock heard a great yelling \nof\n – natives by the sound & from the direction it was coming – thought possibly it was a party of the enemy surrendering & making the noise to prevent our outposts firing didn’t get out of my blankets to see – \nBut was told\n It was a most thrilling noise – but was told this morning the Indians had buried their killed & they were wailing for their dead\n\nJust heard to day a rumour that Anzac has been evacuated expected it – but it will come as a great shock to Australia & will sorely try the temper of their patriotism – There is hardly a home that has not \n\nhad some of its dear ones killed or wounded there. \nIt\n\nMore outpost firing last night – I think they do it just to \nsee\n disturb our sleep –\n","13":" 5\/15 \n\nDuring the last four days \nwe had had\n it has been blowing half a gale & raining hard, \nlife this time\n as one hardly expects from Egypt – a five days trek in force \nround\n to round up some more of the enemy had been ordered for","14":" but has been postponed on account of the rain & conditions of the tracks\n\nThe camp is a quagmire of red mud, The tent lines – trenched & ditched to run off the water – look like a miniature irrigation farm After paddling about all day ankle deep in mud it makes one thank\n\nGod one isn’t in Flanders where I suppose this is the normal condition of affairs only more so & also one looks forward to a tot of rum which is on issue tonight\n\nI wish they would collect all the platform ‘wowsers’ who have been trying to stop the issue of rum, bring them out here & give them a few days of mud with wet \ncold\n socks all \nday\n the time & see if they would refuse a hot rum before turning in to their blankets at night. I think they’d \nwould be in a more\n look at things in a broader minded way once they are away from their fire side & pint of hot cocoa.\n","15":" 10\/16 \n\nThe \"BILLY’S\" have arrived, for months we\n\nhave heard of the preparations being made in Australia to pack a Billy Can with Xmas Cheer for each Australian Soldier at the front & the cargo has been sent out with Mr. Henley MLA to personally distribute them \n\nIt has been the finest gift ever made to an army – apart from their mere value, it is the spirit in which they have been contributed The Billy Cans have been packed \nwith\n by the womenfolk with little comforts which they thought fit, – not for \nany\n a particular friend but for any Australian soldier –\n\nMy list\n \nThe conten\n My Billy was from Jean McDonald Dennis St Colac Vic – with the message\n\n\"May sunshine gild the closing year\n\nAnd Brighten each succeeding day\n","16":" happiness like Music Cheer\n\nAnd gladden all your future way\"\n\nIt contained:– Handerchief Writing Pad, Envelopes, pencil soap, pipe, 2 oz Tabacco, pair socks, pack of card, toothbrush, lanoline, bootlaces, tin sardines \n\nAls\n We also received a pair of socks knitted by schoolgirls of Australia – in the toe of mine was a packet of cigs, – a little cake of soap & some boracis \nacid\n powder in envelope.\n\nA flannel shirt, Comforter Souvenir Tin of chocolate from the Australian war association of London.\n\nLeather waistcoat.\n\nThe chocolate tin is going\n\nhome at first opportunity as a souvenir\n","17":" 12\/16 \n\nThe Light Horse Regt have left this morning – they are returning to the railhead (el Dabaa) & thence by rail to Cairo to rejoin their various regiments from which they were drawn to make up this Comp. Regt. – As far as is known in the ranks their various regiments will be moving \nshortly\n down soon to the Canal where there seems to be big trouble coming. \nAll the Divis\n A squadron of them are left behind & are to follow in a week\n\nAll the Divisional Train waggons have gone with them carrying forage – supplies & water & I expect will stop at el Dabaa & then return with the Complete\n\n \nUnit\n Regt which will possibly be coming to take their place\n\nIt hurt to see my Company \nbe lef\n move off & be left behind in Camp, their is nothing finer than the joy of being on the trek however hard it is. And I had the ‘pip’ all morning.\n\nI put in a written application to the O.C. asking to be allowed to rejoin my company for ordinary duty but so far have had no reply.\n\nJack Stanton the L.H. Postal orderly also was ‘fed up’ as we have had nothing to do all day, so this afternoon we went up to the L.H Lines & borrowed a couple of horses & have been for a good ride & gallop round the Camp and on the beach\n\nThey were good horses \nand we had to hang on\n pulling on the bit to be off all the time & I came back from the ride as \npleasan\n hungry as a hunter. with the ‘pip’ gone for the time\n\nEverything seems very quiet now The shaking up they got on Xmas Day seems to have take all the sting out of the enemy & I don’t think there will be much more serious trouble, though I expect a force will be kept here for some time.\n\nHave been passing\n My best pals are all away on the trek, so instead of yarning in their tent – Ive been smoking on my own & read Kiplings \"Five nations\" sent me by Edie & Mop (Sisters) for Xmas.\n\n\"Ah God one sniff of England\n\nTo greet my flesh & blood\n\nTo see the hansoms slurring\n\nOnce more through London Mud\"\n","18":" – (I think) \n\nHurrah, have got out of that Postal orderly job and am back again for duty with my Company. \nIt was a bit difficult getting away &\n It means harder work & none of the \"sweets of office\" in the way of soft living but it is more satisfactory to be back with the Company with which I started with. \n\nThis diary seems to be dying a natural death, but nothing seems to have happened worth recording. We got some new arrivals last night in the shape of 180 men & 5 officers from the South African\n\nContingent that went home to England. I suppose most of them will find their way out here, as France will be too cold for them\n\nThere is a rumour to the effect that we are to return to join up with the","19":" Division to which we belong & which is now down near the Canal\n\nThe enemy have started gathering again in force near the wells from which they were dispersed on Xmas Day – so I expect another column will be sent out in a day or two to deal with them.\n","20":" \n\nOrders came out this morning of a column leaving camp this afternoon to attack the enemy & all our waggons available had to turn out. \nJust\n As I’m just\n\nback on the lines & have not been allotted a team, I’m a spare Driver at present with only one horse that is rather out of condition & is having a rest, but would do to go in harness if necessary.\n\nI hadn’t been told to go, but I hadn’t been told not to, so I quietly put my blankets in a waggon, saddled up my horse & kept out of the way until just about time to move off, hoping I’d be overlooked only to find that every other spare man had done the same! \n\nThey dragged us all out & asked us \"What the How the\" etc \n\nThe Captain said \"You carry on as though you were at\n\na something picnic\". At anyrate we were all left behind as extra mouths to feed & not required.\n\nSaw the column move out & were specially interested in the South Africans, a battalion of whom arrived a couple of days ago from England where they had been finishing there training. They are a fine lot physically quite distinct facially to the \nAust\n Anzac Soldier, seem to be much fuller & flatter faced, evidently a big strain of Dutch blood in them. \nThis was\n A number of them had been in S.W. Africa but as a battalion this was their first time of going into action & they looked very eager for it.\n\nThey gave us their war cry as they passed – a sort of Zulu Chant \nwhich would have a very\n which sounded very blood curdling.\n","21":" \n\nYesterday Sunday was on outpost duty all day in a Sangar (Block house) just a round wall of stone surmounted with sandbags & loopholes surrounded by barb wire. There were 3 of us & a \nCap\n Corporal also two Signallers of the Royal Scots (who hailed from Manchester bye the bye) these two were in charge of the telegraph line & keyboard which connected us up with the Headquarters – we were on the left flank of the ring of hills which surround the camp\n\nFar below & behind us was a grand panorama of the Camp, the Village & the Harbour, while in front was a stony sandy plain quite flat for miles & in the distance some more low hills we never saw a living thing stirring all day. A message came along that the column got in touch with the enemy late in the afternoon. \n\nWe were relieved at 6.30 pm by the night picket – 20 men & a Sergeant – All today we have been \"standing by\" not a very exciting share in a battle Several motor ambulance loads of wounded have come in, and some more waggons left this afternoon with supplies & I expected to be \n\none of the escort, was \"told off\" & was getting ready when the orders were changed & No 4 Coy had to supply the escort instead\n","22":" 24\/16 (Tuesday) \n\nThe Column came back this afternoon, from all accounts the honours seem to be even between us & the enemy Our total casualties of killed & wounded being just under 300. The bulk of these are with the Sikhs & the S Africans \n\nI saw the latter march in. – There were hardly half the battalion in the body the rest came straggling in leg weary \nfootsore\n & foot & blistered, or were riding in on the A.S.C. Waggons dead beat\n\nThey fought well but the heavy marching had been too much for them coming straight into it soft from a sea trip. \nThe\n\nOur chaps have had a heavy time of it – the Roads were very soft & the waggons getting bogged continually – so it was a case of pulling each other out by turns consequently there were G.S. Waggons all over the countryside, in addition to bogged Motor Cars & other vehicles. If the roads had been better so as the armoured cars could have joined in, the engagement would have been more decisive\n\nAs it is \nthere\n we have inflicted heavy casualties on the enemy & driven them away from the wells, but as they can reoccupy them at any \nrate\n time & also inflicted serious casualties on us it seems to be a stalemate\n\nThe weather \nis\n has been miserable today\n\na bitterly cold wind blowing the sand up all the time which one can feel \nlike\n across one’s face like the cut of a whip lash.\n","23":" \n\nThe aeroplane had an accident at noon today on its return from its daily patrol. Was watching it while watering my horse & just as it was 30 or 40 feet of the ground it fell ‘head first’, \njust\n on the beach within a few feet of the water – Luckily both aviator & observer were only severely shaken & were able to walk to the ambulance which took them to hospital to be attended to\n","24":" \n\nHave received orders to start\n\ntomorrow to Alexandria & from there we understand to the Canal – only Right half of No 1 Coy & No 4 Coy. \n\nThe left half of No 1 Coy which is at Dabaa is coming to take our place.\n\nBusy all day packing stores & forage for our 5 days trek back\n","25":" \n\nWe moved out of Matruh about 9 am. In addition to the AASC mentioned above we have an escort of one Company of Middesex Infantry about 50 L.H. & the same number of Yeomanry \n\nThe road was in good condition & we\n We are also taking along a mob of \ncaptured\n camels. The road was \n\n in condition & we made good time arriving at Jerrawalla Well – our halting place by 2 o’clock, watered & fed our horses & then had dinner (tea, biscuits & bully & jam) groomed our horses this afternoon, while we were doing this two armoured car \"patrols came up & they brought us some mail which was very welcome. I got 5 letters & a book \"Many Inventions\" from Amy (Hargreaves) \n\nAm writing this by candlelight alongside the wagon at 6.30 pm. & am now going to turn in as I expect it will be 4.30 reveille\n","26":" 6 p.m. – \n\nWe travelled 18 miles yesterday – good going the whole way except through a place where the road dipped sharply and after the heavy rains was very soft & most of the\n\nwaggons got ‘bogged’ & had to have extra horses hitched on to drag them through.\n\nThe Camels we are bringing along with us belong to the Sheikh of Bershola a loyal Senoussi – we started off with 90 odd but yesterday morning we found only 11 left – the rest had strayed away during the night. \nWe had\n A bit of a loss for him as we couldn’t waste time hunting for them. He is coming through to el Dabba with us – with two young wives & a baby in arms – all riding on one of the waggons – he is quite a young man\n\nLast night we camp at el Gerboosh (that is\n\nhow it is pronounced) it was the scene of a very bloody battle between the Italians & the Senoussi in the last Italy-Turkey War. \n\nWe left at 9 oclock this\n \n\nThe transport who are going up to take our place at Matruh were also camped there. We left at 9 this morning and are camping this evening after an easy 1,6 miles at a small well by the road side\n","27":" \n\nHave done about 20 miles today & are camped near a small waterhole The roads are good after the recent rains – and also the water is better & more plentiful so it\n\nis a much easier trip than when we went to Matruh, where it was after sundown pretty well every evening before we ‘parked’ the waggons\n\nWe have just ‘dined’ bully beef, jam, cheese biscuits tea & also \nsome\n a billy can full of biscuit porridge which we have made over a little fire. Just Biscuits broken up small & boiled up in water till soft then eaten hot with plenty of sugar. It eats very good at the end of a day or early morning but sounds rather primitive no doubt.\n\nWe passed several native huts & I had a look inside for a \"souvenirs\" but they had been stripped\n\nbare and the roofs (the only thing about them imflamable) had been burnt off.\n\nThey didn’t expect us to find water at our present bivouac and had arranged for a supply to come out by camel & a column of about 100 camels has just come in – carrying water for our horses. It is camped just alongside us.\n\nEl Dabaa our destination is about 20 miles on so we should reach it easily tomorrow afternoon\n","28":" \n\nEl Dabaa arrived here yesterday \nthe\n at 1.30 p.m. Soon after leaving the camp we picked up \nthe\n our infantry escort & carried them along on the\n\nwaggons & thus were able to press on & get here to the Railhead in good time \n\nwe are bivouaced alongside the railway waiting orders to entrain\n\n"}}