{"Document Name":{"0":"Diary_0431","1":"Diary_0431","2":"Diary_0431","3":"Diary_0431","4":"Diary_0431","5":"Diary_0431","6":"Diary_0431","7":"Diary_0431","8":"Diary_0431","9":"Diary_0431","10":"Diary_0431","11":"Diary_0431","12":"Diary_0431","13":"Diary_0431","14":"Diary_0431","15":"Diary_0431","16":"Diary_0431","17":"Diary_0431","18":"Diary_0431","19":"Diary_0431","20":"Diary_0431","21":"Diary_0431","22":"Diary_0431","23":"Diary_0431","24":"Diary_0431","25":"Diary_0431","26":"Diary_0431","27":"Diary_0431","28":"Diary_0431","29":"Diary_0431","30":"Diary_0431","31":"Diary_0431","32":"Diary_0431","33":"Diary_0431","34":"Diary_0431","35":"Diary_0431","36":"Diary_0431","37":"Diary_0431","38":"Diary_0431","39":"Diary_0431","40":"Diary_0431","41":"Diary_0431","42":"Diary_0431","43":"Diary_0431","44":"Diary_0431","45":"Diary_0431","46":"Diary_0431","47":"Diary_0431","48":"Diary_0431","49":"Diary_0431","50":"Diary_0431","51":"Diary_0431","52":"Diary_0431","53":"Diary_0431","54":"Diary_0431","55":"Diary_0431","56":"Diary_0431","57":"Diary_0431","58":"Diary_0431","59":"Diary_0431","60":"Diary_0431","61":"Diary_0431","62":"Diary_0431","63":"Diary_0431","64":"Diary_0431","65":"Diary_0431","66":"Diary_0431","67":"Diary_0431","68":"Diary_0431","69":"Diary_0431","70":"Diary_0431","71":"Diary_0431","72":"Diary_0431","73":"Diary_0431","74":"Diary_0431","75":"Diary_0431","76":"Diary_0431","77":"Diary_0431","78":"Diary_0431","79":"Diary_0431","80":"Diary_0431","81":"Diary_0431","82":"Diary_0431","83":"Diary_0431","84":"Diary_0431","85":"Diary_0431","86":"Diary_0431","87":"Diary_0431","88":"Diary_0431","89":"Diary_0431","90":"Diary_0431","91":"Diary_0431","92":"Diary_0431","93":"Diary_0431","94":"Diary_0431","95":"Diary_0431","96":"Diary_0431","97":"Diary_0431","98":"Diary_0431","99":"Diary_0431","100":"Diary_0431","101":"Diary_0431","102":"Diary_0431","103":"Diary_0431","104":"Diary_0431","105":"Diary_0431","106":"Diary_0431","107":"Diary_0431","108":"Diary_0431","109":"Diary_0431","110":"Diary_0431","111":"Diary_0431","112":"Diary_0431","113":"Diary_0431","114":"Diary_0431","115":"Diary_0431","116":"Diary_0431","117":"Diary_0431","118":"Diary_0431","119":"Diary_0431","120":"Diary_0431","121":"Diary_0431","122":"Diary_0431","123":"Diary_0431","124":"Diary_0431","125":"Diary_0431","126":"Diary_0431","127":"Diary_0431","128":"Diary_0431","129":"Diary_0431","130":"Diary_0431","131":"Diary_0431","132":"Diary_0431","133":"Diary_0431","134":"Diary_0431","135":"Diary_0431","136":"Diary_0431","137":"Diary_0431","138":"Diary_0431","139":"Diary_0431","140":"Diary_0431","141":"Diary_0431","142":"Diary_0431","143":"Diary_0431","144":"Diary_0431","145":"Diary_0431"},"Date":{"0":"unknown","1":824.0,"2":825.0,"3":826.0,"4":827.0,"5":828.0,"6":829.0,"7":830.0,"8":831.0,"9":832.0,"10":833.0,"11":834.0,"12":835.0,"13":836.0,"14":837.0,"15":838.0,"16":839.0,"17":840.0,"18":841.0,"19":842.0,"20":843.0,"21":844.0,"22":845.0,"23":846.0,"24":847.0,"25":848.0,"26":849.0,"27":850.0,"28":851.0,"29":852.0,"30":853.0,"31":854.0,"32":855.0,"33":856.0,"34":857.0,"35":858.0,"36":859.0,"37":860.0,"38":861.0,"39":862.0,"40":863.0,"41":864.0,"42":865.0,"43":866.0,"44":867.0,"45":868.0,"46":869.0,"47":870.0,"48":871.0,"49":872.0,"50":873.0,"51":874.0,"52":875.0,"53":876.0,"54":877.0,"55":878.0,"56":879.0,"57":880.0,"58":881.0,"59":882.0,"60":883.0,"61":884.0,"62":885.0,"63":886.0,"64":887.0,"65":888.0,"66":889.0,"67":890.0,"68":891.0,"69":892.0,"70":893.0,"71":894.0,"72":895.0,"73":896.0,"74":897.0,"75":898.0,"76":899.0,"77":900.0,"78":901.0,"79":902.0,"80":903.0,"81":904.0,"82":905.0,"83":906.0,"84":907.0,"85":908.0,"86":909.0,"87":910.0,"88":911.0,"89":912.0,"90":913.0,"91":914.0,"92":915.0,"93":916.0,"94":917.0,"95":918.0,"96":919.0,"97":920.0,"98":921.0,"99":922.0,"100":923.0,"101":924.0,"102":925.0,"103":926.0,"104":927.0,"105":928.0,"106":929.0,"107":930.0,"108":931.0,"109":932.0,"110":933.0,"111":934.0,"112":935.0,"113":936.0,"114":937.0,"115":945.0,"116":946.0,"117":947.0,"118":948.0,"119":949.0,"120":950.0,"121":951.0,"122":952.0,"123":953.0,"124":954.0,"125":955.0,"126":956.0,"127":957.0,"128":958.0,"129":959.0,"130":960.0,"131":961.0,"132":962.0,"133":963.0,"134":964.0,"135":965.0,"136":966.0,"137":967.0,"138":968.0,"139":969.0,"140":970.0,"141":971.0,"142":972.0,"143":973.0,"144":974.0,"145":975.0},"Entry":{"0":"\n\n \n","1":"\n\nSun 19th\n\nIt was cloudy this morning went to Tukh-El-Khail with Ahearn to see where they were camped. had a good day & thoroughly enjoyed the ride Harvesting is in full swing with some of the crops & most of the cockies were busy carting in the sheaves on camels; \n\nA pontoon bridge has been erected across the canal opposite the camp at Tukh-El-Khail & it was there that the Queenslander fell into the canal with all his gear on a few weeks ago & drowned; we had to do some skillfull manouvering through some irrigated plots to get to the camp as we did not know the track; All the natives in all the villages we passed through & those working in the fields are as friendly as it is possible to be & all want to give us \"Backsheesh\" for ourselves & horses\n\n ","2":"\n\nMon 20th\n\nThis morning we had no trouble to get on with Tukh-El-Khail & lucky we did so, as the ‘phone was out of order this morning & we received a couple of messages which I brought into camp at dinner time; 15 reinforcements for this Sqd arrived this morning. Colin Cameron & Peters amongst them \n\nI left my tunic at Tukh-El-Khail yesterday & made arrangements with Leask to have it sent on for me my diary, also photos & pen are in it; The natives are getting a nuisance & while I was away today one helped himself to the water bottle, another started to smoke my pipe. so Reidy gave them moving orders with the bayonet behind them to put life into them\n\n ","3":"\n\nTue 21st\n\nWent to the sand hill again today & had some good practice with the helio. but Major Smith sent a man out to tell us to come in at 2 oclock, when we arrived back in camp I found there was a message saying I had to give signalling instruction to the troops (6 men at a atime) & there was no necessity to keep the helio station going all day while the ‘phone was working. so it appears our Helio Station is being cut out; \n\nWe had no natives troubling us today apparently they took Reidy’s lesson to heart yesterday Mick O’Donnell was up before the Col today & received 4 days No 2 Field punishment for being in the village with the others a few nights ago, none of the others were punished but as Mick is an old offender they gave it to him; Received tunic today\n\n ","4":"\n\nWed 22nd\n\nMajor Smith had to go to Tukh-El-Khail today to attend a court martial & brought my pen back with him Had a very quiet day in camp;\n\nHorse troughs were erected today by the river to water the horses at; Capt. Stucky came with the reinforcements last night & is to take charge of H Troop. \n\nThe canteen caught fire about 8 oclock tonight & the roof which was made of corn stalks was burned. the rest of the building is made of mud bricks, several of the lads raider the canteen a little later & got away with about 30 bottles of beer; The natives went to the Major but the beer could not be found; Received a message from Gen. Head Quarters at Minia tonight to try & get in touch with the Signal Stn at Beni-Suef at 10 oclock tomorrow morning; Beni Suef is about 40 miles N.E. of us, & we are to use the helio.\n\n ","5":"\n\nThurs 23rd\n\nThis morning Reid & I went out to the sand hill, but failed to get in touch with Beni Suef as a bend in the Nile with its high bank on the eastern side comes between us. We came back to camp at dinner time & found Major Smith had all the men fallen in early this morning & told them he wanted the men to fall out who had anything to do with the canteen raid last night & he would crime them later otherwise, the whole Sqd would have to do 2 hours extra parade both morning & evening, & as there was no response to the invitation to fall out; the Sqd put in this morning doing musketry drill; & had a route march this afternoon, I put in the afternoon teaching the 6 new men signalling both, Bult & Hargreaves are trying their hand at it.\n\n ","6":"\n\nFri 24th\n\nPut in a quiet day under the palm trees teaching the new hands how to wag a flag; Sergeant Warden went to Tukh-El-Khail this morning & I asked him to bring out form for me from the Orderly. I filled it in this evening & took it to Major Smith & asked him to recommend me for a commission as a Signalling Officer & he promised he would forward the form with his recommendation tomorrow; \n\nThe Troop had musketry again this morning & a route march again this afternoon; The weather is getting very warm; An order came today to say applications for transfers to the Artillery Column would be considered; Received a parcel of socks, balaclava & mittens from home today.\n\n ","7":"\n\nSat 25\n\nThe troops had a route march this morning & a pretty stiff one too; this afternoon was a holiday & after tea the lads decided to ease their feelings a little by ducking the men who raided the canteen in the Canal & it made a good sport two cooks were first thrown in & a couple of batmen took shelter in the Officer’s Mess; The officers took it as a joke & made themselves scarce & the batmen soon followed the cooks & a couple of the troopers into the Canal.\n\nWe have a good deal of trouble getting messages through here on account of the Egyptians being constantly on the phone An aeroplane has been flying out on to the desert daily from here, but we have had no reports of the enemy\n\n ","8":"\n\nSun 26th\n\nRoute marches were cut out today on account of the Sabbath, & an message was delivered to Major Smith at 2 oclock this afternoon by a messenger from Tukh-El-Khail with the result that A & B troop had orders to be ready at 4 oclock to move out on patrol, & it set us wondering whether the aeroplanes had seen anything or not; Men were also sent out from Ezbet-Soo-Doun & Tukh-El-Khail\n\nSmithers arrived back from the Sig School & brought back a 1st Class Signallers Certificate with him, & as old Joe Tomlinson also got his, I am inclined to think that the exam is not a very hard one; Tomlinson got drunk at Cairo & missed the train coming home\n\n ","9":"\n\nMon 27th\n\nA & B troop arrived back in camp at 8 oclock this morning \n\nWhen crossing the canal on the punt Eric Dowling was knocked overboard & received a ducking but was close to the bank & managed to catch the rope & no damage done \n\nA spy reported that 3 parties of 12 natives in each (armed) were to go out last night & Wednesday night (next) to join the Senussi’s & that was the reason the troops were sent out last night in the hopes of catching them but had no success last night, \n\nabout 11.30 this morning Sergt. Nelson rung me up & said he had a message which I would have to take on the Heliograph so Les & I saddled up & went onto the sand hill & received a message saying that two troops are to be sent out nightly till further orders, & that no reference\n\n \n27.3.16\n\nis to be made of it on the telephone We arrived back in camp about 1.30 PM feeling very fit for dinner; The interpreter told me today that all the Mahommedans in Egypt are hoping for a Turkish victory as the Sultan of Turkey’s grandfather was a great Mahommedan prophet & is worshipped by the Egyptian Mahommedans, & all the Coptic Christians of whom there are a great many in Upper Egypt want English rule, & the small village where Reid & I have had a few rather amusing afternoons drinking tea & smoking with them, are Mahommedans, & Mahommed Bey Massy whom we met there is a relative of a Senussi General & a very cunning man\n\nMahommed Bey Massy in my opinion has the looks of a fine leader, & is probably heart & soul with the Senussis himself;\n\nC & D Troop went out this evening\n\n ","10":"\n\nTues 28th\n\nThis morning went to Major Smith to see if I could get the 6 new Sigs off patrols, guards, & piquets, but with no success, so I rang up Sgt Nielson & complained that the men were getting too much work to do; Murray decided to drop out of the Sigs & Ford has taken his place & has done a little of it before; \n\nLast night one of the lads killed a snake about 18 inches long this is the second during the last week as one dropped out of Ibbots blankets a few nights ago when he was making his bed down; \n\nSgt Todhunter & Cpl Bigg returned from hospital today; I have handed the class on New Sigs over to Les & am putting in the whole time brushing Reid up for the School;\n\n ","11":"\n\nWed 29th\n\nNelson turned up here this morning & we asked (Kamel) the owner of the village if we could use the top of one of the houses in the village to signal from & he said yes as long as he was always present when we wanted to go through the houses; We had no trouble to get in touch with Turkh-El-Kheil, but failed to get into communication with Ezbet-Soo-Doon & cannot understand why as I fancy we can see the village of Ezbet-Soo-Doon quite plainly through the glasses; \n\nWe were paid this morning & a good quantity of beer drank by some of the lads; Saddler Jones got fighting drunk & we decided to have some sport with him, so I challenged to box him & then went out to him after a very amusing round; Beer is now 7 PT a bottle & the Canteen owner made more money today than he has ever made before in his life\n\n ","12":"\n\nThurs 30th\n\nI fed Darkie (Les’s horse) at 6 oclock this morning & an hour later started for Ezbet-Soo-Down & had a hot long ride through cultivated plots following foot-pads; The barley is just ripening & some of the crops are being cut; All the beans crops have been cut & a good many farmers have it carted in & are now busy breaking it up, or thrashing it; \n\nThis done with an implement very much like the discs of a disc harrow two cows pull the disc round & round the stack & fresh sheaves are thrown under the discs at intervals; after this is finished the chaff is forked into the air to separate the \ngrain\n beans from the chaff, the cattle are fed on the chaff; The same performance is gone through with barley & it is the straw (or tibbin) that we have been feeding on ever since we have in Egypt. \n\nAt 10.30 this morning I pulled up at a well\n\n \nfrom which 3 natives were drawing water for irrigation purposes; filled my water bottle & had a feed of \"mungirie\" & onions with them, I received a bit of a shock in the distance to Ezbet-Soo-Doon & it was 12 oclock when I reached there, & found & pontoon bridge had been erected across the Canal by English engineers to allow waggons to cross; also for armored motor cars which are now stationed about 20 miles on the desert, & A Sqd have a Station on the edge of the desert to keep in touch with them per helio.\n\nWinterton & I tried to get in communication with Hassan-Pasha from the roof of a church here but failed & think there must be a village between us; We had a swim after tea then caught two centipedes & an odd scorpion or two in the blankets & then turned turned in after hearing Les had been bitten by a centipede\n\n ","13":"\n\nFri 31st\n\nLeft Ezbet-Soo-Doon at 8.30 this morning & had a good trip back as the day was not too hot; Had coffee at one of the native villages & was no sooner on the barge to cross the Canal when Darkie took fright & jumped into the Canal & took me with him but had only to swim a couple of yards to get on the barge again; \n\nA lad was having a sleep in the barley this afternoon & woke up to find a 3 foot snake around his arm; two other snakes were killed as they came out of the old wall, & another was killed in one of tents last night so they are pretty plentiful, also got a centipede in our bed tonight The extra patrols have been taken off from tonight; Fleas are very bad bad here but are not troubled with lice\n\n ","14":"\n\nSat 1st\n\nReid went away to the School of instruction at Zietouen this afternoon \n\nForgot to take my watch out of my pocket yesterday when changing my clothes after the ducking in the Canal & am afraid it is no good now as the water has gone through it;\n\nThe natives are on the phones again & Abdul Moolah is back again to attend to any business for the Omdah of Hassan Pasha & I am glad he is back again as he does all my washing (or his wife does) & does it better than any I have seen he also does any odd jobs & expects no Baksheesh. he is the only native I have met who does not ask for any \n\nyesterday I gave him 5 PT the only payment he has had from me yet;\n\nThe troops do 2 hours musketry every morning\n\n ","15":"\n\nSun 2nd\n\nNothing of any consequence happened today; The weather rather warm; Maj. Smith went to A Sqd & McIntosh & McMahon were sent to hospital at Minia with a bad eye & injured knee respectively; Beer was 7 PT per bottle here & the Sergeants got some out from Minia & was selling it for 6PT & brought the price of the Canteen down\n","16":"\n\nMon 3rd\n\n5 oclock reveille this morning & is to be from now on; The troops do one hours musketry every morning before breakfast, & a route march this morning after breakfast; It seems unnecessary to give them so much work when they have been so long in the Army & the days are too hot for comfort when doing no work.\n\nBaxter took sick a couple of days ago & has pulled out of the Sigs, I give them work daily\n\n ","17":"\n\nTue 4th\n\nThis afternoon Les & I tried again to get into communication with Ezbet-Soo-Doon but with no success & I am now satisfied that it is impossible to get them from here; We seldom get papers out here & everything is very quiet; Mick O’Donnell applied for a transfer into Remount Unit this morning & I am trying to get Les Ryan into this Regt. in place of him\n","18":"\n\nWed 5th\n\nThe natives killed a cow here for us today & it was rather interesting watching them. they first cut its throat & then shoved a stick up the leg between the flesh & skin & put in about half an hour blowing air into it to make it skin easy, they were the whole morning doing it; \n\nEverything else the same as usual\n\n ","19":"\n\nThurs 6th\n\nThe Colonel paid us a visit this morning & went on to Ezbet-Soo-Doon this afternoon; The cow that was killed yesterday was condemned as having tubercolosis & another was killed today; It is unlawful to kill any meat otherwise than cutting its throat; \n\nGood land here in upper Egypt is worth up to £150 per acre & in Lower Egypt up to £200 per acre this includes water for irrigation & there is no limited supply; The yearly income per acre clear of expenses averages about £50 from the best land; Burcene, Maize & cotton is grown on the same ground yearly & sometimes a crop of sugar cane as well\n\nAbdul Moolah bought a bottle of kerosene for me from Hassan Pasha village today & we are now able to have cocoa every night\n\n ","20":"\n\nFri 7th\n\nThe Colonel arrived back here for lunch today from Ezbet-Soo-Doon; The interpreter taught Les & I a couple of Egyptian games today with cards; The cooks slushy (an Egyptian) has been taking our horses in for a swim in the canal the last couple of days but nothing but the general routine of work happens here\n","21":"\n\nSat 8th\n\nThere was a fair at Hassan Pasha village this morning & we got Abdul Moolah to get us 3 new mats; It has been very hot today & a couple of snakes were killed tonight one over 4 feet long. I believe the Colonel told A Sqd that they were not likely to see any more fighting\n\n ","22":"\n\nSun 9th\n\nEveryone here have little lumps all over them very much like mosquito bites & very itchy, the natives say it is caused by very small insects too small to be seen; Tonight the troops were fell in & B Troop were told that the officers had tossed to see which troop would provide a concert, & it fell to B Troop, & all who were called on proved themselves sports, & a very good performance was given\n","23":"\n\nMon 10th\n\nCpl Bigg left here today for Cairo also Johnny Hayes from B Sqd both getting commissions; Sgt Bernie & Trp Costello had to go to Turkh-El-Kheil as they broke out of hospital at Wardan & were caught in Cairo by the Piquet; The medicine ball & boxing gloves are very popular every afternoon A Troop supplied the concert tonight & it was very fair.\n\n ","24":"\n\nTue 11th\n\nThis morning when coming in off patrol Cole let his horse go to swim across the canal, the horse had a nightingale on & the reins tied to the saddle & was drowned About an hour later the horse came to the surface & commenced floating down stream three or four lads stripped off & managed to get the horse to the shore & rescued the gear on him & then gave him a push off into deep water again & he went where most of the rubbish goes. floating down the canal; the canal is about 100 yards wide & the current is very strong; \n\nAs our tent is not shaded during the afternoon & it has been very hot in it during the afternoons I asked permission to shift it this morning & now have \n\n \n11.4.16\n\nit in a very cool spot; \n\nA native put in an appearance yesterday & this morning selling beer just outside the mud wall we are camped in, & refused to take the hint to make himself scarce, so we rang up an Egyptian Officer at Bent-Samarag at dinner time to have him moved &\n\nan Egyptian guard appeared on the scene in a remarkably short time & reported for duty, he is the hardest looking \"doer\" I have seen for some time dressed the same as all the low class of Egyptian only his dresses were more ragged than the average & an old rifle swinging on his shoulder & a worn out bandolier on made him look rather comic, but the beer seller did not seem to appreciate his looks & he made himself before the guard got within coo-ee of him\n\n \n11.4.16\n\nWe were paid this morning & a good many lads are merry tonight in consequence; Ayad the cooks offsider threw a piece of brick into the Canteen for a joke & broke a couple of bottles of beer, an Egyptian officer was here & went as though to take Ayad but the Canteen owner advise him to excuse him as Ayad is very popular with the soldiers & it may have caused a row if he was punished\n\nThe concert was very good tonight & was supplied by C.Troop; Sgt Bernie was discharged with a reprimanding for breaking away from hospital at Wardan; 700 eggs were wanted for the Sqdn & Camel the Canteen owner wanted to charge 1 PT for 5 but Abdul Moolah said he could get them for 6 for 1PT & he brought them along this morning\n\n ","25":"\n\nWed 12th\n\nOrders came out this morning that applications for transfers to the D.A.C. would be considered. about 3 parts of the Squadron put in for it & the Colonel arrived here for dinner tonight had all the N.C.O’s up before him who had applied. he told McFarlane that he would recommend him for a commission if he remained & he has decided to remain;\n\nThe strongest wind I have seen in Egypt sprang up this evening & dust makes it impossible to see more than a yard or two; The poor beggars on patrol duty on the desert will have a rough time tonight; Cameron, McFarlane & Dowling are sleeping in with us tonight; We have cocoa every night before retiring; Butter received a parcel today with a couple of tins of cocoa in\n\n ","26":"\n\nThurs 13th\n\nIt has been a very disagreeable day a strong wind blowing & a little dust with it; Today is Eric Dowlings 20th birthday & we are celebrating it tonight by having a little feast; Butter, Dowling McFarlane Cameron, Trickett, Les & myself run a mess between us & live fairly well; \n\nKamel who professes to be a Christian & was in England studying for a Dr when war broke out, now runs the Canteen here in Camp & is out to make all he can, sugar in the Canteen is 5 PT a lump & only 3 ½ in the village alongside us; condensed milk is also 5 PT a tin, & Kamel can hold his own now with any of the troopers in a swearing match; \n\nThe Colonel had a nasty ride home last night & was in a bad humor when he got there as he ordered Granny out of the Mess & prohibited all gambling & shouting in Officers Mess\n\n ","27":"\n\nFri 14th\n\nThe wind has dropped & the weather is glorious today Two up is played all day here by some of the lads; A Troop celebrated the birthday of a couple of their men tonight & the majority of them drank more beer than they could very well carry & were rather noisy as they had an impromptu concert\n","28":"\n\nSat 15th\n\nAnother fine day neither hot or cold; half a dozen Egyptians came on the scene today with a boring plant consisting of a pump, pipes & a heavy piece of iron with a hole through the centre to jump the pipes down & started to work about 4 oclock this afternoon & nearly had the 40 feet of piping down tonight \n\nthe bottom piece of piping has a \n\n \n15-4-16\n\npointed piece of iron riveted to the end of it, & the pipe has 3 rows of holes for 2 feet up, covered with fine gauze with another covering of coarser gauze on the outside, this is forced straight down & an ordinary handle pump to pump the water with;\n\nWe have been in the habit of having cocoa every night before retiring but tonight we found that our cocoa supply had run out, so we had poached eggs instead, & were just about to make our bed down when Abdul Moolah appeared on the scene with a kettle, teapot, glasses & Egyptian tea\n\nI then remembered asking him to come & have tea with us, so we soon had the kettle boiling & by 10.30 was filled up with sweet tea, & enjoying a very amusing evening with Les the interpreter & Abdul Moolah;\n\nD Troop supplied a very fair programme tonight; Was issued with a watch today\n\n ","29":"\n\nSun 16th\n\nHad a Tommy Sig. Officer out today having a look around \n\nA rumor that we are going to Aldershot shortly was brought out from Cairo yesterday but it did not get much of a hearing; We asked Abdul Moolah to come at 8 oclock tonight to make tea for us & he turned up to time & kept tea up to us while we played cards; The well sinkers finished at 8 oclock this morning & went on to Ezbet-Soo-Doon where they have another one to sink for the troops there.\n\nThe water is very black & dirty today & it will not be fit to drink for a couple of days; Cameron has a touch of Nile fever, Trickett & also several other lads have had it & by all accounts it is rather unpleasant\n\n ","30":"\n\nMon 17th\n\nA limber was sent to H.Q. this afternoon for some horse shoes & mail but found the mail had been sent to Minia; \n\nThe hours exercise before breakfast has been cut out & one hours work between breakfast & dinner is all the drill we have to do. I still have the class of new Sigs & they are coming on well. Cocoa tonight\n","31":"\n\nTue 18th\n\nFarrier Cpl Small received leave to go to Cairo this evening he applied for £25 to put a tombstone over his cousin Hector who died at Heliopolis but has no intention of doing it as all he wants is a trip to Cairo & spending money, a great dodge to get money is to go to a dentist & have teeth attended to & ask the dentist to charge £10 more than\n\n \n18-4-16\n\nthe price & to give you the £10 when he has collected it from the Pay Office on the book, but as Small received £25.0.0 on account of his teeth a few weeks ago he had to get another excuse,\n\na few parcels & an odd letter or two turned up today; Tonight Abdul Moolah turned up at 8 oclock & made \"shea\" for us; & we arranged with him to buy & cook 2 turkeys & vegetables for next Sunday’s dinner also to get apples for us from Minia; \n\nA message came through tonight asking for applications for transfer from this Regt. to 1st Field Sqd. Divisional Engineers, men of all trades required; The men in the Orderly Room at Tukl-El-Kheil says it is thought at the Base that we shall leave for England or France within a few weeks\n\n ","32":"\n\nWed 19th\n\nA good many men applied today for transfer to 1st Field Sqd. Div. Engineers. The officers came this afternoon with a cricket bat & ball but the ball did not last long as it was a cheap one & soon went to pieces.\n\nhad cocoa tonight\n","33":"\n\nThurs 20th\n\nThe transport drivers brought out a bat & ball from Minia for us yesterday, we had a few strikes this morning & finished the ball off this afternoon\n\nThe South Western Mounted Bde Field Amb. was replaced by 4th Dismounted Field Amb. at Minia today; We received a paper mail this morning Tonight we had a concert\ntonight\n which went off very well\n\n ","34":"\n\nFri 21st\n\nThe interpreter has been fasting all the week & applied for leave of absence from Saturday till Monday to put in Easter Sunday with his married sister at Malowie & attend the Feasts there but the Colonel would not grant him leave although the Major made no objection; Today he has gone to Church at a village a few miles from here. \n\nA Troop was innoculated against typhoid yesterday & B Troop today; Major Smith & Capt Higginson went into Minia today to take part in a Court Martial Driver James also had to attend as a witness, Sgt. Pike of the Field Amb. was court martialled for assaulting a Colonel; It is said that he had an argument with an Egyptian Officer over the quality of the beer & it ended in a row\n\n ","35":"\n\nSat 22nd\n\nLt. Snow went into Minia yesterday for duty; Lt Garbett & Wright went to the market at Hassan Pasha this morning accompanied by the interpreter & bought 45 fowls for the Squadrons dinner tomorrow; Abdul Moolah brought £1.0.0 worth of eggs along for the Sqd again today\n","36":"\n\nSun 23rd\n\nI gave Abdul Moolah £1.0.0 to enable him to buy turkeys, potatoes etc for todays dinner, Abdul wanted to bring a table & chairs but we objected & we have been rather doubtful as to the success of the scheme & received quite a pleasant surprise when we saw how our dinner was dished up for us, we had ordered it for 1 oclock & at 12 oclock he showed up with a very large metal tray & we\n\n \n23-4-16\n\nthought he was a bit premature as we then had stables to do before dinner but found it was only the soup plates & bowls; The dinner turned up at 1 oclock sharp, & everyone of us agreed that it was the best dinner we have had since leaving Australia every thing was spotlessly clean & the dinner was cooked lovely & composed of soup, 4 turkeys, & potatoes, & boiled rice & tinned pineapples; \n\nThe dinner partly consisted of Dowling, Butter, Cameron, McFarlane Trickett, Smither, Mikhail Hanna (interpreter) & myself, we finished off 3 turkeys & a drumstick of the fourth & was too full to do anything but lay about in the tent for the rest of the afternoon; The dinner cost 120 PT so we gave Abdul Moolah 40 PT more (20 bakshush) for the cooking & work, lemonade, fruit & beer brought it up to 200 PT; We were much surprised at the way the dinner\n\n \nwas cooked & on enquiring was told that Abdul wifes brother was cooking for a European in Cairo some years ago, & taught her how to cook for Europeans.\n\nSgt Warden & 3 troopers went to the village of Tieba for dinner today on the invitation of one of the head Egyptians there.\n\nMorrice & Reid reported back in Minia this afternoon & are to ride out this evening; About a dozen lads made the pace a welter on the beer this afternoon & took a goose & a turkey from the village the goose I managed to get back for the native but it was a different matter with the turkey & it was reported to Mr Garbett; \n\nHad a swim this afternoon & then played bridge & five hundred till bed time, we play cards every night & have cocoa at 9.30 & then turn in; \n\nReceived a parcel today from Ede\n\n ","37":"\n\nMon 24th\n\n12 men & 3 officers went to Nazlet-El-Fellaheen for dinner today also the interpreter. Brig.Gen. McKay ordered 2 Btn of troops to start at 5 AM a couple of weeks ago on a 32 mile march with full pack & equipment also 1 blanket & oilsheet they had their water bottle full to see their journey out & had to do it in the day; \n\nA hot day & the fine powdery sand they had to march through was too much for them, 6 dropped dead on the march & over 200 failed to reach their destination & were put in hospital some of these also died. Packs, rifles, & equipment were discarded by nearly all who went through. their feet were swollen & sore & lips also parched & swollen McKay said afterwards that he would not like to go to the front with\n\n \n\n \n24-4-16\n\nmen like them, if he had to do a route march himself with a pack up (through sand) he would know what a man could do, 30 miles is a long fays journey for a horse here in cool weather & it is far from cool here now\n","38":"\n\nTues 25th\n\nGuille, a H.Q. Sig who came back from the School of Instruction with a 1st Class Sig Certificate last Sunday had the misfortune to get drowned today while swimming his horse a couple of miles from Tukh-El-Kheil his body was recovered about dinner time some distance down from where he was drowned, soldiers being told off to follow the Canal at certain points to find him\n\nAll the men on piquet (horse) last night were up before the Major this morning as they did not do their work last night & got 5 extra piquets as punishment.\n\n ","39":"\n\nWed 26th\n\nIt has been very hot & windy today in fact the worst day we have had so far, the well here has not been working too well, but the pump has been fixed up & it is going along well now; \n\nWe generally have a swim after tea & then cards till 9.30 then cocoa before turning in; \n\nHeard tonight that the Turkish aeroplanes bombed Port Said last Sunday.\n","40":"\n\nThurs 27th\n\nHeard from Nelson today that I shall probably have to go to the School of Instruction next Sat; Sgt. Pike was sentenced to 6 months hard labour as the result of his Court Martial last Friday \n\nFarrier Sgt. Simeon was sent away today as he was bit by a horse last night, & they are frightened of hydrophobia\n\n ","41":"\n\nFri 28th\n\nWe received a pay again today & the two-up school was in full swing before the paying was finished; An order was issued to each village (48 of them) last night to supply 50 men from each to build roads & bridges across the Canal for the troops 4 miles this side of Ezbet-Sit-Houm, as the country the troops are camped on now at Ezbet will be flooded in a month or so; The troops at Ezbet-Sit-Houm were told that they will be here for a considerable time, & there is some talk of a road & line being made out into the desert, where the Armoured Cars now are stationed; \n\nBassan came down here for a ride today; Went in for a dip after tea & played cards as usual till bed time \n\n ","42":"\n\nSat 29th\n\nThe Officers had a pidgeon match at Tukh-El-Kheil today \n\nCapps of A Sqd was found dead this morning, he died during the night in bed of natural causes, & was sent into Minia today on his way to Cairo;\n\nMy name was scratched off the list of men to go to the School of Instruction Lieut Garbett went in charge of the party\n","43":"\n","44":"\n\nNothing of any consequence happened today; Reid & I went into the native village tonight on the invitation of Surgis Yusssef to have a feed with them Meat & vegetables were placed on one big dish in the centre of the table & it was a case of the fastest eater scoring best; it was not a bad feed & had plenty of beer, lemonade & water melon; 6 soldiers were there\n\n ","45":"\n\nMon 1st\n\nLes & McFarlane went into Minia today to see if they could draw money through the bank; All passes have been stopped to Cairo & Sohag for a week; It is rumored that a troop of the 9th L.H. was captured a week or so ago on the Sinai Peninsula, \n\nWe seldom get papers here & are not too well posted with news\n\nA swim & cards after tea\n","46":"\n\nTue 2nd\n\nWe got orders from R.H.Q. to make preparations to move at short notice; Abdul Moolah was here when I received the message & was very downhearted when he hear the news I gave him £1 to get Sundays dinner ready for but cancelled the order; The Officers fired away a good many rounds of gun cartridges this evening shooting birds\n\n ","47":"\n\nWed 3rd\n\nWe received bad news today. A Regt of English Yeomanry cut up on the Canal \nthe 5th Light Horse has been cut up on the canal\n & General Townsend has surrendered with 6 thousand troops;\n\nOur kit bags were sent into Minia today; I have been very busy today getting things ready to go away; I am sorry we are leaving here as it is the best camp we have yet had but we have had a good spell & it is about time we had a little more excitement; A Sqd shifted to Shusha today & did not like going as they also have notice to be ready to move at any time; \n\n£50 was missed today belonging to the Sqd & suspicion fell on Whitby (a batman), he was searched & an inquiry is being held, Whitby has been losing very heavy at two-up & everyone thinks he is guilty\n\n \n\n ","48":"\n\nThurs 4th\n\nThe Sig stores went into Minia today; Lt Snow, Sgt Lowe, Cpl Lindsay Ford, Dalton, Brown & two Sheridans got word today to be at Minia Railway station at 4.45 tomorrow afternoon to proceed to Tel-El-Kebir to join the Artillery; Snow has been battling hard to get his transfer & has Capt Stanby Walker of the 14th Art. Bde also battling for him;\n\nThe natives who have shares on the Canteen are sorry we are going & admit they are all rich men now; Major Smith was told today by the Colonel that he would be held responsible for the £50 stolen & gave an order that all gambling was to stop & it is the best thing that could be done; Blake won £40 from Sgt Wright this morning some of the lads had a farewell concert tonight\n\n ","49":"\n\nFri 5th\n\nReceived an order today to send to Minia any blankets, tents, the water troughs & anything we could do without so as to make things light for the transports when we move\n\nThe party for Tel-El-Kebir left this morning; A fire broke out in a village a couple of miles from here this evening & burned very willing for a few minutes, a swim & cards as usual tonight; \n\nSgt Pannier went today\n","50":"\n\nSat 6th\n\nReceived news from Minia this morning saying the Allied Forces made a big advance in France but the news has not been confirmed; Nothing out of the ordinary happens here & are expecting marching orders at any time; Had a concert tonight with some very good items.\n\n ","51":"\n\nSun 7th\n\n4,800 natives are now working \nworking\n for the Military Authorities building a road & railway through the desert to the Oasis, also erecting a telephone line, the men working on the telephone line receive 4 Piastres per day & the others get 5 that is the only payments they receive & have to keep themselves in tucker so they are not overpaid;\n\nAbdul Moolah wanted a reference so I gave him one today. Lieut Mills who has been Q.M. is now in charge of A Troop is hardly right in the head, he is a Reinforcement Officer & has not yet been to the front; Yesterday he lined the men up after stables & gave them a lecture & said when at the front it is quite safe to stand for 3 minutes in one position shooting at the enemy’s trench after 3 minutes it is time to get below the parapet as it is then dangerous; he also said always shut the right eye & sight\n\n ","52":"\n\nwith the left, (rather an awkward position shooting from the right shoulder) & on no account to rest the rifle on the parapet as the military rifles are now made to allow for the give when the trigger is pulled & if the rifle is held too steady it will not shoot straight, when firing with the bayonet fixed always aim high as the steel bayonet has a tendency to draw the bullet down when leaving the barrel & naturally drops short.\n\nIt was most amazing lecture I have ever heard of especially as 90% of the men addressed had been in the firing line for months & a good many of them have scars that remind them that it is not safe to keep your head above the parapet any more than a second or two; And still we are told to always to do as an Officer tells us, but I fancy if we ever get in a scrap Mills would soon be told to go to Jerusalem or somewhere else;\n\nEggs on toast for supper tonight\n\n \nThis morning a couple of English officers turned up here early in a motor car apparently they are the officers who will take over this camp for us;\n\nLast night one of the lads was sleeping on the burcene by the canal & woke up this morning to find one of the natives had called on him during the night & commandeered his boots; \n\nA home made shower was erected by Major Smith yesterday & has been made good use of\n","53":"\n\nTue 9th\n\nThe lad who had his boots stolen the night before last tied his laces to his arm last night & slept in the same place, at daybreak this morning he was wakened by a pull at his arm & found the native had come back for another pair, he was chased but made good his escape by swimming the canal & getting into a village; \n\nGeneral routine of work\n\n ","54":"\n\nWed 10th\n\nReid went to Tukh-El-Kheil today for a ride; An order came along today saying Head Quarters & B Sqd entrain tomorrow evening at 6 P.M. & C Sqd with the exception of A Troop will entrain at Minia at 8 P.M; A Sqd will wait till \ntill\n Saturday & A Troop will follow us next Friday; \n\nThe boxing gloves are worn out & we tried to finish them off altogether tonight as they are not worth taking them with us\n","55":"\n\nThurs 11th\n\nWere busy this morning rolling our blankets pulling down tents & getting our saddles ready to move of; At 3 oclock the dress for parade blew & we lost no time saddling & getting out on parade the horse lines we soon pulled up & put on the transport & at 3.45 we left Hassan Pasha & \n\n \n11-5-16\n\nhad a very good ride into Minia arrived there at seven at the camp watered our horses, put down horse lines fed our horses but before we had time to have tea we received orders to saddle up & proceed to the Railway Station, as the time for the train to start had been put forward an hour it took us no time to truck the horses & transports & left Minia about 9.30 tonight\n\n12-5-16\n\nFri 12th\n\nThe Sergeants & Cpls were given 2nd class carriages & the troops were in 3rd as usual; Peters, Guthrie, Chivers & I had a carriage to ourselves. had a game of bridge as soon as the train left Minia, & then made ourselves comfortable for the night We went through Cairo about 4 oclock this morning but I was asleep & only\n\n ","56":"\n\nwoke once during the night, the sun was well up when I awoke this morning; We arrived at Zag-A-Zig about 7.30 & watered & fed the horses in the trucks; Some Tommies had tea ready for us on the platform & we had breakfast. About 9 oclock we continued our journey & arrived at our destination (Kantara) about 11.30 & by 1 oclock we had our horses tethered to oak trees growing along a fresh water canal about a mile from the station; \n\nhad rather a good trip since leaving Hassan Pasha & very little messing about; Anti-Air-Craft guns have been mounted in various positions on tops of houses & heaps of sandbags; English soldiers are here in thousands & to the south east of us we can hear artillery apparently practising; these sound a long way off; From here a light railway runs out into the desert 27 miles &\n\n \n12-5-16\n\nis being pushed forward as fast as possible Troops are out in front of the line keeping back any Turks, & here a whole squadron of Yeomanry were captured by Turks a few days ago\n\nThe 2nd Bde of Aus Light Horse are now out there, their rations are taken to them from the end of the line by Camel Transport; The report we got a Hassan Pasha that the 5th L.H. has been cut up was not correct; \n\nThis afternoon all C. Sqd was marched through the sand to where the camp is & were set to work putting up horses lines & as soon as the horse lines were up they decided to leave the horses here in the shade, so the horse lines were pulled up again & tents pitched & we now have have our meals about half a mile from our horses, & have to walk through soft sand well cut up with transports to feed & water the horses, but it will harden us up\n\n ","57":"\n\nSat 13th\n\nReveille at 5 oclock this morning & half the men had to do stables & the remainder to do fatigue work in camp such as shifting stores etc. B. Sqd & Head Quarters arrived here before us yesterday; Colonel Meredith is now Brigadier & Major Granville is in charge of the Regt. & we are all glad to see it so; There are a few Indian troops here & it is quite a change to get away from the Egyptians; \n\nThis is rather a busy place trains continually arriving & going & as we are camped within a few hundred yards of the Suez Canal can see every boat that comes along; There is a bridge across the Canal here; A canteen in the camp run by the military & we can now buy goods at ½ the price we have been paying the Egyptians; a good many lads went to the Canal swimming this morning, I\n\n \n13-5-16\n\nwent back to the horses soon after dinner to lie in the shade of the trees as it is very hot in the tents, but a messenger from Divisional Head Quarters came on the scene at 2 oclock with orders to move off at 5 oclock we had to bustle to get the tents down & all spare gear on the transports; Three Batteries of Artillery (English) went out before us & we managed to move off at 4.15 crossed the Suez Canal over a pontoon bridge & headed out into the desert a seven mile trek brought us to Hill 70 where we put down the horse lines, bed our horses a few hundred yards to water then fed up & had tea at 9.30, also stew; \n\nLes Reid & I have been living well since we left Hassan Pasha as we have been carrying a good supply of tinned fruit & fish on the pack horse; A double light railway line is being built into the desert also a heavy railway & a metal road. 6 inch pipes supply us with water from Kantara\n\n ","58":"\n\nSun 14th\n\nReveille at 5 oclock fed & groomed the horses then pitched the tents, had breakfast & took horses to water at 8 oclock. they are only to get two drinks a day from now on at 8 AM & 4 PM. A Sqd arrived here about dinner time. The water supply run out today & A Sqd had to wait till 7 PM to water their horses & the Yeomanry who are also camped by us had to wait till 8 oclock;\n\nSome Bedouins were brought in off the desert today on camels \n\nit is reported that some English troops who were killed & wounded were mutilated by the native women & now all Bedouins that are caught are being brought in \n\nA couple of transports passed through he Suez today & looks from here that they were sailing through the sand; It was very hot here during the middle of the day but nice & cool tonight\n\n ","59":"\n\nMon 15th\n\nReveille at 5 oclock as usual, groomed & fed the horses. \n\nwe should have had tea then but the S.S.M. neglected to tell the cooks last night & we got none. at 7 oclock we had to ride one horse & lead another for exercise. had a good long ride watered the horses on our way back & got back for breakfast at 8.45 porridge & tea was issued for breakfast, we have been getting principally bully & biscuits for the last week. Les Reid & I brought a good supply of tinned fish & fruit with us but it is now finished; \n\nThe Artillery opposite us left this morning & are going back to Kantara; A train loaded with the 12th L.H. Regt. arrived here at 10 oclock this morning the 12th are camped about half a mile from us they left their horses behind, I saw Fletcher (he is R.S.M.) for a few minutes; We started to do stables at 3.30 this afternoon & it was 7 oclock before we had finished watering\n\n ","60":"\n\nTue 16th\n\nReveille at 5 fed & groomed the horses then breakfast; Led the horses out for exercise (riding one & leading one) & watering them coming back; No letters are being sent away from here for a fortnight; The officers mess is the coolest spot about here & it was 117° in the shade today\n\nOne of the camels went down to it at the water trough today, we thought the heat was the cause but heard the native in charge had the camel set & gave it a drink of salt water at one of the lakes\n","61":"\n\nWed 17th\n\nUsual routine of work, packed Sig gear ready for the track this morning & got two leather cases for pack saddle from Sgt. Clancy; One man to two horses going to water this afternoon as usual, & the remainder pulled the tents down\n\n \n17-5-16\n\n& got the gear ready for the camel transports, as it is too sandy from here to take our own transports ours went back to Kantara today were allowed to post letters at 12 oclock today;\n\nVery hot again but it gets cool as soon as the sun sets; A battery of Art. put in an appearance again this afternoon. after tea we were busy getting issued with ammunition & iron rations & fed our horses at 9 oclock after taking up the wire rope lines & putting down the neck ropes for the night got to bed soon after nine oclock\n","62":"\n\nThurs 18th\n\nWe were hauled out of bed at 1.15 AM this morning & had to load all tents & gear on the Indian Transport Column. got our lines up & left camp at 2.15, watered the horses & started on a very heavy trip\n\n \n18-5-16\n\nthrough fine loose sand, & our horses had had quite enough when we arrived out alongside the 2nd Brigade. the horses were very thirsty as it was about 11 oclock when we got here & it was very hot travelling through the sand but they did not drink much water as it is quite salty from these wells & only just drinkable;\n\nWe put the horse lines down had dinner & few minutes sleep under the saddle blankets for a shade & then set to work to erect the tent & put the camp ship shape; We were issued with a bottle of fresh water each this afternoon & it is quite a treat after what we have been drinking since we arrived; The Interpreters were going to be left behind at Minia but the H.Q. Interpreter is a bit of hard doer & is out for adventure & asked to be allowed to come with us, so both the others had to come also\n\n \n18-5-16\n\nbut at Hill 70 both Mikhael Harman & A Sqd Interpreter, asked for their discharge as they could not stand the heat on the desert. the H.Q. Interpreter is still with us & managed to get here on his donkey\n\nThe day before yesterday the 6th L.H. & a Sqd of N.Z.M.R. came back from a long trip after Turks they were out from 3 AM Monday till 4 PM Tuesday without water some of them had to leave their horses to get back as they knocked up several of their horses were shot & all their Officers went down to it from thirst, 4 officers & about 40 men were sent to hospital from the gruelling they got & about 30 New Zealanders were also put in hospital; \n\nWhen the Sqd of Tommies were captured about 7 mile from here a few weeks ago the Tommies stationed here made a hurried retreat the 6th L.H. arriving the day after the tommies left, & some of the first were lucky enough to get a \n\n \n18-5-16\n\nfair supply of champagne, whisky, beer & other rations & the Tommies were in too big a hurry leaving to take anything with them, a couple of days later the English officers came back to claim their champagne but they did not get much of a hearing.\n\nWe are camped within four miles of the coast. We could hear big guns booming a long way off & heard tonight that it is a monitor & two warboats shelling a Turkish position about 7 miles up from us. I am pretty tired tonight but managed to raise enough energy to walk over to the 6th Regt & saw Ted Oates & Maybury;\n\n19-5-16\n\nFri 19th\n\nHere we have to stand to arms at 4 oclock & one troop & a Signaller goes out on patrol every morning at 4 AM to see that no Turks have managed to get close to the camp during the night The signallers have been getting more\n\n \n19-5-16\n\nwork than the troopers here & the only casualties on our side has been sigs sending messages & got potted & only two or three of them; The days feel much cooler here than at Hill 70 as a cool breeze blows continually from the sea, but the 6th say it was 123° in the shade last Tuesday\n\nThe rumors we heard at Hill 70 of the mutilation of the bodies of dead & wounded Tommies by the Arab women is denied by the troops here they say that all the wounded Tommies were well treated by the Turks who could not take them away, but left them enough food to last them a couple of days & filled their water bottles for them & the native women came along later with more water & treated them very well;\n\nBy all reports all the \"Bints\" that have been captured have been treated very well & shown every respect by the troops & are generally kept here at Head Quarters\n\n \n19-5-16\n\nfor two or three days & then allowed to go back to their camps in the desert if they wish to, but all the men are sent in to Kantara; The 7th Regt. were out when we arrived here, the Turks always retire when a Regt goes out to meet them. our troops go out following them till they are forced to come back for water & the Turks follow them back;\n\nthe 7th laid a trap by dismounting a troop & a machine gun on the way home the returning troops leading their horses home; the troop left behind dig themselves in ready to give the Turks a reception but just at dark a Bedouin lit a fire on the top of a ridge close by them warning the Turks of danger & they did not show up, the Bedouin also managed to escape;\n\n3 dogs have been shot in mistake for Turks by the outposts during the night; The 2nd Bde received a letter from the English general\n\n ","63":"\n\ncomplimenting them on the manner in which they appeared on the scene here after the English troops retreated & said he did not believe there were any troops in the world could have performed the same feat; \n\nWhen the Sqd of English Tommies were captured the 2nd Bde were 17 miles the other side of Kantara & at once commenced their journey, they had 4 hours spell at Kantara, 4 hours at Hill 70 & then came straight on arriving here within 24 hours from the time they got the order to move. the journey was 50 odd miles & were expecting to meet Turks any time after leaving Hill 70 behind them & when they arrived had to put out patrols & outposts in case they were attacked & dig into the sand with their hands to make wells to get water for themselves & horses. \n\nThe country here is composed of nothing but loose sand hills & most of the hills so steep\n\n \n19-5-16\n\nthat the rider has to dismount & lead his horse up & down them & both horse & rider up to their knees going down them & is very heavy work on both; It would be ideal fighting country for mounted troops if the ground was solid & water obtainable; we receive a pint of fresh tea 3 times a day & one bottle full of fresh water daily so we can manage without drinking the brackish water from the wells\n","64":"\n\nSat 20th\n\nB Troop had to go out at 4 oclock this morning on patrol, & as a Sigs had to go too I went & had a very enjoyable ride. We went to within a mile of Qatia where the Tommies were cut up & then came back arriving in camp at 9 oclock after setting fire to all the shades & old dwelling places of Bedouins as they afforded good hiding\n\n \n20-5-16\n\nplaces for the enemy; A Squadron went out at 4 oclock this morning on an all day reconnaisance, at 12 oclock & old Bedouin & his wife were escorted to camp by two of A Sqd men & at 1 oclock a young girl about 12 or 13 years old was brought in by two more men with 8 goats & 3 sheep, she says she was living on the desert with only her mother & that some Turks passed their camp a few days ago & took some goats for food but did not interfere with them.\n\nThe 12th Regt also some Scottish troops were sent to reinforce the 5th Light Horse a couple of days ago & have been consolidating their position as they expected an attack last night; This morning we could hear big guns booming but could not be sure of the direction of the firing; A Sqd arrived back in camp at 6 oclock, & half an hour later 1 man & 5 women & half a dozen children were escorted in by a couple\n\n \n20-5-16\n\nof Troopers; The man when searched had £28 in English money on him another Bedouin brought in a few days ago had £140 on him apparently taken of the Tommies cut up at Qatia. the goats & sheep brought in with the \"Bint\" today were bought by the Military & all the Bedouins are being sent into Cairo (or Egypt)\n\nWe are lucky to be able to get plenty of good washing water so close to the camp\n","65":"\n\nSun 21st\n\nWe now stand to arms at 3.30 AM & have to saddle our horses & stand by them till daylight & then stables before breakfast; at 8 oclock this morning Church Service was held at the Bde Head Quarters but very few of the 1st attended, I dropped off to sleep as soon as I had breakfast & did not wake till stables at 12 oclock; An\n\n \n21-5-16\n\naeroplane came over early this morning & dropped a message to Head Quarters; The aeroplane do all the scouting & always report when there are any Turks approaching; \n\nA & C Squadrons are on outpost duty tonight & are dismounted. C Sqd on the top of the ridge to the north of the camp & A on the ridge to the south overlooking the camp; We are camped in an ideal spot as it is in a deep hollow & cannot be seen till one is right above it;\n\nOur Interpreter (who is an Assyrian) has been knocking about amongst the natives driving the camels & says he has been throwing out hints to the drivers that he likes the Turks but not the English & some of the drivers said they are all going to hand the camels over to the Turks at the first opportunity; The interpreter also says that all the young men camped\n\n \n21-5-16\n\nabout here must have joined the Turks & that is the reason only old men & women are found here & the women & old men act as spies & let the Turks know anything they find out; About a dozen lads made fine amusement today by climbing to the top of the sand ridge & rolling down like a lot of school kids.\n","66":"\n\nMon 22nd\n\nI received orders late last night to go onto the Pinnicle to signal to troops on the desert. Les had to go to a station above the water troughs; We had breakfast at 4.30 & made to our posts at 5 AM & put in a very miserable day; The Pinnacle is a high sand dome about 100 yards long on the top & about 4 feet\n\n \n22-5-16\n\nwide & just steep enough down the sides to hold the sand together without a slip; It is easily the highest point for miles around here & we have a great range for helio work & can get into communication with any troops within 20 odd miles of us; About 4 miles to the north of us is the Meditteranean; 6 miles to the east of us is Qatia where the Tommies were cut up; \n\nToday the 6th Regt went to Qatia & is camping there till the moon rises they got into camp early & we were in communication before we came in at six oclock; A cool breeze was blowing off the sea all day & the sand was blowing over everything making us very uncomfortable there were four Helio Stations on the Pinnacle; I was feeling tired\n\n \n22-5-16\n\nwhen I got into camp tonight but a fairly good tea was waiting us & had a feed of asparagus & biscuits & beef tea before getting to bed as Morrice received a parcel today;\n\nWe got orders tonight that we shall leave camp at 4 oclock in the morning; large camel train went out this afternoon also the New Zealand Mounted Rifle Bde the 7th Regt is moving out tonight & we are expecting a clash with the Turks within 3 days\n","67":"\n\nTue 23rd\n\nWe were called at 2.45 this morning & given till 3.30 to have our horses fed & finish our breakfast; It was a hurried meal & we saddled up at 3.30 & moved off before 4 oclock after watering our horses; We went into the desert 18 miles captured about\n\n \n23-5-16\n\n20 native women & children, one very old man & one young man whome we brought back with us. the women refused to come in with us & were left out there also the old man; We burnt all the Bedouin homes we came across & found quite an assortment of military equipment in most of them; At 10 oclock this morning we found 6 sheep with no owner, so they were brought back to camp by Cpl Morrice & 2 men; \n\nIt was 6.30 when we got back to camp with empty water bottles & horses just about fagged out as they were kept going pretty constant all day in the soft sand, & they had no water all the time they were out; We found a mail awaiting us when we returned which cheered us up a bit; We saw no Turks but the 5th L.H. caught sight of some & managed to capture one of them but there was no fighting; the Turks always retire when troops from here go out to meet them\n\nHad some long range signalling today\n\n ","68":"\n\nWed 24th\n\nA Sqd went out on patrol this morning & went to the beach swimming themselves & horses & say they had great fun as they were in good breakers; Jim Traill left here today to go into Div. Head Quarters I believe he is getting a commission in the Div H.Q. Signal Troop; We have been having lovely weather here lately & had nothing to do today except the usual routine of stables etc.\n","69":"\n\nThurs 25th\n\nWent on swimming parade at 8.30 this morning (C Sqd) & had all our horse in the surf & it was glorious & well worth the 4 or 5 mile ride there & back again\n\na branch line is running from the main line to the beach, & the line is now out level with us; Guthrie went away to hospital this evening with influenza; Parcel mail this evening\n\n ","70":"\n\nFri 26th\n\nReveille at 3.30 as usual & Les went to the pinnacle on duty till breakfast time, I then relieved him till dinner time & Reidy went on from dinner time till tea time; The 6th Regt went to Hill 70 during the night & the 3rd Regt turned up here today Meredith was with them; The aeroplane was over us again today as usual & dropped another note to Bde H.Q.; \n\nB. Sqd was at the beach swimming this morning;\n\nWe have been living very poorly here on bully beef bread & jam, but we could not even get enough bully & at times had to make a meal of dry bread & half a pint of tea\n\nWe have been kicking up a row over it & things appear to be improving tonight being the only decent meal we have had consisting of a good stew; Thousands of Egyptians are working on the railway line, some artillery arrived yesterday here at Romani\n\n ","71":"\n\nSat 27th\n\nWe were called up at 2.45 this morning fed up & breakfasted in a hurry & were headed into the desert at 4 AM; We arrived at Qatia before 8 oclock where C Troop put in the day & was our base, the other Troops were sent to various points on patrol with orders to be back at Qatia by 3 oclock, as we were to get back in camp by 5 PM.\n\nB & D Troops arrived back to time by A Troop did not turn up & men were sent out in pairs to try & pick them up; A Troop were supposed to be a Ogratina (3 miles farther on from Qatia) but put themselves on guard over some Signallers who were repairing the telephone line to Ogratina; We could not make out where they could have gone & had to get in some pretty slick signalling (per helio) to the Pinnacle to find out if they had returned to camped just at sundown, but had no sooner finished inquiring when\n\n \n27-5-16\n\nword came along that A Troop were sighted about 6 miles out, so we came back to camp everyone calling Lieut Mills choice names. we lost no time on the way back arriving here at 8.30 watered & fed our horses & finished tea by 9.45; For the 16 hours we were away we only had a little bully beef & a piece of bread. The sand flies are getting very troublesome\n","72":"\n\nSun 28th\n\nSlept this morning & had nothing to do but read this afternoon but were told at stables that C Sqdn had to leave here at 6 oclock & go out on outpost duty; We have to run a telephone out from the outpost & T into the wire running from Bde Headquarters to the Pinnacles; B Sqd also goes out but in a different direction\n\n ","73":"\n\nMon 29th\n\nI had a touch of dysentry last night & this morning & did not get much sleep last night; Reid was on first shift, Les second & I was on last from 1 oclock till 3.30 when everyone had to stand to arms; Six men & an N.C.O. had to go on patrol at 4 oclock & we came back to camp at 5.30, after getting a particularly rough time of it from the sand flies;\n\nA voluntary swimming parade was to be held this morning & after we had saddled up ready to go word came along to say the permission had been withdrawn, so I slept till midday; We are going out tonight to attack the Turkish camp about 25 miles away; The New Zealanders went out today & are to attack the Turkish outposts at daylight tomorrow morning, we are to travel all night & get there in time to support them so the\n\n \n29-5-16\n\nrumor goes; & we have been kept pretty busy this afternoon drawing iron rations etc; as B Sqd Signallers are very weak through Jimmy Leask being away at the School of Instruction it has been decided that Les is to take charge of B Sqd Sigs & Ally Hargreave is to come with me in his place.\n","74":"\n\nTue 30th\n\nWe left last night at 11 oclock & made very slow progress until daylight going about half a mile or so & then halt to see if everything was clear ahead; The night was very dark as there was no moon; Caught up with the New Zealanders early this morning they left shortly before us last night & the Camel Transport & Field Ambul. came away with us; We arrived at Oghratina at 9 oclock this morning\n\n \n30-5-16\n\n& put in till dinner time watering the horses as there is only one well here with water fresh enough for the horses to drink & as the horses were very thirsty they kept they kept the well drained. had breakfast about 9.30 & slept till 1 oclock. Patrols have been sent out & outposts stationed for the night; We are camped in a large clump of palms where the Tommies were camped & on the sand ridge above the camp scores of Tommies are still lying on the top of the ground where they were killed\n","75":"\n\nWed 31st\n\nWe had orders to have our horses saddled & all our equipment on by sundown yesterday evening & were issued with rations & horses food which was brought out on the camels also had a good issue of fresh water; Went to sleep last night with full equipment on & our horses saddled & \n\n \n31-5-16\n\nslept well despite the fact that we had no overcoats with us & the night was cool; We were called at 12.45 & were soon on the track again, about 4 oclock to camped in a another clump of palms where the New Zealanders camped last night, & had no trouble in getting a good supply of brackish water by digging two or 3 feet in the sand, one of these wells has very fresh water compared to the others & quite good for drinking. from the ridges above the camp we could hear a little rifle fire just at sunrise & a little a few shots were fired by artillery (probably Turkish)\n\nThe New Zealanders are in advance of us & we are only 8 miles from the Turkish Head Quarters; Bde Head Quarters are also here with us today & a wireless station is erected on the ridge above us; this trip has been a very decent picnic up to date; The 2nd & 3rd Regts left Romani at 9 oclock last night & arrived here at Biril Abd about 7 oclock this morning & got word soon after to go \n\n \n31-5-16\n\nback at 10 oclock as they were not required. we also received orders to saddle up at 11 oclock & shortly afterwards the New Zealanders arrived back here, they only received 2 casualties in the scrap both lads being wounded; The aeroplane reported early this morning that there was about 2,000 Turks in camp & the New Zealanders approached cautiously in consequence & did not surround the camp as was first intended, but left their horses well back from the Turk’s camp & advanced on foot; \n\nThe Turkish outpost opened fire on them at about 700 yards & it was a long range fight; The aeroplane dropped a bomb on a Turkish machine gun & put it out of action, & the New Zealanders had an easy job as only about 20 Turks were left in camp & the remainder (about 200) made good their escape; The Turkish casualties in camp were 18 killed 3 wounded & 3 taken\n\n \n31-5-16\n\nprisoners, it is said the aeroplane dropped some bombs on the retreating Turks; At 11.30 we left for Oghratina & arrived there at 1 oclock, had dinner & fed & watered the horses & left Oghratina at 4 oclock for camp & had a good trip in; Most of the lads have had a lot of outpost duty & guards & fatigues since leaving camp the night before last & have had practically no time for sleeping & are about knocked up, but I have rather enjoyed the trip. We arrived in camp at 8.30 had tea & bully beef before getting to bed\n","76":"\n\nThurs 1st\n\nHad quite an exciting time this morning which put more life into us than a days sleep; Reveille at 3.30 as usual & had finished doing stables & waiting for the cooks to sing out for the mess orderlies for breakfast when the burr of an aeroplane was heard\n\n \n1-6-16\n\ncoming from the south very high up. We have never seen an enemy plane here & thought it was our own plane returning after an early morning fly scouting, but one glance at her dove tail convinced me she was a Taube & was out for revenge & there was a rush to get our horses away from the horse lines, & it was remarkable how soon they were clear & we were scattering out onto the desert;\n\nThe early morning sun showed out every mark on the Taube soon after she was sighted & gave us fair warning; our anti-aircraft gun opened fire on her just as she was coming over our camp, but she was much too high to hope to hurt her. the first bomb dropped within a few feet of the wireless plant, the second in Brigade Head Quarters, the third in the horse lines of the 2nd & 3rd Regt. who suffered heavily in horse flesh as they did not take their horses off the lines; The fourth & fifth were dropped amongst our best horses\n\n \n1-6-16\n\nbut only killed one of ours although they dropped within a few yards of some of them & there was some very amusing incidents as both men & horses were knocked down from the shock & as some were mounted there were some comical spills; Reid led the pack horse off the lines & I took both his horse & my own, but had to let Reid’s go early in the game & had an interesting time holding my own as none of the horses had bridles on, but were led from the head stalls & scores of horses soon got free & stampeded across the desert;\n\nThe sixth & seventh bombs were dropped close to the anti-aircraft gun but did not get a bully; The eighth bomb also fell amongst the 2nd & 3rd Regts & was the last & the Taube then made off & we returned to our lines to find 4 horses between us & the wireless that were wounded in the 2nd Regt & managed to go a few yards before dropping were being finished off with bullets; We had breakfast & then\n\n \nheard the wireless had been put out of action & our casualties were officers killed 1, wounded 3, other ranks killed 7, wounded 30, horses killed 37; Some of the horses that got away returned soon after breakfast & some men were sent out to wheel them back again; The bomb dropping was the best I have ever seen for accuracy & was from a great height, every bomb exploded but they sank well into the soft sand before exploding which affected their destructive power a lot as there were hardly any splinters flying & anyone ten yards from where the bomb dropped were pretty safe;\n\nOur aeroplane flew over at 8.30 & dropped a message to Bde H.Q; It is said our plane was out visiting the Turks when the Taube paid us a visit; It was quite easy to pick out the lads who have not yet been in action, & they say they do not want to have anything more to do with aeroplane fighting out they will find it nothing compared to\n\n \n1-6-16\n\nmachine guns & shrapnel; One man mounted had to lead 2 horses into the shade of palms at 9 oclock & all the horses in the Regt had to go till dinner time; Burial parties were told off this morning to dig graves & teams of 4 camels on to each horse, were busy today dragging the dead horses away; Paid tonight\n","77":"\n\nReceived word from Port Said this morning that the Taube that caused the stir here yesterday was brought down by the naval anti-aircraft guns; We were warned to go to Qatia this morning at 4 oclock but the order was cancelled & at stand to arms we took up positions in hollows just away from the camp in extended order; Nothing unusual during the day & we received orders at 5 oclock this evening\n\n \nto go on outpost duty tonight; We were on No 1 Post & had to run a wire out from the line to the Pinnacle an official message came through this evening saying 12 of our aeroplanes made a raid on the Turkish camps & camel trains this morning to even up the score against the Taube attack, a number of horses are still away, and men are out after them; A canteen was erected today & opens tonight.\n","78":"\n\nSat 3rd\n\nHad a quiet time last night on outpost duty & there was a rush for the canteen as soon as we were dismissed but were too late as they were bought right out of eatables last night by the men left in camp, but I spent £1 in tobacco cigarettes & lead pencils; The canteen is run by the Y.M.C.A. & Alf James from Lithgow is in charge of it\n\n \n3-6-16\n\n& has gone into Kantara today to get another supply of tinned fruits & fish etc. A telephone line is in the course of erection to Qatia & a well is being sunk at Hod-El-Sagia & we think a Regt shall soon go to Qatia to camp; Capt White (Adj) has been sent away with a sceptic leg; \n\nWhen we were out to meet the Turks a few days ago we caught a stray mule, & a few weeks ago, we caught a horse that escaped being hit when the Tommies were cut up at Qatia or Oghratina, he was very poor, as it was practically impossible for him to get water during the 5 or 6 weeks he was on the desert, he is picking up fast & has been given to the Interpreter; 6 or 7 horses were led in this morning & were half dead for the want of water, we still have a few missing; We saw plenty of dead Turks & Tommies around Oghratina they had been buried very shallow & the wind had blown the sand off them\n\n \n4-6-16\n\nSun 4th\n\nToday C Sqd is on inline piquet & we went into a clump of palms close by the main watering troughs & put the day in there. I believe the New Zealanders find an inline piquet daily to guard the back of our position & the 1st L.H.Bde find one for the front. they are mainly precautionary measures against aeroplane raids & we are there ready to catch any horses that break loose; \n\n6,000 Infantry came out to Railhead a few days ago & are busy at present making a strong post on one of the sand rises about 3 mile from where we are camped, so it looks as though we shall soon have to push on; These strong posts are only trenches dug around the top of the hill & barbed wire entanglements built around it & are practically impregnable to infantry attacks as all strong posts are defended with machine guns;\n\nWe got back to camp tonight at 7 oclock; The 3rd L.H. Regt shifted camp yesterday into\n\n \na different \"basin\" as they found it did not pay to have the Regts’ too close together when attacked by aeroplanes, previously the 2nd & 3rd Regts were in the same basin & made a good target for bomb dropping & that was the reason the","79":" L.H. had no casualties a few days ago \n\nSand flies are very bad & give both horses & men a rough time here\n","80":"\n\nMon 5th\n\nThis morning at 4 oclock A Troop went to Hill 110 & I also went & Les & Reidy had to work telephone station from above water troughs, had a good bit of work to do this morning as I had 3 stations going pretty regular & came in at one oclock; Les & Reid are on till dark; Bob Butter was transferred from the 6th to this Regt. & arrived today; Divisional Head Quarters also came here today & a fatigue party from this Regt had to go & pitch their tents; \n\nReceived an account of battle in North Sea today saying 14 English & 13 \n\n \n\n \n5-6-16\n\nGerman boats were sunk. This morning Les heard rifle & machine gun fire on the coast to the north east of camp & as a patrol of one Corporal & 8 men had not returned he reported it to Brigade & received some very sarcastic remarks from Major Chisholm for his pains. Chisholm told him he had noises in his head but a Sqd of 2nd Regt were sent out to investigate & found it was the infantry at practice\n","81":"\n\nTue 6th\n\nThis morning Les reported Major Chisholm to Major Granville who said he would take the case to the Brigadier & that Les had done right to report as he did; Fatigues are very constant here & a man is lucky if he does not get a turn twice a day; & today trench-digging has started to consolidate the night outpost; This morning a Taube came in as far as Qatia scouting; Tonight C Sqd goes on outpost duty at 6 oclock\n\n ","82":"\n\nWed 7th\n\nLast night I was kept busy till 10 oclock as the post (No 1) had been shifted out ½ a mile. I connected onto a line running within a couple of hundred yards of the post & found it was a dead line, so had to go back to another & after connecting up found the line was broken somewhere & had some difficulty finding the break; \n\nThis morning at 8 oclock Les, Reid & I went to Bde. H.Q. for telephone instruction, but learnt nothing I did not know before, but heard the naval battle had turned out very well on the English side & that the Australians had very heavy casualties at Verdun;\n\nThe Taube came as far as Oghratina this morning & it is rumored Samson is coming here with a big war-plane; Samson is rather a dare-devil & was idolised on the Peninsular\n\n ","83":"\n\nThurs 8th\n\nHeard today that the Russians have scored a victory; also that Lord Kitchener & his staff had gone down on H.M.S. Hampshire & no one saved stiff luck for K. but nobody here thinks it will affect the war much; received a few remounts today to make up our strength of horses; \n\nA good many men have been caught asleep on duty lately, & Major Granville lined the N.C.O’s up today & told us to try to stop it, as the next case brought before him would have to be dealt with harshly; One night coming back from Qatia our Camel Transport & a guard came right into camp through the 3rd L.H.R. outposts without being challenged\n\nTrench digging progresses & fatigues appear to have no end; It is reported the Turks have given us 24 hours to move the hospital.\n\n ","84":"\n\nFri 9th\n\nReceived orders today to be ready to leave at 4 oclock tomorrow morning to raid another Turkish camp; Were issued with iron rations this evening & I went to the Y.M.C.A a couple of times to see if any eatables had arrived but there was nothing but smokes & we were busy this evening getting things ready to move\n","85":"\n\nSat 10th\n\nWe were called at 2 oclock this morning & fed the horses. had breakfast & had to bustle to get on parade; The 1st Bde of L.H. & a \nSqd\n Regt of New Zealanders left Romani at 3.30 A.M. & watered our horses at Qatia about 6.30, & soon after leaving Qatia our plane flew over us & dropped a message, & the went on scouting; We arrived at Hod. El. Sagia at 11 oclock & fed & watered our horses & rested for the remainder of the day, the water supply here is\n\n \n10-6-16\n\nnot too good all the water being too salty for the horses to drink with the exception of one hole, & a supply from this is very small; all these villages are composed of a clump of palm groves with a few Bedouin \nvillages\n shelters erected with palm leaves\n\nWe are to leave here tonight at 8 oclock had a good supply of fresh water turned on this evening brought along on camels\n","86":"\n\nSun 11th\n\nLeft Hod-El-Sagia at 8 oclock last night & travelled \nall\n over the steep soft sand ridges & pulled up at 3 oclock this morning in a thick fog, & Major Anderson (6th LH) who was sent out to guide us to the Turkish Outpost was unable to get his bearings, & all we knew was that we were within a mile or two of the Outpost & had to wait ready for anything that might crop up till the fog lifted; this upset all the plans as it was\n\n \nintended to attack at daybreak, & we had to wait till 8 oclock & the sun was high before the fog lifted enough to find out where we were. C Sqd was the advance party & as the Bde started to head for home we scouted out to the north a mile or two; Mick O’Donnell & Lucas were scouts & decided to have a spell at one point till the troop got closer. Lucas dismounted & a bullet went mighty close to O’Donnells head;\n\nThe Turks hidden behind the mounds of green hillocks instead of waiting till the troop came right up to them fired on the scouts at 500 yards but did not score a hit, the scouts cantered back to the troop who dismounted for action & in a few minutes the whole of C. Sqd was exchanging shots with the Turks at 1000 yards; \n\nMurghar Macks troop (A Sqd) was sent back to try & get behind them, but the only good he could do was to exchange shots with a few Turks who were out to protect the flank, Macks horse was hit just above the knee, but it was\n\n \nonly a flesh wound & brought back with a bandage on, \n\na few hundred yards from here is a clump of palms with several wells, but the horses would not drink any as it was very bad. these wells were filled in while the rest of the troops kept the Turks at a distance our horses had had enough & although Major Granville was talking of attacking them the horses could not do the work, & we left them at 1 oclock as all the other troops were well on their way back. \n\nWe came back to Oghratina with horses & men very tired & thirsty as the day was very hot, & although everyone made the bottle of water go as far as they could they were dry long before we reached Oghratina; we arrived here about sundown & received plenty of fresh water for ourselves, & after watering & feeding the horses had only half an hour to make a drink of tea & saddle up, & feeling much refreshed started for Romani arriving in camp at 12.30 tonight with knocked up remounts as they were too soft to stand the\n\n \n11-6-16\n\nwork against the hardened horses; I was told yesterday by Major Smith that I have been promoted to Sergeant Signaller; Nelson has his commission, & Les is to be C Sqd Cpl & Winterton has been promoted to Cpl over A Sqd Sigs. \n\nmade a drink of tea tonight with the \"primus\" before turning in\n","87":"\n\nMon 12th\n\n\"Stand to Arms\" again at 3.30 this morning & went to the canteen soon after breakfast & secured some fruit, also a fresh supply of sardines as they are handy to take out on any \"stunts\" & soon after coming back we had aTaube scare but the plane turned out to be our own; Two Taubes came over the camp yesterday & found us out, so dropped a few bombs on Rail Head & then gave Hill 70 a visit, wounding two Tommies there, that was all the damage they did. had a sleep till dinner time & took over Head Quarters this afternoon from Nelson\n\n ","88":"\n\nTue 13th\n\nThis morning an aeroplane Sgd visited the Turks & it is reported they bombed the Turkish aerodrome; One of our planes also gave us a small scare as she was coming from towards Kantara flying exceptionally high. when right above she commenced some fancy tumbling acts & then drop straight down a few hundred feet regain its equilibrium & start some fresh antics; Everyone agreed that it must have been Samson in his war-plane, & we received word later during the day saying it was him; He has a steel rammer on the front of his machine & boasts he will bring down the first enemy plane he sees;\n\nThe 3rd L.H.Regt came across a Turkish patrol of 7 men on camels last Sunday & managed to wound two camels & men & brought them in; One of the Turks had his arm amputated today as it was shattered. The other was wounded rather badly through the leg\n\n ","89":"\n\nWed 14th\n\nI now live with R.S.M. James & Armorer Sgt. Linsell & am in charge of all Head Quarters during stables & on parades; Nelson has received 4 days leave to go to Cairo to get fitted up with clothes & kit; We received orders this evening to be ready to move out at midnight;\n","90":"\n\nThurs 15th\n\nI had no sleep at all last night as I was busy seeing that all the signalling gear was OK & we had to be saddled ready to file on to the parade ground at 11.30, & as James’ batman brought along a drink of tea at 10.30 I was kept going. no pack horses were allowed to go;\n\nWe arrived at Oghratina soon after daybreak & settled down for the day, putting in most of the time looking after the horses &\n\n \n15-6-16\n\nsleeping; A telegraph line runs through Qatia, Oghratina, Hod-El-Debabis & it is said goes through to Jerusalem. we use this line when it suits us probably the Turks do the same. & that accounts for numerous breaks in the line & the line is kept in perfect order from Debakis in our side of the country & we make sure it is cut on the eastern side of where we are speaking to prevent the Turks hearing us;\n\nWe leave here at 10.30 tonight to proceed to Bir-El-Abd about 6 miles east of Debabis where our aeroplane reports Turks are camped, & I received orders this evening from Capt Downing to repair the line as we go, & get into communication as soon as we arrive, with Bde H.Q which will be at Debabis; The wells here have been greatly improved & watered all the horses of the Bde without much delay \n\n ","91":"\n\nFri 16th\n\nHad plenty of work to keep me occupied during the last two miles going to Bir-El-Abd this morning as the line was cut in several places & on the ground in others, but managed to get to Bir-El-Abd within 10 minutes after the arrival of the Regt to find the Turks had made themselves scarce again as usual;\n\nI connected the phone after cutting the wire again to the east of us & sent a message through to Bde & shortly after we received a message to come in; \n\nOn our way in we passed the 2nd Regt on its way out. We arrived back at Oghratina at midday, spelled our horses till 4.30 PM & then came back to camp arriving here at 10 oclock as all the Sigs are about knocked up I have gone on duty till midnight The last time we went out after the Turks they followed us back to within a few miles\n\n ","92":"\n\nSat 17th\n\nTook a borrowed reel of wire back to the 3rd Regt this morning & then slept till dinner time; the midday stables have been put back an hour from 12 oclock to 11 AM but it did not affect me today as I arranged with Sgt Brown to take charge of stables so that I could sleep till 12 oclock & had nothing to do this evening\n","93":"\n\nSun 18th\n\nChurch parade this morning; At 5.30 an aeroplane Sqdn (12 planes) flew over us heavily loaded with bombs they returned at 11 oclock & reported they had dropped 88 bombs on El Arish destroying two Taubes & doing a large amount of other damage; \n\nNelson turned up from Cairo this morning looking brand new \n\nThe first report of the aeroplane raid said we had lost 3 planes in the raid.\n\n \n18-6-16\n\nOne fell in the sea near El-Arish & the plane was towed ashore & burned one of the other planes brought the aviator back, the second came down 5 miles this side of El-Arish the aviator of this machine was also brought back by another plane & the 3rd with the Flight Commandant on board was missing no one knowing what happened to him, but a later report from Kantana said 10 planes had returned & the plane reported missing had turned up\n\nCharlie Linsell received 3 days leave to go to Alexandria last Thursday to see his father who is going to England, he returned today.\n\nThe Tommies here cannot stand the work too well on the desert & give us a good deal of kid stakes for the amount we are doing. There is a very popular rumor afloat that we shall soon go to England but it is one of many; Leask arrived back from the School of Instruction a few days ago.\n\n ","94":"\n\nMon 19th\n\nNothing but the general routine stables etc. today & put in the day doing nothing as usual; The rumor that we are going to England shortly is getting very popular, & it is said we are to be relieved shortly to go to Mex Camp Alexandria for a spell; \n\nI heard Capt White has been given the Military Cross (no one knows what for) Major Granville has received the D.S.O. & although a good brave man, I do not think he has as much right to it as plenty of men on the Peninsular; Major Vernon also received a D.S.O. & everyone agreed that for the time he was on the Peninsular he was the most scared & frightened man in the Regt, he could not sleep during the nights & did not reign long before his health broke down & he was sent away & the whole of the 1st L.H. was pleased to see him go, he was a gentleman, but not\n\n \na decent apology for a soldier where the lead is flying although he is good in a peace camp, but why he should get a D.S.O. has everyone beat; Still everyone knows that the man who earns honors very rarely gets them & then the Regt is asked to supply a dozen names for Christmas Honors or something of the kind & then it is nearly always the names of men who were friends of the heads & the dozen names goes in whether they have earned honors or not.\n","95":"\n\nTue 20th\n\nWe are to leave here at 3 oclock tomorrow morning on another trip after Turks; B Sqd horses are not too good & a good many are to be left behind, all the horses are falling away in condition as the water in these wells is getting more salty every day. the horses drink & eat very little; Major Irwin came out today on a visit; busy this evening preparing for the coming trip\n\n \n21-6-16\n\nWed 21st\n\nWe left Romani at 2.30 this morning & had a decent trip to Oghratina arriving at 8.30 & made ourselves as comfortable as the heat would allow in the shade of the palms; We are expecting a message all day from a scout aeroplane that went out this morning, but none came & we received a message per phone at 5.30 saying the scout was missing & another plane was coming out to look for her but only came as far as Qatia & dropped a message to the N.Z. troops there saying she could not go further as it was getting too dark & then went back to Romani for the night; Today has been one of the hottest we have yet had\n\nThe 3rd Regt is the advance party this time & went on to Debabis this morning; A good many lads have been going into hospital lately & 8 were sent back to Romani with the Camel transports this evening\n\n \n22-6-16\n\nThurs 22nd\n\nLast night at 9 oclock we left Oghratina & arrived at Debabis at midnight. The 3rd Regt had left early during the night & were going through Bir-El-Abd where they expected to meet the Turks, but the Turks had gone & the 3rd arrived back at Debabis at 10 oclock this morning with two Bedouin prisoners who assert they were our own agents sent out by the English Intelligence Department to visit El-Arish to find out the strength of Turkish troops stationed there & were allowed 15 days for the journey. they had passes written in English but as their photographs were not on their passes they were brought back\n\nafter arriving at Debabis we had to stand by our horses till the 3rd Regt returned in case of an attack, but as soon as they returned we commenced watering & feeding our horses, but the last had not finished watering when we received a message to push on to Bir-El-Abd as word had come through that the scout plane had been located N.W. of Bir-El-Abd\n\n \n22-6-16\n\na strong force of Turkish Infantry were only a few miles further on\n\n& we were to try & rescue the aviator; Any man who did not feel equal to the journey was told to fall out but there was no reponse & after waiting out in the hot sun till two oclock waiting for fresh water we started for Bir-El-Abd with only half a bottle of water each, we also took an ambulance cart to bring back the aviator (if we could find him) & engine & main\n\n parts of the plane, we had orders not to touch our water bottles till we got to Bir-El-Abd & here we found the water in the cemented well drinkable & we had a good blow out. as we were coming into Bir-El-Abd a patrol of 9 Turks were seen going out of it but did not wait to argue with us, they were mounted on camels; \n\nThe 1st & 2nd Regt were together till we got to Bir-El-Abd (the 3rd staying at Debabis) here we parted the 2nd going S.E. & the first going N.E. & had only gone 3 or 4 miles when one of our planes came on the scene & put in till nearly sundown hovering around looking for the\n\n ","96":"\n\nfallen machine & at last dropped us a message saying she had failed to locate the machine, & then headed due west for home; We at once commenced to signal her message to Bde H.Q. but were only half way through it when the plane returned & flying within 20 feet of the ground dropped a bag of tools with a note in it saying he had located the machine to the west of us & to watch for his smoke bomb signals. we cancelled the message to Bde & sent another, that the machine was located & watched the aviator drop the smoke bombs above where the wrecked plane was, & then started off to find her.\n\nthe sun was now disappearing & we thought she was closer than she was, & after travelling 4 miles the Brigadier (Meredith) caught up to us, & as it was dusk & very rough country the Brig. said the search would have to be postponed & to make for Debabis, the Brig then made back & the advance party were called in & we found they had just come up to the plane & discovered two Bedouin chiefs with it they were taken prisoners & we could do nothing \n\n \n22-6-16\n\nto the plane in the dark Major Smith & a troop were left to take the bearings of the plane & the rest of the Regt started for Debabis tired but satisfied. we soon encountered the hills that we could not go over which threw us off our course & then a bog got in our way, which meant a mile ride to the west to get round it, & by midnight the officers leading came to the conclusion they were lost. the night was hot, & our bottles dry & a good many lads mouths were parched for the want of water, & they were dropping off to sleep as they rode along; \nat 1.30 a halt was called\n\n23-6-16\n\nFri 23rd\n\nAt 1.30 this morning a halt was called & six volunteers were called who felt confident they could find the camp. these came without hesitation & they set out in pairs, while Richardson (Sig) myself, Major Granville & Capt Harris started off due south to find the telephone line, & we struck it within half a mile from where we halted & only\n\n \n23-6-16\n\na few hundred yards from Oghratina Camp. I connected onto the wire & reported to Debabis that we were at Oghratina. Richardson & I went on into Camp arriving there a few minutes before the Regt & had our horses watered before the Regt arrived at 2.30 this morning. all the horse feed & rations had been sent on to Debabis but fortunately a few fantasies of water had been left at Oghratina & we were all allowed as much water as we could drink, tied our horses up & dropped off to sleep just as the sky began to get light in the east; \n\nrose again at 6 oclock as rations fodder & water had been hurried over to us & after a drink of tea & breakfast of bully & biscuits we felt new men & dropped off to sleep again; The 2nd Regt & Bde H.Q. arrived at Oghratina from Debabis at 2 oclock this afternoon; & rested till 6 oclock; Major Smith & his troop got to Debabis at 12 oclock last night & went out to the plane again this morning \nbringing\n brought back the engine & any parts of value & fired the rest; The aviator turned\n\n \nup at Debabis yesterday afternoon as he made a line for Debabis soon after he landed, his engine had gone wrong which compelled him to land & his propellor broke when the plane hit the ground but he was not hurt\n\nAt 6 oclock this evening the 1st (?) & 2nd Regt left Oghratina & started home, when we first came here no smoking was allowed coming home from Oghratina during the night time but no objections had been raised on the last 2 or 3 trips & tonight the boys commenced singing soon after leaving Oghratina & popular songs were kept going till we arrived at Romani at 10 oclock\n\ntonight the boys were in good spirits all the way & finished up a very trying trip without a grumble from anyone; The 2nd ","97":" Regts’ horses are much worse that our & they lost a good many on the trip, we managed to go through without losing any, although practically every horse was knocked up when we got into Oghratina this morning; the weather has been exceptionally hot during the last few days\n\n ","98":"\n","99":"\n\nReceived a parcel from home today & I could not have arrived at a more convenient time & is quite a luxury after bully beef & biscuits I went to the canteen this morning & managed to get a few tins of fruit & half dozen lemons at 2d each so should live well for a day or two; An order came through today asking for a report on the state of the men but do not know what the reply was, a good many have been going away weak & sick, but practically all of us still have a kick left & can carry on. but we would be better for a months spell if it could be done at all.\n\nYesterday a party of Worcestershire Yeomanry went to Oghratina to bury the dead Tommies lying about there & the officer in charge of the party recognised his own brother among the dead by a scarf round his neck with his name on it.\n\n ","100":"\n\nSun 25th\n\nChurch Service again this morning at 6.30, had nothing to do all day but the general routine of stables etc; A good many lads are getting sick & going to the Field Hospital, but most of the lads are looking well on it; Caban HQ Sig went into the School of Instruction at Zeitoun today, also 8 men for machine gun instruction.\n","101":"\n\nMon 26th\n\nSome fine rumors have been started here during the last day or two, the best one came out today saying it is rumored that the Kaiser has committed suicide & we shall get news within 24 hours that will startle the world. Nothing out of the ordinary has happened today & we are having a fairly easy time at present but the weather is rather warm\n\n ","102":"\n\nTue 27th\n\nSoon after breakfast this morning a Taube passed over us making towards Hill 70 & Kantana. light clouds were in the sky & we only caught sight of her for a few seconds, but reported it through & a few minutes later we could hear her coming back again, & received orders to stand to our horses we got them off the lines pretty lively, & could hear two planes but could see neither as they were high above the clouds shortly after we caught sight of our large battle plane coming down in circles, apparently the Taube decided to retire when she caught sight of our plane & did not wait to drop any eggs;\n\nI took a walk over to the Field Ambulance soon after to have one of my teeth filled & was given an appointment for next Monday arrived back in camp in time to start off to mend the telephone line to Bde, then it was time for stables; Had nothing to do this afternoon\n\n ","103":"\n\nWed 28th\n\nReceived a message last night saying our battle plane would be over us at 6.30 this morning she arrived alright & proceeded out into the desert scouting; about 7 oclock a Taube was sighted coming down the coast & we had not got all the horses off the lines before she was over us but she did not take any notice of us, & made toward Hill 70 \n\nwe filed out in extended order & awaited for her return, & only had a few minutes to wait as we soon saw the Taube & one of our own machines manouvring for positions, & then the Taube made a run for home & our machine after her. they were fairly close together as they came over us & both machines had their machine guns to work, & they were still at it when they looked like two specks in the sky but the Taube seemed to have gained a little, although she seemed to be flying lower, it was rather\n\n \n28-6-16\n\nexciting to watch, but all regretted that it was one of our small planes instead of the battle ‘plane taking part. Our plane returned \nlater\n some time later & only just managed to reach Railhead as she got a bullet through her petrol tank. \n\nthe aviator said the Taube had too much pace for him & he could not cut her off; The big battle ‘plane arrived back about half an hour after the fun had finished; \n\nMost of the men manning the anti-air-craft guns opened fire on the Taube as soon as they came in range & riddled the wings on our own ‘plane which was close behind & our aviator says that accounted for his falling off in speed. the gunners were reprimanded for firing when our own machine was so close;\n\nStaff Sergt. Stevenson (Harry) arrived today to go through the books, trying to trace some men that have been missing since we were on the Peninsula\n\n ","104":"\n\nThurs 29th\n\nYesterday afternoon & this morning a good deal of artillery firing could be heard, apparently a Battery at Hill 70 practicing;\n\nAll the men from A & C Sqdn’s were on Outpost last night & have to go on again tonight, as most of the troops from here are out on a \"jaunt\" B Sqd left here for Katia at 4 oclock this morning;\n\nIt is said that the New South Wales mail went on to France instead of being dropped at \nAlexa\n Port Said\n\nI get a fair amount of work here repairing lines & ‘phones, & the last couple of days fixing up the Nominal Roll & have to put in a marching out state every day\n\nHarry Stevenson left at dinner time today for Duedar. \n\nB Sqd returned tonight with a lame camel they found between Qatia & Oghratina\n\n ","105":"\n","106":"\n\nEveryone in camp is getting work finding Outposts etc. while the troops are on the jaunt & most of the men are on Outpost duty every night besides doing fatigues during the day; We received a message this afternoon to \"stand to our horses\" by ‘phone as a Taube had been reported & a few minutes later our battleplane accompanied by a scout was over us. it is marvellous how soon after an alarm the planes are scouting over us, but no enemy planes came our way today;\n\nAlf James of the YMCA is trying to start boxing tournaments going for the Championship of the Brigade & there should be some good exhibitions as some very decent boxers are among the troops here\n\nthe 6th & 7th L.H. Regts have been out here a few days now they relieved the New Zealanders\n\n ","107":"\n\nSat 1st\n\nThe 3rd, 6th & 7th Regts returned today from their jaunt to Bir-El-Abd & they did not get in touch with any of the enemy; The formation for the railway line is now out some miles in front of this camp (Romani) & the work is going along lively, Strong posts have also been made of any hills here that will be of any value in case we are attacked; Nothing out of the ordinary happened today.\n","108":"\n\nSun 2nd\n\nChurch Service again this morning & nothing out of the ordinary happened today; Tonight Batty (Lt) raided the two-up school & took several names; Too much gambling goes on in camp & it would be better if it was cut out altogether\n\n \n3-7-16\n\nMon 3rd\n\nWent to the Field Amb. this morning & had one tooth out & had two filled & arrived back in camp just in time for dinner; A paper was brought over at dinner time for James & I to sign, it was an application for a Commission in Artillery & sent to us by the Adjutant, but I suppose it will be the same as the other applications & will hear no more about it, only six of us have been given the chance to apply this time; \n\nAlf James who is in charge of the YMCA has been trying to arrange boxing championships for the 1st L.H.Bde, the order came to the Orderly Room here, but was not put before the men & a reply sent back saying the 1st L.H.R. would not compete; James told me later that he had a reply from the Adj saying there would not be any competitors from the 1st L.H.R. I contradicted it, & said I\n\n ","109":"\n\nwould compete for the middleweight & also found that a featherweight, a lightweight & a heavy weight would also box in their class; James then went to the Brigadier who promised him he would call a meeting of the officers & see if they would subscribe to trophies for the winners in each class & it now looks as though the tournaments are likely to come off shortly as the Brig. said he would do all in his power towards it; Several lads of the 3rd Regt have also promised to have a go for the Championship.\n\nJames came over to this Regt tonight to see the Adjutant in reference to the boxing & it was decided that I am to receive nominations & look after anything in reference to it in this Regt. he was delighted at the willing manner in which Major Granville & Capt Weir agreed to all of his suggestions & I have had orders to supply him with a horse anytime he requires one\n\n ","110":"\n\nTue 4th\n\nReference was made on orders this morning to the coming boxing tournament & seven men nominated today; \n\nA patrol of 6th & 7th L.H. saw a patrol of Turks leaving Oghratina today when they were out on duty; A strong rumor is current amongst the officers that Romani will be attacked by the Turks before long but none of the lads will listen to it, & we all hope they do, as the country around here now is well fortified every sand hill is a \"strong post\" & practically impregnable against infantry & it is impossible to bring heavy guns across the desert, the railway line now runs well ahead of this camp & we think we shall soon have to make a camp at Oghratina leaving the English troops here to protect Romani; \n\nPut tonight in at the Y.M.C.A. singing hymns & James gave a short address\n\n ","111":"\n\nWed 5th\n\nNothing of any consequence happened today & there appears to be a good gathering at the YMCA tonight by the noise the lads are kicking up singing hymns & I am busy writing to Edie T.\n","112":"\n\nThurs 6th\n\nWhile doing stables this morning Sig Law called me to say the line was disconnected & I started off to fix it, but as the wires were all tangled up & there was loose ends everywhere where our line was broke I could not locate the right one & arrived back late for breakfast after putting a T onto the 3rd L.H. line\n\nI had just finished breakfast when a Taube was sighted & we had orders to file out, I saddled up & took a phone (out of order) to Brigade\n\n \n6-7-16\n\nreceived another in its place, & on my way back found the broken line to Bde & joined it up again\n\nThe Taube apparently was only taking bearings & did not drop any bombs but made back home shortly afterwards two of our machines showed up, but the Taube was then out of sight, our planes did not get out as slick as they generally do; \n\nI paid James a visit on my back from Bde & he snapped my horse (Mamoon) having a drink of lime juice over the canteen counter out of a mug; We have decided to commence to build the stadium this evening. I have a small sore on my left elbow which is getting rather bad. Septic sets in very easy here & any scratches requires attention; Maj. Mills has been send back to Details & is to be in charge of Bouble Sqd. now forming up, & Maj Irwin is 2nd in Command of this Regt.\n\n \n7-7-16\n\nFri 7th\n\nLast night a dozen lads from this Regt went over to the YMCA & commenced to build the stadium, afterwards had a few songs & then came back to bed; At 9.30 this morning we had to take all our horses to Railhead to give them a drink of fresh water as there was some over in a large tank which they wanted emptied. water is laid on to Railhead from Katara:\n\nNatives are busy at present here making strong posts on all the sand hills & as we have hundreds constantly on the go they get through a good deal of work; It appears that the natives have been taken off the railway for the time being. Put in an hour again this evening on the stadium\n\n \n8-7-16\n\nSat 8th\n\nPut in all our spare time today sleeping as we are going out on a \"stunt\" at 10.30 tonight. busy after tea getting gear in order for the trip; The 2nd Bde have been out a couple of days. they are going as far as Bir Hamesieh\n\nJames came over tonight & is dining with the officers;\n\nTed Mills (Sig Sgt) came out today from the Detail Camp at Tel-El-Kebir to have a look at us & as Jimmy Leask is off duty with a sore foot Mills is going out with us tonight in charge of B. Sqd Sigs; General Chauvel is coming out with us tonight & we are only going as far as Oghratina; Mills is very anxious to get back to the Regt. again\n\n \n9-7-16\n\nSun 9th\n\nWe filed on to the parade ground up to time last night, & at 11 oclock the Bde (minus 3rd Regt) started for Oghratina had a good trip as the night was cool, & arrived at Oghratina at daylight this morning & soon after heard 3 aeroplane bombs go off a long way out. (apparently the 2nd had got somewhere near the enemy) \n\nWe fed & watered our horses, had breakfast, & commenced our return journey at 10.30 this morning & arrived back in camp at 3.30 this afternoon, a cool breeze was blowing from the sea & the ride was not uncomfortable; \n\nI asked Mills what he thought of the trip when he got back & he said he will be much more contented as Sig Sergeant in the detail camp after & is not a anxious to get back to the Regt as he was.\n\n \n10-7-16\n\nMon 10th\n\nMills went back to Tel-El-Kebir this morning; It is rumored the 6th L.H. got 3 prisoners yesterday two of them wounded, the 6th came on to the enemy & should have drove them on to the 7th Regt. but the 7th were not in position & blame the 6th for starting too early; Nothing out of the ordinary took place today.\n\n11-7-16\n\nTue 11th\n\nA Taube came over this morning at 10.30 & had us leading our horses on to the parade ground again but she did not visit us for long & did not interfere with us a couple of shots were fired at her from a mountain battery & a few of the machine guns also gave her a few shots but she did not come close enough to be in much danger; Our\n\n \n11-7-16\n\nmachine guns went to Bde today & we are to be issued with Lewis guns in their place to take out with us, the machine guns will be fixtures in the strong Posts here; A message came through this morning asking for officers to join the Flying Corps as pilots they are to go through a full course, practically all the young officers in this Regt. have put their names in; Only officers are asked for; Jock Davidson (C Sqd Sgt-Major) received his commission today in the Camel Corps\n\n12-7-16\n\nWed 12th\n\nLast night Capt Bennett (3rd Regt) Lieut Booth (2nd) Lieut Nelson (1st) Mr James & I held a meeting in the YMCA & decided the bouts for the Championships were to be only 3 rounds of 2 minutes duration\n\n \n12-7-16\n\nalso decided to commence the tournament next Sat evening at 6 oclock; We received orders at dinner time today to be clear of the lines at 2 oclock to go out on another stunt, & by 3 oclock the Bde was formed up by the water troughs & started for Oghratina. had a good ride as a cool breeze was blowing from the sea, arrived at Oghratina at 7 oclock watered our horses & camped in a dip in the ground out in the open about half a mile from Oghratina\n\n13-7-16\n\nThurs 13th\n\nAt 2 oclock this morning we saddled up & arrived at Debabis by dawn. from here the Regt travelled due south to Hamman extending out in one long line The whole of the Light Horse were\n\n \n13-7-16\n\nextended & the line ran from the coast to 10 miles inland, the 6th & 7th Regts were also out, & we swept the whole of the country in to Oghratina looking for Bedouins Our Brigade only got 4, the 2nd Bde got a few on the coast.\n\nWe arrived back at Oghratina soon after nine oclock & at 3 oclock commenced our journey home arriving here at 7.30;\n\nHad tea & then went to the YMCA to see James, & found his bad leg had broken out & he had to be carried back to his tent in the 2nd Regt. on a stretcher.\n\n14-7-16\n\nFri 14th\n\nWent over to the 2nd Regt this morning to see James & found him in bed had a game of chess with him & then\n\n \n14-7-16\n\nwent down to the water troughs in the palms to get four pieces of angle iron for corner posts for the stadium found they had all been used, but managed to get four pieces of timber from Bde H.Q. this afternoon & put them up after tea; Now that James has gone down to it, I have to arrange for anything we require & am kept going constantly;\n\nTonight I went to James’ tent to help arrange the contests for tomorrow night & found neither the 2nd or 3rd had given any names in so it had to be postponed till the morrow; Our Regt. Sgt. Major (James) has been off color for some time & today went down to it at the latrines & had to be carried back to the tent on a stretcher, he has gastritis, the Adj advised him not to go away sick as there is a vacancy for him with a promotion to Lieutant; McKeowan is acting RSM.\n\n \n15-7-16\n\nSat 15th\n\nThis morning I took a walk over to the 2nd & fixed up the matches for tonight then went to Bde H.Q. to see Capt Hudson about a tarpaulin that was promised for the floor of the ring;\n\nWent to the 3rd Regt. & got ropes & put them up this afternoon, & have been constantly on the go all day to get things in order; feeling rather weary by tea time, & bath after tea freshened me up, went to the stadium & had some good contests on board; \n\nCol Meredith (Brig) acted as timekeeper; Capt Arnold as referee, & three judges, Lt Nelson 1st Lt Booth 2nd & Capt Bernet 3rd; The 1st contest was McKenna 3rd v Currey 1st a win to Curry on points Lord beat his man on points & Jenkins lost his fight after a good go. both these being lightweights; I met Mercer of the 2nd Regt in the middleweights\n\n \n15-7-16\n\n& won all the way, Mercer had a good name in the 2nd as he has won a good many fights through knock-outs but I outboxed him from the start & he could not get a decent punch home.\n\nRepresentatives of the 1st won 3 fights out of 4, so they did not do too bad, all the contests were fast & boxing clean; The only knock-out of the night was scored by Mannion of the 3rd he met one of the 2nd LH men & knocked him out in the 2nd round \n\nhe professes to be the Welterweight Champion of Tasmania; Cunes of this Regt. will meet him next Monday night & I shall meet the winner in the final. Cunes also has a good name here, being runner-up in the Amateur Championship of N.S.W. &says he is confident he can account for Mannion\n\n \n16-7-16\n\nSun 16th\n\nLast night Mr James forgetting today was Sunday said the boxing would be continued tonight & did not notice the mistake before the crowd dispersed & Col Meredith advised him to let it continue as one day was the same as another out here;\n\nChurch Service was well attended this morning. I had a trip to the 2nd Regt just before dinner to fix up the contests for tonight; \n\nThe boxing opened with Jack Cunes & Mannion (3rd) & Mannion won all the way; the second contest was the final of the Featherweights Fred Cunes & Charlie Currey both of the 1st met, the fight was one of the best I have ever seen & the judges could not pick a winner at the end of the 3rd round & another one was ordered, this round was\n\n \n16-7-16\n\nvery fast & even & Cunes got the decision & the Brigadier said he would give a medal to Currey also on account of the closeness of the scoring the majority of the lads say Currey should have got it & I thought so too; \n\nLord (1st) had a very easy win over Mannion 3rd for the final of the Lightweight division, Lord only hit Mannion once & he gave him best. A few lads then gave sparring exhibitions;\n\nA Taube was reported today but did not get this far.\n\n17-7-16\n\nMon 17th\n\nA Taube came over us this morning but dropped no bombs & made off as soon as our plane came on the scene; My left elbow has turned septic & I have kept it painted from the shoulder to the wrist today to keep it from\n\n \n17-7-16\n\ngetting too sore to fight tonight I am looking forward to the contest & feel confident I can win. took a stroll over to the 2nd Regt this morning to see how James was getting on & to stretch my legs; The fight between Mannion & I came on first tonight & we were both there to time, & as soon as I went into the ring to box him I could see he was rather afraid to get close & mix it with me, I forced the boxing all through & in the second round he fouled me with his elbow, but the referee let it pass & I did not appeal, we had only 20 seconds to go to finish the last round (3rd) when he fouled me again & was disqualified, I was rather disgusted as the foul did not do me any damage & I was well ahead on points & a foul is a very unsatisfactory way of winning; It was the final of the \n\n \nMiddleweight Championship so I have won my first tournament;\n\nShand 2nd & Whitney 3rd then met for the heavyweight & Shand knocked Whitney out in one round, neither men could box & Whitney looked very small; as soon as I cooled down after the contest my arm went very stiff & I could not raise it level with my shoulder & came back to the medical tent & had it dressed before going to bed.\n\n18-7-16\n\nTue 18th\n\nWoke up the morning with a touch of influenza, \n\nA Taube flew over us again this morning but made off as soon as she saw our plane coming on the scene & dropped no bombs; Saw James this morning & his leg is pretty bad & goes into the Field Hospital today, & will probably be sent away altogether for a time.\n\n \n19-7-16\n\nWed 19th\n\nBoth my arm & influenza is much better today; The 2nd Brigade went out at 4 oclock this afternoon on another stunt. Our aeroplane dropped us a message this evening saying about 8,000 Turks were camped at Bir-El-Abd & Bir-El-Bayud & had tents & shelters up & were digging trenches & we have been busy making up marching out states & fixing up everything in case we are called out during the night, the 2nd Bde are staying at Quatia tonight instead of Oghratina;\n\nIt was rumored that we were going out next week to destroy the date crops so as the Turks would not be able to use them for food if they decided to attack us later on; About 25 % of the Regt has been sent away sick & very few of the lads left here are fit enough to do much fighting as they are all run down\n\n \n20-7-16\n\nThur 20th\n\nThree of our planes were out early this morning & the big battle ‘plane landed at Railhead. we stood to arms at 3 oclock this morning, & at 7 oclock a message came through saying a patrol of the 2nd Brigade discovered Turks between Quatia & Oghratina the 2nd Brigade opened fire on them at long range as soon as they were discovered & the lads here are impatient for the order to go out & give them a hand, & are very thankful the Turks have come in so close as it will save us long trips before getting into a scrap & we have been in readiness to move out at short notice.\n\nI slept most of the day. 5 of our aeroplanes have been out all day they landed at Railhead at intervals to get a fresh supply of petrol & were\n\n \n20-7-16\n\nup again & out scouting; This afternoon the 2nd Bde received orders to come back within 1½ miles of our strong posts & bivouac for the night; One lad of the 2nd Brigade was shot dead today (through the head) & 10 others wounded; Two Turks were captured today & they say there is 7 Battalion of Turkish troops under 5 German officers & they intend to attack Armadier which is the name of the camp at Railhead right on the coast & which is one of our strongest positions, so we are looking forward to the attack;\n\nIt is asserted that 8000 Troops arrived at Railhead last night & 10,000 more will arrive tonight. B Sqd of the 1st escorted some artillery out this morning but they did not go far Hill 110 I believe, but the planes report that they could not locate the enemy’s main body. We sleep with clothes on tonight & ready to move out at half an hours notice.\n\n \n21-7-16\n\nFri 21st\n\nWas called out at 1 oclock this morning & saddled up & left camp soon after 2 AM, went out of the camp to the south by Kabbit Gannit & had a very slow trip to Qatia. when our scouts arrived there they found a Turk sitting on a bale of tibbin waiting for us to arrive so he could surrender. here we watered our horses & put the day in sleeping under date palms while the 2nd Regt went on & found the Turks in possession of the high ground this side of Oghratina & put the day in exchanging shots at 1000 yards;\n\nTwo artillery guns (18 pounders) arrived at Qatia about midday & went into position at 4 oclock & opened fire on the Turks at 2,000 yards. they fired 18 shells & then came back to camp. C Squadron of 1st Regt went out with the artillery, & relieved the 2nd\n\n ","113":"\n\nRegt, a lad of the 2nd Regt was shot through the temple as he was about to mount to come back & died within an hour or two; \n\nC. Squadron came back to Qatia about 8 oclock tonight & soon afterwards we started for Romani; Major Chambers of the","114":" L.H. took his Squadron to Bir-Es-Sagia today & could see no sign of the Turks, & we decided to water their horses there, & did not put on a guard.\n\nOne of the lads later on had to leave the horses for a few minutes, & only went a few yards when he saw 2 Battalions of Infantry crawling towards them on hands & knees, he walked back to the horses & gave the alarm, & they had to run the gauntlet of the Turkish fire & strange to say no one was hit. As C Sqd was retiring tonight from Oghratina the Turks gave them two shots from an artillery gun, both shots fell short. It was nearly midnight when we got back to Romani\n\n ","115":"\n","116":"\n\nStood to Arms at 2.30 this morning & soon after breakfast a Taube came on the scene & made us stand to our horses, Our large battle ‘plane lost no time in getting up here, but the Taube was flying exceptionally high & did not wait till the battle plane got up, but made back in a hurry;\n\nAt 3 oclock this morning B Sqd (of 1st Regt) left here & patrolled to Hill 110, they captured 5 Turks on the way; The","117":" Brigade of L.H. & the Regt of New Zealanders that are still with us, went out to go to Qatia this morning, but found the Turks were this side of it & they have been having small skirmishes all this morning & captured 7 Turks early this morning.\n\nWe have received orders to keep one horse feed strapped on our saddles, & water bottles filled ready to get out without notice, had orders to be ready to file off at 10 oclock tonight but it is cancelled & we go out after midnight \n\n ","118":"\n","119":"\n\nLeft camp at 1 oclock this morning; C Sqd being the advance guard of the Regt, & the 1st Regt being advance guard of the Brigade; We arrived at Qatia at daybreak; We went straight on towards Sagia to the south of Oghratina, B Sqd sent a patrol to Bir-El-Hamesieh & A Sqd followed the telephone line down from Qatia to Oghratina, a large party of Turks were concealed in a Hod & a Troop of A Sqd rode to within 200 yards of the Turks before they saw them. the Turks opened up a very heavy rifle fire & one machine gun. it was marvellous that every man was not killed but no one was hit, one lad had a hole through his sleeve but was not hit;\n\nOur battle plane was fired on by artillery from Oghratina this morning. Two Taubes came over us again this morning & one battle plane\n\n \nengaged one of the Taubes & brought her down the ‘plane fell into the sea The battle ‘plane was also hit which affected the engine, but the pilot took after the other Taube & chased her as far as Oghratina & then turned to come back to camp, the Taube followed & had the advantage as she was much the higher & the fight continued over Romani Camp & it was good to watch them manouvring but the Albatross had the advantage all through & the battle ‘plane descended as soon as the Albatross made off both men in the battle ‘plane were wounded, one through the arm & the other through the shoulder.\n\nRichardson & Cabban went with A Sqdn today to tap onto the telephone line & keep in touch with Bde HQ at Qatia. Nelson Edwards & I worked a helio station & were going from sunrise\n\n ","120":"\n\ntill sunset, & did not have a minute to spare & must have nearly put up a record for one days work. At 6.30 we retired from our position & went back to Qatia fed & watered our horses & left Qatia at 8.30 on our way home; Two 18 pounders were out with us today & fired 40 shells into Oghratina & we escorted them into camp tonight; It was 11.30 before we finished watering & feeding our horses & were told tonight we would not have to Stand to Arms tomorrow morning\n\n24-7-16\n\nMon 24th\n\nWe rose this morning at 6.30 & had to stand to the horses soon after breakfast as an Albatross ‘plane came over us but she did not wait & only circled over us once; The 2nd Brigade received 4 casualties today as the 7th L.H. had one Signaller killed & 3 Troopers wounded; A large camp of\n\n \n24-7-16\n\nEnglish Infantry has sprung up near Katib Gannit (Pinnacle) within the last couple of days; All enemy ‘planes are referred to here as Taubes but it is seldom we see a Taube now, most of the ‘planes we see now are Albatross ‘planes, & all the enemy planes look faster & neater than ours, & their engines have a much nicer hum\n\n25-7-16\n\n4 Turks were captured today & one of the 3rd L.H.R. wounded through the leg; Left Qatia at 8.30 tonight & arrived back in camp at 11.30\n","121":"\n\nTue 25th\n\nFrank Hobson turned up here on the 20th with a few other Reinforcements; Today 23 more reinforcements came on the scene & 17 horses. Had nothing to do today, but had to stand to our horses once as an enemy ‘plane, (Avatic) paid us a visit, a\n\n \n25-7-16\n\nplane very much after the same pattern as the Albatross came over today from Ismalia she is a Bristol plane & it is said they are the faster planes made; Yesterday evening a report was sent in by the 2nd Bde that the Turks were nearly into the camp but it turned out a false alarm as they were New Zealanders, but the 2nd Regt had orders to get out lively at sundown but were not out long\n","122":"\n\nWed 26th\n\nRose again at midnight & again at 1 oclock this morning started for Qatia again, both 1st & 2nd Regt goes into the firing line today, the","123":" went through Bir-El-Hamisah & took up the same position for a signal station on the hill above Bir-El-Ayish, the Turks were on the\n\n \nhigh ground at Bir-Es-Sagia but we soon hunted them from there back to their trenches. One of our lads got a bullet through his trousers leg & just grazed the flesh, & one of the horses received a bullet through the ear, but no one was hurt;\n\nSkirmishes were frequent during the day at long range but we received no casualties had some good signal practice today as we got through 22 message besides verbal ones, & one of them had 124 words in it. left Bir Ayish at sundown & stopped at Qatia for an hour or two & then came back to camp getting here at 11 oclock & ready for bed at midnight\n","124":"\n\nWed 26th\n\nA couple of Avatiks over today also our Bristol biplane but they did not meet; Large infantry (mostly Scottish) camps are springing up all around us & they are busy sand\n\n ","125":"\n\nbagging along the tops of all the ridges here; I am kept constantly on the go here now & some days cannot find time to write up diary & have made a mistake a couple of days ago. received a tin of ginger crackers from home today. The 2nd Bde had 1 man killed & 3 wounded to day\n","126":"\n\nThurs 27th\n\nLeft camp as usual at 1 oclock & went out through Bir El Hamisah & found the Turks on all the high ground the other side of Qatia but we soon drove them back to their trenches, & the H.Q. Signal Station took up its old position by Bir Ayish some heavy firing went on during the day but we received no casualties &\n\n \n27-7-16\n\ngot back to Qatia just at dark & did not wait to water & feed our horses tonight but came back to camp, we have to escort the artillery back at night & it is slow going & nearly midnight by the time we were ready for bed. had hot stew awaiting us tonight\n\n28-7-16\n\nFri 28th\n\nThe 2nd Brigade found the Turks on the high ground just through Qatia when they went out this morning & had skirmishes all day & drove the Turks back to their trenches around Oghratina & Sagia. The Turks have also entrenched on Hill 245 The 7th Regt received a few casualties today & tonight the 2nd Bde brought in 8 unwounded prisoners & also a few \nalso\n wounded \n","127":" Turks were wounded & captured\n\n ","128":"\n\ndied before they reached Romani. No enemy ‘planes over today for a change.\n\n29-7-16\n\nSat 29th\n\nLeft camp at 2 oclock this morning, & only found one of the 2nd Bde patrols instead of two at Qatia, we found the Turks had entrenched on the hills two miles east of Qatia & we could not get to Bir Ayish. We were kept busy as usual with the helio all day.\n\nOne of A Sqd Sigs found Lieut Pearce shot through the heart at Bir-El-Hamisah; but there were no sign of his three men, these turned up tonight at Hill 70; \n\nThe Turks had machine guns laid everywhere today to trap us. & they had some good targets but do not seem to be able to hit mounted men; Fred\n\n \n\n \n29-7-16\n\nBarrow (B Troop C Sqd) was very unlucky he only returned from England 3 days ago, & was shot through the neck this morning the bullet coming out before the temple. Longworth was wounded through the hip & Peters was wounded & captured by the Turks. our lads could see the Turks dressing his wounds before they took him away.\n\nW. Long (B Sqd Sig) received a slight wound on the wrist & his horse was shot in two places; Rinalde A Sqd was also slightly wounded & Watkins (C Sqd) was wounded & could not be brought in & is reported missing. We did not wait at Qatia on our way home but came straight through & arrived in camp at 11 oclock One of our ‘planes was brought down over Oghratina today by an Avatik\n\n ","129":"\n\nSun 30th\n\nWatkins managed to crawl back from the Turkish lines after dark tonight & was found by the 6th L.H. Regt. this morning & brought into hospital. reports from the Field Anb. state that Barrows wound is not as bad as we feared & all who were wounded yesterday will probably live; We had no enemy planes over today;\n\nThis morning at 4 oclock we had to supply 2 signal stations for Mount Meredith & Mt Royston I sent Leask & Watson, & Edwards & Cabban, a section of men had to go with each station as guard. Life is much better here now as we get from midnight till 6 oclock after coming off a ‘stunt’ instead of standing to Arms at 3 oclock, if the Stand to Arms had not been cut out the men would not have been able to stand it.\n\n \n31-7-16\n\nMon 31st\n\nThe Sigs who went to Mt Royston & Meredith yesterday did not have to come out today but worked the phone in camp, we left at one oclock this morning & found the Turks entrenched within 2 miles of Qatia. The 1st Regt was in reserve today, & we were not allowed to camp in the palms as it was feared the Turks would shell Qatia today, but we watered there & the 1st Regt camped about a mile to the west of Qatia. we had 5 helio stations out & was also in communication with Bde per phone.\n\nAt 9 oclock this morning 3 enemy ‘planes came over the camp & dropped 24 large bombs & hand grenades on various part of the camp & paid particular attention to the strong posts or redoubts & the Tommy\n\n ","130":"\n\ninfantry had 5 men killed & 14 wounded in consequence; The only casualty from rifle fire today was a 2nd L. Horseman slightly wounded. We received orders this evening to be ready to move off at 7 oclock & as we only had 3 or 4 miles to go we should have arrived in camp early, but the main body lost sight of the advance guard & got lost, & it was 12.30 after midnight before we got into camp. there a good stew was waiting us & we were soon asleep; \n\nThis morning a Turk was captured & brought in, when the guard got him to the water trough to water his horse a couple of Indians came down & wanted to cut the Turks throat, they scared the Turk but of course the guard would not consider the proposal\n\n ","131":"\n\nTue 1st\n\nRose at 6 oclock this morning finished stables & was just about to commence breakfast when we received the order to \"stand to our horses\" & shortly afterwards an enemy ‘plane flew over us. apparently she was only out for observation purposes as she dropped no bombs & did not stay long she also came over soon after dinner which meant leading horses off again & at 4 oclock this afternoon 9 of our planes dropped 78 bombs on Oghratina, a Taube chased them into camp after the bombardment;\n\nMonitors also bombarded Oghratina & the aviators say they have altered the looks of Oghratina; The 2nd Bde received several casualties today; Watkins was not wounded a couple of days ago but was cut off & crawled into Qatia through the Turks in the dark\n\n ","132":"\n\nWed 2nd\n\nLeft camp this morning at 2 oclock & found no Turk at Qatia but they were on the same ridge of hills 2 miles east, we took up the same hill for a Sig Station as trip by Bir-El-Mamaluk & our lads were engaging the enemy at 7 oclock right along the line. We had 3 casualties in the 1st Regt all from C Squadron, Law seriously, the other two were wounded bringing Law in;\n\nOur Bristol ‘plane flew over Oghratina this \nmornin\n afternoon & she must have had 100 shells fired at her by anti-air-craft guns & it was marvellous she was not hit. at the same time our battle ‘plane came over Qatie flying very high & got over a Taube before she seen it, the battle ‘plane opened fire & the fight only lasted a few minutes, & the Taube\n\n \nwas brought down; The Monitors opened fire on Oghratina at 9 oclock this morning & kept up a fire at intervals all day; \n\nCpl Lumb med. man showed game today bringing in one of the wounded men\n","133":"\n\nThurs 3rd\n\n3 enemy ‘planes came over this morning, & our Bristol plane was well over them & opened fire on them but his machine gun jammed on him & he got away & came down & was not hurt although he got a couple of bullets through his plane.\n\nA Turkish officer captured yesterday says 27 enemy planes are coming over to pay us a visit tomorrow; I received a birthday parcel from home this morning; We are expecting the Turks to attack here at any time now probably tomorrow morning (the anniversary of the war)\n\n ","134":"\n\nFri 4th\n\nThe second Bde came in about 11 oclock last night & the Turks followed them in, & at midnight we got the alarm & were out in quick time & found the Turks at the entrance to the camp just before daylight our outposts were retiring & fighting their way back; we rode up close to the Turks dismounted for action & were soon in the thick of it just at dawn. \n\nThe Turks were coming up the gully in hundreds & the closest were within 100 yards of us when we opened fire , & they charged yelling Allah Allah, but again Allah deserted them & they fell thick & fast & the fight ended with both sides taking whatever cover they could & sniping; at this we more than held our own although the Turkish machine guns made our positions rather uncomfortable\n\n \n4-8-16\n\nat times, & then the Turkish artillery got the range of our led horses & played havoc with them but very few of the men leading them were hit Brigades of Turkish infantry could be seen coming up to reinforce them & at 7 oclock we received the order to retire the whole of Head Quarters were in the firing line, & Nelson & I were the two last to retire from our end of the line.\n\nThe machine guns & shrapnel fire was very heavy as we retired & we were under a heavy fire right back to the horses (3\/4 of a mile) Nelson had retired 100 yards & I was about to follow when he fell hit by a machine gun bullet in the foot I ran over to him & pulled his legging & boot off & dressed the wound & called to Rich (H.Q.) & we started to help Nelson back, we were on our own as the rest had all retired & the Turks\n\n \n4-8-16\n\nwere following us up & we found it a big order as we had to lay him down frequently to spell & it was very heavy in the sand; shrapnel & machine guns were cutting the ground up all about us & I am satisfied I am not going to die from a bullet. We managed to get him back to the ambulance just as it was about to retire also & got him in, I commandeered a riderless horse that was galloping by as I managed to catch him by the bridle & Rich came in with the ambulance waggon I was never more knocked up in my life & was glad when I felt the neddy springing along under me; When I got back where the led horses were under a steep bank I found poor old MacNoon had been hit with shrapnel, (he was one of the best horses I have ever ridden)\n\n \n4-8-16\n\nWe retired back behind the trenches that were manned by Scottish Infantry & the Turks only made a small half-hearted attack here on the trenches & then retired. \n\nOne or two of our men were hit with shrapnel before we got our horses out of range & at last pulled up about a mile behind the first line of trenches & waited there till 4 oclock this evening; \n\nWe then received the order to mount & went west & pulled up for the night in a Hod (or palm grove) close by Mount Meredith which was in the hands of the Turks here we met a big body of infantry (Manchesters) who had come down from Hill 70; Our casualties today in H.Q. were Capt Weir (Adj) & Capt Fitzpatrick (QM) both seriously wounded & Lt Nelson wounded Sig Edwards wounded through left shoulder Sgt Selff seriously wounded\n\n \nthrough left shoulder. Tpr Ellis wounded (foot) & Tpr Roberts (Nelsons \nBatman\n Groom) & Sig Richardson missing but these two may turn up as there was a general mix up.\n","135":"\n\nSat 5th\n\nLast night we gave the bridle reins a twist around one foot & lay down anywhere & dropped off to sleep & our horses were about as tired as we were & did not disturb us; \n\nat 2 oclock this morning we were mounted again after getting out water bottles filled from fantasies brought up by the Indian Camel Transports, & also got two more horse feeds to take with us, we went due south for 3 miles & saw the results of our artillery fire; Camels were lying dead everywhere some loaded with artillery shells & others with machine guns\n\n \n5-8-16\n\n& amongst the dead Turks lying about were odd German officers, also Germans to every machine gun we came across, The German & Turkish officers all had a good amount of Turkish notes on them & luxuries such as bottles of wine, boxes of cigars etc & the lads in the advance party got a good deal of loot from them \n\nwe circled round & at last pulled up within a mile of Hamisah, & at 4 oclock this afternoon we attacked Qatia to where the Turks had retired & it was one of the finest sights I have ever seen; The first, second, & third Bde of Light Horse, & one Regt of New Zealanders attacked on the right in extended order galloping right up to the firing line; & on the left, a Regt of English Yeomanry attacked with swords & lost 35% of their men & did no good we got no casualties going up to the \n\n \n5-8-16\n\nfiring line although we saw a few saddles emptied a little to our right (2nd Bde) we advanced half way across the swamp to the east of Qatia but their machine gun fire was too hot to push them out of Qatia. The 6th Light Horse Regt took 600 Turks prisoners this morning & the Infantry took large bodies of Turks, Germans & Bulgarians & it is estimated tonight that over 6,000 prisoners 4 mountain gun & two field pieces besides 10 machine guns, we caught stragglers all day & hundreds of wounded Turks were brought in today\n\nWe retired from our positions at Qatia at sundown & got back to camp about midnight; A lot of the horses had no water since leaving camp the day before yesterday & the men & horses were fighting at the troughs to get the brackish water\n\n \n5-8-16\n\na good stew & some tea was waiting for us in camp but there was no water to draw & the lads tipped the tanks over to get the last drop of fresh water; The Turks heavy guns came as a surprise to our heads & they gave the redoubts a heavy bombardment before they attacked them, the Scots allowed their infantry to come right up to the barbed wire before they opened up with machine guns. as many as 20 were in one post & just mowed them down. \n\nyesterday we had the satisfaction of seeing an Avatik drop like a stone at Railhead, our Bristol scout scoring a win; Enemy planes have been continually dropping bombs on the redoubts & camps since the fight started, & it is marvellous that we have come through everywhere with so few casualties; Our Monitors\n\n \nalso kept up a heavy fire & wiper out thousands of Turk coming along the coast to attack Marmadieh on the coast;\n","136":"\n\nSun 6th\n\nThe Sigs have a fairly bad time of it during the fighting Nelson, Smithers & Edwards HQ wounded & poor old Alf Winterton A Sqd Cpl was killed & Richardson H.Q. & Roberts (Nelsons groom) are missing I went to the Field Amb. this morning & found Nelson & Smithers & Edwards were sent away yesterday there was some doubts about Winterton, as to whether he was killed or wounded but Bassan & other A Sqd Sig went out this morning & found his body & buried him & put a cross of shells on his grave; he was one of the finest lads I have known\n\n \n& felt his death rather keenly; Early this morning infantry took Qatia capturing 500 men & a Camel Corps quite a number of camels were captured at different times; & we have quite a number of German prisoners mostly officers & machine gun crews; The Turks fought well but say the Germans turned the machine guns on them when they started to retire, or surrender.\n\nWe cannot get water today & are living on what tea we are issued with & some of the lads are drinking the salt water. dead horses are lying everywhere & are beginning to hum some; I would like to know what has happened to Richardson & Roberts both were fine lads, \"the fortune of war\".\n\nLieut McQuiggan was also killed on the morning of the 4th;\n\nThe enemy are breaking records retiring\n\n ","137":"\n\nMon 7th\n\nRose at 6.30 this morning & had a very quiet day; The Turks are at Oghratina & our infantry are between Qatia & Oghratina. a Bde of Mounted Yeomanry went out this morning & we had orders to be ready to go out at seven oclock tonight but it was cancelled at 4 oclock this afternoon; \n\nLast night I was busy finding men to make up strength of Signallers & in ordwers this morning Cabban came out as Sig Cpl of C Sqd, & Bassan as Temp Cpl of A Sqd, & Corliss taken on A Sqd & Wride, Locke & Olson on Head Quarters these men are only learners & I can see a busy time ahead; Sgt Major Mills came down today with a Lewis gun & is to instruct men how to work it.\n\n \n8-8-16\n\nTue 8th\n\nBusy this morning getting ready to go out on a stunt fighting still goes on but the Turks are out of Oghratina; at 3 oclock this afternoon we left Romani & got to Qatia by 5 PM & found Qatia with a few tents in it & thousands of English Infantry some washing in the salt water holes & others knocking down dates (which are now nearly ripe & eatable) with \ntins\n empty bully beef tins.\n\nwe camped by the cement well & fed & watered our horses here which took till 8 oclock, as both Brigades went out together, & at 8 oclock started for Bir-El-Abd; the 1st & 2nd Bde going to the north & the 3rd Bde & New Zealanders bearing to the south we are to get behind Bir-El-Abd & try & cut off the Turks left there\n\n ","138":"\n","139":"\n\nWe were supposed to attack Bir-El-Abd at 6.30 this morning but the Turks opened the show by putting a couple of shells right amongst our horses before we dismounted for action but got none of us. & a few minutes later we had had horses in a safe position behind a step sand hill & were on the hill above.\n\nthe Turkish Infantry welcomed us with a burst of rifle fire from the ridge opposite & the fun commenced. we soon drove them back to the next ridge & I put the day in on the first ridge (after running a wire from Bde at the led horses) laying at the end with a ‘phone the phone was also connected to the artillery & I was kept busy putting through reports from Major Granville who was directing the troops & giving ranges to the guns from the artillery\n\n \nofficer who was spotting from the same spot, he belonged to the Ayr Battery & I saw some of the finest artillery shooting I have ever seen wiping out a camel train & cutting up Turkish troops advancing across an open stretch of country to reinforce their men; On the south of Bir-El-Abd the New Zealanders put in some good work & during the day our boys advanced over a mile receiving a few casualties;\n\nMajor Smith was wounded in the arm & Lt McDonald was shot dead through the heart but most of the casualties were from shrapnel; our horses suffered badly & at 10 oclock the heavy Turkish gun firing high explosives came into action & kept up a constant fire all day trying to get onto the battery of artillery, & our horses, these shells did very little damage & they\n\n \nsank well into the sand before exploding they made big holes & knocked scores of men down from the shock but hit no one about midday they were falling within a few feet of us & my body was paralysed at times from the explosions; The Turks were bringing up large bodies of reinforcements all day & at 4 oclock we commenced to retire, & it was a case of every man mount & get away as fast as possible from the shell fire which was deadly \n\nas soon as we got out of the danger zone we rallied together & took up a position on a ridge & covered the retreat of the last men to leave the front ridge, & we were a hungry, thirsty lot when we arrived at Debabis at 8 oclock, we watered our horses, & drank a good deal of salt water ourselves which made us worse than ever, & at 10\n\n \noclock we left Debabis for Oghratina with our mouths parched & dry; The Turks have made small wooden troughs for watering horses & all the wells have been cleaned out & a good supply of salty water, but it is too salty for men to drink\n","140":"\n\nThurs 10th\n\nArrived at Oghratina late last night & dropped to sleep till daylight & some fantasies of water were brought on the scene & we soon made a hole in them, & filled our bottles, then mounted & went about half a mile south of Oghratina to a Hod with several good wells, here we watered our horses & then went to Hod-El-Negliat between Qatia & Oghratina, were issued with rations & slept all day\n\n \n11-8-16\n\nFri 11th\n\nHad a good rest last night & were not called till 5.30 this morning & the sun was up when we awoke; Watered our horses at the same Hod as yesterday & had a very quiet time today resting & picking dates that are ripe enough to eat. these are very bitter with the skin on but very good fruit something like apples to taste when peeled \n\nThis morning we could hear the artillery to the east & we received word this evening saying the infantry advanced to Bir-El-Abd, & the Turks left early this morning with very little fighting\n\nEvery man in camp that could be mounted on any sort of a horse was sent out & joined us today, we are getting plenty of water & rations here\n\n \n12-8-16\n\nSat 12th\n\nHad another days good rest today & everything seems clear so far as Turks are concerned a few of our men were sent out this morning to bury the dead around Bir-El-Abd & to collect anything that is lying about; One or two of the lads killed a couple of days ago were stripped of boots & gear but otherwise they were not touched only men belonging to the 1st & 2nd Bde could be found & all these had been reported dead when we retired, these were buried, & all gear left by us recovered;\n\nOn account of our horses getting cut up on the 4th only two Squadrons from each Regt could get mounted & one Sqd of the 3rd Regt came with us to make us up to strength & one Squadron of the 3rd went with the","141":"\n\n ","142":"\n","143":"\n\nRose again at 5.30 this morning watered & fed our horses & at 9 oclock had orders to be ready to form up at 9.30 to proceed to Romani. we gat away to time & escorted the Art. home arriving here at 1 oclock this afternoon; & we are to go to Ballah for a spell;\n\nThe New Zealanders & 2nd Brigade came back to camp last night; several case of cholera was reported yesterday one fatal & all drinking from the wells is prohibited in consequence, but the men will drink anything when thirsty enough cholera or not. \n\nput in tonight washing dirty clothes & a bath once more is a trea. a service is being held in the YMCA & the singing sounds good from here\n\n ","144":"\n\nMon 14th\n\nEvery man had to be marched to the Field Ambulance this afternoon to be innoculated against cholera & it is said we have to stay here till further orders in consequence. we are told that probably the cholera germs were caught from the Turks as we were for several days over the ground they were camped on;\n\nSent some photos belonging to Les Smith home to his Mother today. the kits of the men killed & missing were put up for auction sale today & some of the things brought some fancy prices. I received a parcel from Irene Gardiner today, & believe a large mail should arrive tomorrow; The YMCA is trying to get concerts going once more\n\n \n15-8-16\n\nTue 15th\n\nAt Bir-El-Abd the troops found a notice in English left by the German Field Ambulance saying cholera patients who had died were buried at the spot; This morning I was at the Orderly Room to give particulars as Major Granville is recommending me for a Commission in this Regt as Sig Officer. \n\nThis afternoon at 4.30 the 1st Light Horse Brigade was formed up by the YMCA & General Chauval thanked us for the way we fought during the last couple of weeks, & said he is trying to get leave for a percentage of us to visit Port Said. we are to remain here but the 1st &","145":" Bde of light Horse are to be spelled as much as possible\n\n \n\n"}}