{"Document Name":{"0":"Diary_0406","1":"Diary_0406","2":"Diary_0406","3":"Diary_0406","4":"Diary_0406","5":"Diary_0406","6":"Diary_0406","7":"Diary_0406","8":"Diary_0406","9":"Diary_0406","10":"Diary_0406","11":"Diary_0406","12":"Diary_0406","13":"Diary_0406","14":"Diary_0406","15":"Diary_0406","16":"Diary_0406","17":"Diary_0406","18":"Diary_0406","19":"Diary_0406","20":"Diary_0406","21":"Diary_0406","22":"Diary_0406","23":"Diary_0406","24":"Diary_0406","25":"Diary_0406","26":"Diary_0406","27":"Diary_0406","28":"Diary_0406","29":"Diary_0406","30":"Diary_0406","31":"Diary_0406","32":"Diary_0406","33":"Diary_0406","34":"Diary_0406","35":"Diary_0406","36":"Diary_0406","37":"Diary_0406","38":"Diary_0406","39":"Diary_0406","40":"Diary_0406","41":"Diary_0406","42":"Diary_0406","43":"Diary_0406","44":"Diary_0406","45":"Diary_0406","46":"Diary_0406","47":"Diary_0406","48":"Diary_0406","49":"Diary_0406","50":"Diary_0406","51":"Diary_0406","52":"Diary_0406","53":"Diary_0406","54":"Diary_0406","55":"Diary_0406","56":"Diary_0406","57":"Diary_0406","58":"Diary_0406","59":"Diary_0406","60":"Diary_0406","61":"Diary_0406","62":"Diary_0406","63":"Diary_0406","64":"Diary_0406","65":"Diary_0406","66":"Diary_0406","67":"Diary_0406","68":"Diary_0406","69":"Diary_0406","70":"Diary_0406","71":"Diary_0406","72":"Diary_0406","73":"Diary_0406","74":"Diary_0406","75":"Diary_0406","76":"Diary_0406","77":"Diary_0406","78":"Diary_0406"},"Date":{"0":"unknown","1":359.0,"2":360.0,"3":361.0,"4":362.0,"5":363.0,"6":364.0,"7":371.0,"8":372.0,"9":383.0,"10":384.0,"11":385.0,"12":386.0,"13":387.0,"14":388.0,"15":390.0,"16":391.0,"17":392.0,"18":393.0,"19":394.0,"20":395.0,"21":396.0,"22":397.0,"23":398.0,"24":399.0,"25":400.0,"26":401.0,"27":402.0,"28":403.0,"29":404.0,"30":405.0,"31":406.0,"32":407.0,"33":408.0,"34":409.0,"35":410.0,"36":411.0,"37":412.0,"38":413.0,"39":414.0,"40":434.0,"41":439.0,"42":440.0,"43":441.0,"44":442.0,"45":443.0,"46":444.0,"47":445.0,"48":446.0,"49":447.0,"50":448.0,"51":449.0,"52":450.0,"53":465.0,"54":466.0,"55":467.0,"56":492.0,"57":496.0,"58":497.0,"59":498.0,"60":499.0,"61":500.0,"62":501.0,"63":502.0,"64":503.0,"65":504.0,"66":505.0,"67":506.0,"68":507.0,"69":508.0,"70":509.0,"71":510.0,"72":511.0,"73":512.0,"74":513.0,"75":514.0,"76":515.0,"77":516.0,"78":517.0},"Entry":{"0":"\n\nDec; ","1":"\n\nHut inspection – camp like a quagmire. Break camp again, meet Waterhouse lady, visit Melbourne Gallery together. Unfortunately she does not understand art.\n\nDec; 20th.\n\nPack kit – camp still like a quagmire – no leave granted. Again visit Waterhouse lady – wish she had not got a husband – so does she.\n","2":"\n\nPouring with rain, shall soon have to swim in mud. Must find an excuse to get back to Melbourne to see Waterhouse lady.\n\nArrived in Melbourne, lady out. - - - - I entered the Vienna Café to have a cup of tea. Look across the room – see the Waterhouse lady. My luck seems to be quite in.\n\n6 p.m. Heavy sky, pouring with rain; Waterhouse lady comes to see me off, am leaving for the Front this night. Arrive back in camp, a desolation of mud and slush and rain – very few men in camp. I go to get my pay from Captain Margoline, have a little chat with him – then to sleep.\n\nI mentioned to Margoline how glad I was we were leaving the camp in the morning. Margoline said, “ So am I, Silas, I think we all have had about enough of it.”\n\nDec;22\n\nStill pouring with rain – the mud and filth simply awful. I leave my kit at the end of the line as directed – a few minutes later it had disappeared – expect the “Fall in“ to \n\nsound any minute – am in a terrible state. At last discover some kind chap took it in out of the wet. Find all men have been furnished with a sea kit-bag excepting myself – tear round to find one – eventually am “dished out“ with one, it is about large enough to hold a pound of sugar; this has to hold all necessary kit for six week` voyage.\n","3":" a.m. “Fall in “ – full equipments, pack and sea \n-bags – it is almost impossible to stand up, it is so slippery. March off from Broadmeadow Station; many of us fall down and get up caked with mud. Arrive Port Melbourne – sunny – mess about on the wharf till about 12 – embark on transport, White Star Liner `Ceramic` A.40, a very fine ship. About 1 p.m. steamed away – no relatives or civilians allowed on the wharf, only the harbour master and one or two wharf labourers to wave adieu. En route from Broadmeadow railway station to Port Melbourne I wrote farewell messages on bits of paper, giving them to various strangers who happened to be on the stations as we passed through, to post for me – hope they will reach – may be a long time before I get another chance to write.\n\nRest of the day spent fixing up hammocks, arranging kit, etc. The noise and confusion, or apparent confusion, appalling; fixing up hammocks for the night – picking out the best spots – getting in each other`s way generally; wonder how I will\n\nstand being cooped up with all these rough men in such a confined space. There are 3,000 of us on board; nowhere quiet where I can go away to think. I meet Willoughby Bell, whom I met on one or two occasions in camp; he is a great student and very interesting; he is very bitter against the Germans and has always upon him a knife which he is always sharpening; he says he will show the Germans no mercy.\n\nStudy a little French – I don`t know why, but it might come in useful. Turn in – lights out – great amusement among the boys cutting each other`s hammocks down – much language.\n","4":" 23\n\nBreakfast at 8 – food excellent – manners damnable. Meet Corporal Munn who is out section leader – he was at school with Stanley Wayman. Munn has lent me a delightful book, “The Way the Strange Roads go down” by Gertrude Page – it was a treat dipping into this land of poetry and romance. \n\n12.30, dinner- noise simply awful – our mess deck is just at the spot where all the 3,000 men send their mess orderly for the meals.\n","5":" p.m. instruction in signalling – I am told that if I am put in charge of a signal station, in the event of a message having to be sent which would entail great danger to the messenger, I may not take it, but must send those who are under me. I only hope that if ever I am in so unfortunate a position the man I put in charge of the signal station while I\n\ntake that message will not fail me; for I certainly could never send a man into a position of great danger – however much it would be my duty to stay at my post I should always feel I was trying to save my own skin. I find signalling very difficult to grasp; the others seem to make a much better do of it.\n\nDec; 23\n\nI am mess orderly – beastly job, washing up for 22 men. Breakfast – cleaning up –flag –wagging – dinner; go up on the sergeant`s deck, paint all the afternoon – get hoofed round generally by sergeants and sentries; they resent having a low artist man encroaching on the sanctity of their deck – however continue painting until I am picked off. Weather glorious, sea like glass.\n\nDec; 24\n\n`Christmas Eve` - no drills, though I practise signalling myself, am not satisfied with my slow progress. All mess decks decorated with paper festoons, etc., reminds me of a coloured Christmas supplement of some illustrated paper. Spend all day painting.\n\nDec; 25 Christmas Day\n\nAll day painting and reading . Fruit is given us as a little extra – I presume no day of any importance could be such unless there were something extra for the inner man.\n\nDec; 26\n\nUsual routine – meals, drill, etc., how I hate signalling! At night I try to read the ship`s signalling with\n\nlamps – I feel in despair, I cannot read six words – wonder if I ever will. Sketching as usual; as I use my pencil when ever I get a chance I shall make no further mention of it. ‘\n","6":" 27\n\nRead book of military law and regulations, which goes in at one ear and out of the other; quite enough things to bother me.\n\nDec; 28\n\nArrive at Albany - I think a lot of the happy days I spent sketching here when this terrible war was little dreamt of. We are not allowed to say Transport Fleet is in Albany or what ships we are on – West Australian Government are advertising and running excursions to see the Transport Fleet in Albany; I also receive letters addressed to me “Transport Cerania, A.40” !!!\n\nDec; 29 Albany\n\nAmusing incident - no boats of any kind permitted near transports – one enterprising Albany grocer climbs up on to out ship for orders – he is promptly put in the cells and kept there for two days.\n\nTonight am sitting up on sergeants` deck under a deck lamp, writing my last letters before we leave Australia, as tomorrow New Zealand Transports, for which we are waiting, will have joined us.\n\nDEC; 30\n\nSteam out of Albany, A greyish day - Nature is sad, she weeps for us as we steam away close up to the great bluffs of\n\nthe coast of Western Australia. Far away astern of us there are a few grey specks getting ever smaller – the last sight of Australia - `tis most fitting that the dusk should be creeping on, for it was seven years ago that I saw these same specks of land at the dawn of a glorious day – that was my first of Australia, the land which has been so much to me, which gave me my great chance in life, which I now leave perhaps for ever.\n","7":" 31\n\nSea quite calm – usual routine.\n\nJan; 1. 1915\n\nBurial at sea, perhaps the first of many – a brilliant sky above, glorious blue below – we are all lined up on deck – all the fleet is stopped – somewhere, from one of the ships , a body has been cast to the deep; way back in Australia some mother will mourn a son – there is dead silence throughout that huge fleet; just the gentle heaving of the ocean, each man to think of Death as he may. \n\nThe “Dismiss” is sounded; we all feel relieved to get back to the work of living, though I can`t help thinking of the, perhaps not far distant, date when I shall see my comrades dying in hundreds on the field of battle.\n","8":" 2\n\nUsual routine – in the evening am giving lessons in drawing to two of the men. We have a printing press on board,\n\n \n\nrun by the D.A.P. who publish a paper called The Route. I do some water-colours of the Transport Fleet. I sell two of them.\n","9":" 3 \n\nUsual routine. At mess to-day a youth is rather rude to me – my vis-à-vis, a rough Bushman, turns to the youth and says, “Aven`t you got an eart, mate; Can`t you see’ e ain`t used to this kind of life like we are?” Though rough, the boys were very kind to me.\n\nJan; 4\n\nUsual routine. Am mess orderly all day. So occupied with painting forgot to draw rations – am in a terrible state; 22 hungry men will be no joke to face. Every morning at 5 I sneak into the sergeants` mess to get a cup of coffee – up to date have had nothing stronger than water to drink as I cannot drink the tea, it being always sugared. \n\nOne morning , just before Reveille, went to get some tea; it was given me in a metal cup which I cannot drink out of; I said to the cook, “Wait a minute, I`ll get a china cup” – this was too much for the lads, who immediately began to call out for their valets and shaving water! I never heard the end of this incident for some days.\n\nJan; 5\n\nRecently I have been sleeping up on the sergeants` deck; strictly against regulations, but no matterl\n\nJan; 6\n\nUsual duties. Am reading Victor Hugo`s “Les Miserables”;\n\nnaturally a very fine book, but why, because one of the characters was at the battle of Waterloo, should I have to read the whole history of that battle and the lives of the generals thereof? – this, to me, makes the reading of this book too great an undertaking, at least under these circumstances.\n\nJan; 7\n\nWe often have the Band – though rather nosiy, to get away from it some little distance it isn`t so bad. Also occasionally we have concerts – Lieut. Geddes has a very charming voice, well-trained; but there is always such a crowd of men and so much discomfort, interjections and noise, that I prefer not to go to these concerts.\n\nJan; 8\n\nPractise despatch running – general instructions. I have dinner in the sergeants` mess, which is quite excellent; stewards, etc., though I get into trouble for this. Up to date somehow I have always managed to have thin bread and butter; the boys say they like theirs thick, something they can get their teeth into; for my part this puts me off it – afraid I`m a snob even in my feeding; can`t stand food in big quantities – for four days I`ve eaten ;practically nothing; even now I cannot get used to the rough conditions with which I am surrounded.\n\nJan; 9\n\nHave a chat with Willoughby Bell – he`s awfully een for me to read a little book on the South African War. I skim it\n\nover in order to please him. I hate War books, soldiers, and soldiering – I have not read a newpaper since the War began and I don`t intend to do so: all I know is there is a War on, that I`m doing my bit, and that I`ll be glad when it`s over. How I hate this terrible life.\n\nJan:10\n\nSupply of literature very scarce – glad I`ve got my pencil to keep me busy. I am teaching Captain Townsend French; he has lent me a little French book, I read a page of this a day; also practise signalling, but am frightfully slow.\n\nJan:11\n\nMake a little portrait of Captain Townsend which pleases him much, and me also as it gave me a chance to be on the officer`s deck where it is quiet.\n\nWe are near Colombo; all the fleet with the exception of three White Star ships which we believe have put in at Colombo.\n\nJan:12\n\nUsual routine. Got a kind of wish-I were-dead sort of feeling; one can scarcely understand what it is like to be cooped up with 3,000 men for so long a period. \n\nGreat excitement; all the Fleet has stopped – the ships going to Colombo are taking a mail – much display of writing pads, pencils etc., men more or less quiet – wish to God there were a mail every hour: much excitement; a boat is lowered to take our letters to the ship which is taking the mails – it is marvellous the amount of interest a little incident like this creates, though\n\nit certainly was a fine picture to see the great ship rolling gently in the long swell and all the boats from the other ships rowing up, a sparkling white against the deep blue of the sea which, where the sun shone through it, was the most magnificent colour.\n","10":" 13\n\nSpend a good deal of my time making studies of heads; this is very good practise. Having been shunted off the sergeant`s deck sleep once more on the main deck – no sleep after 4 a.m. as the ships crew come along with brooms and hose yelling at the top of their voices “ Rise up and shine for the White Star Line,” what time they knock their brooms on the deck. If one wants to save themselves their morning shower, why then, don`t trouble to move, because the crew with their hose will do all that is necessary.\n\nThe baths on this ship are splendid – in the Army it is saying something.\n","11":"\n\nPass the Mineaque Islands, S.W. of India, truly a jewel set in a sapphire sea, rich green palms waving their graceful heads towards the blue heaven, where the surf was breaking were large lakes in the sand, brilliant emerald against the sun, here and there beturbaned covered men resting in the shade of rich foliage, all round the Island, making way thro` the sea, native catamarans. All this I could see quite\n\nclosely through the telescope; it is fortunate to be a signaller sometimes. \n","12":" 15\n\nOnce more out of sight of land. Usual routine.\n","13":" 16\n\nFire drill – put water through the hoses - A.Company`s mess deck, through some mistake, becomes a swimming bath. Plenty of adjectives as well as water flowing about.\n","14":" 17\n\nDaily routine. Play Bridge – played as badly as I ever do; what matters?\n","15":" 18\n\nPass the Islands of Soviate. Signal drill – in the life boat near which we are practising there lies a silent form covered with the Union Jack.\n","16":" 19\n\nDaily routine. Am reading another of Gertrude Pages`s books, “The Rhodesian” – very charming.\n\nJan`: 20\n\nGulf of Aden – arrive at Aden; what a series of gorgeous pictures! All round the ship are countless boats of all sizes and shapes , filled with coloured men of every hue selling their waresl though this is an everyday occurrence to the average globe-trotter, to us, after a tedious journey of some four weeks, it is full of interest.\n\nHow true it is that in the midst of life we are in death; for in the middle of all this yelling crowd, bartering their wares, we slowly lower the boat containing its silent occupant, which is towed to the shore for internment. I go up on the sergeant`s deck to make some\n\nstudies of the natives; the sergeants get annoyed at my presence – I go on to the officers` deck and am better received. \n","17":" 21\n\nAs soon as daylight appears there`s a deafening riot of bartering voices recommences. See a P. and O. liner go past; passengers on board waving to us – after the uncivilised conditions of a Troop Ship it makes me long to be on that liner and in the society of refined women. \n","18":" Same old noise of niggers. Cannot get a decent sketch – naturally the men are everywhere.\n","19":" 23\n\nLeave Aden – nearly a collision with a N.Z. Troopship; got ready to make a sketch of the collision, which, had it happened, I should probably have been studying deep sea fish. \n","20":" 24\n\nDaily routine.\n","21":" 25\n\nDaily routine and noise. Geat excitement; first mail delivered to us from home; only those who have been cut off as we were can realise what that means to us – a letter is the greatest boon we can receive.\n","22":" 26\n\nEnter the Gulf of Suez – weather fairly warm. Daily routine. Writing to catch mail at Suez.\n","23":"\n\n Part of Suez very interesting. All ships are sandbagging all upper works prior to entering Canal – we hear that a P. and O. officer has been killed and some men wounded by rifle\n\nfire in the Suez Canal. It is hinted that we may be in a scrap pretty soon; somehow don`t feel much worried about it.\n\nThe wife of the Captain of the ship visits him – a most unusual spectacle, at least to us, to behold once more a woman. It is only when one has been cooped up for a considerable period with nothing but men that one can understand what this means. It made me long for the refinement of society.\n","24":" 28\n\nLeave the Port for the Canal. We are now going to have an interesting time – our first view of the land of the Pharoahs – on either side of the Canal are trenches and camps; all the stations are protected with sandbags; this looks like the real thing. There are a large number of Indian troops all along the Canal. We remain a night, in the Salt Lake, prepared to land at any moment for a scrap.\n","25":" 29\n\nWe hear there is something doing. Our first view of an aeroplane.\n","26":" 30\n\nI make a sketch of an Arab woman. Through a telescope it looks as if there is going to be some interesting work for my brush. Arrived at Port Said – what a clamour all round the ship! – boats of every size and shape filled with the most heterogenous mass of humanity that ever walked the globe. \n\nArabs selling Egyptian Delight and every other form of useless commodity it is possible to imagine, half-caste Europeans with\n\ndisreputable-looking women tinkling string instruments, the sound of which , amidst this tremendous noise, was very much like the buzzing of a fly on the dome of St.Pauls.\n\nOpposite to us is a French ship. We are drawn up in a line on the deck of the ship – the Bugle sounds the “Still” – two men go past carrying a little heap covered with the Union Jack; another poor chap gone on his last journey.\n\nOur band is giving us a few selections – it plays the Marsellaise; The French ship opposite is highly enthusiastic, much applause and cheering from all the ships in port.\n","27":" 31\n\nLeave Port Said.\n","28":" 1\n","29":" a.m. arrive in Alexandria – see American warship “Tennessee” which has brought in refugees from Smyrna.\n","30":" 2\n\nHear various rumours about the advance of the Turks.\n","31":" 3\n\nTreat myself to a new pocket handkerchief. All through the sea has been like glass.\n","32":" 4\n\nOur troopship, the “Cerania”, has been the largest ship to pass through the Canal. 8 a.m. make up alongside wharf – grey day, very cold, large quantities of gulls, dark brown wings – natives on wharf, scarlet, yellow, green, blues and white; a great deal of colour.\n","33":" 5\n\nVery cold. Entrain Alexandria 10 o`clock – arrive Damanahour 11.35, arrive Cairo, Zeitun station, 4.30 – march to\n\ncamp Heliopolis 5 p.m. Camp is only five minutes from Heliopolis. Visit Heliopolis 7 p.m. – dash into a café to have some coffee; it is great to be free, to be able to walk about when I like.\n","34":" 6\n\nVisit Cairo – I see many interesting things and des choses mechantes, tres mechantes.\n","35":" 7\n\nVisit the Pyramids – I went inside but was too tired to go up to the top. I am disappointed with the colour in Egypt which is not as beautiful as I expected.\n","36":" 8\n\nDuties in camp\n","37":" 9\n\nMeet some Egyptians at a café.\n\nFeb: 10\n\nA march to Cairo – this was to impress the natives and Egyptians generally that it was no use their playing any tricks.\n\nFeb: 11\n\nDrills all day on the desert.\n\nFeb: 12\n\nSame as","38":"\n\nFeb: 13\n\nVisit Cairo – see the mosques and several very wicked places but immensely interesting – visit Hospital at the Citadel and see the Indian wounded from Suez; one Ghurka tells us that he crept into the enemy trenches and cut the throat of five of them and got back again quite safely. \n\nI go about Cairo with my friend Willoughby Bell, a very interesting companion – exasperating at times ; just when I would be admiring robes and colour of an Arab he would break in with “Now, what\n\nnationality do you think he is?” Bell was very interested at seeing all these different nationalities as he had never before left Australia.\n\nFeb: 14 – 16\n\nAll drill.\n\nFeb: 16\n\nVisit Mosque Amur, Coptic Church and Greek Church – Bell and myself meet a Copt student, who shows us these different places of interest.\n\nFeb: 17\n\nNight alarm; the whole Battalion turns out, all tents packed up, everything prepared as though we were off to the Front – the whole taking something under an hour.\n\nFeb: 18\n\nManoevres. 18 miles across the desert to the third tower on the Suez road. \n\nFeb: 19\n\nSee Egyptian burial close to where we are. Signalling. Visit Boulac Museum with Bell.\n\nFeb: 20\n\nVisit Cairo – call upon Professor Adolfe Scarselli, a very clever artist, and his wife – it was a treat to be once more in a studio.\n\nFeb: 21\n\nMilitary duties.\n\nFeb: 22\n\nVisit the mosques of the Caliphs, and the Bazars – I had a splendid day with Bell B.A. – also we visit the Palace Hotel Heliopolis – it is like Fairyland to be in this lovely building and see these quiet sisters at their duties.\n\nFeb: 23\n\nI go down to a café in Heliopolis and work at water-\n\ncolour. In the evening to Cairo to my favourite rendezvous, the Café Saulte. I like to go here because there are no soldiers. It is such a treat to be among civilised people; it is not their delightful pastry that appeals to me so much as the elegant china, gold and white in Louis Seize style, also a delightful little orchestra which usually plays one of my favourite operas, “La Boheme.” \n\nWhenever I enter this place I am much stared at – why I should receive attention more than other soldiers puzzles me, I used to think it was my egoism made me thinks so, but on several occasions have drawn my attention to the interest I appear to create. \n\nOften the habitués of the Café make my acquaintance – I am glad I can speak French, it has been most useful to me in Cairo.\n\nFeb: 24\n\nMore wearisome flag wagging.\n\nFeb: 25\n\nManoeuvres – this means trouncing across the desert.\n\nFeb: 26\n\nManoeuvres. Tonight I dined at the Hotel Heliopolis with my friend Frank Fraser, quite one of the most charming men it has ever been my pleasure to meet. At first we had some difficulty in getting the maitre d`hotel to permit us to dine here, for we are only privates and this place is the rendezvous of officers. To be sitting here, surrounded by women charmingly gowned, roses on the tables matching well with the womens` robes, the soft electric light, was ecstasy\n\nafter the hell of camp life. Getting killed is, to my friend and myself, the least terrible part of soldiering – I wonder will we think the same when we are at hand shakes with Death. Be that as it may, this evening has been delightful.\n\nFeb: 27\n\nVisit the Arab Museum with my friend Bell – we do not know enough of archaeology to fully appreciate this Museum.\n\nFeb: 28\n\nVisit Mena Camp to see my friend Whitehouse; also see the 11th and","39":" Battalions and others leave for the Front;\n","40":"\n\nVisit Cairo\n","41":" 2\n\nFlag wagging. Studies at Café Saulte.\n","42":" 3\n\nManoeuvres – leave camp 8 a.m. rest 9 a.m. march to second tower. 1.35 p.m. attack across the Desert, 3 o`clock march nine miles across the sand without a rest – what this means, only those who have been through it can fully appreciate.\n\nAltogether we have done something over 20 miles to-day. Reach camp 7 p.m.\n\nTo Heliopolis; though dead tired feel I must get out of camp.\n","43":" 4\n\nFlag wagging. Studies at a Café, Heliopolis.\n","44":" 5 – 6\n\nManoeuvres – leave camp 9.30 a.m. return 4 p.m. March out again 8.30 p.m. march all night and entrench – the cold is so awful that it is agonizing. Fighting all day – return to camp –","45":" miles without a rest; these have been the most fatiguing manoeuvres we have ever done. In the evening\n\nto Cairo to make studies.\n","46":" 7\n\nSakhara. Leave Cairo 10.30 a.m. with forty others on an antediluvian junk of wood that is masquerading as a steamer – one daren`t lean too much on one side, otherwise she will capsize – cranking old engines are pumping away; I think the boat will fall to pieces before we have got very far. \n\n11.30 a.m. engines break down; we commence to drift down the Nile – come in contact with a Nile barge for which our old ship forms a great attachment – the natives evidently think it will greatly help matters by heaving lumps of coal at each other. 12.45 p.m. off mudbank; arrive at Memphis 3.30 p.m. \n\nI have my first donkey ride; I think my particular animal must have had relatives in a circus. By the time the last one has arrived the first of us are returning, but, as I understand this is a habit with donkeys, enough said. \n\nVisit the Tombs, Step Pyramid, Apis Mausoleum, two Colossi, Ramese the Second, Tombs of the Sacred Bulls, Thi, Ptah-Hetep, Mera, Sarapeum. Get bushed; fall off my donkey; reach the ship (?) afternoon tea 8.15 p.m. Wonder which is the oldest the boat or the piano on it. Arrive Cairo 11.15 p.m. \n","47":" 8 \n\nFlag Drill. The first sand storn – simply terrible, sand everywhere.\n","48":" 9\n\nFlag wagging. Studies at the Cafés.\n","49":" 10\n\nManoeuvres. For the first time after the many hard marches I have done, I fainted - very amusing thing; I fell down just as is I had been shot; my companions, who were only a few yards ahead of me, within easy speaking distance, did not miss me until they had gone some considerable distance. I wonder how I`ll get on when I am faced with the real hardships of War - I casn only hope that I don`t blow out before I have at least done a little.\n","50":" 10\n\nStudies at the Café.\n\nMar; 11\n\nFlag drill – kit inspection – studies.\n\nMar; 12\n\nManoeuvres – studies.\n\nMar; 13\n\nVisit Cairo with my friend Bell.\n\nMar; 14\n\nStudies. Visit friends in Cairo; they say they are French but they cannot speak one word of the language and in every way are obviously Egyptians.\n\nMar; 15\n\nA great event! I am given three days C.B. for refusing to attend that farcical absurdity Church Parade. Strike camp. Studies intermingle with my first experience of the “Angel`s Whisper”.\n","51":" 16\n\nBivouac – manoeuvres – and C.B. All the camp are delighted to hear that Silas has C.B! – the lads are immensely amused and come along to see me do it; if it had been pack drill I think they would have paid a pound a head for front seats.\n\nMaking military maps – studies at a café.\n\nMar; 18\n\nFlag wagging – studies – Café Chantant, rather diverting but decidedly crude plenty of singing of patriotic songs by a woman in tights with a piping voice, who perhaps for a few more piastres would sing the “Watch on the Rhine” with as much vigour as she did “Tipperary” and “Rule Britannia.”\n\nMar; 19\n\nA strange and wonderful thing has happened – I go to have my teeth seen to and the dentist says it does not matter when I pay him! I explained to him that I might be leaving for the Front to-morrow; “Never mind, send me the money from Berlin.” This is a Dr. Garavedien - he is most charming and most hospitable.\n\nMar; 22 \n\nVisit Cairo – studies at Café Saulte.\n\nMar; 23\n\nFlag drill – studies – visit Cairo.\n\nMar; 24\n\nDrill. Visit Mr and Mrs Babbira; it was very pleasant to sit on their verandah and look over across the desert over which I had so many times marched in the heat and grime of the \n\nday. They bring in their infant for me to admire! I thoroughly dislike them but apparently I gave my host and hostess the impression that I had a strong partiality for small children – if they had really known my thoughts on the subject they would not have been pleased.\n\nMar; 25\n\nFlag drill – studies.\n\nMar; 26\n\nTo Cairo – lunch with Dr.Garavedien and his charming wife in their delightful appartement in the Rue Magdeburg. \n\nStudies – dined at Café Sault with Frank Fraser,","52":" A.S.C., really a most charming man.\n\nMar; 27\n\nDrill – studies.\n\nMar; 28\n\nTo Cairo – lunch with Garavedien – studies – visit a prison in Cairo; the Director was most hospitable, sent out for coffee and showed me the prison – most awful looking hole, though the prisoners did not seem the least worried about it.\n\nMar; 29\n\nThis day has been most detestable. We were reviewed by Sir Ian Hamilton – \n\n– it might have been very nice for the onlookers, but to be a common private “padding’ it through the sand is vile.\n\nMar; 30\n\nVisit to Cairo – studies\n\nMar; 31\n\nMarched to Marg – it is a delightful country, very green – we bivouac here the night – in order to get away from the crowd I took my blankets and went about a mile from the camp\n\nto sleep on my own; whether there were snakes in the thick grass I didn`t much care; I was away from the noise and roughness of the camp.\n","53":"\n\nDrill – visit Dr.Garavedien; he is always delightful. \n\nApr; 2\n","54":" Studies. Visit Cairo – terrible happening in the Wazir quarter; there has been a row between the natives and their troops; many wounded, two killed; this sacred day has been well celebrated.\n\nApr; 3\n\nStudies – drill.\n\nApr; 4\n","55":" We are kept in camp , as the Cairenes have a Fete Day on; if “the boys” got amongst them there would be trouble.\n\nApr; 5\n\nTo-day in camp has been like hell – great gusts of wind which blow the sand into the eyes, the nose, the throat; almost suffocating – sand, sand , sand everywhere. I break camp and visit Garavedien, during which time picket entered the Doctor`s surgery and ordered me back to camp. My God! What a manner in which to finish perhaps the last days of my life – I have offered my life for my country but it seems to me they have also taken my liberty – such is the military life. \n\nApr; 6\n\nSoon we shall be upon the battlefield – I pray God that I shall not be wanting when we are under fire.\n\nApr; 7\n\nDrill – visit Cairo\n\nApr; 8\n\nDrill – visit Dr.Garavedien – I am not permitted to go into Cairo so Madame had a dinner brought to the Doctor`s surgery in Heliopolis to wish me Bon Voyage.\n\nApr; 9\n\nVisit Dr. Garavedien. Packed kit ready to depart for the Front.\n\nApr; 10\n\nI break camp and go into Cairo to have a last chat with the doctor and his charming wife. We pay our adieux to many comrades who perhaps we may never see again. Studies. The Camp is struck – we are waiting for the order to march off, during which time I received my last letters from home, to which I hurriedly replied. 7.30 p.m. march out of camp to Cairo – 12 o`c midnight, entrain for Alexandria.\n\nApr; 11\n\nArive at Alexandria 7.30 a.m. – visit the city; quite a fine place. Embark upon the Transport “Haidu Pasha”, a prize taken from the Germans.\n\nApr; 12\n\n` Tis a wonderful sight to see all these Transports which are to transport 100,000 troops for the front. Studies – leave Alexandria 4.45 p.m.\n\nApr; 13\n\nMal de mer.\n\nApr; 14\n\nPick up a barge – pass the Isle of Rhodes.\n\nApr; 15\n\nI find it very difficult to believe that every minute brings us nearer to the guns of the enemy. Arrive at Lemnos – see H.MMS. Agememnon, with large holes in the funnel, made at\n\nthe Dardenelles. In this splendid harbour there are vessels of every description for transporting the troops.\n\nApr; 16\n\nPractising signalling – I feel very anxious as I do not think I am at all efficient.\n\nApr; 17\n\nDitto.\n\nApr; 18\n\nLanded at Lemnos, a very picturesque island. I have made several studies – it is great to be once more amongst green meadows and to hear the cow bells jingling. All is very fine colour.\n\nApr; 19\n\nManoeuvres on the Island.\n\nApr; 20\n\nStrudies.We are not permitrted to take more than a bottle full of water a day, there is not enough for washing with - the sea is all around us, yet we are not allowed to bathe, the whole thing is damn rot.\n\nApr; 21\n\nA deal of wind; very cold on deck, where I have been sleeping as there is so little room on the ship and the atmosphere in the hold is appalling – I also eat all my meals on deck, such as they are; bully beef, biscuits, Dutch cheese, Jam and occasionally ham; also at times we had some weird concoction consisting of biscuits and bully beef formed into a kind of stew. Take the Colonel in one of the ship`s boats to a Council of War. Midday, a concert. Studies.\n\nApr; 22\n\nStudies – swimming – reading a book called “The Green\n\nCurve” – all military tales, doesn`t interest me much. Practising flags.\n\nApr; 23\n\nStudies – Flag practice.\n\nApr; 24\n\nStudies – Flag practrice. Bitterly cold at night – continual booming of guns.\n\nApr; 25\n\nIn the distance one can just discern the Dardenelles opening up – the thunder of the guns is much clearer – the weather this morning is beautiful; what will it be to-night? \n\nStudies, I have eaten well . I can now see fire from the guns. I wonder which of the men round me has been chosen by Death.\n\nI do not feel the least fear, only a sincere hope that I may not fail at the critical moment.\n\n5.30p.m. we are on the battlefield, well under the fire of the enemy – it is difficult to realise that every burst of flame, every spurt of water, means Death and worse. For days before we reached the final scene in the “Great Adventure” we could hear the ceaseless thunder of the bombardment, we have been told of the impossible task before us, of probable annihilation; yet we are eager to get to it we will not be found wanting. \n\nThe Assembly is sounded – I have never seen it answered with such alacrity – there is a loud cheer as we gather\n\npelting us like anything. The ships are keeping the tip of the ridges under a continual line of fire – am just told that we have landed 20,000 men. We are transferring into the boats – it is raining lead – Turks firing wide.\n\nIt was a relief to get ashore; we were packed so tightly in the boats and moreover so heavily laden with out kit that, had a shot hit the boat, we should have had no chance of saving ourselves – it was awful the feeling of utter helplessness.\n\nMeanwhile the Turks pelted us hot and fast. In jumping ashore I fell over, my kit was so heavy; I couldn`t get up without help – fortunately the water was shallow at this point, otherwise-. \n\nIt was a magnificent spectacle to see those thousands of men rushing through the hail of Death as though it was some big game – these chaps don`t seem to know what fear means – in Cairo l was ashamed of them, now I am proud to be one of them though I feel a pigmy beside them.\n\nWish there wasn`t quite such a damned noise with the guns, it is sending me all to pieces – don`t think I shall ever make a soldier.\n\nThe beach is littered with wounded, some of them frightful spectacles; perchance myself I may at any moment be even as they are. Indians bringing ammunition mules along the beach – this scene of carnage worries them not at all.\n\nIt is commencing to get dark – we are now climbing the heights.\n\nI am given a pick to carry – half way up I had to drop it, it was too much for me. The lads on the top of the hill are glad to see us for they have been having an anxious time holding their position on the Ridge – “Pope`s Hill’ – they had scarcely time to throw up more than a little earth to take cover behind. \n\nThe noise now is Hell. Cannot find any of the Signallers of my Station – will look for my Captain, Margolin, they are sure to be with him. \n\nThere was no time to wait for orders; I must work on my own initiative – in any case the Captain will want a signaller with him. \n\nNow some of the chaps are getting it – groans and screams everywhere, calls for ammunition and stretcher bearers, though how the latter are going to carry stretchers along such precipitous and sandy slopes beats me. Now commencing to take some of the dead out of the trenches; this is horrible; I wonder how long I can stand it.\n\n“Signaller”! just had to go a message to Headquarters – it has been raining a little, I found it almost impossible to keep my foothold, I kept slipping down all the way along. Colonel Pope seemed very worried and tired; have just heard that our Signal Lieut. Wilton and Sergeant Major Emmett badly wounded in abdomen. Turks playing funny bugle calls all night long and yelling out, always in English. Bursts of fire from\n\nour men – officers doing all they can to stop it as we are getting short of ammunition – more bugling by Turks, makes me think of a Cairene Bazar; the idea of the bugles is supposed to impress us – the Turks would be vexed if they knew what we really thought.\n\nI have been running despatches all night and in between endeavouring to make a dug-out – I couldn`t lift the pick so had to use my trenching tool. Wonder what I am going to do for rations – I had to throw mine out, it was too heavy for me to carry. Feeling very weak and tired. \n\nApr; 26\n\nPope`s Hill – daybreak – down in the Valley, in the midst of this frightful hell of screaming shrapnel and heavy ordinance, the birds are chirping in the clear morning air and buzzing about from leaf to leaf, placidly going about its work, is a large bee – to think of what might be makes me weep, for fighting is continuing in all its fury. \n\nOur signallers have been nearly all wiped out – I suppose I`ll get my lead pill next.\n\nIt has been now a ceaseless cry of “Stretcher bearers on the left” – they seem to be having an awful timeup there – one poor fellow has just jumped out of his dug-out, frightfully wounded in the arm; I bound it up as best I could, then had to dash off with another message. All along the route, scrambling along the side of the exposed incline, my comrades offered me a dug-out for me to take cover as the snipers are\n\ngetting our chaps every minute, but as the messages are important I must take my chance. All along the route I keep coming across bodies of the poor chaps who have been less fortunate than I.\n\nApr; 27\n\nStill fighting furiously – now all signallers have been wiped out of A. and B. Companiess except myself. Just had a shell each side of my dug-out – I felt in a real panic as it is a most horrible sensation. Our ships have missed the range and sent eleven shells into us in a minute; I do not think anyone has been hit – the Turks`trenches are so near ours that it is marvellous how accurately the ships find the range. \n\nFor three days and nights I have been going without a stop, occasionally having a go at my dug-out which, up to the present, is nothng more than a hole – the continual cry of “Signaller”! never seems to cease. \n\nWhile going up to the Captain`s dug-out with a message from Headquarters I nearly got pipped by a machine-gun; fortunately one of the lads pulled me down into safety – I don`t seem to feel it`s any use worrying; if I`m to get hit nothing can stop it, and to keep dodging down into dug-outs gets on my nerves – I can`t stand being cramped into small spaces. \n\nThe Turks have now got hold of the names of our officers and keep giving messages purporting to emanate from said officers. All night long the Turks have been\n\nharassing us heavily – ever and anon “Enemy advancing on the right, “enemy advancing on the left” – all messages now have to be whispered along the line. There is a pale moon – any minute we are expecting the enemy to rush the trenches – we have no reserves.\n\n I ask Captain Margolin to let me make his dug-out more secure, as every time he has to give a message he has to expose himself – after some persuasion he permits me to do so, though at the same time asking me if I had completed my own dug-out. However, after having made his position apparently secure and arranged bushes the better to make it less conspicuous, I had no sooner vacated the position and he had got into my place, than he was struck in the mouth by a bullet. \n\n“Good God!” I exclaimed, “have they got your Sir?” “My God!” he yelled, “they have caught me at last;” but, after the first shock, he said to me, “I thought they had got me then, Silas; what shall I do? I mustn`t let the boys see I have been hit” – however, I said he had better have it attended to. \n\nJust at that moment a shot struck the parapet close to my face; I thought my turn had come; although it was nearly dark the snipers seemed well on to this particular dug-out. A body was lifted out of the trench; I thought it was a wounded man; I asked if he was dead – then I saw the top of his head – Oh God! The Turks seemed to be going to rush us – Margy grabbed\n\nhold of a rifle. I asked him if he was going to use it –“My word, yes,” he said, “I want something I can fight with.”\n\nMargy tells me to try and get a little sleep, but I cannot do so – Turks seem a bit quieter, all the same the position is very critical.\n\nApr; 27 ?\n\nMorning. Facing our extreme left, on the ridge opposite where there is a single fir tree (not lone pine)\n\nThe New Zealanders are advancing – they are nearer the enemy than they suppose – they may get cut off – from our positions we can see the enemy and their danger. \n\nFrom Captain Margolin – “Get a signal through to them, Silas.” I get up so to do, and receive immediate attention from the Turkish snipers; some of the boys told me to take a less prominent position – if I do so the New Zealanders will not be able to see my signal – it is hardly necessary to state the course I had to take; the position is too serious, I must take my chance. God, this is awful, my sight is going; I wonder if I can get my message through or will the snipers get me first – I keep giving them “N.Z.” – “N.Z.” but cannot see if they are getting me – it is too awful, will they never see me?\n\nAt last the N.Z. signallers see me – “The enemy are immediately in front of you, go with caution, look out for snipers, they are everywhere” – my sight is getting dimmer –(to Captain Margolin) “Send somebody\n\nto read Sir, my sight is going” – (to N.Z.) “Look out for our men, they are in front of you”- (from Captain Margolin) “Signal to our men to come in “ – (from the Sergeant Major) “Signal to them slowly”. Snipers getting very busy – don`t think I can last much longer – everything now quite blurred – signal our men “Come in” – can`t see at all – thank Godl, message is through. I drop down, have gone all to pieces; the lads think I have been caught. I told Captain Margolin “I am done send to headquarters for more signallers” – cannot remember his reply, but anyway it was couched in very kindly terms.\n\nThe stretcher bearers have been doing splendid work, poor chaps, along this precipitous ridge where it is difficult to gain a foothold, and under incessant fire from snipers for at this time the Turks spared nobody, they shot at anything that moved.\n","56":"\n\nFighting still continuing with unabated vigour – will this frightful noise never cease? I wonder what this valley will be like when there is no longer noise of firing, no longer the hurried tread of combating forces – when the raw earth of the trenches is o`erspread with verdant grass. Perhaps here and there equipment of War will be lying with fresh spring sprouts of grass threading through interstices – underneath the sad little mounds resting sons of a great nation – in the clear sky overhead, instead of the bursting shrapnel, little\n\nfleecy clouds – the scream of the shrapnel, the Hell noise of the firing, giving place to an unbroken stillness save for the chirping o f a bird or the soft buzzing of the bee! I wonder would it be thus!\n\nA rather amusing experience happened to me – there is one particular open space so well set by snipers that few men have been able to get across it – a stream of dead marks its length, it is called “Dead Man`s Patch” – I had to cross this space many times; it would have taken too long to go a more circuitous route for all messages were very urgent – upon this occasion, I crept into the bushes which fringed this bare patch and took my breath ready for my dash across – I lunged forward – the seat of my pants caught in the bushes, and I hung by them! I was in a terrible funk, for then the snipers got busy – I felt as if I had been hanging there ages, though I don`t suppose it was very long – at last I tore myself off. \n\nWhen I got the other side of the Patch, my now unseemly garb sent the lads into roars of laugher – certainly it was more hygienic than comfortable, and it was some days before I had a chance to dock for repairs.\n\nAPR; 29\n\nAfter four days and four nights without a rest, at last I am relieved and go back to the rear for a few hour`s rest.\n\nAll the way along there is always that stream of wounded coming\n\nfrom the firing line. Despite my recent fatigue, now that I have the leisure I cannot sleep – thank God it is quieter here, though in the gully we get the full benefit of the blast from the guns of our ships- however, they are doing the Turks some damage, otherwise we should have been swept into the sea ere this. \n\nI have just been told by Signaller Ashton of the Signallers that I have been mentioned in despatches for a military decoration – hope to God I haven`t bungled things, though it`s a funny kind of joke on a battlefield.\n\nAm told by Sergeant Paull of the Signallers that I have been mentioned in despatches for a military decoration, at the same time saying that I have earned for the Signallers a good name – hardly know how I feel over the matter – I can scarcely express it in words; to have won through so successfully when my one great fear had been that I should fail lamentably fills me with a great peace and sense of satisfaction that at least I have not given up all in vain. \n\nIt is curious on the battlefield how unconscious one is of having accomplished anything exceptional; for my part I do not feel that I have done anything more than my duty – where so many men are doing fine things I do not see what utter use it is giving medals, for I have seen many things that strike me as being infinitely finer than anything I have done or, I fear, would have the nerve to do, and yet\n\nnothing is said of them. I don`t regret my receiving this distinction, for at least it has shown the lads that Signaller Silas, the joke of the Battalion, was able to do his bit with them, and also to show a somewhat sneering world that artists are not quite failures on the battlefield, though I would admit that we are not quite cut out for this sort of work. I don`t think I can stand much more of it, my nerves seem to be going; what little I did have.\n\nSundown. I go to Headquarters to see if there are any further messages, as I`m returning to the firing line after a five hour`s spell. Colonel Pope to Captain Margolin – “If you`re not busy, get your trenches a bit deeper.” \n\nOn my way along I`m told to take cover, snipers have got much worse; one man, Ibbotson , pulled me into his dug-out, at the same time remarking “For God`s sake, take cover; two men have just been hit within the last two seconds within a yard or two of where you are standing.” I saw the proof of this; their faces turned to the sky, the sand splashed with scarlet.\n\nI wait in his dug-out two minutes, but feel I must get back to the Captain, he may be wanting me so I start forth again. \n\nAll the way along the lads keep calling from their dug-outs “Get down, take cover, snipers are getting us in dozens!” – however I continue my journey and reach the Captain none the \n\nworse. \n\nIt is true things are getting merry, but the snipers don`t seem to get the strength of me. I find that the signallers have been relieved, that I was not supposed to have returned until the following morning. “Stretcher bearers on the left” is the ceaseless cry.\n\nApr; 30\n\nI cannot write – it is all too terrible, too sad – later, if I`m not killed, I shall write these experiences. More despatches to run to Headquarter – one chap named “Toc” said to me, “Well done , Slilas, I must try to get a V.C. myself.” He is such a good natured fellow and very keen to distinguish himself. \n\nFighting still continuing with unabating fury – the men are commencing to look very weary, they do not look as if they can last much longer – how long will this Hell continue?\n\nTo Battalion Headquarters – when I get there, Lieut. Curlewis pulls me into the Headquarter`s dug-out , saying “Come in , Silas you`ll get killed.”\n\nOn the way back I guide Lieut.Geddes to Captain Margolin – “You`re going too quickly for me, Silas; I am very weak” – I then discovered the poor chap has been wounded. I hear our losses have been very heavy.\n","57":" \n\nWe are relieved from the firing line – the battle still raging; every nerve strained. Australians have done splendidly, holding a very difficult position have been much troubled with snipers. Am glad I have done my duty. First\n\nwash for a week – go down to the Water Hole, which is always covered by Turkish snipers - it was safer in the trenches than here – all around this spot are dead and wounded who have been hit when dodging round this corner; however, one must drink, even if the price be Death. \n\nMake dug-outs in our rest camps, but men are continually getting caught by the snipers. Many are commencing to suffer from dysentery, thought the spirit of the men is splendid, always ready for a joke.\n\nSignaller Walker just hit in the mouth – we considered we were out of range in our dug-out but the snipers are everywhere. Sergeant of the machine gun is writing a very amusing diary, full of humour; I wish I had his spirit. \n\nIn the dug-out just above me a poor chap is lying very ill but has asked me to say nothing to the medical officer as he does not want to get sent away in the middle of the fun, as he calls it. Of such stuff are soldiers made – I think if I were in his place I`d be glad of an excuse to get out of this Hell, though I don`t think I should ever have forgiven myself if I had not come. \n\nI hear that to-morrow we are to make a charge – the Turks are cutting our supplies off; the situation is severely critical. To read this in a newpaper makes an item of passing interest; to experience it is something quite different – if we are up against it, please God I may die in the \n\nThe Charge of the","58":" A.I.Bde at Bloody Angle Anzac","59":"\n\nThis trench had been giving us considerable trouble owing to its position, commanding as it did, practically the main artery of Anzac, the road (if such it could be called.) through which our supplies were brought: eventually it became quite impossible to get further stores through.\n\nThe landing of supplies on April 25th had been an infinally more difficult task, it is time, but our ranks had become so decimated, the line so thinly held that we could no longer afford to throw away lives upon what we knew as certain death; it would have still further weakened an already weak front., and give the enemy the chance to break through; give to them the opportunity they had been so ardently awaiting. But at last even this consideration had to be ignored , for we could not hold the line without munitions, the human frame must have means of sustenance, for even the strongest will reach breaking point. \n\nIt was finally decided to storm the ridge – a desperate undertaking desperate even for Anzac, There could be no question of a surprise on the enemy, for they knew our straits, knew that we should have to make an effort or perish. All through the day the fleet had been bombarding the ridge, leaving no question of doubt in the enemy`s mind of what was afoot.\n\nAt 6pm on the evening of","60":" we, the 16th Bn assembled for the attack. The setting sun was touching the hilltop with rose and gold as we filed along in the purple shadows of the gully at its base. \n\nThe barrage from the ships had slackened, it was now – for Anzac – comparatively peaceful, for the contours of the gullies deadned most of the sound. The occasional ping ping! of some enemy rifle on the ridge above, as he fired at some movement fancied or real – the humming of some distant shell, with its plomp! as it hit its objective – were all the sounds that came to us. \n\nThe sun was well below the horizon, the fire from the the ships had died right away, the shadows deepened, until figures became moving silhouettes, or became merged into the scrub which overhung the gully. And\n\nso – what time we gazed up at the towering of sandy soil frowning down upon us, we waited tense, expectant, like dogs in the leash, every muscle strained for the moment of attack – a few whisper orders, the tightening of buckle and strap the stealthy loosing of the bayonet from its scabbard – “ The line will advance !!! “ then over all the bloody fiends of Hell let loose. Every rifle, every gun, opened up simultaneously; the ridge became a blaze of fire a murderous enfilade from the enemy`s right swept that hillside with a rain of lead; men withered away under it; the wounded, screaming in their agonies, rolled down the sheer slope, filling the gully below with a mass of writhing human flesh, soaking the gully in a torrent of blood. \n\nWe hung on with our bare hands to get a grip of that terriblesoil, which crumbled away at the touch; scrambling, rolling, sliding in our efforts to get a hold and whilst we hung there voiced from every throat, heard even above their nerve wracking crash of heavy expressives rolled up the strains of “Tipperary” – quite impossible to hear orders it was each man for himself – we knew what we had to do, and did it – at a price over the bodies of our comrades we reach the top of the ridge , in every crevice little stabs of fire, the enemy had their target in front of them , they couldn`t miss, they could roll their bombs down in dozens, each would get its mark – at last we got them out of the trenches, the ridge was taken could we hold it ?\n\n On our front end left a trail of lead which might be said to be coming over in a solid mass, our ammunition running out, men volunteered to supply this want, falling on the hillside as they clambered up with the heavy cases, others took their place, they too fell; again came others , they fell laying athwart the cases, making it still more difficult for those that followed to get at them, not for one second during whole of that terrible night had the enemy fire slackened.\n\nAt dawn the 16th Bn was a withered remnant. The little ridge on the right of the picture, at the most two feet high, in my considerably less was the only dead ground in that inferno. The only cover for the supports laying flat on their bellies; bullets plobbing into them, tears and rending them where they lay; specking the ground in a of little spouts of dust, tearing up the ground under them –and the enemy – as always , coming up in steadily increasing number, their supports behind them. \n\nElias Silas 16th A.I.F.\n\n{Written in long hand at top of page – “ Charge bloody Angle see also written description.”}\n\nsame manner and fight in the same spirit that I know my comrades will display, for they know not defeat.\n\nMay 2\n\nOur supplies are getting cut off – Turks have complete command of the roads through which we have to bring them – to-night we are to take the Ridge. I wonder how I shall get on in a charge, for I have not the least idea how to use a bayonet; even if I had, I should not be able to do so, the thing is too revolting – I can only hope that I get shot – why do they not let me do R.A.M.C. work? I have told the authorities that be often enough that I cannot kill. \n\nOne poor chap in a dug-out close to us was killed while preparing his meal; he has been lying there two day – his mess tin full of tea, the charred remains of the fire he was cooking by, a few biscuits scattered about, his pipe by his side – we cannot bury him on account of the snipers; it seems no place is safe from them – efforts are being made to clear them out but it is a difficult job as we cannot spare the men to do it. We are very hard pressed – we were to have had four days` rest from the firing line but now the situation is so critical that at all costs the enemy must be shifted from the Ridge. Colonel Pope has aged much during these first terrible days.\n\n5.30 pm.\n\nIn half an hour we have to move off for the charge. Close to where we have fallen in, enemy snipers are putting in\n\npretty hot work. I had to go up the road with a message; on the way back apparently I took to the wrong side – Captain Margolin called out to me, “Keep to the right; Don`t you know which is the right side? Run for it, you --- fool!” Then all the men called out to me to run for it – “ The snipers will get you” – however, I don`t think I cared much whether they did or not – if I am to get hit nothing can stop it; I am tired of never being able to move about with freedom, I`d much rather take my chance – running does not appeal to me; too much like hard work.\n\nI have just seen a very plucky incident. Some ammunition mules came down this exposed bend; the snipers immediately got on to them, one poor brute was severely wounded; the sight of the blood gushing from the tortured brute quite unnerved me – the rest of the train commenced to , break away – despite the great danger, two men rushed forward and caught hold of the startled animals, thus preventing a stampede which , in the confined space of a narrow road – if such it could be called – might have caused an impasse, and this, under the existing conditions, would have been highly dangerous.\n\nThe shrapnel is now ever in the sky, it is as much a part of the landscape as the cloudsl At 6 p.m. we march off. Half way to the Hill which we are to take we had a rest for\n\ntea, biscuits, bully beef, cheese and jam – I went down to a water hole in a gully; it was difficult to realise that all around us was such Hell. Lieut. Geddes was also there – a man whom I remember, at our concerts, used to sing very charmingly – poor chap, this was his last night in this world. \n\nJust as the sun was setting, throwing its rich colour o`er all the landscape, we formed up for the final march off for the attack – it was difficult going, crawling through the gully which skirted the foot of the hill we were to attack.\n\nWe were to attack at 7. sharp, prior to which our artillery was to support us – our Battalion , No.6 platoon supported by the 15th Battalion on the right, 13th on the left .\n\nLieut.Geddes looked at his watch – “ It is 7 o`clock, Lads, “ He said, “ Come on, lads, at `em.” Up we rushed – God , it was frightful – the screams of the wounded, bursting of the shells, and the ear-splitting crackling of the rifles. \n\nIn a very few minutes the gully at the foot of the hill was filled with dead and wounded – thee poor lumps of clay had once been my comrades, men I had worked and smoked and laughed and joked with – oh God, the pity of it. \n\n It rained men in this gully; all round could be seen the sparks where the bullets were striking. Amidst this Hell of writhing, mangled men and hail\n\nof bullets, a General was walking about – “Your puttee`s undone, young man, “ he said – “Yes sir, that`s all right, “ I replied, “I`ll soon fix that up, but for God`s sake, take cover; you`ll be killed.” Every second I expected to see him hit, but not until he had done up my puttee for me would he move – then, with an amused chuckle, he passed his hand over the top of his cap, at the same time remarking “That was a pretty near thing” – a bullet had singed the top of his cap.\n\nOn my way up the hill I much wondered what I would do when I got to the top – the Corporal of our signallers ordered all the signallers to the rear; this struck me as being curious, so I asked him whose orders – he said “Lieut.Southern” – so I went down the gully to see what I could do for some of the wounded. It was impossible to walk between them, they were in such heaps. \n\nOne sergeant, Caldewell, came tearing along, badly wounded but full of spirits – “My !” he said but they`re willing up there.” Another poor fellow, his right hand shot away, called out, “God, but I`ve done my duty. Is that you, Silas old chap; I`ve done my duty, haven`t I?”\n\nI was wondering what our officers were doing for signallers, so determined the reach them, orders or otherwise – my nerves were quite gone, but still I determined to make the effort. \n\nOn my way up the Hill, a large number of men were lying flat\n\non its face – it was a screen of lead right across. \n\nWalker, another signaller, made ever effort to reach the top – meanwhile the men were yelling to us to lie flat – we continued our way a little further until we saw the impossibility of our task, so we tried to dig ourselves in, but there was litlle room for anyone. Our artillery was firing into us as well – then came the cry from the top, “We must have ammunition” – to run down that slope was instant death – there was no officer to give the order and, aware of the urgency of the case, I got up and tore down the Hill, for being a signaller I felt it was my duty to take the risk, so went down to Headquarters with the message. \n\nOn my way down, in the gully, I came across the reinforcements coming up – one of the chaps said to me “Who are you? Where do you come from? What is your name?” Meanwhile drawing his bayonet – I had to answer pretty quickly, otherwise I could have had more steel than I wanted. \n\nI then came across Lieut.Braishaw lying wounded – “Who are you?” I said – “Don`t you know me, Silas?” he replied. “What is the password?” was my next remark – “Garra Gabba – don’t you remember, I came over in the same ship with you from Melbourne?” Then I remembered him – perhaps it was foolish of me, but the Turks had played so many clever tricks that it was best to play for safety.\n\nI covered him up with some bushes.”Can`t you help\n\nme to the rear now?” he said – a natural enough question, as we might not be able to hold the Ridge and the wounded would fall into the hands of the Turks – “No sir,” I replied, “I will tell the stretcher bearers to look out for you but I must take the message about the ammunition; it is very urgent.”\n\nI continued on my way – the gullies were choked with wounded; all along the route I kept coming across poor shattered things crawling along in their agony, but I could not stop to help them. Some distance from Headquarters I came across a pile of ammuntijon boxes – these should have been brought up by reinforcements, but by some error this was not done – I went to Headquarters with my message, where I arrived in a state of collapse – the horrors of this night have been too much for me, I cannot get used to the frightful sights with which I am always surrounded.\n\nMay 3\n\nDawn. Oh God, only 250 left of our battalion – there has been a ceaseless stream of wounded, many cases have died on the way down, until in most places the narrow pass is so cumbered with dead and badly wounded waiting for the stretchers that it is becoming impassable – along the edge, bodies are hanging in all sorts of grotesque and apparently impossible attitudes. Seeing those fine stalwart men going up the gully\n\nto reinforce and shortly returning, frightfully maimed and covered with blood – I don`t think I shall ever be able to forget this; it`s horrible. \n\nOne poor fellow , a New Zealander, came tearing past smothered with blood and quite delirious, kissing everyone he passed, upon whom he left splashes of blood.\n\nSome come along gasping out their lives and then remain silent, for ever. \n\nI don`t think we can hold the Ridge much longer – to complicate matters, our own Guns are firing into us, \n\nWill the stream of wounded never cease? It is now nearly midday and still they keep pouring down – Marines, some of them mere boys and New Zealanders are supporting us, but getting frightfully cut up. \n\nI am told to go and rest, which I do upon a hill held by the Marines. I lie down in the sun for a bit, but sleep I cannot.\n\nMay 4\n\nRest day - go to a new Rest Camp a little more sheltered from the snipers – expected to be away from the trenches a few days, but at 6.30 p.m. have to return – we are very short of men. \n\nEnemy has been busy all night with bombs through which we are losing many men – when I see the men going into the trenches I often wonder how many are coming out – a few minutes after they have been in there is usually a scream, then the awful cry “Stretcher bearers”, and then the mangled heap is brought out. The wounded lying in the clean wards of a \n\nhospital, with spotless bandages round their wounds, is one thing; but to see them lying here covered with mud from the trenches, the blood oozing through their clothes, and, more often than not, unrecognisable, is quite another.\n\nIn one portion of the trenches are the remains of what had once been a human being – every time I go through that section of the trenches, which are very narrow, I have to climb over this maimed corpse – there is not the time to bury him. We are putting up wire netting as protection from the bombs – we have very few bombs with which to return the enemy`s continued onslaughts with this hideous weapon. The low dull thud of their explosion fills me with horror, as I can always picture the result; though God knows I am seeing quite enough horrors without the addition of my terrible imagination. \n\nAll night the Turks have been sending up star-shells – any moment they may rush us – if they make a detemined effort, it`s (finish)\n","61":"\n\nIt has been a very tiring night – we are anxiously scanning the horizon for a sight of the transports which are to bring us the much-needed reinforcements – we are only just “hanging on” – please God they arrive in time. To-day went down to Headquarters with a message to Officer in charge of the Engineers R.E. building up the trenches at Quinn`s Post, the posi\n\ntion we are at present holding – I am getting so weak that I have to sit down and rest every few yards – one gap which was exposed to snipers I was told to run across but hadn`t the strength to do it; I had to take my time and my chance of being picked off. This doesn`t worry me much, I think I am about done – thank God men of my temperament are few and far between – I am quite satisfied that I`ll never make a soldier; a thousand pities to have been born an artist at a time like this – I do wish I could take War in the same spirit with which my comrades face its horrors.\n","62":"\n\nRelieved from the trenches – back to the Rest Camp. I set to work to make a dug-out, but can only do very little at a time. We are handed out cigarettes, some of which are quite mouldy, though I smoke them as smoking only keeps me going now.\n","63":"\n\nLittle sleep - I dread being asleep more than awake as my dreams are so frightful. I am making no effort to keep a concise diary, I can only hope that I shall be able to forget it all. \n\nAmuse myself designing stained glass windows – it`s awful having no reading matter; am reduced to reading labels on jam tins. \n\nAll last night the Turks have been bombarding heavily with shrapnel; a quite ujnusual occurrence, as they never used to commence before dawn.\n","64":"\n\nOur rations are excellent – lard, jam, potatoes, cheese, biscuits, ham and bacon – plentiful supply of all – we concocted many strange and weird dishes, making rather excellent little jam tarts by first soaking biscuits in water, baking them on the embers, and then, when the biscuits are nearly brown, adding the jam. Also make little stews – cutting up the bacon and the potatoes, stewing them together, when done adding a little cheese – a dish fit for a King, at least so it seems here.This is the first quiet day we have had that is quiet for this particular part of the globe. \n\nUp to date we have slept in great coats but now have managed to get hold of blankets; altogether very comfortable – it is cold at night but fine in the day time – fortunately have had no rain.\n","65":"\n\nHave been delirious all night, my nerves have quite gone to pieces – go down to the sea for a dip; this is certainly a most unique experience – how delightful it is to be immersed in the sea after not having had a decent wash for about three weeks.\n\nWe hear the Turk`s gun from Gaba Tepe, then “Shell oh!” – out we all scamper like a lot of naughty schoolboys – we take cover from anything on the beach that affords shelter. Then, after the shell has burst, back we go into the sea – “Shell oh!” – this time we were nearly caught, for two or\n\nthree shells came sliding through the air and burst quite close to us – however, we are determined not to be done out of our swim,, so back into the water we go. \n\nThe sea is a lovely colour. As I look out at the ships in the Bay it brings back to my memory my many sketching expeditions in that dear country far across the sea where it is happiness and sunshine, where Death is not ever waiting to reap, in so hideous a manner, the harvest that has been allotted him.\n","66":"\n\nDelirious again last night. “Stand to Arms” – B. Company will advance. Just before dawn every morning we had to “stand to arms” in readiness for a probable attack – it was all very eerie, dreary and cold in the thick morning mists – men would appear and disappear like phantoms.\n\nTo-day we are in for a hot time; I am feeling very weak and helpless – I have been taking morphine, given me by the M.O. – I can now neither eat nor sleep. I wonder how many of us will be left by sunset.\n\n– I do hope dear old Margy (Captain Margolin) won`t get killed; he is such a fine fellow and brave beyond compare, though it`s hard to say who isn`t – all the lads are splendid!\n\nTo-night the Light Horse are to take a trench facing Quinn`s Post – their bombs have been giving us a hot time, causing many casualties – we hear the Turks are massing, so it`s pretty certain there`s going to be something doing – we are to be the supports\n\nthough , if we go into it, what is left of the 16th Battalion will be wiped out completely. \n\nWhat a frightful night – the trench has been taken, and alas! our lads are gone into it. Lieut.Curlewis, Margolin`s great chum, has finished with troubles of this world.\n\nAfter the trench was captured, the forty yards of flat ground between this, our new front, and our own trenches, is being swept by the enemy`s fire, which is enfilading us. We have been sent into the firing line, but there is not room for us in the trenches – Margolin is frightfully upset – “My poor lads,” he said, “there will be none of them left; I do wish I could get them out” I asked Margolin “Can I take a message for him?” so off I go to find the remains of our Battalion. I leap over the parapet of our old trenches and dash across this lead-swept plateau, hoping that I shall not stumble over any of the decomposed bodies of any of the dead Turks which have been lyng there some two weeks. I do not know where our men are, except that they are somewhere in front – I find the Officer of the 15th Battalion – he says he does not know. \n\nThere is not room for me to go along inside the trench, so I keep to the outside until at last I find Lieut. Harwood who, when he sees me, exclaims “Silas this is fine; I wouldn`t be elsewhere for a thousand pounds; tell Captain Margolin we are being enfiladed.” “What shall\n\nI do? “Explain to him exactly our condition.\n\n” Back I go across this lead-swept plateau with my message – altogether I had to go six times across this place. When I reached Margy, he said “tell Harwood to bring the lads back, they are not wanted there and there isn`t room for them; I don`t want to lose my boys for nothing” – so back I had to go again.\n\nThis time could not find Haywood, so then I had to find where our boys were on my own and pass the word for the 16th Battalion only to retire. \n\nOne rather amusing incident – while trying to get into the trench it didn`t seem possible to do so without jumping on somebody`s head; one of the chaps exclaimed to me “ Come off the sky line, you --- fool “ – “I will,” I replied, “as soon as I can find space” “Jump in anywhere,” he answered back, “never mind if you do hit anybody, your`e not in a drawing-room.”\n\nIt certainly did seem ridiculous, standing on ceremony in a time like this, though I don`t suppose anything will alter this peculiar side of my nature. \n\nThey are now digging a connecting trench between our new front and our old trenches – we have had to retire, the Turks are too strong for us.\n","67":"\n\nDawn. The roll is called – how heart-breaking it is – name after name is called; the reply a deep silence which can be felt, despite the noise of the incessant crackling of rifles\n\nand screaming of shrapnel – there are few of us left to answer to our names – just a thin line of weary, ashen-faced men; behind us a mass of silent forms, once our comrades – there they have been for some days, we have not had the time to bury them.\n\nWe have kept at bay a large body of Turks, infinitely superior to us in numbers and equipment; their machine guns are a much better class of weapon than ours. \n\nAn incident typical of the sang froid of our leaders has just occurred; some Staff Officers had just come up to inspect some trenches when an enemy shrapnel burst over their heads – one turned round and remarked in his `Varsity drawl, which wnants to be beard to be fully appreciated, “I suppose its from Gaba Tepe.”\n\nReturn to Rest Camp. I make a sketch of the position for (I think) General Birdwood. 6 p.m. return to trenches .\n\nTurks bombing heavily - we have had a spot of rain which has made it extremely difficult to gain a foothold. \n\nI asked Captain Margolin if he could spare a little of his jam – “It isnt my jam,” he exclaimed, “It is our jam; help yourselves.”%%%%%%%\n\nThe stench from the corpses is appalling – I offer Captain Margolin a cigarette; though he does not smoke I think he ought to try – “All right Silas,” he said,” Ill see how I get on.” He is frightfully cut up over the loss of Curlewis. ‘Silas , I can hear Curly speaking, “ he remarked.\n\n We are\n\nserved with rum, maconichie rations, which are very good; ham and hot tea – I can eat nothing myself – “You must try,”said Margy. \n\nOur periscopes are very rough and ready contrivances which make an easy mark for the Turks.\n\nRather an amusing incident just occurred. It was a lovely evening – when going through a connecting trench, I got up and looked over at a distant landscape which was very fine colour, gloriously unconscious of the fact that just in front of me were the enemy trenches; I was suddenly pulled down and asked if I`m tired of life. Within a few yards of this same spot one of our officers, Lieut. Cretchman, goes past a hole in our trenches, something less than a foot wide, and gets killed – such are the chances of war.\n\n( Night of the 9th ) Captain Townsend said “ Come on lads, I`ll show you something to do,” and with a mere handful of men, during the charge that night, tried to take one of the strongest trenches in this section and , though frightfully wounded, I am told still urged the lads on.\n\nWe can still see the bodies lying on the Ridge where they fell the night of May 2nd and May 3rd\n","68":"\n\nPosition good, though all men very tired – considering the amount of shrapnel the Turks have ;poured into us, our casualties might have been much heavier.\n","69":"\n\nRelieved from trenches. Wash out some underclothing and\n\nhunt for “grey-backs” which are now prevalent everywhere.\n\nJust as Colonel Pope was coming out of the trenches he commenced to scratch himself – a roar immediately went up from the lads, who exclaimed “The Colonel`s got one.”\n\nGreat excitement - have just been presented with half a loaf of bread what exactly this means, only those who have been without can fully appreciate.\n\nSome papers at last, and Mail from Home, among which a copy of “London Opinion” – an article by Ashley Sterne made me laugh; the first time I have really done so for nearly two months. The letters from home make me think a lot, this terrible life will make me very contented with the ordinary conditions of life. For my part, all I desire is a little studio and the wherewithal for bread and butter.\n\nOur first night with blankets – am delirous again, which must be rather trying for my companions sleeping in the same dug-out with me, but they assure me it does`nt worry them at all. Very nice fellows, but rough; if only one of them had a greater comprehension of the right and proper place to use the past and present tenses.\n","70":"\n\nGo down to the M.O. for more morphine – he suggests my going to the rear where the noise is less, but when I look round and see the other chaps so full of good spirits and ready to hang on to the last, I feel that I cannot do less\n\nthan they, so determine to stick it as long as I possibly can.\n\nWe are hoping to be sent back to Lemnos to reorganise, as our Battalion is no more.\n","71":"\n\n“Stand to Arms!” – nothing doing. Return to Quinn`s Post. Hell of a noise on the right, though quiet where we are. “Lizzie” has not been coughing latterly, hear she has been sent home for repairs, but fear she has been sunk with the Majestic – how awful, for she has been one of our strongest supports during these terrible days.\n","72":"\n\nSunday. Suppose some more Hell again – all our biggest engagements have taken place on that day. I think if I am here much longer my reason will go – I do not seem able to get a grip of myself and feel utterly crushed and unmanned, though I shall try and stick it to the last. In my heart I know I am done – it would be too ghastly to bungle a message and perhaps cause the loss of the lives of many of these brave fellows. I thnk perhaps, now that I am no more use as a fighting unit, the wiser thing would be to get away for a little while – I do wish I could get wounded so that the matter could be decided for me.\n","73":"\n\nI was much worse last night – am told that I was quite off my head. Am told to go down immediately to the M.O. but I will not do so until our Battalion is relieved which will be\n\nin a few hours. See the M.O. who tells me that I had better go away for a week or two. I say good-bye to Colonel Pope, who says “I`m sorry you are going, Silas, you have done some valuable work for us.” When I tell Margolin I am going he exclaims “Yes, Silas old chap, it`s about time too, you`re not cut out for this kind of thing; I hope you will get into the A.M.C. as you always wanted to do.”\n\nI was asked to leave what underclothing I had, also equipment etc. which later I was very glad to do. On the way down to the Clearing Hospital there was a marked difference in the aspect of the landscape – where before there was nothing more than a track exposed to the enemy`s fire and the deady aim of the snipers, were now roads, if such they could be called, in parts cut to a depth of ten or twelve feet - when one considers how few men we have, how hard we are pressed, these roads are really a remarkable piece of work. \n\nI enquired my way at a hospital – a medical officer said to me, ”Hello, are you from West Australia? I am Dr Quinn.” I was glad to meet this man as he was a friend of my great chum Dr. J.E.Gordon of Perth, West Australia.\n\nAfter the incessant roar of the firing line, it seemed comparatively quiet at this spot. It is th end of a glorious afternoon – all the landscape is tinged with the warm glow of\n\nthe sun – in the distance the blue ocean sparkling like a jewel. \n\nUp the narrow winding path with its border of sad little mounds, one of which may be my lot before I can get to the Hospital Ship (We are always under the enemy`s fire)\n\nPlacidly come some Indians with ammunition mules. It seems more like a scene in a play than one of the most tragic drams in the world`s history.\n\nI am not left long in doubt as to the reality of it all. A buzzing as of a huge bee – a flash of yellow flame – on the ground a mangled heap from which slowly trickles a dull red stream Far away across the sapphire ocean just a few more will be waiting in vain for the return of their loved ones.\n\nI reach the clearing station – it presents a scene of well-ordered confusion; everywhere on the narrow beach are numbers of wounded awaiting their removal to the Hospital Ship. This cannot be carried out till well after sundown, for the enemy are sending a continuous rain of shells in this direction. \n\nEre our transfer to the boats we each have a label pinned on to us stating the nature of our wound. Many are gasping out their lives before they can be transferred to the boats. \n\nWe are put into the boats and are towed away to the Hospital Ships – we are towed from ship to ship; always the same reply, “Full up” – eventually we manage to get aboard one. The cot\n\ncases were hoisted on board by the derricks. The sea is fairly smooth, which is fortunate – a sailor tells me during the choppy seas of the last few days the wounded suffered terribly when being put aboard the Hospital Ship. \n\nEven right out here an occasional shell comes buzzing throught the air and drops close alongside – it would be really rough luck to get hit so far away from the firing line after having been in such thick scrimmages.\n\nThe ship I am on at present is the Sudan, a Castle Liner which is being used as a Naval Hospital Ship.\n","74":"\n\nAm transferred to the Galeka, another Castle Liner. This is not a proper hospital ship, there is only accommodation for 150 wounded – we have on board some 500 or 600, many very terrible cases, and the filth is awful. I request to be put on as orderly, at least I have the use of my limbs.\n","75":"\n\nAm on duty from 6 a.m. till 11 p.m. snatching foood when I can get it, which at any time I did not feel the need of.\n\nThere is practically no nourishment for the patients; very little bread, the majority have to eat the hard ship`s biscuits; jam, occasionally a little butter, very little milk – which is tinned- occasionally baron-tinned beef and a sort of cornflour.\n\nI have been watching two important brain cases – one man with a large portion of his brain exposed; the M.O.\n\nhas little hope for him but is going to give him a fighting chance.\n","76":"\n\nI am glad to say I have got my two patients up on deck; the atmosphere down here is simply frightful and everything filthy.\n\nOne of my cases is a man called Dench, he has been shot in the head and is both deaf and dumb.\n","77":"\n\nIn the cabin next to where are my two patients is a wounded Turk shot in the lungs – it is truly heart-breaking to see him gasping out his life and unable to do anything for him.\n","78":"\n\nOn deck 6.30 a.m. Patients are lying here just as they were when they left the trenches, with all the filthy and blood-soaked clothes still upon them. I must get them washed somehow, so I get the orderlies, who don`t seem to have thought this was necessary, to discover all the basins they can and get to work washing the patients.\n\nI take one of my patients, Miller, to the operating theatre and help with the operation. Dr Fiaski Jun. is the M.O. in charge. I nearly faint through weakness and dread shaking the surgeon`s hand while he is operating on this very dangerous case.\n\nDr Fiaski tells me that if this operation was being performed in a London Hospital , it would have been considered truly marvellous.’\n\nDench is now able to walk but is heart broken at losing\n\nhis speech and hearing – this he writes on a piece of paper and shows it to me. Another man, a handsome looking fellow, has lost his left leg up to the thigh; he tries to throw himself overboard – but, taking the patients generally , they are displaying wonderful fortitude over their terrible sufferings. \n\nOne man from Sydney, who has lost his right arm, is quite the merriest on the ship and seems thoroughly happy – a Turk wounded in the same manner does not display the same patience, though seeing he is a prisoner one must make allowances.\n\n"}}