{"Document Name":{"0":"Diary_0179","1":"Diary_0179","2":"Diary_0179","3":"Diary_0179","4":"Diary_0179","5":"Diary_0179","6":"Diary_0179","7":"Diary_0179","8":"Diary_0179","9":"Diary_0179","10":"Diary_0179","11":"Diary_0179","12":"Diary_0179","13":"Diary_0179","14":"Diary_0179","15":"Diary_0179","16":"Diary_0179","17":"Diary_0179","18":"Diary_0179","19":"Diary_0179","20":"Diary_0179","21":"Diary_0179","22":"Diary_0179","23":"Diary_0179","24":"Diary_0179","25":"Diary_0179","26":"Diary_0179","27":"Diary_0179","28":"Diary_0179","29":"Diary_0179","30":"Diary_0179","31":"Diary_0179","32":"Diary_0179","33":"Diary_0179","34":"Diary_0179","35":"Diary_0179","36":"Diary_0179","37":"Diary_0179","38":"Diary_0179","39":"Diary_0179","40":"Diary_0179","41":"Diary_0179","42":"Diary_0179","43":"Diary_0179","44":"Diary_0179","45":"Diary_0179","46":"Diary_0179","47":"Diary_0179","48":"Diary_0179","49":"Diary_0179","50":"Diary_0179","51":"Diary_0179","52":"Diary_0179","53":"Diary_0179","54":"Diary_0179","55":"Diary_0179","56":"Diary_0179","57":"Diary_0179","58":"Diary_0179","59":"Diary_0179","60":"Diary_0179","61":"Diary_0179","62":"Diary_0179","63":"Diary_0179","64":"Diary_0179","65":"Diary_0179","66":"Diary_0179","67":"Diary_0179","68":"Diary_0179","69":"Diary_0179","70":"Diary_0179","71":"Diary_0179","72":"Diary_0179","73":"Diary_0179","74":"Diary_0179","75":"Diary_0179","76":"Diary_0179","77":"Diary_0179","78":"Diary_0179","79":"Diary_0179","80":"Diary_0179","81":"Diary_0179","82":"Diary_0179","83":"Diary_0179","84":"Diary_0179","85":"Diary_0179","86":"Diary_0179","87":"Diary_0179","88":"Diary_0179","89":"Diary_0179","90":"Diary_0179","91":"Diary_0179","92":"Diary_0179","93":"Diary_0179","94":"Diary_0179","95":"Diary_0179","96":"Diary_0179","97":"Diary_0179","98":"Diary_0179","99":"Diary_0179","100":"Diary_0179","101":"Diary_0179","102":"Diary_0179","103":"Diary_0179","104":"Diary_0179","105":"Diary_0179","106":"Diary_0179","107":"Diary_0179","108":"Diary_0179","109":"Diary_0179","110":"Diary_0179","111":"Diary_0179","112":"Diary_0179","113":"Diary_0179","114":"Diary_0179","115":"Diary_0179","116":"Diary_0179","117":"Diary_0179","118":"Diary_0179","119":"Diary_0179","120":"Diary_0179","121":"Diary_0179","122":"Diary_0179","123":"Diary_0179"},"Date":{"0":"unknown","1":952.0,"2":953.0,"3":954.0,"4":955.0,"5":956.0,"6":957.0,"7":958.0,"8":959.0,"9":960.0,"10":961.0,"11":962.0,"12":963.0,"13":964.0,"14":965.0,"15":966.0,"16":967.0,"17":968.0,"18":969.0,"19":970.0,"20":971.0,"21":972.0,"22":973.0,"23":974.0,"24":975.0,"25":976.0,"26":977.0,"27":978.0,"28":979.0,"29":980.0,"30":981.0,"31":982.0,"32":983.0,"33":984.0,"34":985.0,"35":986.0,"36":987.0,"37":988.0,"38":989.0,"39":990.0,"40":991.0,"41":992.0,"42":993.0,"43":994.0,"44":995.0,"45":996.0,"46":997.0,"47":998.0,"48":999.0,"49":1000.0,"50":1001.0,"51":1002.0,"52":1003.0,"53":1004.0,"54":1005.0,"55":1006.0,"56":1007.0,"57":1008.0,"58":1009.0,"59":1010.0,"60":1011.0,"61":1012.0,"62":1013.0,"63":1014.0,"64":1015.0,"65":1016.0,"66":1017.0,"67":1018.0,"68":1019.0,"69":1020.0,"70":1021.0,"71":1023.0,"72":1024.0,"73":1025.0,"74":1026.0,"75":1027.0,"76":1028.0,"77":1029.0,"78":1030.0,"79":1031.0,"80":1032.0,"81":1033.0,"82":1034.0,"83":1035.0,"84":1036.0,"85":1037.0,"86":1038.0,"87":1039.0,"88":1040.0,"89":1041.0,"90":1042.0,"91":1043.0,"92":1044.0,"93":1045.0,"94":1046.0,"95":1049.0,"96":1050.0,"97":1051.0,"98":1052.0,"99":1053.0,"100":1054.0,"101":1055.0,"102":1056.0,"103":1057.0,"104":1058.0,"105":1059.0,"106":1060.0,"107":1061.0,"108":1062.0,"109":1063.0,"110":1064.0,"111":1065.0,"112":1066.0,"113":1067.0,"114":1068.0,"115":1069.0,"116":1070.0,"117":1071.0,"118":1072.0,"119":1073.0,"120":1074.0,"121":1075.0,"122":1076.0,"123":1077.0},"Entry":{"0":"\n","1":" Pozieres An advance last night, gained 800 yards. Heavy casualties on our side. I went to gun position \nlast\n this morning 5.A.M. Hundreds of wounded coming down to dressing station. B.86 lost 22 horses and 20 men. Our 3rd Bty lost 2 men, and two of our men are missing. Went out to repair telephone communication last evening, not back yet (2 P.M). The village of Fricourt is absolutely in ruins, not one single house standing, and the ground for miles around is pitted with shell holes. On the British front scarcely a square foot is free from shell holes. Another man in 3rd Bty killed\n","2":" 7.P.M Our Infantry still advancing. Captured a village and a wood. Australians complimented by General Haig; upon their splendid work. The usual blunders made by our Infantry. Told to take only half of the village. Instead, they went clean through. The Artillery were not prepared for this, and consequently shots fell amongst them. Our D.A.C is a damnable affair, cant get ammunition. Our trench mortars\n\nlost a few men, blown to atoms. Just heard that we lost the village, too dangerous to hold. Big bombardment on our right, never heard anything like it in my life. More than 600 guns in action here, all sorts from 15 pdrs to 15 inch. French and British\n","3":" Weather fine. Bombardment still continues, Our Infantry making another advance. I am sending thousands of rounds of ammunition to the Bty. All of the officers in a Seige Bty killed with one shell; They were in a dug out. 6 of them. One of our planes brought down. 9 captured Germans passed our lines this evening. Officer of the 101st Howitzer severely wounded, also 2 men, premature burst. The civilian population flocking back to Albert. A lot of our Engineers knocked out.\n","4":" Thursday. 2 men killed, Gr Bartleson and Maher. Capt A.E. Olding wounded shot in back. Gr Bowden suffering from shell shock, gone mad. Another man had the seat of his pantaloons blown out. He was uninjured. The two gunners\n\nkilled were batman, Direct hit, blown to atoms, This happened whilst they were having dinner. Artillery still firing. Terrible slaughter on both sides.\n\n27.7.1916 2nd Division going into action. Some more casualties in Bty. Bdr Tanner wounded. Driver Sloane, broken wrist, Corp Elphick, out of action. 800 Infantry left out of","5":" Division. Still chopping our way forward. Getting a stone cut and ready to erect over Gnrs Bartlesons and Maher grave. Weather fine cold during the night. Waiting for ammunition, 10 P.M. Cleaned out of horse shoes. Everything up side down\n","6":" Gr Mills wounded in head. Battery getting pelted with 9.2 inch. 1,000 rounds going to Bty. Albert getting shelled. Aeroplanes busy, a few Huns over. A great cloud of smoke on our right, Suppose an ammunition dump, ours, blown up\n","7":"\n\nA violent bombardment all night. Just now- 8.P.M it has eased off a little. Expecting to go for a rest soon, Every body done up, worn out. Increased our range 300 yards. This means that our Infantry advanced. The head stone was erected over our two soldiers grave. One driver hit with a piece of high explosive shell, A little bruised, remain on duty.\n","8":" Out of action, Relieved by the 20th Bty, Some 9.2 shells put into a Tommy wagon line, a lot of damage done. Our troops are in Contalmaison. One Battery in the village getting shelled. Our guns in wagon line, 4 oclock P.M. Most of the gunners as deaf as a post. Thoroughly fatigued, laying down everywhere. Boot and saddle 8.P.M. Move off by 8.30 P.M\n","9":" Arrived on the outskirts of Bouzencourt. 10.P.M last night. Camped. Boot and saddle at 8.30.A.M. move off in 15 minutes. Now three miles from Albert. Now camped in the wood on the hill, previously mentioned, named\n\nVadencourt. Off again tomorrow\n","10":" Moving, Boot and Saddle 8.30.A.M. Move at 9.A.M. Arrived at St Leger at 6.P.M. After a 20 mileS march. Weather hot, roads dusty\n","11":" Supposed to be resting at St Leger. As a matter of fact, this is where I have to work, Shoeing, ready for another move. General Hobbs and Col. Anderson inspecting horses, Some grey horses in the Bty. The General said get rid of them, I won’t have them in the Battery. Weather dry.\n","12":" General Hobbs again in horse lines. Battery out on manoeuvre for three hours. Inspection by General Walker tomorrow. No news, things quiet. Five reinforcements arrived yesterday. One left Sydney in June last. Farrier Sgt of 3rd Bty, up before the C.O. for getting drunk\n","13":" General Hobbs and Col Anderson inspecting horses just recieved from\n\nfrom D.A.C. Sent most of them back\n","14":" Today is General Walkers review. Told us that the 2nd Division gained two important positions. Far. Sgt of 3rd Bty, Severe repremand. Went to ordnance to get some horse shoes. Very difficult to got, in great demand\n","15":" Likely to move any day now. Reveille at 4 A.M. Three hours Battery manoeuvre. In our last stunt at Contalmasion we fired 10,000 rounds\n","16":" Nothing doing, only the regular routine, Battery drill. Fine dry weather. A new O.C. of Bty- Capt Taylor from D.A.C\n","17":" Battery drill, from 12 till 3. P.M. This village St Leger is on the Somme. Rather old and out of date. A few large munition factories on the outskirts, making sand bags. Mostly female labour and old men employed.\n","18":" Brigade parade, all day. Got back to camp at\n\n4 P.M. Rumoured that we move tomorrow. Weather hot and dry. We can buy vegetables in this village, such as turnips, carrots, cabbage, lettuce, also fresh fruit. Greengage plums, grapes, peaches, rock-melons. The rations are good, including onions, potatoes, bread, and fresh meat. Just heard that the Farrier and Saddler of 7th Battery got killed\n","19":" Left St. Leger at 6.A.M. Starting to rain, Making for Albert. Arrived at Contay 12 midday. The King and Staff passed through here on his way to the trenches. At 12.45.P.M A parade to see him\n","20":" Left Contay 3.A.M. Enroute to firing line, Making for brick fields. Arrived on the outskirts of Alberts at 7.30 P.M. When at Contay we were visited by General Birdwood, talking to the men; Dropped onto the sgt mess, we were at dinner, asked the Sgt Major how many casualties. He has 15 ribbons. Telling us, that on a average, 10 guns of the enemy were knocked out daily. A few large H.E \n\nshells on a road. A bit of a scatter amongst the wagons; Only lasted a few minutes\n","21":" Gunners called out at 3.A.M, to proceed to gun position, and dig gun pits. Our wagon line 6 miles behind gun position, in the Long Valley. Recieved orders to send to Bty 1,000 rounds of ammunition as soon as possible. Near our lines is a baloon, observing for a heavy Bty. This evening I was watching them change shifts. I was told that the officer who was just going up, got 15 hits on one Bty. He was going up 2.300 feet. The weather is hot, and the roads dusty. A horse that was lost when we first come to this front was found today; In fact it come back itself. The nights are terrebly foggy, very heavy dew.\n","22":" Our first casualtie, today. Gr McKenzie, wounded in shoulder. Seven of our planes attack one German plane, got him. A few shells, falling in Albert. 900 rounds of ammunition sent to Bty. Some wagon lines retreating, shelled out; One line lost 20 horses and several men.\n\nCorp Bloomfield of B.H.Q killed. Another man in 1st Bty, his heel blown off.\n","23":" Showery. Huns shelling Albert. Bdr Beeks, recommended for the M M. He rescued Bdr Tanner, who was wounded, under heavy shell fire. Horse shoes arrived today. Just finished drawn ammunition 650 rounds\n","24":" Showery again. A general attack last night. Our people advanced, The supports on either flanks were too weak, and we had to retire again. A Sgt Major, 2 men and 2 horses and a G.T. wagon, blown to pieces, a direct hit, They were Tommy artillery men.\n","25":" 1,200 rounds sent to Battery. This was an all night job; Rain pouring down all the time. The D.A.C arrived forward this day, about time. I hear with regret my old pal Farrier Sgt Bacon is under arrest, and pending court-martial, for Shooting, with intent to kill, one Frenchman, The Frenchman is recovering. I wont believe \n\nthat Bacon would do such a thing. I have known him over 15 years and worked with him, the most even tempered man that I have ever met, he would not hurt a fly. Hun planes over our lines at 4 and 6 oclock A.M. Our planes after them, result, an aireal duel; The portion of the front that our Brigade hold, is on the left of our old position and further forward. As regards guns, just the same as last position, hundreds of them. Just on the outskirts of Albert is a Battery of 12 inch Howitzers, and behind our Battery, 6 in Naval guns; All over the field are 4.7, 60 lb, 4.5 Howitzer, and 18 pds. Near our horse line, there are no less than 7 D.A.Cs, and all their horses and mules drink at one trough, The watering of so many animals at one water point, is a great problem.\n","26":" A few isolated showers. 700 rounds of ammo, sent to Battery. German aeroplane brought down in flames. One of ours brought down yesterday. Great difficulty in getting water for our horses 6,000 watering at one trough.\n\nBy all accounts we are steadly advancing. Shod old boosey Browns horse, Officer Commanding the Trench Mortar Btys. Handed out a 5 Franc note to give to shoeing smith. 7.30. P.M. heavy thunderstorm, lasting 15 minutes, Everybody swamped out, Wet to the skin.\n","27":" Showery, 1,000 rounds of ammunition sent to Bty, Met an old mate, Vic Carter, He is Sgt. M. in a D.A.C. One of our guns out of action. A premature \nof\n by the 101st Howitzer By. Wounded one of our men, and one of their own. This is the third premature they have had, each time wounding their own men.\n","28":" Raining steadily, seem to have set in, The ground as slippery as glass, horses can’t stand, fall down. One horse fell down three times going to Bty. Called out at 1.A.M. to recieve ammunition from D.A.C. Bouzincourt and Albert shelled yesterday and last night. We are in between. A village and three lines of trenches captured last evening.\n","29":" Today fine, but cloudy. Battery coming out of action in a day or two. Some big stunts on. 800 rounds sent to Bty this evening. Adjutant and Vet Officer inspecting our horses. The usual complaints, not sufficient grooming. Out all night, and half the day, work the soul case out of them, and then reward them with two double hands full of oats and a little grass hay\n","30":" Seven or Eight Hun planes over this morning; Dropped bombs amongst the 7th Bty. 12 men killed and a number wounded. The Bty was on parade, Gas Helmet inspection. A few coal boxes near our lines, Desturbed a wagon line, caused the horses to stampede. A few bombs near our Bty. Drawing 6 horses from D.A.C. The A.D.V.S. in horse lines this morning (Major Matson)\n","31":" The bombs dropped on 7th Bty, weight estimated 260 lbs. The exact casualties were 40 men killed and wounded, and 40 horses killed wounded, and destroyed. Terrific bombard-\n\nment all night. Bty coming out of action tomorrow\n","32":" Battery on road coming out of action. Just left gun position, when the Huns started to straff, Caught the 60 pds in rear of the Battery, A direct hit on one gun cutting the piece clean in two, We just escaped by the skin of our teeth. All move from wagon line 3.P.M. Arrived at Vendoncourt.6.P.M. and then went on to Contay arriving there 7.P.M.\n","33":" Departed from Contay at 11 A.M. in fine weather Arrived at the village of Hem. 4.30.P.M. 14 miles march\n","34":" Hem, is 2 Kilometres from Doullens. This evening is showery. Camped in a wood. 20 or 30 Acres, very bad camping ground, numerous mud holes, Too much shelter, never dry. Last night I went to Doullens. The second time that I have been in this town. Rather a busy place, purchased some provisions for the mess,\n\nprices fairly reasonable, Preserved peaches 2 Frans per tin 1\/8 Butter 2 ½ Francs a Kilo about 1 ½ lbs. Sugar you cannot buy. Fresh fruit is dear, come from Paris. Peaches 3 pence each, rock-melons 8 pence. Yesterday completed two years active service. General Hobbs through our horse lines. Read out in orders that Bdr. Beeks awarded the M.M.\n","35":" Still showery. Moving off to entrain 8.30 P.M 10.30.P.M. raining like fury. Horses and vehicles trucked. Moved out of Doullens 1.A.M. Destination unknown\n","36":" Arrived at Poperinghe 7.45.A.M. Hooked in and march 6 miles to a village named Boeschepe. Col Rabett with his B.H.Q camped here; In fact this is his billet. But being his old command he allowed us to put our horses in stables. 12 miles from firing line. This village is near the Belgium border.\n","37":" Again showery, Having a bit of a rest in this\n\nbillet. Most of the people in this village speak English well, a large percentage are refugees from Belgium. Met Col Rabett shook hand with him, had a long talk. He said he was more than pleased to see his old Bty. He is now in charge of 15 wagon lines. No swollen head about this Colonel, a thorough gentleman. His Brigade is attached to the 4th English Brigade in action.\n","38":" Raining all day. Our officers going to pick out gun positions. Today is the first time that we have heard the report of the guns, since coming on this front. Big bombardment going on. Very nice Hospital here, beautiful flowers, and grassy lawns, Run by the Canadians. Everything so clean. This is the second time in France that our horses have been under cover.\n","39":" Rain continues, very miserable. Our next position in action is through Ypres likely to move tomorrow. In today paper is stated that Roumania declared war on\n\nGermany. The French were wild with delight when they heard about it.\n","40":" Lieut Archer, picking out a wagon line. Pay was issued yesterday. Very quiet\n","41":" Left Section going into action. Leave here at 4.30. P.M. Right Section going tomorrow. Today fine but cloudy. Went to village of Poperinghe last evening 4 ½ miles from here. One portion is knocked about a great deal by shells. Like all the rest of the towns in this country, consisting of broken down hovels, and one main street. Enormous prices charged for any article, fresh fruit particularly. 6 Francs for a pine-apple 2 Francs for a cabbage 2 Francs per lb for grapes and 9 pence per lb for tomatoes. Lemonade, 3 pence for a wine glass full. The cheapest of all is beer 1 penny per glass. Hop picking in this part is in full swing. Very poor rates of pay, all piece work. 2 pence per basketfull. Pick about 10\n\nbaskets per day. This evening, in company with Vet Sgt Bootle, visited a flour mill. The real old kind, worked by the wind. The sails about 30 feet long, conducted by one man. He informed me, that he grinds 25 bags weighing 85 Kilos each per day. The mill he said was 200 years old. I saw 1804 and 1844 cut on some of the beams myself. I went up the stairs, the mill was working, rocking like a ship at sea. The fittings were mostly all wood. Hundreds of these mills all over this country. A most noticeable building in these villages are the Churches. Butcher shops are few. In each village is a Brasserie or brewery.\n","42":" Left Boeschepe, at 5.30.P.M. Arrived at the Outskirts of Poperinghe 7.30.P.M. Temporary wagon lines. Two gas alarms last night. About here is where the Canadians suffered heavy casualties through gas. We relieve the 46th Bty 12 Brigade\n","43":"\n\nFine weather. Poperinghe is about 1 ½ miles from our present wagon line. Gun teams got back from gun position at 4 oclock this morning. They left us on the road last night at 7. oclock. Poperinghe shelled this morning, 5 of the civilian population killed. 26 aeroplanes over today. We are now in action in Belgium. Better class of people here, speak more English\n","44":" Wet and cold, likely to put the winter in here, making ourselves comfortable. 30 rounds fired by Bty yesterday. Front fairly quiet. This is the Ypres salient, We are 6 miles behind our guns\n","45":" Orders recieved \nto\n at 12.30. P.M. to move our wagon line, Starting at 12.30.P.M. Must be away by 6.P.M. Raining in torrents. Bitterly cold. Absolutely the worst we have had, mud over boot tops, and wet to the skin. Wind and rain terrific. Got to new wagon line at 7.P.M. Still raining\n\nNo cover for man or beast, one sheet of water, The frame work of a hut was here. I lent the men a tarpaulin that I carried for a shop, to put over, so they were right for the night. Sgt Bootle an I brought a portable Armstrong hut along on G S wagon. Fixed it up in the pouring rain, Anyhow we had a dry place to sleep in that night\n","46":" Great change in the weather, today is beautiful and fine. Everybody busy building some kind of cover. Shoeing Smiths and Myself built a shop. General Hobb in our lines. Great Artillery activity all night\n","47":" Still fine, Nothing doing, just fixing up our wagon line\n","48":" Cloudy, The name of this place is Ouderdom. A number of aeroplanes over yesterday. A bombing accident, today, killing one man and wounding twenty, This happened alongside of our lines. The men were terribly knocked\n\nabout. The Sgt had both arms blown off and half of his head. Others were hit in arms legs and heads. Artillery bombardment again last night, the vibration was felt quite distinct. Three more remounts recieved \n","49":" Gas alarm last night. The Artillery fires furiously when this gas is coming over, to try and disperse it. Drawing remounts today. We are ½ mile from the village of Ouderdom in Belgium. Tonight I went to Reninghelst about 1 ¼ miles from here. The same high price for fruit, Apples 1-30 per lb, grapes 1-50 per lb.\n","50":" Very quiet day, Half holiday for the men. This is the first for months. Weather fine, getting cold, mornings foggy. Lieut Little, on leave to England. Australian Divisions pouring in. Very few French here, all Belgiums. They speak Flemish\n","51":"\n\n6 killed and 13 wounded, Canadians. They were lighting a fire, and Fritz spotted them, He put the fire out. Our Capt nearly went mad, giving the Battery position away Fine weather. Baty fired 600 rounds since going into action here. We are up to our strength in horses, first time in France. 2.M.S. Thompson returned from hospital, away 2 weeks, with a poisoned hand.\n","52":" A few showers last night, Tonight is the first time that ammunition has been taken to this position, there was plenty left in the gun pits. 17 of our planes over enemy line, reported that they saw, Germans pulling up railway lines close to Combles\n\n13.9.1916 Much like a winter day in Sydney. The 3rd Division of Artillery is in France. Our front quiet. A bit of a dust up with an Infantry officer, about moving some huts. He says we had no business to move them. Told us to put them back. We are \n\nstanding fast, All bluff I think. I believe we will have a wet and cold winter. As regards shoeing, I am alright. A nice little shop holds 3 horses comfortably. Sgt Major still in wagon line. The health of our men is excellent. The conditions are good, we can always get a change. Hundreds of little shops about, Prices hight, oatmeal 8 pence small package, preserved pine-apple 2 Francs or 1\/8 in English, a small cake 1\/8, eggs3 pence each, small tin of biscuits 6 Francs\n","53":" Today is again wet and windy, Winter is coming on fast. The unfortunate","54":" Bty, got blown out of it position. They had to clear for their lives. As luck would have it only one man was wounded. Colonel Foote, staff officer in our lines this evening asking about the hut that we move. In a towering rage. Anyhow he did not get it back. Found fault with everything. Nothing right. If some of these old coots, went up to the firing line, and looked\n\nafter matters a little better up there, they would do some good. All they are fit for is to crawl around wagon lines. This wet and cold weather is playing up with our horses. No rugs, no cover; Big stunt on this evening\n","55":" Fine day but cold; One of the greatest bombardments in the history of the war, is to take place, on the Somme this evening at 6. oclock We are supposed to start here at 11 A.M\n","56":" 7.30.A.M. Raining again. The Battery was pelted with 9.2 inch shells yesterday, no damage done. Brilliant success by the French and Canadians on the Somme. Take a great interest in that part, We know a lot of places there. Winter stables getting erected all over the place. Cold weather coming on fast. The British authorities must spend thousands of pounds on this work.\n","57":" Sunday, the civilian population going to Mass. Fine morning 9.30. Evening dull and chilly.\n\nA stunt last night, starting exactly at 12 oclock. Bty to fire 100 rounds, It was hell while it lasted, (1\/2 hour). This was just a demonstration to let the Huns know, that we are still here. Hundreds of guns took part in it. A new armoured motor car is in action here armed with 6 lb and numerous machine guns. Nothing but a direct hit, will put it out of action. We named it the tank. It resembles a tank. O.C. inspecting our wagon lines this evening 5.30. Going on leave to England tonight. Sgt Buckler, Corp Elphick, and G. Harvey, ordered to parade at Battery, something about letter writing. No green envelopes available so the officers censor all letters\n","58":" Terrebly wet day, raining in torrents; Three more Military Medals awarded, Bty H.Q men Corp Fairey, Bdr Tanner, (away wounded 6 shrap holes in him) and Bdr Horan. Horse lines in an awful state, mud everywhere. Ordered byVet officer to make and shoe a certain horse with a pair of bar shoes. This horse has\n\nvery bad feet. My Corp Elphick in trouble about letters. Said something the officer took exception to, he is going before the Colonel.\n","59":" Showery. General Hobbs in wagon line. Lieut Little back from leave. Weather cold and wet\n","60":" Wet, cold, windy, and miserable; A bit of a stunt on at 1.P.M. Another this evening at 7.30. Horses still in the open. Cold and wet weather playing havoc with them. Not much doing on this front. A few of our planes floating about. Pelted with high explosive by the enemy.\n","61":" Isolated showers. Letter recieved from home, saying that Vince should have arrived in England. Sir Douglas Haig inspected 2nd Battallion of Infantry. Sgt Todd evacuated, suffering from boils. Six on one arm, and two on the other. Our gun pits falling in, been in action two years.\n","62":" Fine day, Hun plane over, our people got busy on him, and brought him down. Enemy\n\nshelling Poperinghe this morning\n","63":" Weather fine, nights cold, Hun planes busy. Winter clothing will be issued in a few days, consisting of 2 shirts, 2 pairs of underpants, 3 pairs of socks, Gum boots for gunners, and Canadian top boots for drivers. Our boys in wagon line made a raid on a potatoe patch, the consequence was, a camp commandant with a Belgian interpreter made their appearance, and the unit has to pay 35 Francs. An officer is now at wagon line, the first time in France. Large body of Infantry going to trenches. Tons of material going up, to trenches, by all accounts they have to be rebuilt. They are in a horrible state. No wonder the Canadians got slaughtered there\n","64":" Went to Reninghelst Church, Three priests officiating. The sermon was in Flemish. Strange service, Seemed to be a high mass and Benediction combined. The only church where change is given. The first collection\n\nis taken up by a man, you simply hand him a coin. I handed him ½ Franc. I was offered 2 pence change. The next collection was taken up by men and women, no plate passed around, instead a brass affair like a frying pan. The service lasted one hour. Coming back had dinner with S.M. Bradwell of the 103rd Howitzer Bty.\n","65":" Recieved a letter from Vance, he is in England. Weather fine. Comforts in the shape of shirts, sox, underpants, insect powder, chewing gum, papers, jam, handkerchief, recieved this day. A bit of a straff on this evening. Very quiet on this front compared with the Somme\n","66":" Hun plane brought down this morning. One of ours compelled to land, pilot and observer both wounded. Great Artillery activity today, Capt Taylor in our lines. Our G.S. wagon in ditch, loaded with iron girders and channel iron, Terrible job to get\n\nit out. Lieut Morris horse stolen from a stable in Poperinghe last night, had to walk to camp. Horse saddle and bridle turned up today. A man in 101st Bty under arrest, supposed to be the thief. Ammunition going to guns tonight.\n","67":" Nice fine sunny day. Hun plane over this morning, dropped a bomb on a shed in Poperinghe, where a number of our Infantry were billited. This bomb was a dud. Two heavy Btys passed this way last night. Heard that Combles and Thiepval were captured. Combles is a great railway junction\n","68":" A lot of shooting going on. Nothing startling\n","69":" Raining last night. Went to Reninghelst last evening. Went to a hairdressers shop, the barber was drinking beer, I left. Terrific Artillery shooting. Stopped raining, terrebly foggy. Some heavy guns in action, not far from our wagon lines. Horses are looking\n\nwell again. Very little work. Major Matson in lines yesterday, no complaints. Making a start on stables today.\n","70":" Major Matson A.D.V.S. and Colonel Wilson Vet officers, in lines this evening. Everything wrong, horses not groomed, Shoeing wrong, talking about angles of the feet. These English officers have got the Australians set, and every chance they get they rub it in. Colonel Anderson also inspected our horses Too many heads on this job. As I write this a terrific bombardment has just started. 8 P.M. exactly. Rumoured that a 36 hours bombardment is coming off. Having a try for Hill 60, a real death trap. The Canadians got cut up there. We are on low ground. Lost a G.S. wagon last night, got up near the supports, and capsized into a ditch. The mule team got to wagon line at 6 oclock this morning.\n","71":" A little recreation, Cricket match\n\nbetween eleven from the 5th Battalion and eleven from Bty. Match unfinished, continue on Tuesday, Germans and weather permitting. Day fine. A German plane brought down one of our balloons about 4.30 this evening, Totally destroyed. The raid last night very successful, penetrated to their third line of trenches. Captured 21 Huns, they would not go toward our lines, tried to bolt back to their own. That was the end of 20, only one got to our lines alive. Hundreds of Infantry men going past our lines, in the direction of firing line\n","72":" Wet and cold 6.P.M. one wagon load of ammunition going to Bty. Nasty trip for the drivers.\n","73":" Wet day. Nothing doing, very quiet. An officer is now constantly in wagon lines. Lieut Archer is here at present, for one week only.\n","74":" Again wet and miserable. The same old complaint, mud over your boot tops Everything quiet during this weather. Getting on slowly with our stables. A number of men suffering from boils. Weather too rough for aeroplanes.\n","75":" Bty is coming out of action in a day or two. The weather is fine, and mild. A few shell about the Bty. One of our mules wounded at Lille gate last night. This is a dangerous spot, swept by machine gun fire every night.\n","76":" Fine but cloudy Bty coming out of action tomorrow. Shoeing Smith Heyden gone to Hospital, something wrong with his throat. Tonight is windy and rough, Artillery active.\n","77":" A few isolated showers, with a fierce wind, Bty coming out tonight\n","78":" The Bty out of action. Weather disagreeable hight wind and showery. No casualties in this position. The 8th Bty relieved us. This gun position is regestered by the enemy. Twenty horse rugs issued. One new blanket per man issued last night.\n","79":" The Belgiums made a bit of an advance. Captured 6 trenches. Fighting from 2 till 5. terrific bombardment. This is supposed to be our rest. One section going to reserve wagon line, about 4 miles away. School of instruction\n","80":" Bty S Major, on 10 days leave, England.\n","81":" Still windy and raining early this morning. Getting cold during the night. Muster parade, tin hat, and gas helmet inspection.\n","82":" We have no guns, 2 at school of \n\ninstruction and 2 at mobile workshops for repairs. Shoeing Smith Heyden struck of Bty strength\n","83":" A few showers, high wind. Vet Sgt F.W. Bootle, going to 4th Battalion as private. Transferred at his own request. Going for a commision. 83 raids last night very successful. 450 prisoners near our Head Quarters. Come from the Somme.\n","84":" Departure of Vet Sgt. for Infantry. I am ordered to carry on until another Vet Sgt is appointed. Marching orders recieved. Marching order parade, told Sgt Major I want to be excused, very busy in shop. Because I was not on this parade I had to attend office. I had 6 horses at the shop. An explanation was given, The orderly officer failed to tell the O.C. Everything in order.\n","85":" Terrible explosions, sounds like bursting shells, not far from our lines. Hail\n\nstorm this evening. Cold. Moving off tomorrow, at 8 oclock A.M. Wagons packed tonight, The march tomorrow is about 10 miles, the day after 30 miles.\n","86":" Left Ouderdom 8.30. A.M. Arrived on the outskirts of Cassell at 2.P.M. a distance of about 14 miles. Terrific hail storm when we were leaving the morning. Later the day was fine.\n","87":" Early move 4.30. A.M. Arrived at Clerques.5.P.M, after a journey of 31 miles. The later part in the pouring rain.\n","88":" Billeted in a barn, very dirty, mud everywhere. In the two days trip I lost one shoe. Destination unknown. Voting for or against conscription. Raining like fury. Tonight is a wild night. \n","89":" Fine day, Horse with a fractured leg\n\nHe was destroyed and buried. Moving off tomorrow. Entraining at St. Omer for the Somme.\n","90":" Boot and Saddle 11.30.A.M. Move off at 12 oclock for St Omer to entrain. Arrived at St Omer 5.30. P.M. entrained by 6.30 P.M. Moved out at 8.P.M. Bitterly cold, frosty Arrived at Amiens. 8 A.M.,","91":"\n\n21.10.1916 Bitterly cold, After a march of 12 miles we arrived at Bonnay. Horse lines in a bog hole. On our trip today we passed a few hundreds of German prisoners. A large number wearing glasses. Mostly young men. Two trains wrecked by enemy bombs. Two hours before we reached Amiens. Thousands of pounds worth of damage done.\n","92":" Moving off again in the morning; 9.A.M. arrived at Vievills, 12 midday. Passed a lot of Huns on road, repairing same\n\nThey seem happy. Three Brigades camped together. The first time for months. Our men in canvas huts, about 7 feet high\nt\n. 3rd Brigade Infantry cut up. This is our third time on the Somme.\n","93":" Raining, and cold, likely to move to wagon line tomorrow morning. At present we are 1 ½ miles from Albert. This evening the O.C. Btys selecting wagon lines. Almost dark at 4 oclock. The rumble of the guns can be heard day and night, they resemble distant thunder\n\n24.10.1916 In new wagon line. Wet, cold and muddy. Relieving the 3rd N.Z. Battery. Right section gone into action tonight. The Bty is in action in Fleurs, a real hell hole, lucky if we get out of it.\n\n20.10.1916 No rain. Left Section arrived, and gone into action. This is an awful hole, horses and men getting bogged. 6 horses in a water cart struggling\n\nalong, 10 horses in a G.S. wagon. The","94":" N. Zealand Bty move\ns\n out tomorrow. A bombardment on, started last evening at 7. oclock. Still on, now 5.P.M. Our wagon line shelled during the night, no damage done. Aeroplanes and baloons up in scores. Hundreds of G.S. wagons and motor lorries on the road, and thousands of horses. This road is the only possible way for vehicles to get to the firing line; All material, and ammunition and rations going up, and wounded coming down. The report of the guns like one continual roar of thunder. We are camped near Mametz wood, which was once held by the Huns. Not a tree standing, a few stumps left. Put in a rotten night, wet through flooded out with mud. and, frozen, This is fair Hell, can men live through this I wonder.\n","95":" Wet again. Tonight is very quiet. Rigged up a bit of a shelter out of German Capolas, got a fire going, fairly comfortable, The same performances again, wagons and guns bogged. The reason so many horses, men, and vehicles get bogged is on\n\naccount of shell holes, Some of these are 8 and 9 feet deep, and 12 or 14 feet across, and are filled up with slush, and are not noticeable, consequently when a man get into one of these holes it is almost an impossibility to get him out . Dozens of British Infantrymen have lost their lives in these death traps. Winter is here alright. Pitch dark at 6 oclock.\n","96":" Isolated showers, 300 rounds of ammunition to go to Bty tonight on pack horses. Canvas carriers to fit over saddle, and to hold 6 rounds are issued, sometimes 4 rounds are carried on the riding horse as well. Hun plane brought down. R.H.A. preparing to move and work with Cavalry. Expecting a big push shortly. Bty fired only 80 rounds so far. Loosing shoes every day now, pulled of in the mud, feet get in a terrible state worn down to the blood, many horses lame with punctured feet, caused by flint that is here, sharp as a razor. The Bty we just relieved, had eight weeks here, during that time, their casualties were, men 82, and horses 31.\n\nA large number of our men sent to Hospital. This is the weather to cripple men.\n","97":" Again wet, 400 rounds of ammunition sent to Bty. One horse crippled, fell down, and cut his hind heels almost off. Shoeing horses under tarpaulin, leaking like a sieve. A bit of a stunt on. Infantry going to trenches. 15 inch guns near us, firing during the night, report, terrific. I never saw so many dead horse in my life as here, strewn all over the place, get in a bog, useless to try and get them out, shoot them where they are.\n","98":" Raining in torrents, bitterly cold. First casualty in this position yesterday. Gr Jones had one leg shot off accidently. The signal, S.O.S was sent up. (our guns are always laid on this targate, when cease fire is given) He and Gr Gibson rushed to the gun to fire it, Gibson got there first and pulled to firing lever, just a Jones was in front of muzzle. 396 round of ammunition to guns.\n","99":" Very disasterous day, Sgt Leeming wounded in lungs, Gr McVitty wounded, Driver Bedford killed, and Driver Herford wounded in head, Gr Winn wounded. 2 horses killed and one lost Sgt W.T.Watson was mixed up in this lot, got knocked over, escaped injury. The Bty getting heavly shelled. Another bombardment on tonight. Hear that the Infantry hop over tonight. Showery. Since coming to this wagon line, we have lost, 2 horses killed, one to Vet Mobile, 2 stolen, and one lost. Roads getting worse, almost impossible for a horse to walk about, mud up to their hocks.\n","100":" The beginning of another month, goodness knows what it will bring forth. Five minutes past 6.P.M S.O.S. Bty opened fire, counter attack by the Huns. More showers, Hun plane over; A lot of our men getting sick, particularly Infantrymen, 3 Hun prisoners passed our lines, covered in mud, from head to foot, completely done up\n","101":" \n\nChange this afternoon, sun shining, Nothing of any importance doing. Horse rugs issued, also field service boots, sheep skin vests and woolen gloves.\n","102":" Fine day, Aeropanes taking advantage of fine weather, Hundreds about. Not a gun fired this morning from 5 A.M. till 9.A.M. Although now 12.30. P.M. they are rattling into it. The Hun airmen are about also, as I write this an anti- air craft gun is firing away. All Infantry being withdrawn from trenches, up to their thighs in mud. They are relieved by another Division. Fricourt wood shelled, 36 Infantry killed with first shell. Shelling lasted all afternoon.\n","103":" Fine weather. Bombardment changed over to our right. Terrific Artillery fire. Bty shelled all day yesterday. A few shots over, near our wagon line, too close to be healthy. Hun planes over. A few (6) reinforcements arrived. Rumoured that a bid will shortly be made for Bapaume \n\nBelieved, 4,000 women and children are there\n","104":" An urgent call for ammunition 10.30 P.M. Turn out the teams, Raining like fury, blowing a gale, bitterly cold, Today is fearfully boistrous. Infantry hopped over at 9 oclock this morning, gained 400 yards, which they still hold. Three old hands returned to Bty this evening. 5 horses drawn from D.A.C to replace casualties\n","105":" Only one sharp shower today. Terrific bombardment all this evening. A village the other side of Bapaume bombarded. One of our grs wounded Gr Williams, (a youngster about 18 years old,) Employed as runner. Corp Smithson of Leichhardt on B.H,Q, wounded in spine. Every night a few shells fall around our horse lines; Rations getting light, 4 men to a loaf of bread, 6 to a small tin of jam, 1 tin of milk to 16 men. Cant buy goods here; A canteen in Albert, when they have stores, which is seldom, charges 3 Francs and 2 pence for preserved fruit, and 1 Franc for a small package of oatmeal\n\nBty still getting shelled. Some horses and men belonging to another unit, killed there today\n","106":" Lieut George and Bromlow, 1st Bty killed at dinnertime today, 11.2 in shell. Two Bds of our Bty, Dingle and Sharrett, buried in a dug out, both wounded and sent to Hospital. Our Infantry cut up again, the usual happened, flanks failed to come up, Some of our men stuck in mud up to their waist, dead, others drowned, or smothered in the mud. Awful stir up here last night, enemy plance dropped bombs one one of our ammunition dumps, blown up. The weather is damnable, raining and windy, also bitterly cold. Our horses going to pieces, about 30 out of action, peculiar cases of punctured soles, for all the world like a cut with a sharp instrument, and very fine pieces of material like glass, wedged into the cut, The horse goes awfully lame. The foot has to be cut out, and thoroughly examined, to find the seat of lameness. Although we never cut\n\n \n\nout the sole of foot when shoeing, never the less it get as thin as a piece of paper, and the least pressure causes an injury. The treatment we administer is, cut out well the puncture, pour in raw Lysol, pack with tow, put a piece of hoop iron under shoes to keep in packing.\n","107":" 4.15 P.M. bombardment on our left. Heavy stuff coming over. The 101st Howitzer Bty had one man killed and 2 wounded. A shell landed in our horse lines last night, no damage done. Corp Ansell arrived from base details, when we arrived in France he was left with kit bag at La Valentine. Weather still wet and cold. Gr Williams died of wounds. This is a terrible hole, men and horses covered from head to foot in mud. Hundreds going sick, I am suffering from a slight attack of dysentry. 40 officers short in Division. Lieut George who was killed a few days ago, the biggest part found was a hand with a wristlet watch attached. He was absolutely blown to particles. One Bty in our Brigade has only 30 horses in action\n\nThe bombardment has eased off a little. 7.P.M. One of our officers, Lieut Little, just returned from firing line, been away one day and a night, F.O.O. Said it is cruel to see the Infantry. Some with legs off some with arms off, others with trench feet, and some doubled up, almost unable to walk, standing in mud and slush up to their hips, Suffering untold agonies. In the Bty, particularly the wagon line men, we are having a hard fight. Last night at 10 oclock we were turned out to draw ammunition from a dump. Wet through all the time we have been here. This is hell upon earth.\n","108":" Today is the first fine day, that we have had in action this time. Aeroplanes very busy. Two Huns brought down; One of ours brought down in our lines. Capt Olding coming back to Bty. Counter attack by Germans last night. A big stunt on all night, A 12 inch and 15 inch guns firing. Very plucky airmen those Huns, dozens of our men up, but still one or two\n\nHuns continue to come over. Look like a flock of sparrows after a fly. A few shells whistling about our lines during the night, never any in the day time.\n","109":" Beautiful day. Big stunt, 5.30 till 9.15. A.M. Air alive with Hun aeroplanes. One gun 1st Bty blown. One of our guns sent to workshops for repairs.\n","110":" Foggy morning, Indication of more rain. The 1st Bty had 12 horses killed and wounded, also 2 men wounded. The Bty was retreating, We the 2nd Bty had to lend a hand, supplying horses and men, Turned out at 11 P.M. Stupendous bombardment, all night, particularly intense just now 5.A.M. Advanced 1600 yards, capturing a number of field pieces. Major Matson A.D.V.S. inspecting our horses. A bright lot I must say, about 30 out of action. Asking why they were not groomed, nice question, considering that they were ploughing through mud up to their bellys all night. \n\nThe most remarkable thing I saw yesterday was an aeroplane duel, 3 0r 4 of our planes, tackled a Hun. One of ours turned four or 5 summersaults, just like a sheet of paper caught in the wind, dropping a few thousand feet; He then made a magnificent recovery, making for the aerodrome. He must be wounded. Another Hun plane brought down in flames.\n","111":" Somme, continued. A fearful mishap at Bty last night. Gr Allen Gr Hassell, Corp Fairey and Bdr Beeks all killed. The last two mentioned were M.M. men. The 101st Howitzer Bty had a premature, wounding 2 of their own men. More reinforcements arrived. Fine but foggy. Rumoured that we move out of action on the 17th inst. Our men that were killed yesterday were all Bty H.Q. They were in a dug out; A.77 M.M. shell hit it, another Bdr (Horan) was in the same dugout, He was not even scratched. Horse lost in shell hole last night, destroyed, impossible to get him out. Colonel Anderson, in wagon lines today. A stunt on our right, 4.30 P.M.\n\nNow 5.30 P.M. still going strong, More men wounded in (0 pip) Gr Clarksmith, Gr Wren Gr Jennings\n","112":" Foggy all day. Another bombardment all night. A few shells over our way. 3 horses sent to Vet Mobile Section. Helping the 1st and 101st Btys with ammunition. Lieut Little gone forward observing for 24 hours. Frost coggs, taps and wrenches issued with shoes now. Another horse lost in bog hole last night. I got eight horses from D.A.C hooked onto him and pulled him out. He was bogged from 7.P.M until 10.A.M next morning, none the worse for his adventure. Driver Blundell, lost last night, arrived in camp 7 oclock this morning. The Guards regiment are facing our boys. Our Infantry in a charge met the Prussian Guards two days ago. A very plucky regiment. They were cut down like grass. Dozens of 18 pdrs opened fire on them. A second time they charged, and again cut to atoms.\n","113":" Fearful bombardment, Bty getting shelled, had to leave guns. Good progress made yesterday 600 yards gained, and still advancing 3,000 prisoners captured yesterday. General Birdwood highly delighted. A frightful, but grand sight occurred this evening at 3 oclock, a sheet of flame shot out of the clouds, and fell straight to earth. Similar to a huge rocket. I believe it was one of our aeroplanes. The day was foggy. All the 1st Division Infantry relieved. Terrible slaughter, not an inch of ground without shell holes. Dead, both German and British lying everywhere. Guns, wagons, horses, and men blown to atoms, Thousands of rounds off all sorts of ammunition strewn about. One part in particular is pleasing, 2 monster Howitzers(Huns) one mass of scrap iron.\n","114":" Bitterly cold. Another one of our Gunners killed. Gr Steward, a Bty H.Q man. Sgt Delaney gone to Div. H.Q. Recommended\n\nfor a commission. Sgt. Watson recommended for a D.C.M. (Decoration). Bombardment this last day or two, almost continuous, Something wonderful the amount of ammunition used\n","115":" Changed Bty position, The 50th Bty is taking over this wagon line, One section gone to new wagon line forward. I am still in old wagon line. Likely to move tomorrow. Waiting on transport, only one, S.A. wagon to move wagon line stores. Bitterly cold all day. Hun aeroplanes over 5 in all. 2 brought down\n","116":" Cold, Everything frozen, I left Mametz wagon line, leading my horse, he is on three legs, and as poor as a crow. Making for new line at Montauban. Arrived there at 4.30, dark. 3 ½ miles. The poor old horse is knocked up. I stood, and looked at him several times on the road, considering what I would do. Whether to shoot him or drag him along. Made up my mind to stick to him. I am\n\ndressing him myself. I think more of this horse than I do of a good many men.\n","117":" We have relieved B. Bty 156 Brigade (Tommy Brigade). Now an S.O.S Bty, now in a very critical position. Guns three miles away. This morning is awfully cold. As far as you can see is as white as a sheet, and a nasty wind is blowing. This is the place for shells, real coal boxes, they just lob on the hill at our rear, a few hundred yards away. Capt Olding reported, at D.A. yesterday, rejoining this Bty.\n","118":" Wet night, mud worse than ever. Wagon line shelled at 2 AM. About 50 5.9 inch over One horse in 1st Bty killed otherwise no damage done. Bombardment at 2 oclock this evening. Very little rest in this wagon line. Big guns about here, very close, shooting all night.\n","119":" Wagon line shelled again last night.\n\nengineers camped alongside of us, had one man lifted clean out of dugout, and thrown over the road, he was killed, and one man wounded, also one horse killed. Today we take over the 6th Btys guns in position, 400 yards further forward. Had to evacuate our tent last night, and get into trench. Rough shop this. An enclosure about 40 yds from my tent, for German prisoners, at present it contains only two, put in last night. Horses getting done up. 3 were sent to Vet Hospital this evening. Punctured feet.\n","120":" The same performance last night, shelling a treat. No damage done on our lines. Col inspecting wagon lines, 108 horses now in Bty. I am writing this in my shop, which is a hole in the ground, covered by a tarpaulin. Day fine, but bitterly cold, freezing.\n","121":" A big stunt on our right. Saw 3 Hun planes brought down. One of our was also \n\nbrought down. The pilot and observer were seriously injured. Wonderful that they were not killed. A few shell over during the night. A lot of six gun Btys about here.\n","122":" Fine frosty morning, Day fairly cold, Lieut Rigg rejoined Bty, Fractured his ankle some months ago. Still lame. Q.M.S. Thompson wounded in head whilst drawin rations, a nasty knock with a piece of high explosive shell. Several AS.C men wounded. There were wagons, men, hay, oats, and rations going up in the air. These shells passed over our heads; Only one landed in our wagon line. Sgt Delaney evacuated to hospital sick. Corpl Flett and Torpey promoted to Sgts\n","123":" Bitterly cold. Sleet. 42 casualties at ration dump yesterday. One Driver (Pascall) knocked down by shell, last night, no harm done. The mud is still thick here. Four prisoners (Huns) in compound, young looking men, 19 or 20 years old\n\n"}}