{"Document Name":{"0":"Diary_0419","1":"Diary_0419","2":"Diary_0419","3":"Diary_0419","4":"Diary_0419","5":"Diary_0419","6":"Diary_0419","7":"Diary_0419","8":"Diary_0419","9":"Diary_0419","10":"Diary_0419","11":"Diary_0419","12":"Diary_0419","13":"Diary_0419","14":"Diary_0419","15":"Diary_0419","16":"Diary_0419","17":"Diary_0419","18":"Diary_0419","19":"Diary_0419","20":"Diary_0419","21":"Diary_0419","22":"Diary_0419","23":"Diary_0419","24":"Diary_0419","25":"Diary_0419","26":"Diary_0419","27":"Diary_0419","28":"Diary_0419","29":"Diary_0419","30":"Diary_0419","31":"Diary_0419","32":"Diary_0419","33":"Diary_0419","34":"Diary_0419","35":"Diary_0419","36":"Diary_0419","37":"Diary_0419","38":"Diary_0419","39":"Diary_0419","40":"Diary_0419","41":"Diary_0419","42":"Diary_0419","43":"Diary_0419","44":"Diary_0419","45":"Diary_0419","46":"Diary_0419","47":"Diary_0419","48":"Diary_0419","49":"Diary_0419","50":"Diary_0419","51":"Diary_0419","52":"Diary_0419","53":"Diary_0419","54":"Diary_0419","55":"Diary_0419","56":"Diary_0419","57":"Diary_0419","58":"Diary_0419","59":"Diary_0419","60":"Diary_0419","61":"Diary_0419","62":"Diary_0419","63":"Diary_0419","64":"Diary_0419","65":"Diary_0419","66":"Diary_0419","67":"Diary_0419","68":"Diary_0419","69":"Diary_0419","70":"Diary_0419","71":"Diary_0419","72":"Diary_0419","73":"Diary_0419","74":"Diary_0419","75":"Diary_0419","76":"Diary_0419","77":"Diary_0419","78":"Diary_0419","79":"Diary_0419","80":"Diary_0419","81":"Diary_0419","82":"Diary_0419","83":"Diary_0419","84":"Diary_0419","85":"Diary_0419","86":"Diary_0419","87":"Diary_0419","88":"Diary_0419","89":"Diary_0419","90":"Diary_0419","91":"Diary_0419","92":"Diary_0419","93":"Diary_0419","94":"Diary_0419","95":"Diary_0419","96":"Diary_0419","97":"Diary_0419","98":"Diary_0419","99":"Diary_0419","100":"Diary_0419","101":"Diary_0419","102":"Diary_0419","103":"Diary_0419","104":"Diary_0419","105":"Diary_0419","106":"Diary_0419","107":"Diary_0419","108":"Diary_0419","109":"Diary_0419","110":"Diary_0419","111":"Diary_0419","112":"Diary_0419","113":"Diary_0419","114":"Diary_0419","115":"Diary_0419","116":"Diary_0419","117":"Diary_0419","118":"Diary_0419","119":"Diary_0419","120":"Diary_0419","121":"Diary_0419","122":"Diary_0419","123":"Diary_0419","124":"Diary_0419","125":"Diary_0419","126":"Diary_0419","127":"Diary_0419","128":"Diary_0419","129":"Diary_0419","130":"Diary_0419","131":"Diary_0419","132":"Diary_0419","133":"Diary_0419","134":"Diary_0419","135":"Diary_0419","136":"Diary_0419","137":"Diary_0419","138":"Diary_0419","139":"Diary_0419","140":"Diary_0419","141":"Diary_0419","142":"Diary_0419","143":"Diary_0419","144":"Diary_0419","145":"Diary_0419","146":"Diary_0419","147":"Diary_0419","148":"Diary_0419","149":"Diary_0419","150":"Diary_0419","151":"Diary_0419","152":"Diary_0419","153":"Diary_0419","154":"Diary_0419","155":"Diary_0419","156":"Diary_0419","157":"Diary_0419","158":"Diary_0419","159":"Diary_0419","160":"Diary_0419","161":"Diary_0419","162":"Diary_0419","163":"Diary_0419","164":"Diary_0419","165":"Diary_0419","166":"Diary_0419","167":"Diary_0419","168":"Diary_0419","169":"Diary_0419","170":"Diary_0419","171":"Diary_0419","172":"Diary_0419","173":"Diary_0419","174":"Diary_0419","175":"Diary_0419","176":"Diary_0419","177":"Diary_0419","178":"Diary_0419","179":"Diary_0419","180":"Diary_0419","181":"Diary_0419","182":"Diary_0419","183":"Diary_0419","184":"Diary_0419","185":"Diary_0419","186":"Diary_0419","187":"Diary_0419","188":"Diary_0419","189":"Diary_0419","190":"Diary_0419","191":"Diary_0419","192":"Diary_0419","193":"Diary_0419","194":"Diary_0419","195":"Diary_0419","196":"Diary_0419","197":"Diary_0419","198":"Diary_0419","199":"Diary_0419","200":"Diary_0419","201":"Diary_0419","202":"Diary_0419","203":"Diary_0419","204":"Diary_0419","205":"Diary_0419","206":"Diary_0419","207":"Diary_0419","208":"Diary_0419","209":"Diary_0419","210":"Diary_0419","211":"Diary_0419","212":"Diary_0419","213":"Diary_0419","214":"Diary_0419","215":"Diary_0419","216":"Diary_0419","217":"Diary_0419","218":"Diary_0419","219":"Diary_0419","220":"Diary_0419","221":"Diary_0419","222":"Diary_0419","223":"Diary_0419","224":"Diary_0419","225":"Diary_0419","226":"Diary_0419","227":"Diary_0419","228":"Diary_0419","229":"Diary_0419","230":"Diary_0419","231":"Diary_0419","232":"Diary_0419","233":"Diary_0419","234":"Diary_0419","235":"Diary_0419","236":"Diary_0419","237":"Diary_0419","238":"Diary_0419","239":"Diary_0419","240":"Diary_0419","241":"Diary_0419","242":"Diary_0419","243":"Diary_0419","244":"Diary_0419","245":"Diary_0419","246":"Diary_0419","247":"Diary_0419","248":"Diary_0419","249":"Diary_0419","250":"Diary_0419","251":"Diary_0419","252":"Diary_0419","253":"Diary_0419","254":"Diary_0419","255":"Diary_0419","256":"Diary_0419","257":"Diary_0419","258":"Diary_0419","259":"Diary_0419","260":"Diary_0419","261":"Diary_0419","262":"Diary_0419","263":"Diary_0419","264":"Diary_0419","265":"Diary_0419","266":"Diary_0419","267":"Diary_0419","268":"Diary_0419","269":"Diary_0419","270":"Diary_0419","271":"Diary_0419","272":"Diary_0419","273":"Diary_0419","274":"Diary_0419","275":"Diary_0419","276":"Diary_0419","277":"Diary_0419","278":"Diary_0419","279":"Diary_0419","280":"Diary_0419","281":"Diary_0419"},"Date":{"0":"unknown","1":744.0,"2":745.0,"3":746.0,"4":747.0,"5":748.0,"6":749.0,"7":750.0,"8":751.0,"9":752.0,"10":753.0,"11":754.0,"12":755.0,"13":756.0,"14":757.0,"15":758.0,"16":759.0,"17":760.0,"18":761.0,"19":762.0,"20":763.0,"21":764.0,"22":765.0,"23":766.0,"24":767.0,"25":768.0,"26":769.0,"27":770.0,"28":771.0,"29":772.0,"30":773.0,"31":774.0,"32":775.0,"33":776.0,"34":777.0,"35":778.0,"36":779.0,"37":780.0,"38":781.0,"39":782.0,"40":783.0,"41":784.0,"42":785.0,"43":786.0,"44":787.0,"45":788.0,"46":789.0,"47":790.0,"48":791.0,"49":792.0,"50":793.0,"51":794.0,"52":795.0,"53":796.0,"54":797.0,"55":798.0,"56":799.0,"57":800.0,"58":801.0,"59":802.0,"60":806.0,"61":807.0,"62":808.0,"63":809.0,"64":810.0,"65":811.0,"66":812.0,"67":813.0,"68":814.0,"69":815.0,"70":816.0,"71":817.0,"72":818.0,"73":819.0,"74":820.0,"75":821.0,"76":822.0,"77":823.0,"78":824.0,"79":825.0,"80":826.0,"81":827.0,"82":828.0,"83":829.0,"84":831.0,"85":832.0,"86":833.0,"87":834.0,"88":835.0,"89":836.0,"90":837.0,"91":838.0,"92":839.0,"93":840.0,"94":841.0,"95":842.0,"96":843.0,"97":844.0,"98":845.0,"99":846.0,"100":847.0,"101":848.0,"102":849.0,"103":850.0,"104":851.0,"105":852.0,"106":853.0,"107":854.0,"108":855.0,"109":856.0,"110":857.0,"111":858.0,"112":859.0,"113":860.0,"114":861.0,"115":862.0,"116":863.0,"117":864.0,"118":868.0,"119":871.0,"120":872.0,"121":873.0,"122":874.0,"123":875.0,"124":876.0,"125":877.0,"126":878.0,"127":879.0,"128":880.0,"129":881.0,"130":882.0,"131":883.0,"132":884.0,"133":885.0,"134":886.0,"135":887.0,"136":888.0,"137":889.0,"138":890.0,"139":891.0,"140":892.0,"141":893.0,"142":894.0,"143":895.0,"144":896.0,"145":897.0,"146":898.0,"147":899.0,"148":900.0,"149":901.0,"150":902.0,"151":903.0,"152":906.0,"153":909.0,"154":910.0,"155":911.0,"156":912.0,"157":913.0,"158":914.0,"159":915.0,"160":916.0,"161":917.0,"162":918.0,"163":919.0,"164":920.0,"165":921.0,"166":924.0,"167":927.0,"168":930.0,"169":931.0,"170":932.0,"171":933.0,"172":934.0,"173":935.0,"174":936.0,"175":937.0,"176":938.0,"177":939.0,"178":940.0,"179":941.0,"180":942.0,"181":943.0,"182":944.0,"183":945.0,"184":946.0,"185":947.0,"186":948.0,"187":949.0,"188":950.0,"189":951.0,"190":952.0,"191":953.0,"192":954.0,"193":955.0,"194":956.0,"195":957.0,"196":958.0,"197":959.0,"198":960.0,"199":961.0,"200":962.0,"201":963.0,"202":964.0,"203":965.0,"204":966.0,"205":967.0,"206":968.0,"207":969.0,"208":970.0,"209":971.0,"210":972.0,"211":973.0,"212":974.0,"213":975.0,"214":976.0,"215":977.0,"216":978.0,"217":979.0,"218":980.0,"219":981.0,"220":982.0,"221":983.0,"222":984.0,"223":985.0,"224":986.0,"225":987.0,"226":988.0,"227":989.0,"228":990.0,"229":991.0,"230":992.0,"231":993.0,"232":994.0,"233":996.0,"234":997.0,"235":998.0,"236":999.0,"237":1000.0,"238":1001.0,"239":1003.0,"240":1005.0,"241":1006.0,"242":1009.0,"243":1010.0,"244":1011.0,"245":1012.0,"246":1013.0,"247":1014.0,"248":1016.0,"249":1017.0,"250":1019.0,"251":1020.0,"252":1021.0,"253":1023.0,"254":1024.0,"255":1026.0,"256":1027.0,"257":1028.0,"258":1029.0,"259":1030.0,"260":1031.0,"261":1032.0,"262":1033.0,"263":1034.0,"264":1035.0,"265":1036.0,"266":1037.0,"267":1038.0,"268":1039.0,"269":1040.0,"270":1041.0,"271":1042.0,"272":1043.0,"273":1044.0,"274":1045.0,"275":1046.0,"276":1047.0,"277":1048.0,"278":1049.0,"279":1050.0,"280":1051.0,"281":1052.0},"Entry":{"0":"\n\n1916. January.\n\n","1":"\n\nArrived in Melbourne after spending nine days Xmas leave from Maribyrnong in Adelaide. Accompanied by S. and M.D. S. and I went to \"Three Musketeers\" at Her Majesty’s in the evening. Had supper at \"Vienna\". Funny cab ride on arriving Melbourne. Found kits in disgraceful state on reaching Maribyrnong. Stayed night Federal Palace Hotel.\n","2":"\n\nArrived back at Camp after walking from Ascot Vale at 12 noon --- was due at 12 midnight of previous day, but missed last motor car out. Lieut. F. and others were going out riding, and he, expecting me asked where I was. Capt. L. replied that I was at Church! (instead I was A.W.L.) Truly the devil looks after his own. S. and I went to St. Kilda in afternoon and thence Treasury gardens.\n","3":"\n\nWent out in morning with drivers and had full battery manoevres. Had a rotten horse. Very interesting work.\n","4":"\n\nFull battery, guns and detachments (no wagons etc.) on parade ground for direct laying under Lieut F. and S.M. (Sergeant Major) C. Collective ranging etc. Good afternoon spent.\n","5":"\n\nFransferred to No. 1 Battery from No. 2. S.A. Tas. and Vics. ro form reinforcements (3rd of","6":" Brigade) Am in charge N. Subsection about 50 men. Arranged in alphabetical order, South Aus. and Tasmanians A-Z. Notified that we embark 18th Jan. by Themistocles. Great excitement followed by cheers as the parade was dismissed.\n\nFurther work of organization in afternoon but sudden and heavy storm broke. Great drops of rain with tremendous gusts of wind. Thirty one tents, including Battery Office, P.O., were blown down. Only by placing two bunks under cross pole of my tent could B. and I prevent ours from going the way of others. Was stuck up in motor car by mud on leaving camp.\n\nThursday 6.\n\nWrote letters and went to bed early.\n","7":"\n\nAwoke feeling fit and fresh. Rotten drill under Lieut. M. Foot drill and talk about Guards and Sentry Duty, S.S. and M.D. invited B. and I and her cousin M. from National Bank to dinner at Federal. From there we went to \"Under Fire\" at Theatre Royal. Supper at \"Blue Bird\". Caught car home at 1 a.m.\n","8":"\n\nWent to Art Gallery with S. and M.D. Some fine pictures --- but though seemingly a larger collection than at Adelaide, not much larger, and consider latter’s alcoves afford better scope for light. Adelaide’s the better collection. Bric a brac etc. Melbourne very fine.\n","9":"\n\nSlept at Federal Palace---till 11 a.m. Had dinner then took s. to Rev. D. and took service at Footscray. About 300 present. Good service.\n","10":"\n\nWent in to see S. Went T. Gardens. Not feeling too fit. Mooted staying in camp Tuesday evening---then arranged to come in. Diarroehia all day.\n","11":"\n\nDiarroehia worse. By four o’clock could not stand up.\n\nWent to my quarters---temperature rising. S.M. T reported me to hospital. Red Cross van took me up. Temp. 101 in quarters. Half an hour later 102.2 12.30 am. Dr. F. tested me for Meningitis. (On being received into Hospital given 1 oz caster oil) Ye gods! after two days diarroehia. Note D’s sympathy compared with S.M. (Sergeant Major) T.\n","12":"\n\nAfter restless night three doctors came round at 6.30 am. and re-examined me and by signs etc. they made concurred with former decision of Dr. F. re memingitis. Nothing to eat today and yesterday. Two cups of milk per day, that is all. S. and M.D. came in afternoon. Note D’s second sympathetic visit. \"Gawd bl-a-a-ss you!\"\n","13":"\n\nMug of Mazina for breakfast. Temperature normal 98°. S. and M.D. came in---brought chicken, jelly, fruit salad. Able to eat former. S. and M.D. to leave Friday but promised to stay until I was better.\n\nGreat saying in hospital \"This is the life\".\n","14":"\n\nChop for breakfast---allowed up for little while to see S. and M.D. in afternoon. Getting up did not agree with me. For Monday, Tuesday, Wednesday, had opened bowels 31 times. Head dizzy.\n","15":"\n\nMazina! Brutal day, about 101, dusty. S. and M.D. came.\n","16":"\n\nMazina! S. M.D. came.\n","17":"\n\nMazina still! Doctors agreed to let me out providing I had a\n\na few days spell. On recommendation Sig. B.U., a fine lad in next bed to me, arranged to go to Mrs. B’s, \"Allambee\", (Place of Rest) Healesville. S. and M.D. to accompany me. Got my discharge from hospital about 11.am. Final leave granted (till Friday midnight) Packed kit, arrived town 4.30 pm. Stayed at Federal.\n","18":"\n\nS. M.D. and I left by 4.56 train to Healesville after shopping etc. Arrived Healesville 7.5 pm. Took coach for about mile to Mrs. B’s, \"Allambee\". Wrote letters in evening.\n","19":"\n\nTennis, and arranging kit. Then went out with S. in evening.\n","20":"\n\nArranging kit and said goodbye to S. Went for long walk. On return had supper. M.B. in sitting room. Found her a rather original girl, with ideas her own, well worked out, and with well inferred deductions, and keen judgment. She overdoes it a bit however, and spoils it.\n","21":"\n\nLeft Healesville 10.30 am. Saw S. and M.D. off by 4.30 train after lunching at Winter Garden Café. Thence to Mrs. A. K’s. \"Wairona\" Middle Brighton, to dinner. They have fine home. Interesting dinner. Soup, Fish pate, roast beef, custard, cabinet pudding (port and light wine) nuts, sultanas etc.---then fruit. Then licquers, cigarettes, black coffee. Then cigars, and later music. Supper, whisky etc of which I did not partake. Thence camp.\n","22":"\n\nNot feeling too well; granted leave until 9. am. Monday morning, and told if not better to advise them by wire and apply for extra leave. Caught 4.55 pm. to Healesville. Had good yarn with M.B. in evening.\n","23":"\n\nVery hot. Easy day. M.B. sang and then we yarned.\n","24":"\n\nDiarroehia not too good. Wired for leave till Thursday morning. Granted. Party, M.B. and the Mascot and I to Black Spur. Left 10.30 am. Had dinner at \"The Hermitage\" (German kept). Magnificent grounds. Tropical growth of tree ferns---one could be lost in them. Our journey back---beautiful country. Returned to Allambee about 6 pm. Yarned in evening after music. Went to bed early.\n","25":"\n\nVery hot. Easy day. M.N. very sympathetic---played piano all evening. M.B. and I encouraged her and listened. M.B. depressed because misunderstanding with M. She regained her usual lightheardedness. Great saying Healesville: –\"This is the life\". \n","26":"\n\nCashed wire £:10. Returned from Taglawirra where M.B. and M.N. and I spent the day. The former drove in buggy with me and the latter rode a little white pony. Pretty drive. Trip to Creek (Canoe Ck) Pony played up. Saw Mills. All sat out on lawn while M.B. sang (in evening). I promised to return there when I got back to Australia.\n\nThursday 27.\n\nM.B. called me at 5.30 am. Good breakfast. She walked down to P.O. and I caught train nicely. Arrived in Camp with kit at 12 noon, after catching wrong car and having to lug kit up---no cab. Just in time to scribble my name on kit and put it on wet on transport as it left the camp. Reported then to Embarkation Office and found I was down to go alright. Wrote letters in afternoon in Melbourne. and at Camp at night. Retired 10.30 pm.\n","27":"\n","28":"\n\nReveillé 3 a.m. How welcome the sound! The sleep, little as it was that came to any of us last night, was but a drugging of the normal senses, leaving the subconscious in a world of grotesque and wild phantasy, peopled only by a restless horde of \"petits diables.\"\n\n3.30 a.m. A threatening sky, a low booming of thunder, a sultry heaviness. Rain, big, heavy drops.\n\n6.30 a.m. Roll calls, and the last packing up had to be done by candlelight. Lamps fitted up and down the lines in wierd fashion. Everywhere a tenseness, a strangeness, as like the first day in the birth of a new world wherein a vague sense of an older one made one conscious of the contrast.\n\nRain, rain, rain. How the men cheered \nafter\n we had all passed through the gates! How silent as we passed out! Only the goodbyes of friend and friend. Left the camp behind us at 7 a.m. Nothing but mud for the first bit of the way, while the storm fell to its work with fury. Roads awash 6\" deep. Men gay, sploshing along in groups, each singing their own marching song. Entrained at Ascot Vale; \"special\" there waiting for us.\n\nPort Melbourne arrival about 10 a.m. We marched a mile to the embarkation pier. In spite of the rain---the road, rough and pool-strewn, was lined with people. In a dim way I had thought to see crying women, but not to see the strained, anxious looking faces of men. How we were gay---but quietly so as we passed along that road. We pitied them, these people. Were they sad for\n\nus? or those who had already gone from their midst? or were some of them simply full of self-pity?\n\nThe big vessel that we had already seen faint and grey through the fog, began to loom large as we gained the pier. A32---We could see the number, and then, on the davits the name, T.S.S. \"Themistocles\".\n\nThe pier was crowded, but no when we arrived; it was not until we were wringing wet and beginning to feel a wee bit cold and tired waiting our turn to board the boat that our turn did come (the last too) and the band began to play and the people to stream up the pier to the side of the boat. That was about noon.\n\n\"Tipperary\", the whole gamut of American ragtime---the band kept it up unceasingly. Everyone--- no, I think I saw a few faces of those who still felt the import of it all, but nearly everyone was in good spirits. I think they realized they must be cheerful in the last few minutes to the boys who were leaving. It was good of them! I believe I felt a little pang once. There was no one there---not a soul---I knew. I would not have had it otherwise though.\n\n12.30 p.m. Auld Lang Syne. The almost imperceptible motion of the moving boat. The waving handkerchiefs of the huddles crowd on the end of the pier, and then a grey sea, and a grey sky and a sudden vague sense of strangeness.\n","29":"\n\nStill cloudy. Nearly everyone sick, including myself. Bozzy in hospital. I managed to eat a little at tea time. Lay up on deck in fresh air all day. It was very comical to see everyone sick. Men\n\nlying prone, with a plate near their mouth and getting it down somehow. I found some satisfaction in anathematising the Kaiser each time I found it expedient to visit the side of the ship. My impression at the end of the day was that I had \"Gott strafed der Kaiser\" about 84 times. Anyhow it kept me cheerful---and one or two of \nles malades\n around me.\n","30":"\n\nFeeling better, though still groggy. Eating well. Whales spouting. Cloudy skies; port holes closed. Church Parade---but did not risk moving from saloon deck. Brought my hammock up on deck and slept there---7 p.m.\n","31":"\n\nRead London’s \"Martin Eden\". Holiday---Foundation of Aust. Anniversary. Rough weather crossing the Bight. Big liner (supposed to be Troopship \"Wiltshire\" inward bound) sighted. Bed 7.30 p.m.\n\nFebruary.\n","32":"\n\nEveryone Feeling groggy. Boat pitching heavily. Do not feel too good, can scarcely write a line. I spend most of my time with Basil Urban, who was next me in hospital at Maribyrnong. He is a fine youngster---I always seem to feel older than he somehow. We seem to hit it without any effort. \n\nConcert in evening. Sang \"My Ain Folk\". Bed 8.30 p.m.\n","33":"\n\nLand sighted starboard, 20 miles away.\n\nWe are near Albany so will soon be in the Indian Ocean. Saw my first flying fish this morning. Albatross not so much in evidence. Picked for Sergeant of the Guard, commencing 6 p.m. Not feeling too good. Finished London’s \"Cruise of the Dazzler\". Bed 10 p.m. (on deck). Went rounds midnight. All correct.\n","34":"\n\nRounded Cape Leeuin during the night. No land in sight this morning. On Guard until 6 p.m.; 2 Corporals. Feeling better. Had a pipe of Lucy Hinton tobacco, the first smoke since I have been on board and it made me feel tip top. Concert in evening given by the of the 5th Inf. and others. Sang \"Kings of the Road\". Bed 8.30 p.m. Artillery Sergeants had a group photograph taken this afternoon.\n\nBoat rolling considerably but little pitching. Southern Cross and Venus very beautiful. Basil and I spent an hour, before going to bed, on the port saloon deck. We did not say much. The sky was very wierd, great scrolls and masses of deep, mauve black with luminous hieroglyphics of yellow in one great line along the west.\n","35":"\n\nDrill (Signalling) on the poop deck for 3rd of the 6th. Physical Jerks before breakfast. Feeling much better. Boat still rolling---but no pitching. Weather warming up. Slept on deck. Bed 8.30 p.m.\n","36":"\n\nInoculation for Enteric in morning. Very\n\nlittle pain with the actual incision, but the soreness is increasing and arm is beginning to swell.\n\nConcert in evening by Ship’s crew, but so crowded I did not go. Every square inch of room was occupied; every beam and crane and rail were covered with men in all degrees of undress attire. Wrote \"The Wanderer\". Bed, deck, 9 p.m.\n","37":"\n\nWe passed the point, 60 miles from Cocos Island, where the \"Sydney\" dashed off to fight the \"Emden\". Church Parade 10.30 a.m. Sermon on the Syra-Phoenician Woman. Not suitable for troops and yet restful and inspiring to me and my mood---and perhaps to many others. We do not see anything of the Chaplain during the week. He is one of the Censors and has plenty of that to do, but why shouldn’t that be split up between the Officers and let him come and have a yarn with the men? He is an old chappie, ripe in experience no doubt---and though I think a younger man is more fitted for the work, an old man is not without certain advantages, if he would only use them. Bed 10 p.m.\n","38":"\n\nWeather warmer still. Say cloudy, and atmosphere muggy. Have been at letter writing most of the day. It gets so wearisome because one cannot say half that one would. Writing is brim full of expression when one has time to translate the mental pictures and the emotions and sensations that one has---but it is perhaps a shallow vessel at best.\n\nThe voice, the presence of the speaker, the subtle undercurrent of magnetism and sympathy that makes the great vessel of conversation brimful of expression---how a letter lacks this! One thing only seems to help one to be patient and that is that one is a passing thing while the other is permanent. And of course one has to recognise and accept that where distance separates there is no alternative.\n\nClouds similar to those of our own skies---atmosphere more hazy if anything for the type of weather. The sea varies from grey-green to deep blue, and is now, much calmer. There is no pitching of the boat and only a slight rolling.\n","39":"\n\nHeavy tropical rain. It has quite a peculiar effect on the water, quite unlike anything I have ever seen before. Where before there was a sharp, clear spray upon the edge of the rollers there is now only an oily looking and smooth sea, with only \nthe\n a soft rolling motion on its surface that moves but does not break it.\n\nDrill (Signalling) a great farce but which the Officers consider a great method of keeping the men from being homesick and getting \"slack\". It is of course impossible for 1,500 men to drill decently on board a 10,000 ton ship even by making shifts of it. Wrote 25 P.Cs and letters. Not feeling too good. Woke up feeling very heavy. Restless during night. Discovered this was common to most. Expect we are feeling the after effects of the inoculation.\n","40":"\n\nFeeling worn out today. Arm alright, but attribute feeling the effects of inoculation. Woke up feeling heavy. Had to lie down most of the day.\n","41":"\n\nHoliday in honor of crossing the line. Sports. In the Tugs of War the first Artillery team was beaten by the Infantry, but our second team scored over the Inf.’s seconds. Several steamers sighted. One large vessel passed within two miles to starboard---but all that we have seen so far have always been bound in the opposite direction to us. Feeling better today.\n","42":"\n\nCrossed the line 11 a.m. Passed by steamer about a mile away. Very hot, though not as hot as we expected. The sunset tonight is rich in its simplicity. It does not dally with the senses or touch one here and there with its beauty. It has nothing of exquisite detail or coloring that it should touch one to a fine appreciation. It is so big and grand, but that is not its most abiding influence---its three great masses of deep mauve are billowed along the whole western sky, with only a silver, hazy blue above--- it is the beauty of its simplicity that takes hold of one and lifts one into a land where soul voices seem to whisper in language that seems strange but with a cadence almost familiar.\n","43":"\n\n2 p.m. Land in sight. Ceylon at last. From our vantage point it looks very mountainous. But there is nothing of cruelty about its ruggedness---the\n\nsoft light blue, the pink and the brown tints that towards evening deepen make it a veritable Fairyland. \n\nAbout 4 p.m. we passed through fleets of native scows; there must have been 40 or 50 of them.\n\nSunset---6 p.m. We are beginning to draw in to the coast. It is quite dark now and we see the first lights of Colombo---the beacons of the lighthouses---how they seem to beckon to us. Excitement very high everywhere; the men were too tense to be noisy. Towards 7.30 p.m. the lights of the town itself began to twinkle and then a cheer broke out along the long line of crowded watchers. Men clambered everywhere to get a better view---Sgt---and Basil and I climbed up on the fore look-out, but we were hunted down. That cheer breaking the tenseness seemed to get the men off, for, from then onwards, there was nothing but a great chorus of song up for’ard,---right until we entered the harbour.\n\n9.30 p.m. We moored in the harbour, somewhat like the Outer Harbour of Adelaide with its big artificial breakwaters. There were a dozen big vessels there besides some smaller ones. We saw the wreck of a big P & O boat as we swung through the entrance to the harbour.\n\nWhile we were mooring a single boatload of natives paddled around the ship crying \"Yi-yi-yi-yi---money, money.\" We threw them coppers. The men thought it great fun and kicked up enough row to wake the whole island.\n","44":"\n\nIt was impossible to get a place to sleep on the saloon deck. Basil and I have been accustomed to sleep in one particular spot on the starboard saloon. We book it about 4.30 or 5 p.m., and take turns to guard it until bed time. I do not go down to the Sergeants’ Mess for tea, but have mine with Basil. We usually get a tin of preserved fruit, and some biscuits from the canteen, while the Army ration of bread and cheese helps out. We slept up on the (Upper) boat deck on account of the crush below.\n\nAbout 5 a.m. we were awakened by the most infernal babel I have ever heard. It was the natives on the coal barges and water boats below. Bum boats everywhere. Blue-uniformed native police in patrol boats.\n\nBetween 5 and 7 a.m. we exchanged money with the natives through the port holes. One youngster with a very merry face especially took my fancy. I nicknamed him Tim. Ridiculously small bananas, and pineapples in all stages of growth and ripeness, and cocoanuts in plenty were soon everywhere---even to floating round in the water.\n\n7 a.m. Natives allowed on board. Coins, silks, precious(?) stones---chiropodists, etc. etc. Several, in fact most of the boys were Christians, converts of the Catholic Mission there. I bought some coins, fruit, a garnet, and had several coins given me. The natives’ extent of English was limited to the favorite oaths of the Australians. They didn’t know much about Germany, but they knew of the existence of Egypt and could curse the Turks with great gusto. According to European\n\nstandards they are depraved even from a very early age. \n\n10 a.m. First batch of 500 left on barges (4) for the shore. F.A. and Signallers left at 3.15 p.m. after a wait of an hour and a half. We saw a big hospital ship and exchanged hurrahs for it was Australia bound. We marched along the Esplanade through the European quarter and the most respectable part of the native quarter to the Barracks. How the Authorities love to impress the natives! The native policeman as typical of the Oriental seen for the first time strikes one as something between a grotesque humorositie and a very influential bully. They perambulated up and down the route we took to the extreme terror of the small urchins.\n\nThe notables of the town were radiant in cerise skirts and other unmentionable colors that contrasted as vividly and grotesquely as a rainbow bordered with solid emerald green. The human element about the decoration made it possible to see it humorously and not in any sense critically.\n\nThe roads we saw were excellent and the rickshaws seemed dapper and quite smart compared with the rare, dilapidated carriages we saw, with their European occupants pale and anaemic looking.\n\nThe men were very anxious for a glass of beer (the ship being \"dry\") but the mug (one only) of treacly-looking English \"beer\" nearly made them sick---many indeed took their’s outside and after tasting it threw it away.\n\nThe Sergeants’ Mess was a very elaborate affair. I had\n\na glass of Indian pale ale with the rest of the fellows---but did not particularly fancy it.\n\nWe marched back to ship by a different route and arrived there at 7.15 p.m. The sea was very rough, and it was a matter of danger as well as difficulty to get from the barge to the gangway. The rise and fall of the sea even at the vessel’s side was five feet---with little more than a second between the maximum rise and the swift rush of the fall. It took until 8.30 p.m. to get the last man off. Many were absolutely prostrate when they got on board, while several were nearly drowned and one of the Officers almost had his leg crushed to pulp.\n","45":"\n\nSteamed out of Colombo at 7 p.m. Things quiet all day. Land soon out of sight. Slept on boat deck.\n","46":"\n\nHeavy tropical rain at 5.30 a.m. We had to rush for cover. No land in sight. Heading due N.W.\n","47":"\n\nSecond inoculation or rather the completion of the first. It was a double dose this time, but the after effects were not anywhere near as severe as those of the first dose. No land in sight.\n","48":"\n\nGenuine alarm in the afternoon. We had already had one practice lifeboat alarm. This time there was a cause however, and there were no rumours round beforehand. A vessel was sighted on the horizon right\n\nfore. In an incredibly short time she grew larger and seemed to approach directly towards us with great rapidity. She flew no flag. She was making dense smoke. Suddenly the hooter went and everyone got downstairs--- all doors were closed and we waited at our boats expecting something---but it was only a false alarm after all---although the Colonel received a bit of a scare over it.\n","49":"\n\nCargo boat on port side. Seagulls about---though cannot as yet see land.\n","50":"\n\nDrill (Signalling). Passed steamer. Concert in evening. Sang \"The Sunshine of your Smile\", and with Bozzy \"O Wert Thou in the Cauld Blast\".\n","51":"\n\nChurch parade in morning at 10 o’clock; 11 – 11.45 Sacramental Service, or in the words of the P.B. \"Holy Communion\". It was the first time that I have received the bread at the hands of an Anglican priest or been at the full Service as it is conducted by them. It was very beautiful and I found many old prejudices broken and shattered by contact with its sweet reasonableness that, viewed in the abstract or from \"outside\" had seemed to contain so many superfluous phrases and so many words that were psychological anachronisms.\n\nThere were about 20 of us there, including one or two officers, the rest all N.C.O’s except one man.\n\nAfternoon correspondence. Posted 20 cards.\n","52":"\n\nWrote \"Boys of Australia’s Clime\" as a sally to the ship’s song \"Boys of the Aberdeen Line\", and put it in the hands of the ship’s printer.\n\n6 a.m. Land in sight, but so faint as to be hardly discernible from the horizoned clouds.\n\n9 a.m. Great jagged mountains of rock jutting out clear from the sea. Nothing but pink brown except where the dentations are marked with shadowy mauve. Tried my hand at sketching---I have almost forgotten how to hold a pencil---and managed to get a bit \"Gulf of Aden.\" But the best thing was the great pile of rock that hides the town. It rose sheer, a big massive thing like a giant of the Flinders on a burning day---a king of mountains raising his jagged crown above all else around him, as though he would take first of the homage of everything---even of the great blazing King of the blue above.\n\nSeven or eight vessels passed us including one transport (empty) going home for troops, and three British loaded transports on the way to Mesopotamia.\n\nThe great peaks seem to grow more and more cruel looking. But in all their cruelty and fireceness and barren harshness there is a pride and magnificence that seems almost conscious.\n\nPassed the Island of Perim towards dark. Just enough light to see the settlement and lighthouse. \n\nSignal came from the gunboat in harbour (Morse lamp). What ship? Are you transport? Where from?\n","53":"\n\nDrill (Signalling). Entered Hell’s Gate during early hours of morning. Passed several steamers during same period.\n\n9 a.m. We passed the rocks known as \"The Twelve Apostles\". By 6 p.m. we had overhauled 4 steamers. We were doing about 15 or 16 knots.\n\nLecture at 3.30 p.m. by Senior M.O. on V.D. and caution re Egyptian women. Did a copy of \"Entrance to Aden\". It took just an hour. Saw six vessels at same time all going south. Correspondence.\n","54":"\n\nReceived 300 copies of \"Boys of Australia’s Clime\" from printer. Sgt Fenton and I sold them all within an hour. Could not get any more from printer---a rotter he was too---charged 20\/ and we provided the paper. I offered to give the whole of the profits to the ship’s band too.\n\nPassed the \"Ceramic\", going south, at 8 p.m. She looked very fine with all her lights; we were very close to her too. Saw 8 or 9 vessels during day.\n\nPlayed \"500\" in evening with Basil, Bozzy and Tommy Mower and then wrote letters.\n\nHave seen no land all day.\n","55":"\n\nCorrespondence in morning. Land in sight both sides, within short distance. Concert in evening.\n\nYarned with Sgt. F. the whole evening.\n\nWe found a cool spot in a corridor just between the cold storage chamber and the butcher’s shop, with the fresh night air coming over our heads. He is a very interesting fellow. He is a braggart, has been in delirium tremens for three days last week, but is outstandingly good-natured and without any pettiness. He resolutely leaves drink alone (except when these rare bouts take place) he tells me. He has a big element of honesty about him that has given me the incentive to come to grips with him---and strange thing of all he is attracted to me. It is he who sought me out, making me his confidant, not of things, but the confidant or the onlooker of his \"life\". Making me see some part of the curious make up that is to him a soul.\n\nLike most men in the ruck of life at anyrate, he is a roué, but as he says, he has never robbed any girl, he has only taken what, in some form or other, was offered him. I believe him, though I do not agree with his philosophy. I recognise that he is a man with a personality and with instincts, and social position (he is in fair circumstances) not only lead him into adventures that yield sensual luxury but that lead many girls of good social position toward him with impulses that are keyed to his and whose happiness and pleasure seem to flow like some tributary into the great channel of his pleasure. He has the magnetism---I have seen other men like him. It is queer and perhaps it is very cruel. He is much older than I---8 or 9 years---and that’s a lot between young men. He is afraid to die he says and yet he has\n\nnot a thought of anything different to what he has always done---and yet he feels his life has been rotten. He asked me what my private occupation was and he did not take it as strange when I told him; he even seemed to be glad.\n\nI was picked for Sergeant of the guard, but paid Sgt Miller 7\/6 to take my place.\n","56":"\n\nTowel, Kiwi, fountain pen, housewife stolen. Mountainous coast on both sides, very beautiful. It is very close to us and one can see the wonderful tracery of indentations showing up as purple against a pale mauve.\n\nSketched portion of African Coast in Gulf of Suez. The best attempt I have made yet. Passed about 8 or 9 vessels. We arrived at Suez about 5 p.m. About 20 big vessels in harbour, including 3 cruisers, a couple of converted cruisers, all painted grey. There was also a monitor from Mesopotamia painted yellow---as a match to the sandy banks of the Tigris.\n\nNight very, very cold. Slept on deck.\n","57":"\n\nMorning bitterly cold. No news yet as to debarkation. Have been off colour all day, listless, depressed. Played cards most of the day. I am sorry the voyage is over---it has been splendid---but we all feel glad that we are getting closer to the \"game\". Furphies and all manner of \nBudgets\n rumours numerous and varied. Every few minutes would bring forth some new one---The Captain told the head stoker, or the Colonel’s batman\n\ntold the First Lieut., or Pte Tom, Dick, or Harry, in the course of a confidential chat with the Colonel, and the Captain was advised that we would disembark next morning, or would continue the voyage to England, or would go through Canal and disembark at Alexandria, or change boats for Mesopotamia, etc. etc.\n","58":"\n\nNews out today. We are to disembark tomorrow morning. Reveille to be at 5 a.m.\n","59":"\n\nReveillé 5 a.m. We moored alongside the wharf about 9.30 a.m. Disembarkation took about 2 ½ hours. Entrained (Officers","60":" class, of which there was one, Sergeants","61":" class, and men 3rd class). Left Suez at 12.30 p.m. Suez very quaint. Houses flat-looking and with an appearance of being incomplete. Crowds of natives and children, the latter running by the side of the train crying \"Backsheesh, Backsheesh\". Next station Terre Plein, then Tenara, whence we could see the dark blue of the Bitter Lakes, with their fringe of palms. Desert, pebble covered in parts and on the eastern side of the line, between it and the Canal nothing but camps, camps, camps, miles of them, dusty, dirty, primitive things, with camels in hundreds, clumped together on their outskirts. The men in them looked cheerful but to us it seemed a dreary scene. One could scarcely realise that one could adapt oneself to such a life as this.\n\nThere was just one pang, no more, of longing for the life \n\non the transport.\n\nOn the west was nothing but undulating, arid desert. \n\nPassed Tel-el-Kebir during the night. Arrived at Zeitoun at midnight. Thence we marched through silent streets, where our footsteps echoed dismally, to Zeitoun Camp. We had to carry our Kit, and it seemed an intolerable burden. We were very tired---then we left the metalled road and ploughed through heavy sand for nearly a mile. It was hell. Then we had a cup of tea, then blanket issue, then at 2 a.m. sleep.\n\nTuesday, 29.\n\nUp at reveillé 6 a.m. Parade at 9.30. Tent erection etc. all morning. Leave for afternoon. Six of us went to Cairo. Met Light Horse sergeant who offered to show us round. Saw Wuzza, so called Kam-Kam dance, zig-a-zig of Egyptian harlot by a man called in, French, Italian, Greek, and Egyptian prostitutes. Thence to see Music and Drinking Hall, where one may choose a lady---very tawdry affair. Stayed there ten minutes, thence to a French and Italian Brothel. Ceaseless stream of soldiers going in. There they are carefully examined, however, and are afterwards given a Condy’s Fluid wash. The sights of the day were brutal and sickening. A man would have to be hopelessly drunk to fall into such temptations.\n\nMarch.\n\nWednesday, 1.\n\nJerks (first parade) and footdrill morning. Usual leave (Wed. and Sat. afternoons) from 2 p.m. Went with N. and G. to Native Bazaars, (Egyptian and Arab) Blue Mosque, and also another Mosque nearby. Beautiful marble mosaic, lapis lazuli etc. Bought a black and gold table centre for 100 piastres. They wanted 250 for it. Struck a nice place in Khan Khalil, a French and a Russian girl there, and had good time trying to speak French. Went with N. and G. to French brothel---50 piastre place, at north-west end of Bulac Shareh. We refused their overtures but shouted drinks which cost us 55 piastree We spent half an hour chatting till a well-dressed native came in when the ladies immediately flocked to him.\n\nThursday, 2.\n\nJerks and drill morning. Heavy dust storm, so no parade in afternoon. Went in with Bob M. in evening. Indigestion and liver victim---late when we got to town, poor companion---so not particularly enjoyable evening. Left by 9.15 train for Camp. Station Helmieh.\n","62":"\n\nOff for day. Left camp 9.30 am. Party to visit Pyramids. We stayed Cairo. Bazaar in afternoon---Khan Khalil. B. delighted with French girl. Went to Sultan Hassan Mosque, built by him and called after him. 500 years old. Ascended lower Minaret---higher one blocked up. Minarets 280 ft high. Built from casing of big Pyramid at Guizeh. Rufieh Mosque very beautiful---great costly lamp of solid gold---and carpets (both from England). Mosiac and figured woodwork of ceiling. Saw Citadel---exterior. Dismissed Guide and went back to Khan Khalil who brought us in coffee in small cup, tea in glass, and a glass of water (latter an Egyptian custom).\n\nTea at Lion d’Or. The Propriétaire very kind and chatted in French, her English being more limited even than my French. Thence to Berlitz school to make arrangements for lessons.\n","63":"\n\nJerks and drill morning. Afternoon Cairo. Bozzy, Jim Coles, Naphtali and I hired Guide---20 Piastres---who was to pay all expenses. Went by ghary to Old Cairo, crossed on a raft to Rhoda Island, saw remains of Roman building with Late Egyptian inscription. \n\nSupposed place of Moses and Pharaoh’s daughter. Thence to an old Mosque---thence Tombs of Mamelukes. Thence Bozzy, Naph, Atkinson and I had first lesson at Berlitz School in French.\n","64":"\n\nBozzy, Jim Coles and I to Pyramids. Climbed Cheops, three of us to Queen’s Chamber. I only to King’s. Stifling and hot.\n\nWe consider ourselves tourists now as we have been getting leave every day. Great saying \"This is the life\". The war seems only a dream. Rode donkeys to Sphinx. First class dinner at Petrograd 31 piastres each. Bought shawl 25 piastres. 8.45 pm train to Belmieh. B. lent me 50 piastres.\n","65":"\n\nJerks, footdrill morning. All day off for Pyramid trip. Naphtali, Atkinson and I went instead to Egyptian Museum in Cairo. Fine building and very interesting---though could get no guide-book and catalogue at place as they had run out of them. Samuel’s Russian Bar for dinner. Wrote up diary and letter Mother at Y.M.C.A. afternoon (Ezebikieh Gardens). Thence to Khan Khalil Bazaar at 5pm.\n\nWent with N. in evening for half-an-hour through Wuzza, after an economical tea at Soldier’s Home. Two Egyptian soldiers cadged drinks from us in a rather barefaced fashion.\n","66":"\n\nJerks morning. Received word to pack up and be ready to leave any hour. Lesson evening in French at Berlitz School. They refunded 30 piastres each. Wired 6pm Sister M. Wrote Mother and S.\n","67":"\n\nOrders issued at 6.30am that all kits to be packed and tents struck by 7.30am. Everything ready, but authorities kept us fiddling round until 11.30 am. Then we moved off to Zeitoun and entrained in open trucks---12.30.\n\nOn parade, W. shows himself in true colours---grasping, with a narrow, crabbed egotism, not the pride of individuality that lifts itself high, in spite of the encroachments of collective circumstance, but egotism that is indifferent to all else, and blind.\n\nArrived at Tel-el-Kebir (dinner, bully beef, in train) about 4pm. Marched two miles and found we had been sent to the wrong place. We were given \"sit easy\" for two and a half hours. (No tea except what we could forage). Marched off again to thatched huts---no blankets. This, our first taste of actual Active Service conditions of course evoked the saying \"This is the life!\"\n\nThursday, 9.\n\nAfter a bitterly cold night we fell in for breakfast---bully beef and biscuits. Went over to the scene of the old battle of 1882. Saw Arabic Pasha’s trenches.\n\nAfter fiddling round all morning all except 3rd. of 4th. left Tel-el-Kebir in trucks for Ismailia. No dinner ration issued. Arrived about 2pm. Picked for Sergeant of Baggage Fatigue. Our camp a couple of miles away---heavy sand. Col. C. asked me previous profession. Told him. He said, \"Good, very good. We’ve only had one so far\". Attached as Sergeant to","68":" Battery. We did nothing beyond watering and feeding horses. B. and number of others\n\npicked for Howitzer Brigade.\n","69":"\n\nAm spending ½ piastre per day, that on a newspaper. We are on Active Service. No Canteens etc. Only two latrines that can be called such. Simply a desert of heavy sand. Food—active service. Sergeants’ Mess, an old board---a couple of chunks of wood for seats---open air---and at night bitterly cold. Meals any hour Third inoculation---for Typhoid and Para-typhoid---very big dose. Arm very painful. I felt it all over body and had to lay up all day. Received a letter from home dated","70":" and addressed Maribyrnong.\n\nSaturday, 11.\n\nTransferred this morning to B.A.C. 6th. Brigade as Corporal---provisionally (one month) F. Subsection. Rotten W.O. Always growling or whining. Has no direct appeal to men. Watered horses three times per day---also groomed and fed them.\n\nIn tent with McCleave, Les White, Len Marshall, Sam Crute. It is fine to be with them.\n","71":"\n\nChurch Parade for whole 6th Brigade. Poor sermon the little I could hear of it---so wrote up my diary during service. After review of whole division by General ---.\n","72":"\n\nUsual routine---watering and grooming and feeding. M., who retained his three stripes, gave us 70 minutes foot drill before breakfast. The men detest him. He is a school teacher and treats us as kids. He has studied psychology, but his horizon is the text book, and applied psychology is unknown to him.\n\nIt is fine to sit round the candle in the tent at night with all the old fellows.\n","73":"\n\nUsual routine except for washing in afternoon. Did most of mine. Handed in Black Kit Bags. Ordered three copies Anzac Bk at 2\/6 to be charged against Deferred Pay. Received first letter from S. and one from H.S. Have a very heavy cold---on the chest. The Dispensary here is very poorly equipped.\n\nWednesday, 15.\n\nUsual routine. General Birdwood looking around so had to take charge of fatigues in morning. Appointed Orderly Sergeant Duties commencing at 6pm. We expect to leave tomorrow. Wrote letter in French to Molle Marie, Khan Khalil, Shareh el Mousky, Cairo.\n\nThursday, 16.\n\nUp at 5.30am. Scarcely any time for my own meals. Parade 6.30am. Dismissed to get ready for striking camp. Have been at it all day. Received two letters from Mother, one dated","74":" and addressed Maribyrnong, and the other No.1, addressed Egypt. I think I was about the last of the 3rd of the 6th to hear from home. Mc.Cleave etc picked out to go by \"Arcadia\" under Sgt Matthews. Rest of us got away about 7.30pm. marching through heavy sand. After great trouble got all horses and mules entrained---then ourselves. Left in train, thirty odd trucks and carriages, at 11.45pm. Travelling in third class carriages. Slept by fits and starts till 4am. \n\nFriday, 1.\n\nArrived Alexandria at 8.30am. Detrained, and got all horses and mules aboard transport G.061 Eboe, by 1pm. Snatched breakfast and dinner and took Sister M’s pen to Y.M.C.A. and asked them to post it. About half a dozen transports in harbour. Chick from Clarence Park introduced himself to","75":" 17th,","76":" 21st Batteries, and B.A.C. aboard by £pm. Tea at 6.30, when we started to move off. Had tea below---very stuffy---no portholes.\n\nHelped with stables till 8pm---sick---slept up on deck---rained all night.\n","77":"\n\nVery rough---raining, squally, cold---no shelter on deck---sick---bile. Went below to get hat to help with stables---couldn’t get up again. Seized with kind of convulsions and had to be carried to hospital. Doctor injected morphia \nnear\n over heart---do not remember much about rest of day.\n","78":"\n\nFeeling a bit better, though far from well---temperature 96. Limited to milk and bovril. Pains in back and legs. Got up for a little while but it upset me.\n","79":"\n\nGot up this morning and had a hot sea bath and cold shower, and shave. Feel very shaky but much better. Sea calm and beautiful. Blue sky and not a movement in the ship. Slept in hospital.\n","80":"\n\nDischarged from hospital. One is fed there on milk and perhaps a small piece of bread, or half a cup of bovril and latter. Warned for Guard but refused to take it. However, was promised by W.O. L. a couple of N.C.O’s to do posting. He failed to keep his promise and I had to do the best I could. Night bitterly cold and a rough sea. No sleep, and frozen all night. It was an eternity of nightmare. Never have I dwelt in such black depths of chagrin and hatred and disgust of the swiftly accumulating humiliations and tortures of the military machine. Bitten in the neck by a horse 5.30pm.\n","81":"\n\nFeeling a bit better. Living in hopes of end of voyage. I\n\nI dread the Mess room below. The stench there is terrible---stale beer, stables and rotting straw, grease, foul air, and all the multitudinous odours from the lower hold.\n","82":"\n\nWe arrived at Marseilles at 10.30am. Towers and warehouses typical of a big sea port. Parade, full kit, 10.45am. then stables. Attended both and did my whack. Sent for in afternoon by L. I was in hospital getting some stuff for my neuralgia. On presenting myself to him down at stables, he accused me before an officer of not having been on parade at 10.45am. or doing stables that day, and that I had done nothing but moan since I had been on the boat. I corrected him afterwards, and he half apologised and said he had been told to give me a slating by the Brigade W.O. who had seen me in hospital and did not know I was under treatment. Went and slogged into stables. Took charge Baggage Guard at 5pm. till 12 midnight. Everything entrained by 1am. We departed at 1.30am. Dry bread and tea for evening meal.\n","83":" 24, and Saturday, 25.\n\nA little sleep. France! We pass up the valley of the Rhone, through the land of Daudet---Avignon, Lyons etc. It is beautiful. Here an old battered grey castle---quaint, red tiled cottages---beautiful towns---and the charm and smile of the daughters of France. The elms and poplars, cyprus, pines. It is all beautiful---one drinks it in---but to describe it must be left till later---the beauty of it all leaves one powerless now.\n","84":"\n\nHavre-disentrainment. March through town with horses and mules. Bleak and grey sky---muddy streets. No. 2 Camp two or three miles out. Put horse lines down. Finished at 8.pm.\n","85":"\n\nNo hot meals yet. Iron rations. Bitterly cold---rain, mud, slush. Horse lines in rotten state. Exercise of animals at 6.30am. Chains like ice. Later took horses etc. down country lanes---very pretty. In afternoon took them to village of Feutre. Booked for Orderly Sergeant in night. Cpl. Taylor acted for me. Went into Havre with Bdr. K. Came back late 9.45. Havre dead. All lights out 9.pm. Very few people out. Read notice outside public building exhibiting latest telegrams that the Australians had arrived at Marseilles!\n","86":"\n\nUp before O.C. in morning for coming home late. Case remanded for Colonel to deal with. K. got off with one night’s duty on horse picquet.\n\nRoutine: Stables 6.15am. Watering, exercising, grooming and feeding. After breakfast and dinner---exercising horses. We take them about two miles down the various country lanes round the Camp. Very pretty.\n","87":"\n\nA fine little café near the camp. The people Protestants. Everywhere it is ouef or des ouefs. My French is improving with practice.\n","88":"\n\nOrderly Sergeant. The life is very enjoyable in spite of the work. There is no system, but we manage somehow. Pay about 10.pm. 120 f. They pay, it seems, at the rate of 1 franc = 8 ½d. We get ten pence worth for it.\n","89":"\n\nBooked to take three four horse teams and 11 men to work\n\nfor 18th Battery. I had to select horses and harness---a hard job (there were only heaps of harness---odd parts, chains, collars etc. Horses to be paired and made up into teams) and get everything right by and ready to hook into wagons at 3.pm. Everyone had gone. Two or three of us rode on 18th. Battery limbers. We left Havre about 8.pm. Sam Crute, McCleave, White, Bagshaw and myself, in one carriage. We had some egg sandwiches from Café Protestant so we were alright.\n\nApril.\n\nApril.\n","90":"\n\nNoyables, Pompe à Incendie, Fort Mahan, Steenbecque, some of the stations we passed through. We disentrained at Thiennes. Major Dean in charge. Rode on gun limber. Had to go four miles. After fixing up horses had tea. Got to bed in an old farm---hay loft---at 10.30pm.\n","91":"\n\nFirst morning in Flanders. We purchased seven loaves of bread and some butter for 13 francs.\n\nLeft about 11.am, but could not find B.A.C. lines until 12.30. Country pretty. Quaint estaminets.\n","92":"\n\nWas roused at by Lt. Bryan the O.C. for coming back late from 18th Battery. No room provided for us here. Told to sleep under a gun. Everything sloppy. Picturesque village of Blaringhem. Roused at by Bryan for being too reserved and quiet and not bullying the men more etc. The rotter! Let him wait!\n\nOrderly Sergeant. Slept in Saddler’s \"Shop\". Worked with Lt. McDonald at 8.pm.\n","93":"\n\nReveille 6.am. Fall in 6.30. Boot and saddle 8.45. Marching order parade---all teams out 9.am. Dismissed at 12.30. Boot and saddle 1.45. Marching order parade 2.pm. Dismissed 5.30pm. Worked with Lt. McDonald 8.pm. First Green Envelope issue.\n","94":"\n\nUsual routine. Went out with teams this morning. I have a nice little bay pony for my hack. Findley, Wise, Jackson, Quarrel and I sampled the champagne at one of the estaminets. Water and non-intoxicants practically non obtainable.\n","95":"\n\nUsual routine. Horse lines in a terribly sloppy condition. McDonald utterly without psychological instinct. It is impossible to please him. The people of the Estaminets say they dread our going away---\"Les Australiens sont tres riches\", they aver. It is a good livelihood for them. It is a great relief, after the day’s work to spend a couple of hours there with some \"bons comrades\".\n\nOrderly sergeant from 6.pm. Walked over to Headquarters with Tattoo Report.\n","96":"\n\nUsual routine. Had my ordinary work of supervising F. Sub to do, in spite of Orderly Sergeant’s duties. Wrote letters etc. in the evening. I am sleeping next the Sergeants’ Quarters---in reality the Saddler’s \"Shop\". The warm soft straw, sweet smelling, makes a most inviting bed. The Sergeants’ Mess is in the cottage. Monsieur and Madame Mouton, an old, old couple who have lost three sons in the war. They welcome this augment to their income. Being the interpreter I score. She looks after me well. I eat in the little bedroom and storeroom off the kitchen.\n","97":"\n\nBryan, the O.C. returns from the firing line. He paints in his usual exaggerated style, the glory etc. of our new quarters. He is a mean-spirited, visionless cur. He cannot speak without betraying the dirty soul that lies within. Scarcely a parade passes without his foul abuse.\n","98":"\n\nWent to the Church (Catholic) of Aire-sur-Lys. Interior was good. Could not follow the preacher. Concert in evening.\n","99":"\n\nReveille 3.am. We were well out of Camp by 5.am. Of course\n\nBryan etc. had a good swear. But on the whole I reckon it was creditable for untrained men anyhow. We passed through Hazebroucque and some villages and arrived at Croix-du-Bac at about 2.pm. The \"humpies\" evacuated by the Tommies were indescribably filthy, and the ventilation is a door at one end. The smell was like the Eboe’s hold. The day was beautiful.\n","100":"\n\nAnother fine day. A little cottage nearby serves me for a home I was one of the first there and have again struck right. I have three meals a day there. Little Clothilde and Marie---they are bonny youngsters. Horses are watered three times a day at a water hole a quarter of a mile away. McDonald growling---\"F. Sub always behind\".\n","101":"\n\nVery wet and cold. Usual routine. F. Sub first---still McDonald not satisfied. Exercised horses afternoon---men riding one and leading two. Rained all the time. Orderly Sergeant. Bryan on Tuesday night read out orders at \n7.pm.\n 7.30pm. In the course of his remarks he warned men against women; \"But if\", he said, \"you must have that sort of thing, I would advise you to use your fingers---at all events you will get more pleasure that way.\" He is a rotten filthy cur. I thought his two junior officers Lewis and Meates, would have knocked him down, they looked so wild.\n","102":" ","103":"\n. 13.\n\nWent with McDonald to Brigade Headquarters and","104":" and 17th on right (before coming to 18th and","105":" on left, with fine avenue of ormes and two black faced barns). He growled again I was ten minutes late---when I was not. He left me Orderly Sergeant’s job and this other affair as well. He also is mad. Column, commencing from 9.am to be 2 sections, Right and Left, and 4 Subs, A.B.C.D. I am transferred to B.\n\nFriday, 14.\n\nB. Sub tip top. Though the responsibility is now over, I feel the reaction of the old Sub. However, in a few days I will be fit and the neuralgia will disappear. Stables and exercising horses as usual. Still wet---slush, spongy and sloppy everywhere. Boots wet through.\n\nSaturday, 15.\n\nHarness cleaning---holiday afternoon.\n\nSunday, 16.\n\nWork as usual. Wet as usual.\n","106":"\n\nWet and sloppy underground and still raining. The humpies are damnably stuffy and evil smelling. Each day in spite of the weather we exercise the horses. I am to take Horse Picquet tonight and sleep in the saddlery barn. It is a cruel night. Hay nets to be untied filled, tied on again and then untied again.\n","107":"\n\nSlept well and feeling fit this morning. Left for Brigade Headquarters at 7.30 and arrived there at 8.pm. Had to wait a couple of hours. Went to the La Petite Chaumière de Lerouge in the evening.\n","108":"\n\nTook a wagon out to 18th. Battery in afternoon. Spent evening at La Petite Chaumière de Lerouge.\n","109":"\n\nStill wet. Went with Mr Lewis to Bailleul---and managed to do a bit of shopping. He owes me 6 ½ francs for a lamp for the Officers’ Mess.\n","110":" (Good Friday)\n\nNo different to any other day as far as our work is concerned.\n\nWent to La Petite Chaumiere during day and found that Madame etc. refrained, according to Catholic custom, from eating even eggs. Speaking of the war, she cried a little because of the hardship it had spelt for her, and telling me in answer to my question, that the war had failed to make the people of France more religious. My first sermon in France---it was only a matter of minutes---but I pointed to the sacrifice of Christ, the injustice that was done him.\n","111":"\n\nOn picquet.\n","112":"\n\nSpent a rotten night (Sat. night). Slept in Saddlery \"Shop\"---very draughty. Went to Croix-du-Bac. Service rotten. Presbyterian Minister. Work rest of day.\n","113":"\n\nWeather fining up a bit. Half-a-dozen aeroplanes up at one time, and a couple of hundred shots fired at them. Usual routine. Went for first time to Divisional Baths on fringe of Armentières. Two letters from W. also papers.\n","114":"\n\nWeather grand---though ground sloppy underfoot. It will be a week before it dries up. Exercising horses a pleasure in the sunshine. Aeroplane bombardments intermittent throughout the day. In afternoon took ammunition to 18th. Battery lines. Old Lewis very complimentary. Letter from M., (No. 3) including photo A.---her letter and letter C. also C.C. and Chronicle.\n","115":"\n\nWent to Baths in morning. W.O. in charge. Harness cleaning in afternoon. Heavy bombardment commences tonight.\n","116":"\n\nThe bombardment continues. Detailed to relieve Bdr. Rowe, who is ill, as guard at Ammunition Dump, but later detailed for trip to Bailleul. Tip-top!\n\nWent with Logie in evening to farm opposite billets to find out address of a beer merchant and in course of my questions the fermier asked me point blank the number of our division. I replied \"Septième, non, dixième.\"\n\n(Words of Tipperary in French, written in at Havre at dictation of a small boy).\n","117":"\n\nHarness cleaning all day. My set is looking fine now. Picked for guard last night, but did not arrive back from Bailleul in time, so Taylor and I swopped nights. I am on tonight. Reported affair of fermier to Messrs Lewis and Meates tonight.\n\nTonight one can hear the big guns. The 18 pounders are lost---it is the big stuff.\n","118":"\n","119":"\n\nSteenwerk. Went in on business for Capt. Milford and Lieut. Lewis. Rode Captain’s horse---a regular snorter. Returned at 6.pm 5 films---1\/- each to develop 1\/- each to print--- for Captain Milford---to be finished by Thursday next 2.pm. 1 copy each. 3 negatives for Lieut. Lewis. 6 copies of each to be finished Sunday next 10.30 am. 288 3\/- 1\/- each half dozen. Post cards 8 fr. par douzaine; 4 ½ fr. par demi-douzaine.\n","120":"\n\nUsual routine all day. Detailed by W.O. to take party to Dump to unload ammunition (after parade was dismissed, 5.30pm.) Then after tea, detailed again. After which I received orders from Mr Lewis---during which time I was called for in Horse Lines, and because not present, was put under open arrest by Mr. McDonald and Mr. Lawson, the W.O. Left at 10.30pm for Sub. Park (with Cpl. Taylor) Returned 4.am. All wagons had been called out for ammunition supply Heavy bombardment during night. Mr. Lewis told me on my return from Sub Park not to take any notice of arrest. He roused well at McDonald I believe.\n","121":"\n\nDetailed by W.O. at early reveille 5.30am. for unloading ammunition from Sub Park. After which usual duties. Went to 18th Battery with Cpl, Laidlaw in hope of going to pits---disappointed. Returned---made another trip on promise of trip to Pits---again disappointed. Returned 1.am.\n","122":"\n\nReveille 7.am. Unloaded ammunition all day. Others had afternoon off, and also went to Church in morning. The W.O. details me for all the work. Stayed home from church, because too dog-tired to go.\n","123":"\n\nUsual duties. On guard for night. Had a good sleep. Too tired to write. Turned in at 8.30pm.\n\nGuard reported having seen pigeons fly up from \"Brothel\" at 5.am. Reported matter to Lieut Lewis.\n","124":"\n\nUsual duties. Had a good sleep for night.\n","125":"\n\nCalled up to see Mr. Lewis whilst having tea at La Petite Chaumière. Had left word to that effect. W.O. ordered Bdr. --- to take message that I could not be found in billet. I went down. Recommended for School of Instruction and Commission---Mr. Lewis informed me. W.O. not to be recommended, his attitude of past week had not escaped the O.C’s notice. Finished interview and met W.O’s messenger Bdr.---as I came back. One for me. I told him to deliver his message.\n","126":"\n\nCpl. Taylor sent to Sub Park in morning. Bungle somewhere, so I had to go. Was paraded before a corporal and thence every officer except Major, up to Colonel to get what I wanted. (Primers).\n\nSaturday, 13.\n\nGreat alterations. Column (B.A.C.) horses and outriders transferred to new Batteries. Mules to take their place. B.A.C.’s to become D.A.C’s. 6th B.A.C. becomes 3rd. Section","127":" D.A.C. Went to Baths via Nieppe and Armentières. Transferred to","128":" Battery. Received word 6.pm. Arrived (after carrying kit) at Battery Wagon line 8.30pm.\n","129":"\n\n17th. Battery billeted at Petit Mortier. Easy day. Am not to take over till tomorrow. Fine sing-song, hymns etc.\n","130":"\n\nTook over duties at reveille 5.15 this morning. Fall in 5.45am. I have no friends here and it leaves one with a queer sense of depression and the feeling that one can never be at home here. The constant change of the last few months too, is having its reaction and one feels that one is indeed a \"Wanderer\". More singing (evening) some fine voices. \"Soldier’s Farewell\" \"The End of a Perfect Day\". \n","131":"\n\nOrderly Sergeant for the day. Plenty to do. Was pleased to get the job as it gave me an insight into things. W.O. Campbell who has improved out of all recognition, (though the fellows hate him) called me up last night to explain my duties. He sort of spoke challengingly, but I told him straight out that I would do my whack etc. and it sort of broke the ice.\n","132":"\n\nAm beginning to feel more at home. The fellows are a decent lot---mostly Tasmanians, though there is a representative or two of all the States, and an Irishman, an Englishman and an American.\n\nMy French improving---though mostly patois spoken round here. The older people difficult to understand.\n","133":"\n\nUsual routine. \n","134":"\n\nUsual routine. Interpreter for the day, finding out depths of water in wells round about the billet.\n","135":"\n\nUsual routine morning. Afternoon---sports. Wrote letters. In evening concert. Very fine double quartette \"The End of a Perfect Day\". \"Soldier’s Farewell\", I sang \"Boys of Tasmanian’s Clime\", and Tipperary and Marseillaise in French.\n","136":"\n\nUsual routine morning. Went into Steenwerk in afternoon. Thence to 2nd. Section D.A.C. to see J.L. Evans, Green etc.\n","137":"\n\nNotice to move camp at 6.30pm. Everything went off smoothly. Left at 6.35pm. Went via Croix-du-Bac to Menegatte and L’Estrade. Subs divided up. C. Sub at Menegatte. D. at L’Estrade, and A. and B. in between. Things going well with men---work good, but unsatisfactory to Officer and W.O. From Office to C. Sub three quarters of a mile. Alice’s house burnt to ground.\n","138":"\n\nWe do our own cooking, have our own reveillé etc. at C. Sub billet, and are very happy. Am sleeping in the loft above the stables. Orderly Sergeant for the day. Saddled a horse for the purpose.\n","139":"\n\nWent over with Lieut. Cleveland to old billet at Petit Mortier to get \"\ncertificat\n\" showing that we had done no damage to any property occupied by us. On every hand heard nothing but praise for our men and the Australians generally. Cleveland held my horse each time!\n","140":"\n\nA couple of big farms about here. La Ferme de L’Estrade, very interesting. Madame Crépin, une verve, fat and ungainly, with six sons at the Front. Mdlle. Angeline, red haired and randy, but a good \"French\" girl, Mdlle Berthe, about 20, a plump, raucous-voiced vulgar, and indescribably smutty-minded girl---even for the countryside of France. Then the workers---Madame Isabelle, a verve, refugee, coarse-minded, but kind hearted, who makes as an excuse for her sayings that she has been married. Then Mdlle Madeleine,\n\na Belgian, a big, tall, rosy-cheeked lass, blue-eyed---clean-minded—nice girl---but rough compared with our own city girls of Australia.\n","141":"\n\nUsual routine.\n","142":"\n\nOrderly Sergeant for day. We commence to shift to the old infantry \"humpies\" situated in the orchard at L’Estrade---nearer to Office. It is a very ragtime shift. Went to baths. Trouble with Bdr. Boag and Campion. Warned them for Orderly.\n","143":"\n\nNearly everything shifted. We have the afternoon off. I wrote a little, but slept till stables---under a cherry tree in the orchard.\n","144":"\n\nAt Menegatte C. Sub had covered in stables, but here the whole battery horse lines are in the open---two lines, one for each section. Usual routine. Hauled out of bed at 9.30pm. to supply two teams and accompany the Left Section---four teams in all-to Gun Pits. Cpl. Waters to take four teams to Right Section. Night---drizzling rain intensely dark, was highly strung---it was my first trip into the unknown. The strafe had been heavy all day. Went right to the Pits themselves. Returned 4.am.\n","145":"\n\nMorning in bed---slept till 10.30am. Had to attend Orderly Room to give evidence re Boag and Campion.\n","146":"\n\nUsual. Went into Steenwerk for tea with Prouse---pate, eggs, chips and coffee. In a butcher’s shop where we got the pate I saw the most exquisite type of face and hands I have seen in France.\n\nAbsolutely English of the best example. A butcher’s shop! Ye gods! Voice, dress, manner, perfect also.\n\nJune.\n","147":"\n\nParty of ten from 17th. and representatives from whole of units of Md. Division went to parade at which Fisher and Hughes spoke.\n","148":"\n\nUsual.\n","149":"\n\nEnglish Captain (Morgan) who is relieving McArthur for a week or two shouted for the whole room at La Ferme de L’Estrade in the evening. Then we sang Marseillaise and God save the King.\n","150":"\n\nUsual routine. Afternoon off. I spent it in writing. At midnight called up to detail a team and take 4 teams to Forward Wagon Line, thence to Pits.\n","151":"\n\nVery cold. Got to Forward Wagon Line and found order given was a mistake. Returned at 3.30 a.m. Passed Bob Matthews in charge of a dozen teams from D.A.C. When we got back found 5 wagons of ammunition waiting for us. Unloaded them. Got to bed 4.30am. Reveillé general. 7.am---for us 2.pm. parade. Woke 8.am. Got up and wrote S.\n","152":"\n\nReceived letters No. 8 from M. (dated","153":" saying that A. and C. would be married on April 20\/16.\n","154":"\n\nBattery left L’Estrade 6.pm for old","155":" Battery (afterwards","156":" lines at Erquinghem. Known as Forward Wagon Line. Each \"duty\" battery proceeds there for a fortnight and supples the Brigade---16th,","157":" 18th, and 21st Batteries. Four teams left for Pits. The farm is easily the largest we have seen. Its equipment\n\nand comfort more complete. Refugees from Lille, of good standing, occupy it. Slept in a borrowed bunk---there were not enough to go round---in the Right Section barn.\n\nSaturday, 10.\n\nWe are not allowed to do driving drill---too near German Observation Balloons---so old \"Second Section (Cleveland) makes us exercise from 6—7.30am, then water at the Canal, and then exercise again at 9.am. The harness room has no saddle racks. The men are in an open state of rebellion almost.\n\nSunday, 11.\n\nOrderly Sergeant, but relieved of duties temporarily to go to old billet at L’Estrade for Certificats des Dégâts. They were all very sorry to lose us. Everywhere it has been the same with the","158":" Arrived back at Erquinghem at 2.pm. Rode \"Sgt. Crane\"---not a bad pony.\n\nMonday,.12.\n\nWeather changing. Dull and cold---then drizzling\n\nWednesday, 14.\n\nAeroplane shell fell in Wagon line, seriously wounded Pratt’s mare, and broke the spokes of a limber, and tipped a wagon upside down besides scaring several fellows sitting a few yards away.\n","159":"\n\nUsual routine.\n","160":"\n\nWent up to Erquinghem with \"Pud\" Reed. All estaminets closed (1.pm). Went to private house who got us a bottle of vin blanc and we chatted the afternoon away. Twelve teams warned to \"stand to\" at midnight. Woke men 12.30. Then telephone rang with report of gas. Got to bed 2.am. Reveillé to be at 6.15am.\n","161":"\n\nReveillé 6.15 instead of 5.45. Had to fight hard with the O.C. for the concession, however.\n\nRain for the most part of the day. Orderly Sergeant up to 6.pm. Plenty of Fatigues---sweeping the cobblestones drive, digging out the gutterway, burning stable refuse, burying the dead horse, (on the site of the old farmhouse garden) getting wagons all squared up.\n\nAwakened between midnight and 1 a.m. to learn that gas attack had been launched near Armentières. We first felt for our helmets and then off to sleep again.\n","162":"\n\nIt has not rained today, but it is very cold and muggy still. Have been working all day, on burning the stable refuse. We have about a dozen fires going.\n\nWe were all awakened about 11pm. to hear that the R.E. Dump was on fire. Although we were out in less than three minutes, were only in time to be told to get back to bed---except the first half-dozen who had to unload ammunition. Seven teams for pits.\n","163":"\n\nUsual routine. Went to Baths at 1.pm. Lieut. Radley has come from Pits to take Cleveland’s place. He goes to D.A.P. Wrote in evening in the private room at the farmhouse. Revised \"When the Guns speak\" and wrote S. The weather brightening up.\n","164":"\n\nFine day. Usual routine. Afternoon-putting up new railings in stables. At 3.30pm I dismissed B. and H. etc to harness. Bdr. Cranston, Button Wistlecroft and myself stayed on to finish. Gve Wistlecroft permission for latrine. Did not return. At 4.45pm found him in billet lying down. After three orders to leave, which\n\nhe did not obey, I placed him under open arrest.\n\nAppointed Orderly Sergeant 6.pm. Twelve teams warned. Stayed up in W.O’s hut in anticipation of orders. Wrote and revision \"When the Guns speak\". At 11.30pm Despatch Rider (Motor Bike) arrived with telegram saying gas attack launched. Woke camp up---then warned five teams, which left about 11.50pm. Went to bed about 12.20am. \n","165":"\n\nSky cloudy and gradually growing threatening. At 11.30am Wistlecroft paraded before Captain McArthur and remanded to C.O. Received Magazines, Bulletins and other papers. Twelve teams warned Only two went out. Went out at 7.pm with Fred Carter to La Grande(?) Place to same place as Sunday. Had coffee and biscuits, and a good chat with Madame, a well educated Lilloise refugee. She informed me that there were not ten people in Erquinghem who could speak really good French. Heavy thunderstorm and hail from 5—6.30pm. Had a drink of water---which we caught in our dixies from roof of big barn—first drink of water for three months. It was delicious.\n","166":"\n\nHeavy strafes on both sides each night. Sometimes Germans commenced first, but usually we break out about midnight with a sudden gust that spreads until the whole air is filled with the peculiar swish as of waves breaking restlessly along the seashore---while the lighter guns rattle along the front like rifle fire. Only the crash of the bigger guns breaks their continuity. The Germans fling star-shells up with nervous haste. This heavy fire the precursor of the infantry raids.\n","167":"\n\nRumours have been prevalent lately of the departure of the","168":" and","169":" Divisions for another part of the Front. Where---we know not. Ypres \"Furphies\" seems to have the greatest number of supporters.\n\nFriday, 30.\n\nHeavy strafe by our batteries right along salient to cover raids of infantry. Aeroplanes every night in profusion. Saw six at one time.\n\nJuly.\n\nSunday 2.\n\nHad temporary filling put in tooth at 6th Field Ambulance. Wrote all afternoon and evening. Heavy strafe in evening to cover infantry raids. The heavy firing is considered a part of the \"Grand Offensive\". We hear now of the advance of the English and the French on the Somme. Italy is doing well, likewise Russia. Bets are frequent---£10, £20 even money that we will be out of France by Xmas. Prisoners brought in complain that as soon as they leave front line for the supports, they are almost starved, but say there is plenty to eat in the \nfront\n first line.\n","170":"\n\nOrders to leave any hour. No 1 Furphy: To go to Somme as supports for English. No 2 Furphy: (more reliable) Ypres. No 3 Furphy: Caistre to entrain. Left Erquingham, Right Section 6.30 p.m., Left Section 7.30 p.m., for unknown destination. Arrived at Eck, near Caistre, at 2 a.m. Put up Horse Lines, watered and fed---then bed.\n","171":"\n\nReveillé 8 am. Right Section left at 12 noon---for Armentières according to furphy---but actually to Ploegsteert Sector. Marching orders for Left Section. Had afternoon to ourselves. Jack P., Alb. C. and E. had Dubonnet and vin rouge and biere francaise at the farmhouse. People Flemish, though can talk French---or else French and can talk Flemish. Saw Les White. He and McCleave are now in the 18th Battery.\n","172":"\n\nReveillé 7 a.m. Orders to march off 11.30 a.m. Everything square. Whitworth Acting W.O. Left 11.30, having had early dinner---bully beef and biscuits. Passed through fine country. Wheat crops 5 and 6 feet high. Plenty of hops. Passed through Flêtre, Meteren, Bailleul, thence main road to Armentières, where we turned off abruptly into Belgium. Thence Neuve Eglise, thence across new unmettalled road through fields to \n\nRomarin. Received word that I am to go to the Pits tonight. Though tense I am glad to go.\n","173":"\n\nLeft at 2 a.m. for the Pits with Sgt. Whitworth. Sgt. --- ---- hopelessly drunk---standing in middle of road---raving---as we passed. His gun and Detachment left without him. We got the Tommies’ guns out and put ours in. At 4 a.m. we commenced building up parapet of sandbags in front of guns, and strewed twigs about to hide tracks. Then bed. The dug-out smelt horrible, but sprinkled sassafras and lysol. Up at 10 a.m. Afternoon fired eight rounds-ranging. I have been nearly deaf since and even tonight my ears have not ceased ring. Also we dug-out---six loads of rubbish, underclothing etc.\n","174":"\n\nRonnie Whitpain and I built three new bunks, removing the old ones; also baled out the drainage pit. It was filled with stagnant black water. The tunnel leading to it, running from the dug-out, was putrid with old scraps and urine. This is not the first instance of the Tommies---many there are such as these. Illiterate, with some uncouth, provincial burr---they cannot help that. All that we have struck have been externally clean, on parade, by force of military discipline, but are, in reality, filthy beyond the most vivid description. They live in an atmosphere that reminds one of the hold of a horse-boat.\n","175":"\n\nThis morning German fire---5.9 breaks out. Rumours that we may move out tonight. 4 p.m.---I received orders to pack up and go to Wagon Line. 5 p.m. Whole battery (except guns) left for destination unknown. Arrived at Silvestre about 10.30 p.m. Felt tip top until I went to the barn, and then had to go out and vomit. I had had had nothing to eat \nsince\n or drink since 1 p.m.\n","176":"\n\nSunday, 9.\n\nReveille 8 a.m. Afternoon off. Went up to the town---met Les White.\n","177":"\n\nOrders out to leave midnight. All blankets and surplus material to be handed in. Had to split up my little medicine chest. All I have now is my haversack (cram full), water-bottle, gas helmet, respirator, mess tin, bandolier, (full of matches) belt, and greatcoat (full of books). I cannot get another thing in my tunic pockets. Orders out not to leave tonight, but tomorrow night. Nearly all the men boozed. Sgt. W. and others under arrest, the former close arrest. Drunkeness.\n","178":"\n\nNews has come through that our Wagon Line at Neuve Eglise was shelled and smashed up the day after we left. Exercising horses. In afternoon took two sick horses down to the town (Sylvestre) to be cast. The Maire fixed me up. Went back and got Certificat des Dégâts. Left Sylvestre at 7 p.m. We went a rather round-about way, just skipping Hazebroucque, and linking up with the main road again. In addition to the usual lumber I wore my respirator---in all about 50 lbs. No bon. We rode all night---nothing to eat---halted but rarely.\n","179":"\n\nArrived at St. Omer 4 a.m. We were all dog-tired. We just tethered our horses to anything we could find, letting the teams stand, and then, near the railway station, beneath a great grey sentinel, a magnificent cathedral in ruins, we lay out on the footpath, officers and men, and slept for an hour. Left St. Omer by train 8 a.m. after entrainment of horses etc. I was Corporal of the Guard. We had very little sleep on the journey. Arrived at Amiens about 4.30 p.m. Then, (no tea) mounted and moved off to Belloy-sur-Somme. Arrived about 10 p.m.\n","180":"\n\nWe are in Picardie. There is a different patois here. The people are very dark, and many very beautiful. We are 16 kilometres from Amiens.\n\nWe are, too, beyond sound of the guns. Our billet is an old factory. Impossible to get eggs or anything except a few biscuits.\n","181":"\n\nThe 106th arrived. Their horse-lines are with 18th---the men sleep here. B. turned up and we went out together. After a great struggle I managed to get three eggs. Could not buy bread, butter, beer. With great difficulty I got the eggs cooked and persuaded an old lady to let us have some coffee---a small cup of black coffee was all we could get. I begged some bread from the chateau, but had to spin a long yarn.\n","182":"\n\nFull marching order parade ordered for Colonel’s inspection---then cancelled. General Brigade Parade instead at 7.30 p.m. The Colonel spoke. Our fellows marched perfectly, and were the best groomed battery out. News of good work by British cavalry on the Somme.\n","183":"\n\nMarching Order Parade afternoon---battery only. O.C. complimented us. C Sub. the best sub. Concert in evening. Good.\n","184":"\n\nLast night a big mail arrived. Come fellows received 10, 15, and one, 25 letters, besides hosts of papers. I received two---one from W. and the other from J.B. I was hoping for a big mail, too. B’s inordinate military ambition curbed. He is content to remain corporal---at least he says so. Wrote up whole of sketches tonight, finished about 10.30 p.m. W’s letter very beautiful. We are all counting on the war being over within three months from now.\n","185":"\n\nA little more mail today. Two letters from W. but nothing from home. Went to concert in 5th Brigade area---out of bounds to us. It was held in the village school-yard. There was a piano, violin, and an improvised kettle drum of dixie lids, wash basins etc. The music was decent.\n\nBailey rendered \"Somewhere a voice is calling.\" and \"A Perfect Day\" with genuine feeling. Also D. ran through the whole gamut of rag-time commencing with \"Robert E. Lee\". Roll Call 9 p.m.---just too late. However, Glover accepted a nil report.\n","186":"\n\nOn the 6.15 a.m. parade it was announced that we would leave at 9.20 a.m. Fall in at 8.45 a.m. Boot and saddle 8.30. Dismissed for breakfast 8 a.m. Rotten for time to get ready. Left 9.20 a.m. Arrived at Puchvillers at 5 p.m. Dinner, ten minutes---bully beef and biscuits. Beautiful country, valleys, plenty of timber. Our billet is three-quarters of a mile from horse lines, and troughs the same.\n\n(Gen. McKie-Battle Fleurbaix, 5th Div.)\n","187":"\n\nThe whole of the 2nd Div. Art. is quartered round the town. No eggs or food of any descrition. This god-forsaken hole is second only to Belloy-sur-Somme. L.E. and I went out in evening and managed to dig up a little old house, and found an old couple about 65, (but who still work in the fields) and got half-a-dozen eggs each. They gave me bread next door. We could get no coffee, so beer and champagne formed our beverage.\n","188":"\n\nIt is a bit wearisome to track up and down the steep rise from Wagon Line to watering troughs three times a day, in addition to three times to and fro for parades. I sleep now under \"C\" gun with Bdr. Vautin. It is too stuffy in the \"humpies\".\n\nSaturday, 22.\n\nUsual routine.\n\nSunday, 23.\n\nMarching order parade. Went out at 9 a.m. and returned about 1.30 p.m. Passed through Toutencourt. What was left of afternoon, after knocking off from \"stables\", we had.\n\n(First attack on Pozières by the 1st Div. A.I.F. after failure of English troops).\n\nMonday, 24.\n\n\"6th Field Art. Brigade, A.I.F. Brigade Order No. 186, By Lieut-Col. H.E. Cohen, Commanding 6th F.A.B. In the Field, France,","189":"\n\n(2) Court Material: No 8167 Sgt. W----, G.W.,","190":" Battery, was tried by a Federal General Court Martial on the","191":" July, 1916, on charges of 1. Stealing. 2. Absent without leave. 3. Drunkeness. 4. Neglecting to obey an order, and was sentenced to be reduced to the ranks and six months imprisonment with hard labour. The sentence was commuted by the Confirming Officer to reduction to the ranks.\"\n\n(Read out on early morning parade.)\n\nOrderly sergeant from 6 p.m.\n","192":"\n\nMarching order parade 2 p.m. General Haig passed us in motor---going like blazes.\n","193":"\n\nCoghlan, Carter, Emms and myself, after reporting to our No 1 and the W.O., went out to tea. Difficult to obtain. Gave a couple of women a dressing down in French for charging us extra for eggs---because we were Australians. Arrived back at our billets at 7.15pm, only to find the battery had evacuated. It came as a bit of a bump. We dashed off for the Wagon Line and found them nearly ready to move off. Left Puchvillers at 8.pm.\n","194":"\n\nArrived Albert 3.30am. Put up our lines and went to bed at 4.am along side the gun. Reveillé at 8.am. We were promised the whole day for rest but got only an extra hour in the morning. Parade in afternoon postponed till 3.30pm, but at 2.30pm. order came through to march off to new billet on other side of town. Left about 4.pm. Passed through Place D’Armes and passed the church with figure of Virgin suspended. Very few civilians left. There has been real war here. Arrived at new billet 5.30pm.\n\nMoved off with guns and Firing Battery wagons at 7 p.m. for the firing line. The night soon came on thickly---darker by far than usual---and intensified the mystery and cruel magnificence of everything. We soon passed through the old British First Line, and thence through the German First and Second Lines. Becourt Wood gloomy to intense blackness. Sausage Valley, where our difficulties commenced. We arrived, after many waits, at 11.30 p.m. The big guns, right alongside the roadway, thick everywhere, were continually on the fire. I road as brakesman on the gun trail as otherwise would not have got the trip. We rode at 20 and then 50 yard intervals to escape shrapnel.\n\nWe put guns in, and left wagons---and off. We returned by a much longer route (Fricourt Road). Even with the utmost will power could not keep consciousness for two minutes together for a great part of the way. Rode Cpl. Cox’s and led Sgt. Whitworth’s horse back.\n","195":"\n\nGot home 3.30 a.m. Then watered and fed. Reveille 7 a.m. Left at 9.30 a.m. for Pits as brakesman---was anxious to see the place by daylight. It was cruel and terrible. Great craters, shattered wire, equipment strewn everywhere; innumerable trenches, dug-outs, and guns---some in pits, others in open, but everywhere guns. Coming home we saw the big 9\" Howitzers. Big Lizzie of the Somme, 15\", is just opposite our horse lines. Orderly sergeant 6 p.m.\n","196":"\n\nThe wh\n Teams left at 1.30 a.m. The whole Brigade left Wagon Line south of Albert to a position north of Albert---just the other side of the town. Left at 3.30 p.m. and arrived 5 p.m.\n","197":"\n\nLeft at 9.10 p.m. with Sgt. Cameron (in charge) and Bdr. McGowan\n\nwith 6 teams for the guns. No one knew the way, but I had a fair idea. Jock turned first turning left which I knew was wrong. Rode forward at trot (I was riding in rear) to tell him so, but my horse put his foot in an old shell hole and came down. Jock not to be convinced so let him have his own way. \n\nAfter some time we turned down into a valley---the stink was awful---\nwhile\n the rough road, strewn on either side with smashed guns and carriages and wagon wheels, while the torn earth was piled in ghastly shapes. Every score yards or so a telephone wire (low down) crossed the track. \n\nGradually we ascended until we reached the ridge only to find the road lined with trenches and dug-outs on the left side, and barbed wire on the other. A few paces, and \nthe\n a nest of guns hidden for the moment, commenced to open fire. The din was terrible and the glare blinding. Some of the younger fellows began to lose nerve and called for me to see Jock Cameron. I had to order some of them pretty sharply. \n\nPresently the guns ceased and we went on round a corner only to halt. Jock leaves the wagons for half an hour in a dangerous spot without saying a word to me. Descended a three storey dug-out (6th Brigade Infantry Headquarters) to find out where we were. Found out and returned to find men with gas helmets on, as warned from neighbouring Infantry supports of gas attack. Then gave order walk march just as Jock appeared. \n\nArrived home 3.30 a.m. While we were waiting, waiting, I could not help singing \"A Perfect Day\", \"Somewhere a voice is calling\" etc. Thank God my nerves were steady as a rock.\n","198":"\n\nTwo hours in morning allowed off to teams of night before. Went out with teams in afternoon.\n\nAugust.\n","199":"\n\nTeams during day.\n","200":"\n\nHigh explosive shell burst in our horse lines---no damage---was putting on my shirt at the time and got spattered with gravel.\n","201":"\n\nShell burst 4.30pm in horse lines 16th Battery---next door to us. Four horses killed---terribly mangled-entrails scattered in all directions. Two men killed, one wounded, twenty suffering from shell shock. Orderly Sergeant for the day. Went out with teams at 6.30pm Our horses rather nervous. We have been taking an average of 800 to 1000 rounds a day to our battery.\n","202":"\n\nW.O. C--- is beginning his old capers again. This is no place to be exacting over details. Every day we are called out in dinner hour or during our tea time to unload ammunition or some extra job---yet when there is an hour to spare the men have to fill in time on harness. Took charge of party of seven from our battery---detailed to bury the 16th’s dead horses. Went out to Pits in afternoon. Coming back---Taura got his hind-quarters in a shell-hole and jerked my neck backwards. It has been painful since.\n","203":"\n\nNeck worse, so went \"sick\". W.O. insisted on \"sick\" men going to Doctor. Cpl. Waters, Scott and myself set out about 9.am. After two hours search could not find an Australian Field Ambulance in Albert. Did shopping, however. Managed to get a box of cigars, some views and some eggs and watered coffee.\n\nAbout 6.pm Germans sent some 5.9 H.E’s (High Explosives) over Went to bed 10.pm.\n","204":"\n\nF.C. left me about 1.am, waking me to tell me so. German shell falling at 5 second to 10 second intervals on every side. C. left blankets and everything and went below to the dug-out. Shortly after I heard order shouted in lines, \"Stand to your horses!\" No one woke us---we were left to chance. Got dressed and found W.O. and Bdr. McBean letting horses loose. No men about anywhere. Collared three horses and took them towards \nAveling\n Avelny. \n\nGerman fire over head and to my right. Soon I had to shift---the shells on the right were getting too close. One piece fell within a couple of yards. I moved on a hundred yards and so-for a mile Fritz kept me on the move. Presently beneath a tree I found Jock Cameron; things were quiet there for a while. Presently Fritz opened up with another battery and that shifted us. \n\nAt 5.30 am we got back to the lines. Some lazy beggars stayed in a Tommy dug-out all night---never did a hand’s turn. The O.C. Wagon Line decided to shift at 8.am. All ready. Then ammunition arrived. I went with it to Pits. Things smashed about a bit, but nothing serious. \n\nMoved to other side of river at 5.pm. Orderly sergeant. Tea? 9.15pm.\n","205":"\n\nThis morning Fritz sent three shells over, one in horse lines, and the other two about five yards from where I was standing. Not much of a burst. (Aeroplanes have been up and they are the cause of our being so constantly hunted out.) \n\nLast night","206":" Battery and B.H.Q., who stayed in old quarters, lost 11 horses through shells which Fritz sent over last night. Learnt also today that 106th lost six men at Pits, and 16th and 18th Batteries several, the former’s one gun buried. Our own lost nothing, though Fritz’s shells close. \n\nWe moved still further over today, among old British trenches. Jelling the O.C. Wagon Line, is a fool and the W.O. is likewise. No newspaper for several days.\n\nTuesday, 8.\n\nQuiet day in our new pozzie. At 9.pm 6 teams (and myself and Bdr. McBean) ready to move off. Ordered instead to \"unhook\". We \"stood to\" for an hour---then order \"unharness\". Then an hour later \"hook in\" and move off. German shell fire heavy near Ancre and Boiselle Valley---burst on either side of us. Trotted past dangerous places. Left Pits about 1.am. Full trot near Becourt Wood---because of shells. Dvr. Freeman hit, also Dawkins’ horse. Freeman in hospital. Shot horse. Had to return through Albert on account shell fire. Arrived home 4.am.\n","207":"\n\nNews received that 2nd Division to come out and go for a ten days rest. Our guns came out and arrived at Wagon Line at 7.pm. Fellows glad to get out for a spell. They all stated how strange it seemed to be away from the roar of the guns. Bdr. Vantin wounded by a premature burst from the 18th Battery just as he was getting ready to go..\n","208":"\n\nLeft about 8.30 a.m., (Reveillé 5.am.) for Rest Camp. Rain commenced at 8.am. Passed 1st Division Artillery on their way back to the front line. Their \"rest\" consisted of Field Manoevres. Arrived at Val-de-Maison at 3.pm. Dan Healy made a good baked hash of bread, biscuits and bully beef. We are receiving about 1\/12 of our jam issue.\n","209":"\n\nReveillé 5.am. Left 9.30 for a \"short trip\"---which consisted of 5 hours in the saddle, with only one 10 minute spell. Passed through Canaples etc. Arrived at St. Leger at 2.30pm. Dismissed at 4.pm. Next parade 5.30, then grooming, water and feed. We have come to a rest camp. Some of the men need it badly---yet in spite\n\nof the Farrier Sergeant’s verdict re water etc., the authorities, (while other batteries are off) persist in humbugging us as much as possible. I am sick of the whole business. The Pits, with all their danger, are without the hyprocrisy, the rotten acting, the tawdry drama of this. Ceremonial camps! I should never enlist again under such conditions. The food (at the best of times) is rotten. We are half starved. The sergeants have always an abundance of jam bread etc. We get two 1lb tins of jam every other day between 29 men.\n","210":"\n\nWent up Town on Saturday evening.\n","211":"\n\nChurch Parade. Went with Catholics, but found Church closed. Had chips and chops at Marguerites.\n","212":"\n\nUsual routine at Camp. Left at 9.am. with four others for Halloy-l-Pernois on dental leave. Got a lift on wagons from Mr. Meates. Reached there 10.30 am. Too late for dentist. Had a good meal coming home at a private house. Evening went to St. Ouen for shopping. Asked along the road for the way to Flixcourt---and then Tipperary. Fred Hollingswood and George Eddie came with me. Promotions. Cpl. Cox to be Sergeant. Gunner Reed to be bombardier. Sgt. Iken to be Sub-Lieut. 16th Battery. I am transferred to D. Sub, commencing","213":"\n\nTuesday, 15.\n\nMorning. Went out exercising horses. Cricket match afternoon, so afternoon aff. I went to Canaples to see Field Cashier re my Extra Duty Pay. Told me it rested with O.C. Battery to decide. Rained on way, so took shelter under a portal. Saw there one of the finest types of a Picarde. \"Gros bete\", said I to my horse---and a tap on the foot from a parasol greeted me. At Canaples went to canteen and gave each of the girls a character sketch---in return\n\nthey gave me a souvenir.\n","214":"\n\nExercising horses in morning, 6.30pm. two hours notice to quit. Wild rumours of German advance etc. Left at 8.30pm for the front. Rain set in at 9.pm Wearying journey.\n","215":"\n\nTravelled right through to Contay. Arrived at 4.30 am. Watered and fed and had breakfast and an hour’s rest. Left 5.40 am. Arrived Albert (North-West side) near Long Valley, at about 2 pm. Went about 4 pm to water horses. Place after place empty. Two miles away found good trough. Heavy storm---missed way---did not get back until 7.30pm. Teams hooking in as I got Back. Then cancelled.\n","216":"\n\nGunners called out at 2 am.---cold and wet. Guns etc. left at 9 am. About seven or eight of us then proceeded to make horse lines Whilst getting a pole from one trench fell back into another and knocked my spine and started my nerves twitching---all right in five minutes. Orderly Sergeant from 6 pm. After stables we packed all wagons etc. 9pm. 12 teams ordered and all surplus ammunition strapped on vehicles. This made up total 2,500 rounds for day or equivalent to 24 teams and surplus.\n","217":"\n\nImmediately after 9 o’clock parade felt groggy in legs and aching at base of spine. Nerves began to twitch. W.O. gave me an order, and then noticing me---caught me just in time. A couple of hours later they told me I had been very ill. The doctor came and ordered me to the Divisional Rest Camp.\n\nSunday 20.\n\nThey drove me in a Cook’s cart to the 3rd Field Ambulance at Albert about noon. I had dinner and tea with them at their mess and\n\nthen motored to Vadencourt (2nd Field Aust. Ambulance) Slept there, and left on foot for Contay Rest Station---just a few hundred yards away. Everybody is considerate and kind to us.\n","218":"\n\nAm sleeping in a tent with five or six others. Burton,","219":" D.A.C. fellow, born in France and living there for thirteen years, speaks French like a Frenchman. The food is excellent---plenty and good. One eats at a long bench---table. Wrote \"Is it still far to Tipperary\" in afternoon.\n","220":"\n\nWent up street to buy some post cards, and in course of conversation discussed war with Madame and M. Verites. They invited me in M.V. and I had coffee and cigarettes. Then I found he was a Protestant. I told him I was a pasteur in Australia. A little later he took me to the Protestant Pasteur who was on three day’s \"permission\". Dressed in dark grey coat and grey trousers and black puttees. Madame spoke fluent English and I had a very interesting time. They invited me to tea. When paid by the state they used to get £:105 per annum. Two of the children were home on vacation from a Paris school.\n","221":"\n\nWent to M. Verités for afternoon tea and met a French officer who told me that the war would be over by Xmas. He said that the Australians were going North and that the Canadians were coming to relieve them. \"A big surprise\" he said, \"awaits Germany on the Salonica Front, and a bigger one here.\" Had coffee at 7.30 pm. at Camp. Then bed.\n","222":"\n\nWoke about 4 am with severe abdominal pains. Colic all day. Coffee dosed I think. It brought on another seizure during day.\n\nLeft me weak. Burton no better. Left for Mal-de-maison in afternoon.\n","223":"\n\nDid not stir from tent all day. Tried to write, but not feeling good enough. Slept most of time. By the way, the blankets are as lousy as they possibly can be.\n","224":"\n\nFeeling a little better, but had to remain in tent all day.\n","225":"\n\nFeeling better---so doctor marked me TGO. Not enough cars to take us all to Albert---so went to roadway for lorries. By this time I was feeling off colour again. Got in somehow to Albert---walking lorries etc---by 8.pm. Had tea, and slept, another fellow and I in an empty house in Albert.\n","226":"\n\nGot a few biscuits and some coffee for breakfast. Thence camp The other chapp was very decent and helped me with my things right to our camp and then went back to join his battalion. Everyone thought I had gone to Blighty. Lay down most of day, but stayed in lines as long as I was able. Nerves not too good on going to bed.\n","227":"\n\nUp at reveillé. Saw doctor next day, but he was too busy to go into my case---gave me bromide pills. Saw a couple of fellows there who had been out in No-Man’s-Land for seven days. The clothes (cut off them) were covered in blood and maggots. Stayed up for a while but had to lie down and rest. Mud everywhere.\n","228":"\n\nWet, wet, wet. The W.O. would not allow me to attempt to work Rested all day.\n","229":"\n\nUp at reveillé and carried on as of old-but had to peg down\n\nabout 4 pm. Legs heavy as lead. Had another seizure---nearly choked. Went over to see doctor---he was not in. News through Roumania declared war. Bulgaria thrown up sponge. Fellows very excited. One could hear cheers coming from all round as each unit learned the news. Rumours prevalent of great naval battle---43 German vessels, 16 British and 7 French, sunk.\n\nSeptember.\n","230":"\n\nSaw doctor in morning. Told me to come next morning. (He wanted to pack me off there and then, but I had my pay book arrangements to make.)\n","231":"\n\nWent over to doctor’s---thence Albert, No 13 Clearing Station in cook’s cart. Met McCleave there. Thence in motor to Vandencourt, No. 1 Canadian Hospital. Thence motor to Puchvillers (English)---thence train.\n","232":"\n\nArrived Boulogne abut 3.am. Thence motor to No 8 Stationary Hospital. Wonder of wonders! Caught sight of Australian Flag and found it was No. 2 A.G.H. Sent down note to C. and she came up in afternoon. Had bath and complete change of clothing. Khaki taken away and blue suit issued. Got to bed 6.am. Orderly came 7.am and woke me and told me to get up---spoke roughly. Feeling absolutely knocked up after long journey etc. Gave him something to go on with and in middle of it had seizure.\n","233":"\n\nDoctor insists on my getting up. I saw my sheet and noticed it diagnosed \"Epilepsy?---under observation,\" Told him point-blank I was not a neurasthenic but had had a bad fall and injured my back. Told him I had been six months in line and not had a day’s sickness. Later in day begged the Sister in Charge to get me an X Ray examination if she could.\n","234":"\n\nX Ray examination. Two plates taken. Photographed through abdomen. German prisoner helped to carry me in. Very considerate and willing.\n","235":"\n\nHad chat with German prisoners. One quite Americanised.\n","236":"\n\nPlates showed \"suspicious fracture\". Pain getting worse. Marked for England.\n","237":"\n\nLeft Boulogne wharf 10.15 am. Arrived Dover 11.45am. Thence train to Chatham 2.30pm. First person I met on board was Gordon Strange. He had hurt his foot on leaving Albert. (Drill Hall, Chatham).\n","238":"\n\nHospital, the old Drill Hall---one large ward with about 200 beds. Things rough, but homely.\n","239":"\n\nX Ray taken at Fort Pitt. Photographed direct.\n","240":"\n\nX Ray showed simple fracture coccyx or sacrum.\n\nA Mrs Cuckney came in to see John Reed my next bed neighbour and spoke to me and promised to come in and see me again.\n","241":"\n\nMrs Cuckney came in and brought me books cigarettes, fruit etc. She is the wife of the Borough (Chatham) Treasurer. She is one of the finest women I have met. She not only does things for us fellows but she has the knack of personalizing them. She transmits the virtues of the motive that prompt the deeds to the very deeds themselves. Her gifts \"resentissent\" of the kindness and sympathy that inspire them.\n","242":"\n\nTransferred to Preston Hall, Aylesford, Kent. Left Chatham as a \"stretcher case\" at 7.pm. Preston Hall about 6 miles from Chatham. Motored.\n","243":"\n\nReceived letter from Miss G. stating that her father had died","244":" It was a cold careless letter ---\nand\n or so it struck me. After all these years to miss seeing him! Another few weeks and I should have been there.\n","245":"\n\nI am moved from my bed in A. Ward---main room---to the little room in the same ward.\n","246":"\n\nI am now allowed to get up. I am very weak. The right leg is especially weak and painful. I can only just crawl along---and of course cannot stand up straight.\n","247":"\n\nI learned (forget actual day) that I am booked to go back to Australia. My first feeling was one of acute disappointment, and somewhat of resentment to think I had to leave the \"Great Work\" without seeing and helping in the end. Then the feeling that though I was unfit for the heavier work that they could not give me some other to do. However---I realized that it was useless to trust the Military Authorities for the latter. The thoughts of home were sweet but I have always tried to keep them from me in a matter of this kind---because, well, they would absolutely overwhelm one’s judgment and conscience, did one not form the habit of excluding them.\n","248":"\n\nDay after day. One getd to feel that life is a poor thing. One sees nobody. In the evenings Rivers generally wheels me round while I \"take off\" Mrs. Turner. After \"lights out\" we (of the little den, McDougall, Armitage, Rivers and I) sing choruses, \"The Soldier’s Farewell\", \"Lindy Lu\" and a few hymns. It seems to suit the other fellows---for they get weary---only I do not think they all suffer so acutely as I. I mean they are built differently, because they have\n\nlived differently.\n","249":"\n\nI have been over to Maidstone; it was a change but------\n\nEnglish landscape in trim and neat, prim almost. One comes upon glades and feels the charm of quiet paths and the shadowy depths of the woods, but one is never shocked by any extravagance of beauty. One never cries out at some unexpected joy that suddenly might confront one. One seems to feel only that what one sees here one will see there. This trim hedge, so straight, so stiff, and garnered, is no different to all the others. The landscape seems almost typical of the temperament of the people. There is something suppressed, something that is built or cut to a pattern.\n","250":"\n\nWent for a walk up the Barming Road, and through the hop fields now deserted, and arrived back at 6.pm to learn that Mrs. Cuckney had been. I was very disappointed. She is the decentest I have seen in Blighty. She left me some \"Abdullas\", an apple pie, and some books.\n","251":"\n\nWrote letters morning.\n","252":"\n\nA beautiful day. Mrs Cuckney rang up in morning to say she was coming. She arrived at 3.pm. and brought a Miss W. with her, and cake cigarettes and mince pies. She is very good. We had tea at Aylesford---and then a long ramble round. Arrived home at 8.15 pm. after seeing them \nto the\n off at the station. Transferred with Armitage to No. 19 Ward.\n\nOctober.\n","253":"\n\nWent to St. Peter’s in morning with Armitage and Dick Mercer. We were too late for service, but waited outside, and inspected old gravestones several centuries old, 1687 etc. Picked apples and went to \"The Friars\".\n","254":"\n\nRain, and incessant autumn drizzle all day. I left my hat down stairs at dinner time---some rotter collared the badge. Damn him. I went down to Aylesford with Armitage; he is a decent fellow. We had cigars---ye gods! I sold a stick of shaving soap etc otherwise I was penniless, and his worldly wealth was only a half penny. Somehow this life makes one utterly weary. It is the feeling of dependence upon others for even trifles. How I loathe the sensation. Day after day, especially toward the close of them, I long to drift out on some tide of forgetfulness.\n","255":"\n\nReceived notice to pack up ready to leave for Harefield. Left by 1.22pm train from Aylesford for Charring Cross, London. Arrived 3.10pm. Thence to Commonwealth Bank, but no cable for me. Thence to Harefield. Arrived 6.30pm.\n","256":"\n\nCommissariat etc. splendid. 7.pm notice of discharge to Salisbury Plains.\n","257":"\n\n10.30am Left by motor for Denham, thence through London to Salisbury Plains. Arrived Perham Downs (Luggershall) 5.30pm. The rottenest hole on earth.\n","258":"\n\nParades all day for new equipment, pay etc. One general parade to se a deserter---corporal---stripped of his chrevons. Charge and\n\nevidence read out by Camp Commandant in voice meant to be impressive but which was a thin squawk. Pay. No mattresses to sleep on. Bare boards. Two fellows sandbagged last pay day, so told to hang on to money.\n","259":"\n\nOne fellow sandbagged last night. Left by 9.1am train from Luggershall for London. Thence Chatham 3.25pm. Arrived Mrs Cuckney’s 5.pm.\n","260":"\n\nWent to \"Leather Bottle\" and Cobham Church.\n","261":"\n\nHad a look in at the Cathedral (Rochester) and also \"The Seven Poor Travellers\".\n","262":"\n\nRochester Castle and Cathedral and Museum in morning. Canterbury Cathedral in afternoon. \"The Weavers\"---the old city gate.\n","263":"\n\nLeft Chatham 10.45am express for London. Arrived 11.43am. Went to Devon Hotel, Vauxhall Rd. for rooms. Went over St. Paul’s and Tower Bridge in afternoon. Tower closed.\n\nEvening Apollo Theatre (Hobson’s Choice).\n","264":"\n\nWent to Sotheran’s, bought a nice copy of \"Tartarin sur les Alpes\" The shop is too modernized to be good. Went to Westminster Abbey, but service on, then to Headquarters and saw L.T. Spent evening and night at Putney. He and Murphy.\n","265":"\n\nWrote all morning and part of afternoon. Took bus to Stroud Green right along Tottenham Court Road---what seemed an interminable way. Saw Mrs. P’s sister and stayed evening. Came back bu Tube.\n","266":"\n\nWent to Central Hall and heard Rev. T. Dimsdale Young. Thence in afternoon to Stroud Green to dinner and stayed tea.\n","267":"\n\nStayed last night at Peel House and robbed. Went to Bank, Regent, Oxford Sts. bought copy of \"Songs of Sunrise\". Caught 4.20pm train to Chatham. Stayed night at Cuckney’s.\n","268":"\n\nCaught 3.30pm train from Chatham to Aylesford, wet and gloomy. Saw all at Preston Hall. Stayed at Mrs. Joy’s at Aylesford. Very homely and nice. The English of the country have very light teas but heavy suppers.\n","269":"\n\nWent over to Maidstone with Arthur and Dick Mercer in afternoon. Left them and went to Museum. Thence by train back to Aylesford.\n","270":"\n\nArthur came down to Mrs Joy’s in morning---and walked with me to the station. Left by 10.22am for Chatham. Had dinner at Cuckney’s thence Drill Hall---thence receiving depot at Fort Pitt. Received Ward 6.\n","271":"\n\nThis is the Ward of Serious Sergical cases. Paddy a rale Oirishman, had his leg amputated at the thigh yesterday. He has a nurse watching him night and day. And when they dress him, a doctor is present at each occasion, it is terrible to hear him. Quite half a dozen of the others almost shriek with the pain of dressings.\n","272":"\n\nOne poor beggar next me---is an American who crossed the border to enlist. He has most of the right elbow shot away and has to be dressed two or three times a day. He almost faints with pain.\n\nWhite---white as chalk.\n","273":"\n\nIt is a prison this Fort Pitt. Mrs Cuckney and Miss W. came to see me, and it was only with great difficulty that they could get in. The conversation was very strained. The atmosphere was stifling. The doctors are fine fellows---the nurses are rotten. As I wrote Miss W. later I said \"I guess you’re right about conversation in a hospital at least Fort Pitt. It’s not an ideal spot. Il y a de mieux---n’est-ce pas? Hélas! La vie est toujours de mâme, toujours, interresante, mais toujours coquette. Des fois elle parle, peut-etre d’une voix tendre at caressante, mais ce qu’elle dit---Hélas! nous ne pouvous pas entendre à cause du bruit des autres---n’est-ce pas? L’ame est toute-puissante parmi des grandes choses de la vie, mais lorsqu’elle se mele aux choses petites et ordinaires, elle n’est que silencieuse ou distraite, souvent hesitante et timide\".\n\nWednesday, 25.\n\nOrdered to be ready to leave Convalescent Hospital (unknown) at moment’s notice.\n\nLeft by motor ambulance for Tunbridge Wells about 5.30pm. Not sorry either. The trip took about an hour and a quarter (26 miles)\n\nThursday, 26.\n\nMen, (St. John’s Ambulance and fine fellows too) were there to bath us last night. Pyjamas dressing gowns, slippers, hot water bottles, linoleum floored wards, big hearth rugs---music---flowers---home atmosphere---entire absence of all Military tone! Those were my first recollections of Kingswood Park V.A.D. Hospital, Tunbridge Wells. Concert in evening---could not sit it out however---my back pretty weak.\n\nFriday, 27.\n\nI have just sighed a long, long sigh---of content. I am in\n\nthe rippingest ward of the rippingest hospital in Blighty. We have a piano and lounge to ourselves, and the nurses come in every afternoon or evening to play or sing. Two other wards have also a piano apiece.\n\nI have just sighed another long sigh of content. Each ward also has a small library in addition to the general hospital collection. All Military methods are taboo and napoo. Civilization reigns uninterruptedly. Everything works smoothly. There is no lack of soft pillows and clean linen, and the fancy coverlets for the beds are pretty and pleasing. We each have different coloured slippers and dressing gowns. Warren wheeled me in spinal chair to Church (Hall)\n\nMonday, 30.\n\nWas wheeled down to the town by Waghorne thence to Howard’s to be X rayed. 2 plates of back and 1 of left leg taken.\n\n(Several quotations from letters etc. follow).\n\nNovember.\n\nSaturday, 18.\n\nIt is snowing. I have just woken up---six am. Fine powdery flakes they are. My first sight of snow on such a scale.\n\nMonday, 20.\n\nUp all day. Nerve attack 7.pm and another at 1.30am. \n\nSister H. was a dear during the night. She didn’t worry me---I was feeling pretty rotten and couldn’t get any sleep, but she very quietly seemed to do the right thing.\n\nTuesday, 21.\n\nHad to take things pretty quietly all day. Couldn’t lie other than prostrate all day.\n\nWednesday, 22.\n\nC. and Mrs. T. came out to see me. C. is on furlough. Went to concert in evening but couldn’t \"stick it\" was bad so they told me next morning. All I know is I felt rotten when I got back to the ward.\n","274":"\n\n(Transferred to Hope Ward). Woke up or rather came out of stupor feeling stupid. Received word that I was to go to Hope Ward. Try to get into spinal chair (I was very weak) but slipped and wrenched my back. Couldn’t get out of chair and they hadn’t sense to lift me. Nurse M.G. dragged me by legs to pull me lower down the chair again! I couldn’t sit up at all.\n","275":"\n\nNo good in morning but able to lie up a little in the afternoon.\n","276":"\n\nFeeling a bit better and able to sit up a little in afternoon.\n","277":"\n\nVisiting day. Misses F. and H. came and brought cake and Autograph Albums.\n","278":"\n\nFeeling bit better now---though very sore still about my transfer. It was a dirty trick on someone’s part.\n","279":"\n\nLettre à M. Dumortier Walle, Steenwerk. (28\/11\/16).\n\nCher Monsieur, Je ni vous ai pas oublie ni les timbres que je vous ai promis. \"C’est un long chemin à Tipperary\", comme nous disons en anglais, mais nous y arrivons---n’est-ce pas? Vos timbres y allaient d’arriver aussie.\n\nJ’ai vu la vie et la mort depuis que je vous ai vu. Il n’y a pas la guerre au Nord. Armentières, Steenwerk, Bailleul---les jens-la restaient tranqilles, n’est-ce pas? Il faut voir la Picardie pour la comprendre. J’espere que vous trouveriez parmi les timbres que je vous envoie quelques uns nouveaux. Je vous enverrai des autre quand j’en pourrai obtenir.\n","280":" suis malade depuis trois mois (fracture de sacrum, colonne vertebrale) mais je ne suis pas malheureux. Saluez de ma part madame Walle et receve mes salutations empresseés.\n","281":"\n\nNurse L. transferred upstairs. Nurse Y. (a Queenslander) takes her place.\n\nQuotations from letter, etc etc follow.\n\n"}}