{"Document Name":{"0":"Diary_0309","1":"Diary_0309","2":"Diary_0309","3":"Diary_0309","4":"Diary_0309","5":"Diary_0309","6":"Diary_0309","7":"Diary_0309","8":"Diary_0309","9":"Diary_0309","10":"Diary_0309","11":"Diary_0309","12":"Diary_0309","13":"Diary_0309","14":"Diary_0309","15":"Diary_0309","16":"Diary_0309","17":"Diary_0309","18":"Diary_0309","19":"Diary_0309","20":"Diary_0309","21":"Diary_0309","22":"Diary_0309","23":"Diary_0309","24":"Diary_0309","25":"Diary_0309","26":"Diary_0309","27":"Diary_0309","28":"Diary_0309","29":"Diary_0309","30":"Diary_0309","31":"Diary_0309","32":"Diary_0309","33":"Diary_0309","34":"Diary_0309","35":"Diary_0309","36":"Diary_0309","37":"Diary_0309","38":"Diary_0309","39":"Diary_0309","40":"Diary_0309","41":"Diary_0309","42":"Diary_0309","43":"Diary_0309","44":"Diary_0309","45":"Diary_0309","46":"Diary_0309","47":"Diary_0309","48":"Diary_0309","49":"Diary_0309","50":"Diary_0309","51":"Diary_0309","52":"Diary_0309","53":"Diary_0309","54":"Diary_0309","55":"Diary_0309","56":"Diary_0309","57":"Diary_0309","58":"Diary_0309","59":"Diary_0309","60":"Diary_0309","61":"Diary_0309","62":"Diary_0309","63":"Diary_0309","64":"Diary_0309","65":"Diary_0309","66":"Diary_0309","67":"Diary_0309","68":"Diary_0309","69":"Diary_0309","70":"Diary_0309","71":"Diary_0309","72":"Diary_0309","73":"Diary_0309","74":"Diary_0309","75":"Diary_0309","76":"Diary_0309","77":"Diary_0309","78":"Diary_0309","79":"Diary_0309","80":"Diary_0309","81":"Diary_0309","82":"Diary_0309","83":"Diary_0309","84":"Diary_0309","85":"Diary_0309","86":"Diary_0309","87":"Diary_0309","88":"Diary_0309","89":"Diary_0309","90":"Diary_0309","91":"Diary_0309","92":"Diary_0309","93":"Diary_0309","94":"Diary_0309","95":"Diary_0309","96":"Diary_0309","97":"Diary_0309","98":"Diary_0309","99":"Diary_0309","100":"Diary_0309","101":"Diary_0309","102":"Diary_0309","103":"Diary_0309","104":"Diary_0309","105":"Diary_0309","106":"Diary_0309","107":"Diary_0309","108":"Diary_0309","109":"Diary_0309","110":"Diary_0309","111":"Diary_0309","112":"Diary_0309","113":"Diary_0309","114":"Diary_0309","115":"Diary_0309","116":"Diary_0309","117":"Diary_0309","118":"Diary_0309","119":"Diary_0309","120":"Diary_0309","121":"Diary_0309","122":"Diary_0309","123":"Diary_0309","124":"Diary_0309"},"Date":{"0":"unknown","1":1712.0,"2":1713.0,"3":1714.0,"4":1715.0,"5":1716.0,"6":1717.0,"7":1718.0,"8":1719.0,"9":1720.0,"10":1721.0,"11":1722.0,"12":1723.0,"13":1724.0,"14":1725.0,"15":1726.0,"16":1727.0,"17":1728.0,"18":1729.0,"19":1730.0,"20":1731.0,"21":1736.0,"22":1737.0,"23":1738.0,"24":1739.0,"25":1740.0,"26":1741.0,"27":1742.0,"28":1743.0,"29":1744.0,"30":1745.0,"31":1746.0,"32":1747.0,"33":1748.0,"34":1749.0,"35":1750.0,"36":1751.0,"37":1752.0,"38":1753.0,"39":1754.0,"40":1755.0,"41":1756.0,"42":1757.0,"43":1758.0,"44":1759.0,"45":1760.0,"46":1761.0,"47":1762.0,"48":1763.0,"49":1764.0,"50":1765.0,"51":1767.0,"52":1768.0,"53":1769.0,"54":1770.0,"55":1771.0,"56":1772.0,"57":1773.0,"58":1774.0,"59":1775.0,"60":1776.0,"61":1777.0,"62":1778.0,"63":1779.0,"64":1780.0,"65":1781.0,"66":1782.0,"67":1783.0,"68":1784.0,"69":1785.0,"70":1786.0,"71":1787.0,"72":1788.0,"73":1789.0,"74":1790.0,"75":1796.0,"76":1797.0,"77":1798.0,"78":1799.0,"79":1800.0,"80":1801.0,"81":1802.0,"82":1803.0,"83":1804.0,"84":1805.0,"85":1806.0,"86":1807.0,"87":1808.0,"88":1809.0,"89":1810.0,"90":1811.0,"91":1812.0,"92":1813.0,"93":1814.0,"94":1815.0,"95":1816.0,"96":1817.0,"97":1818.0,"98":1819.0,"99":1820.0,"100":1821.0,"101":1822.0,"102":1823.0,"103":1824.0,"104":1825.0,"105":1826.0,"106":1827.0,"107":1828.0,"108":1829.0,"109":1830.0,"110":1831.0,"111":1832.0,"112":1833.0,"113":1834.0,"114":1835.0,"115":1836.0,"116":1837.0,"117":1838.0,"118":1839.0,"119":1840.0,"120":1841.0,"121":1842.0,"122":1843.0,"123":1844.0,"124":1845.0},"Entry":{"0":"\n\n","1":"\n\n(1)\n\nA long day, and a move forward. Roads of traffick, and all the colours of the A.I.F. about. Lorries and guns, limbers and wagons, men moving up and passing down, and at slow intervals Ambulance Cars. Prisoners passing and passing, and in amongst empty wagons and limbers, a mounted convoy of Boche – of ammunition limbers, passing down with the stream to the rear.\n\nAll objectives and passed, at Franvillers a Corps H.Q. captured, and strange tales of tanks and planes and armoured cars come down. Midnight, to turn in.\n\nAugust 10\n\n2.\n\nYesterday a day of Maps \"at the toot\". Midday today sees the final objective of yesterday’s maps and stunt attained.\n\nNow the development is to war.\n\nAugust 11\n\n3.\n\nRoads deep, the dust and haze of red dead powder. Over the burnt brown of faces and arms, powdering that accentuates the beauty of features and colour, and makes doubly brilliant the clear quick eyes.\n\nAttacking still and following up.\n\nAugust 11\n\n4.\n\nA white road in the sun, with the smoke of dust from it, swings round the low hill and behind it: overshadowed by a high darkly wooded horizon edging a tremendous sky. The sun burning gold.\n\nTonight Frank D. tells of Ridge wounded again, and again an abdominal, Groves too, he in the neck: they both may die. Wounded also, but slightly, McCrae and Vin Cellars.\n\nThe Ambulance running an Advance Walking wounded D.S. about Harbonnieres.\n\nAll through the night bombing and shelling – a galloping repeating of all rembered of Keats and Brooke and Watson.\n\nPoor Villers Bretonneux!\n\nAugust 17\n\n5.\n\nSouthgate\n\nThe fourth day wasted. At tomorrow for Ely, then for Cambridge – Winchester and Bristol. Elsie’s with child so I’ll not see her.\n\nLeft V.B. on morning of 12th.\n\nAugust 18\n\nEly\n\nAlone at last on the train with a damnable dirty-nailed Cockney, she flung her ultimate bait – \"I was aht wiv an whorestralian last week in Finsbury Park\". I read Alice Meynell.\n\n7.\n\nAt the Lamb Hotel, so now out to see the Cathedral. Later. Back from a strolling as a stared at novelty, obviously I intrude – the hats a damnation – hardly a crown. But early in the morning I’ll forget these Englanders and myself in an ecstasy of stained glass, old carven stone, and lovely groupings, then to Cambridge.\n\nA letter written to Mrs. H.\n\n8.\n\nBy and about the Cathedral, comely old houses, richly mellowed colours of red and brown and grey and blue, vine grown, and gardened with tall flowering hollyhock rising above their walls, narrow gothick windows, small geometrical leaded panes. The curtains are imitation lace, and covering two old windows the back of a cheap near yellow dressing table.\n\nThey cannot love beauty: in the Albert and Victoria Museum on Friday, the splendid\n\ntorso of Serbia’s old hero by Mestrovic, stands between – and flanked – by tall wide covering show cases. You may look at it from angles – not further than four paces.\n\nAt Kensington that afternoon bought Alice Meynell’s Collected Poems – the 1st edition 7\/6, saw there Hodgson’s \"Poems\" at 10\/- and Daisies at 8\/6. 8 o’clock, to dinner.\n\nAugust 20\n\nSouthgate\n","2":"\n\nThe great charm of people consists in not knowing them, another day wasted – a sacrifice to a sentimental laden pleasure.\n\nTomorrow I’ll partie – throw the remainder of my leave in the lap of the Gods – and sip Brandy & soda.\n\nDamn! I’ll to Bristol tonight.\n\nAugust 23\n\nBath\n","3":"\n\nTwo nights and one day with an N.Z. M.G., then a casual parting, he to Cornwall, I to Bath. One full day of leave that life came into and laughter, now I am dead. Yesterday at Bristol will be the memory of this leave. We were looking for rooms when we met, we joined forces, and at 10 found beds at the Y.M.C.A. Then a morning about Bristol and Clifton, driving through a country full of home colour and form, and now a loneliness in a lovely town, and a dull pain at the heart and a vague fear of the night.\n\nTomorrow ? perhaps to Salisbury, perhaps to Winchester, then London – cold dead rouged London – and Southgate and France, to the little wrecked villages, where dumb wide-eyes ghosts go passing – where the deep night silences are broken by the far away gun beats, and by the sudden smashing of H.V. shells.\n","4":"\n\nSouthgate\n\n11.\n\nEarly this afternoon back here to Aunt Louie’s, now alone in the house, they all at church, I excused myself – in the face of \"I do wish you were coming with me dear boy!\"\n\nTed Ridgeway is dead. God what useless wastings. Tonight’s special paper tells in headings –\n\n\"Still advancing N of the Somme\", \"Haig’s men take Contralmaison & other positions\", \"Nearer to Bapaume\", and Ridge is dead.\n\nAugust 25\n\nBath left midday yesterday – in a hatred of damned \"Anzacs\". Three Australians and myself in uniform, four in hospital blues: and three Anzacs – each in size a match for the lot of us, to demand our passes and criticise dress.\n\nTea last night with a 6th Btn. lad – wounded on the","5":" and yesterday commencing his 14 days leave.\n","6":" Tuesday, then France. Tomorrow I’ll to Kensington again and worship Mestrovic’s \"Torso\", and Rodin’s Bronzes. The two experiences of this leave have been the first seeing of a folio of plates & Mestrovic’s sculpture, and the damnably placed \"Torso\", and at Bath a half dozen portraits by Agustus Johns – in particular a strong viciously modelled girl’s face – expressioned horribly but fascinating and wearing a black white-feathered hat.\n\nFor two days now I have been listless and dead, bored unutterably & hot and cold by turns. If tomorrow the same I’ll to Horseferry Road.\n","7":"\n\nCorbie\n","8":"\n\nNight, and back again with \"Maps\". In the long treed square a good band played an hour, to a full audience of diggers, with stray Jocks and Tommies.\n\nA smashed Town with its Abbey towers scared and broken, and all about the threading streets only Kharki, and the colour patches of three divisions, but by the splendour of their life and their country they have made Corbie lovelier far than red-rouged London.\n\nA great arguing tonight with Jim S. over the genius of Agustus John but then Jim has not seen his portrait studies – only a few of his early drawings, so he compares him with the charlatan Epstein.\n\nMail accommodations , letters from Mother to end of June, one from Max P., two from Mrs. H. and from T.B.C., two L.S. Dysons new Cartoons, Sassoon’s \"Counter Attack\", Balzac’s \"Catherine de Medici and Yeat’s Essays and \"Folly\" of T. Maynard. But its bed before diarying and a reading of the adventures of \"Sylvia Scarlett\".\n","9":"\n","10":"\n\nAmongst the colours in the square last night, the blue and brown of the 43rd: so I asked one of Jake’s whereabouts, learnt he was at an O.T.C. and that Doug had died of his wounds after the Hamel stunt. A night at Wimereux before we left one another Jake once said, \"Well I don’t suppose the three of us will come through\" – and as the elder his was to be the sacrifice: and since then his luck has carried him past three woundings.\n","11":"\n\nVictoria left at 8 in the morning of the","12":" Folkstone at 4 in the afternoon, Boulogne at 7 on the","13":" morning, and Corbie detrained at 4 a.m. yesterday.\n\nThe Division are out, but there’s still warr before them, and within the next few days. Maps quiet.\n\nOn","14":" up to Harefield and had small growth cut from behind nose, a motor ride back to London completed cure of the long terrible dopiness.\n\n15.\n\nAfternoon: part of the morning passed sketching from the sq. a part of the Cathedral Abbey.\n\nAugust 31\n\nYesterday’s mail: \n\nFrom Mother June 2nd, \"Geoff came down on Wednesday and brought over 400 sheep to market: and to my surprise he enlisted on Thursday. I really felt very upset at first, but after thought I came to the conclusion I’d do the same if I were I his place.\"\n","15":"\n\n\"Geoff, arrived home yesterday in dungarees: and such dungarees – the sleeves about a yard wide and pants in proportion! He hopes to get his proper uniform next week. We are going to try hard and get him his wings in the F.C., so if you meet the kid, salute him, eh?\"\n\nBut the letter of June 2 follows on with a note on books and buying, and a wonder at Rebel Song and the Irish. Damn! but it’s a dear letter, and the earnestness behind it would make me foreswear books, only, there are much easier ways of suicide. But I’ll draw a limit for a while, and read Balzac in Everymans and the cheap reprints of the old lauded classics.\n\nThe sun’s coming out and a skys clearing of clouds: by in the canal, green water between ruled banks. so to the lagoon.\n","16":"\n\n16.\n\nPassing the staircase, through a jagged shell hole in the wall, a tangling of dark branches, red flower laden, over a gleaming green space of water, reflecting a white dissolving venus, by a hessioned latrine.\n\nJim S. is painting an interior of the Abbey, his easel against the smashed altar: the best of his late work is a bridge over the stream by Aubigney : the usual distortion of his perspective is absent, and the impotent daubing of his colour, has confirmed the richness of the stream’s banks colouring. Its his most successful sketch.\n","17":"\n\nThe argument is the old one, of Tommy officers and Australian. Geoff, Sam, Ken, with occasional quiet comments by Tom. Geoff on the \"superiority\" of the Australians – \"I give it to you they are the finest troops: they have had 500 miles of front for near three years!\"\n\n word is still good – though today have passed Divvy Ambulances following Ambulances and lorries of slightly wounded. Kemmel is ours and Bailleul. And from The Times of 29, the pasting of the facing page, so the dull rumours of last April – or March? – \nare\n were lying.\n\nTimes","18":"\n\nAustralian Graves at Pozieres\n\nWar-scarred Cemeteries Regained.\n\nMr. C.E.W. Bean, Official Correspondent with the Australians in France, in a message recording the recapture of Pozieres, stormed by the Australians in the Somme battle of 1916, says:-\n\nCrosses and graves stand on Pozieres summit exactly as they were before the great offensive of last March passed over them. Scars of battle mark almost every monument, but the cemeteries, so far as we could see, had been scrupulously respected. The cross of the seventh field company of the Australian Engineers is nearly cut through by a shell, but still rises over the Canadian and Australian graveyard on the hill. The great white crosses of the first Australian Division, eighth Australian Battalion, stand scarred with shrapnel in the cemetery near the entrance of the village. Before them to-day are two newer rows of German graves. The cross of the fourth Australian Battalion still stands in the little line of scrub from which the battle started, with the cross of the","19":" Battalion beside it. The grave of Captain Margetts, of the","20":" Battalion, is still marked by a small white cross beside the stumps of the copse where he fell.\n\nBy the windmill still stands the dark wooden cross of the second Australian division on the summit of the whole Somme battlefield. Heavy shells have shaken this cross half loose from its stone pyramid, but it still rises there beside the great road on the hilltop, which the second Division won. Beside it the north and south lines of the old O.G. trenches, along the summit, can still be traced by small white crosses to nameless Australians, with here and there the grave marked with the name of the 46th Battalion and other battalions, which two years ago were fighting on that terrile hillcrest.\n","21":"\n","22":"\n","23":"\n\nThe first drafting since leaving Villers Bretonneux. Sullen clouds over the blue of the sky, and a white haze from the sun behind them. This morning a walking along the canal – and springboards everywhere: but a cold wind over the water holds bathing. \n\nCabled this morning for £15 and the letters still to write explaining it and answering that of","24":" Damn! Why didn’t I have my account made to the London Commonwealth Branch, then there’d have been no worrying by Mother, and the peace of knowing the rock you stand on.\n\n19.\n\nBetween the two long captured guns in the square, a ‘shelter’ gun, mounted on perambulator wheels, part of an old plough, part of a hand press, and a length of thick iron piping. Captured by Chinese Labour Corps addressed to Pekin War Records.\n\nSeptember 3, 4\n\n20.\n\nTonight to the \"Kookaburras\" – the 5th Divvy C.P., a poor show with a finale of a Cockney’s Joy Ride designed by Agustus Johns, well designed but badly executed.\n\nMust get hold of new pen, this belongs to either Ken or Ted, mine a broken wreck from the losing of many windings of plaster.\n\nThe warr still waging, now the Canadians doing well from Arras towards Cambrai.\n\nMet Horsewell by the stream during the afternoon, he in the 15th, out just now with three others guarding Kits with the 2nd.\n\nA day of rain and sun patching: sun in the afternoon brought out the swimmers but the water cold as ice.\n\nEnjoyed the reading of J.B. Yeats essay on \"Synge\" and \"Butler\" and his book of newly published \"Essays\".\n\nSeptember 4\n\n21.\n\nTonight drawn unwillingly, but with no chance of escaping, into a dull argumenting with a \"man who knows what I like, and I hate pedantic red tape\" on the beauties of Corbie Abbey. Last year from the train passing to Amiens, Corbie always attracted – a great Cathedral seemed to loom richly above the villiage: but I always passed on to Amiens. This year comes the spoiling of the old impression: the shell wrecked Abbey is a soulless building, barstard in its design, building and decoration. Tonight, that the fine old Church of St. Vaast of Bailleul was good, where Corbie Abbey is bad would not appeal to the 11th Btn’s observer, and back at Maps, with the remainder of the observers, collectively they desired the confirming of their appreciation of this dull ruin’s \"beauty\".\n\nAnd comes the wonder if later I’ll be able to attempt the convincing of clients just what is good and bad in design! God! there’ll be all the women of Surburbia, the so artistic women, to listen to smiling, while they give their compleat and artistic \"ghutz\" of their £1000 Villa desires!!\n\nAnd the folio of Mestrovic’s sculpture comes to mind: give me the clay and I’ll model, is there a chance?\n\nBeyond books, beyond everything sculpture and full nakedness appeal.\n\nSeptember 4\n\nToday came to the pool-stream the Engineer of Sylvestre, and his image has been in my brain since. So few others – Jake, and his thigh has been laid open. Frank Hungerford, and seeing him last month at Allonville he has lost his old condition. Tommy Walker ? his beauty is too plausible – there is falsity somewhere. Eric ? he’s dead, and Doug Roach too.\n\nIf an After is, it’ll be of sculpture, wine growing or Architecture, and if it’s the last, the prayer is that it will be with Vin, him to charm by his compleat agreement the damned parvenus’ appreciations. I’ll be drawn into more of these fruitless word battles, \"the illiterates!\"\n","25":"\n\n22.\n\nSummer in the day: full colour skies, and heaping galleon clouds. Late morning to the white café by the canal and swimming. In front of the \"White Café\" a doorless, windowless café now, a long narrow treacherous springboard, balanced over a long sideboard flush with the bank, and anchored by a great fragment of a brick pier, and this afternoon to the stream as it runs through an orchard, before it reaches the ruined factory. Back to H.Q. met Jim S. on one of the garden seats raging at a latrine butting between an old stone venus and a great dull red tree, and Jim wanted to argue Blake’s inferiority as an Artist – I’d mentioned Yeats obvious admiration for his genius.\n\nNo argument.\n\n23.\n\n\"Call for the Pioneers!\" Now they’re re-slating our latticed-to-the-sky roof, weeding the rose gardens and clearing away from the balcony terrace the heapings of rock debris and timber.\n\nSent down to Eric G. \"Sylvia Scarlett\", must return too Basil’s copy of \"Tragedy of a Genius\".\n\nCanadians still doing well – Henencourt Wood entered. The French have advanced deeply to Guiscard and a further advance by the 4th east of Peronne. And the Americans have still to be heard of.\n\nSeptember 6, 8\n\n24.\n\nA vivid sky and a burning sun: all day long bathers along the canal and in all the lagoons and streams.\n\nA crowd gold in the sun and sun flecked in the shadows hail two hundred yards along the canal path an unladen postman. \"Any letters?\" – a head shake, and a chorus that follows the circle of sound – \"You --- !\"\n\nThe early afternoon on maps of Battle objectives: the 3rd and 5th Divns., we in support. And tonight comes the wire that after no battle our line runs by the plan’s second objective, and in towards Ham and Laon the French advancing.\n\nWe to move up: perhaps tomorrow.\n","26":"\n\n25.\n\nHalle\n\nMoving up, the sun behind leaden mist clouds, and the roads through grey and patched green country deep in fine dust.\n\nTwo lorries to move H.Q.’s staff, the greater part of its equipment, and a full guard.\n\nThe old Somme country of hills and valleys, and battled woods of stark broken \npoles\n stumps.\n\n\"Jove! how’d you like to charge that hill with y’ pack up!!\" \"Fix Bayonets: Charge!! Cock a Machine Gun over the top, and knock every barstard dead!\" One of the 5th Btn.\n\nHeavy rain in the afternoon, and clearing skies in the evening, with such colours of golden copper and misted mauve, blue and green, beyond understanding and with the last colour of the sun fringing yellow a great deep blue cloud, flares from the hills and valleys – Fritz flares of the diggers’ firing.\n\nH.Q. parked hardly in an old patched farmhouse, and a dozen of us wondering on our place of sleeping: the attic – with a splintered and debrised floor and a roofing of ruberoid, full of sneezing gas! Eyes still stinging from a gazing about this afternoon.\n\nThe 1st to go in, supporting the 3rd and","27":"\n\nYesterday a dull uninteresting day.\n","28":"\n\n26.\n\nThe A.P.M. in the small corner Chapel: passing this morning, his white-lettered black board – A.P.M. beneath the Rising sun, like the black skull and thigh bones card these small villiage churches seem so well stacked with.\n\n27.\n\nFrom a captured letter written by man of 190 I.R. 220 Div. dated","29":"\n\nWe are lying here in a hellish position, no dugouts, but all in funk holes, with losses & again losses, and dead, so that one almost becomes mad. Since lying here I have been smoked out three times, and if this still continues for long I shall cease to take part, you can be sure of that: for I am not hanging on so miserably here to get my limbs shot to pieces. We are not going out into rest. The orders are to hold the position till the last man, and the Coys go into line here with 20 mannikins. My God if the Tommies only knew that! Ah poor Germany!\n\nIn the 2nd Coy of 9th I.R., 28 \"Div. prisonersinterrogated two days back, tells of the Company oil being of the warr being over in 4 or 5 weeks!!!\n\n\"Ah, Poor Germany!\"\n\nSeptember 9\n\n28.\n\nAfter plans of three objective lines of an advancing on St. Quentin – 4th and 1st Divns., for a walk to Peronne. A city of great ruin: a city of ruin utterly dead, and still full of the most beastly and individual smell of Boche. The Church ruined as the Church of Bapaume – the aisle and naves filled high with heaped stones of tumbled columns and \nstones\n rubble of vaulted roofing. It has been before warr broke over it, a lovely church, a building of some achievement and of good design. The columns and wall of one aisle stand, and the apse walls and part of the High Altar. What a sketch! And shortly we move for Tincourt.\n\nWalking back met one of the \"Sentimental Blokes\" of the Dranoutre stunt: a yarning of their show, and telling him of the Canadian \"Dum Bells\" their opening scene greatly appeals. Tried in a roundabout way – lauding the good taste of the Diggers, to work him into short piece by the good men – Barrie, Wilde and Shaw. But from beneath his assumption of \"Diggerism\" came out his \"T.T. ness\", so praised his introducing of the \"Indian Love Lyric\" stuff.\n\nSeptember 9\n\nDown tonight to the 9th F.A. in hopes of seeing Bill Adams: but learn that since last Oct. he has been with the 2nd A.G.H. Bert R. up from the Amb. – Motor Orderly with Reg. D. A and B Bearers have gone up with the 1st Bde. Toby, Nick & Coy attached to one of the Btns.\n\nNo Mail: beyond the leave accumulated stuff, none since returning: so today posted to Smith of Paris 15F. for French’s two vols. of verse and poems in prose.\n\nA sketch, commenced last night, finished of \"Maps & G.\".\n\n29.\n\nAll about the trenches here, parties of salvagers, passing by Bray yesterday, parties of Fritzs – apparently alone, industriously carrying shells, M.G. Belts and all the Fields accommodation, to small roadside dumps.\n\nTwo T.T.’s their guard!\n\nIn his abandoned dugouts, and all about the probable billeting areas, he has as last year been leaving bogey traps and small mines. Why not use captured Boche as cleaners out of these doubtful two places?\n\nHistory holds plenty of precedent to justify this.\n\nSeptember 10\n\n30.\n\nEpitaphs from Omar Khayham to a Tommy’s at La Boiselle – \"He done his bit\": but Scott tells of one in indelible over a half-buried Boche at Mt. St. Quentin –\n\n\"There lies a Hun who met a Digger!\"\n\n31.\n\n\"They’re calling the new reinforcements ‘The Stokers’\"!\n\n\"Why the Stokers?\"\n\n\" – They’ve kept the home fires burning!\"\n\nThis contrib. from Mac.\n\n32.\n\nAfternoon with Ken and Jim across the fields – through the deep belts of the Boche old wiring and past isolated shell-hole graves of 2nd Div. men – to dead Peronne. An afternoon of clouds and passing showers and brief patching of a white sun. Made an unsatisfactory sketch from top of the heaped fallen columns and wall. Jim and Ken worked from a small high bay chapel; two rather good mates.\n\nYesterday Jim did St. Quentin: it passes my test – a sketch I’d like to own: taken from an old shelled trench the woods of the summit stand stark against a windy sky. In water colour its his best picture.\n\nThe Divisions go in tonight.\n","30":"\n\n33.\n\nGeorge defines Brasseries, as \"the place where they make you show your photographs\". Satire mostly of Butler – or the typical Digger.\n\nGeorge E. suggests a \"Button Day\" for H.Q. – but G. desires a Wattle Day – a \"What’le y’ have day!\" – and rum for miles around.\n\n34.\n\nA long yarning with Jim on painting etc., then Mac into the tale. Mac confesses a vague regret that he \"didn’t give Art a fly – but when I was a kid I’d a sickening of paints – the Mater was mad on it – it was her mania. D’you know what she did at one house we were in? – painted every panel of all the doors with scenes an’ that! An’ I used to get some terrible hidings: over the wet paintings I rub my finger, an’ ask, \"Mum is this wet?\", an’ they’d go mad at me.\"\n\nSo a yarning ending pleasantly and so to turn in.\n\nMac away to Corps early in Oct.\n\nSeptember 11\n\n35.\n\nBois de Buire\n\nThe Bagmen, H.Q. staff, Maps, and D.O. in a Bon Hut put up during the afternoon by the Engineers.\n\nAmongst the Bagmen a new 2nd Btn. lad of fine build & features, and wounderful quiet grey eyes.\n\nSeptember 11\n\nCasualties in the 4th Btn., a party of Boche surrendering, discover a party smaller in numbers to themselves, they commenced a stunting, and support came to infilade the 4th.\n\nIn the South the French have reached the Hindenburg Line – a good advance, and ground gained S. of St. Quentin.\n\nIn an instant, through the edge of the wood, a sky with the sun’s setting, of gold Siamese silk, and the silhouetted branches and leaves a rich vague green.\n","31":"\n\n36.\n\nRain, and the muffling of deep gun fire on the left; and a wind like the wash of the sea through the wet leaves of the trees.\n\nHalle left at midday, and in lorries to the edge of the wood: past Peronne the stark stumps of trees and grey battle country fell away, and winding poor roads – a hundred Tommies labouring on their rebuilding – were through green meadows on hills and by valleys, and over the green horses of the 3rd Div. Artillery, with mounted stockmen passing amongst them and around. Sleeveless shirts, shorts and the slouch hat, and the sun\n","32":"\n\ngold on their burnt bodies.\n\n37.\n\nThe afternoon across two valleys to an old gun position of the Boche: salved from there two of his shell-case return boxes for ‘Maps’ gear.\n\nJim tells tonight of a tale heard from two separate sources, of the Boche leaving at his abandoned Dressing Stations, dead bodies on stretchers, moving the stretcher explodes the mine!\n","33":"\n\n38.\n\nNo Mail, and a dull day of rain, clouds and passing sunshine but tonight, and the nights still young, two Boche raiders brought down in flames – as great giant flung gold burning torches, trailing tiny stars of light, and great floating exquisite flares of scarlett, green and pearl gleaming white, and the while a sky of darkling blue sparsely starr’d, divided and crossed with the white of searchlights. As the first plane flamed in the sky and fell, a great wave of cheering from the troops in the valley – and a wave of sound that swung round the wood and through it. And between the two planes firing, this through from Aust. Corps ..\n\n\"French and American troops have joined across the St. Mihiel Sailient, meeting at Vigneulles, A.A.A. Prisoners numbering 20,000 A.A.A. Mopping up of salient proceeding.\"\n\nThe guns loud all through last night, till well towards mid morning, but I.S. tells only of varying Artillery activity.\n\nSeptember 15\n\n39.\n\nMidday: Tom to lunch – Ted on his way to Australia, leaving here yesterday afternoon at an hour’s notice. Ken on his way to England, Len of the D.O’s and two Pioneer draftsmen compleating ‘Maps’. Yesterday on maps for the coming stunt – that will bring the 4th Divn. to within 1000 yards of Bellinglise – of Alan Seeger’s Sonnets.\n\nA white sun morning, and a pale sky through the green undergrowth of the Hazels. Jim has been sketching in colour – and achieved but a vague imitation of the ‘pretty’ Christy!\n\nTried yesterday to get Vin down to fill Ted’s place – but Laughlin jibbed when he heard he was in the Transport.\n\nAnd Laughlin this morning for Australia – via Italy: Brindisi.\n","34":"\n\n40.\n\nBob S. down from the Ambulance tonight, and just back from Paris leave, comes full of admiration for one Miss E.A. Rout – Hon. Sec. of N.Z. Volunteer Sisterhood, and staying at the Hotel d’Ostende, for reference, address, 9 Rue de la Michodiere.\n\nSeptember 16\n\n41.\n\nFirst mail for weeks, yesterday: and a ‘bonser’ letter from Betty – a letter all Australian, and two, July 7 and 14, from Mother. On the 14th Mother writes – \"Geoff will know in about 3 weeks wether he will get through – for the A.F.C.\"\n\nTwo minutes ago the third of tonight’s raiders over and in a sky clear of searchlights till he’d dropped his load – about 15 small bombs.\n\nBattle plans for 18th compleated since establishing here, on the General’s Maps.\n\nSeptember 17\n\n42.\n\nToday a letter to be written to Mother: but it should have been written on the 13th. It would be a far more beautiful custom if instead of receiving present son such a day presents were made to the Mother, this though is too obvious for such a world of unreason. \n\nIn the black hours of the morning deep rain, thunder, lightning and a great wind through the trees – and shelling! What a night for the line Battalions – a night of old Flers over again. And tomorrow? But this morning a clear high pale sky, with passing thin whiffs of white mist, and the sun clear and drying.\n\nA Pioneer found in a nearby won villiage, a fountain pen, uncapping it detonates a charge and his wounding bad.\n\n43.\n\nAfternoon: small ‘toot’ jobs – single copies of stunt maps: now a clear board.\n\nA few evenings back the yarning came up of ‘Barstard’. George E. had some good tales, one of a Bishop: at the dressing of a Digger’s arm wound, feelingly he sympathised \" – It’s a boody war lad!\" The Digger looks up, and agreed: \"Yes, it’s a \nbarstard\n !\"\n\nThe tales told too, of a pre-warr Methodist Padre, after a year’s Pardreing in France, going home to tell his people – \"Over there they called me the \"Old Barstard\"! – the beam is imagined.\n\nBut the realist of all – this from an old Bulletin, explaining the origin of \"Dear Mother\" –\n\nDear Mother:\n\nThe £10 arrived, and they won’t give me leave to Cairo: Isn’t it a barstard!\"\n\nSeptember 17\n\nThe hope is that a careful record will be made of these tales, of the pithy summing-up language of the troops: \"Aussy\" certainly will carry a fair record, and as far as it goes, is a good reflex of one of the aspects of Digger life, and the record should be of the slow growth of terse phrases. \"Grout\" came in slowly early in 1917, developed, and now is now part of daily use. \"Gutzer\" walked along the Duckboard track, and has developed to the weaker – ‘Abdominal’ – ‘Horizontal’ and ‘Crash’. But the simplest of them all, and only Australian is the beloved \"Possy\", to the Tommies its Bivvy, comfortable or uncomfortable: but to the Digger, ‘Possy’ in 9 cases of 10 stands for a crude Bivvy neatly camouflaged to the snug ‘Possy’. And the friendliest is \"Dig\", the Bulletin’s solid labour to make him ‘Bill Jim’ has been as avoided as their efforts to make ‘Australia’ \"Anzalia\"! ‘Aussy’ perhaps – though its first use by the Tommies seemed a veiled insult. Digger stands triumphant: ‘Cobber’ is good, but it lacks the clear, happy, ring of \"Dig!\" Damn! the very sound of it’s a laugh, and the visioning of gold or brown features & sapphire eyes!\n\nSeptember 17\n\n44.\n\nTo turn in, with maps of the stunting fronts well arranged and ready: groups of red, brown, blue and green pencils, and skeleton maps. But the possibilities of such another high pressure morning as at V. Bretonneux on Aug. 9 are slight. Patrol reports of last night tell of one of his strong rearguard posts evacuated, & of fortifying work near our 2nd objective line.\n\nSeptember 18\n\n45.\n\nEvening\n\nSlow, slow rain, and zero at 5.20, the sound of the gun barrage uneven and undecided. Then before 8 word of the first line being reached, and the battle commenced, and a lull in the news.\n\nAnd at breakfast this from Corps,\n\nFollows from 4th Army, torrid 8.15 A.A.A. Begins. A.A.A. Salonika front French and Serbian Troops combined in the attack yesterday, and are reported to have broken into Bulgarian positions to a depth of 7 km. on a front of 25 km., A.A.A. 4000 prisoners and 30 guns have been taken by the Allies, A.A.A. address all concerned A.A.A.\n\nCame the slow smile, and a wonder at the useless worrying there’ll be over \"Charlie boy\" at Salonika in the A.S.C.\n\nSeptember 18\n\nThe 9th Bn. reached at 11 the line of exploitation within 2000 yards of Bellicourt. To 5 p.m. prisoners total well over 1000 excluding 45 officers.\n\nFrom a Pioneer lad, heard an amusing account of the getting to the line of the ‘dummy’ tanks. Taken up on the L.R. at the end of the trip, a donk was roped to one – and bolted!\n\nJim back from a day forward brings a sketch of an old Boche M.G. position with its dead at their post: Templeux le Guerard in the distant cup of the rise, it is a good record, and in the class with \"Mont St. Quentin\". This yesterday’s oil, of the 1st Bn. Transport Cookhouse has a rather decent background, faintly in the manner of Phillips Fox, but its whole effect is poor.\n\nIn the afternoon down to Tincourt to the Pioneer Bn. with Harold B. – one of the new draftsmen. After the following days of work at the board, and with a white and blue patching sky, the country and its dotted copses and woods indescribably lovely, and behind the ruins of Buire a fringe of trees have already taken the colour of autumn. Passing one of the folds in the slow hills, a strung out line of rusted iron bivvys, and about on the clear green and in the sun, a hundred Pioneers fresh from line fatigues: in sleeveless shirts, wide open and in underpant shorts, shirtless, chatting, scraping putties & breeches, bunches yarning, & a hatless, sunburned, two-up school, and on the ridge by Cote Wood, on the horizon through the haze of the valley, occasional instant fountains of dull rose, fading to a passing cloud.\n\n46.\n\nTo turn in, a day of no drafting, of waiting for the next wire. Most bring in totals of 1369 O.R. and 60 Officer prisoners to us: guns captured too, the attack an entire surprise. Wires from 3rd, 4th and","35":" French Armies still to come in.\n","36":"\n\n47.\n\nBack from the Amb. late last night George brought old mail, and a gem from Bett just before her Dubbo trip. Letters from Mother of","37":" and 18, and T.L.S. of","38":"\n\nToday wrote to T.B.C. for Bennett’s \"The Title\", and announcement of T.L.S. – Barrie’s \"Courage My Children\" – four \"Half Hour\" Plays, Barbusse’s \"We Others\" and Fabre’s \"Life of the Grasshopper\".\n","39":"\n\n48\n\nIn the evening down to Tincourt to Pioneer Camp with Harold B. and a half hour yarning with Vin D. Across the valley guns on the far ridge, and shrapnel and flares – gold and white in the blue gloom of the far sky. Vin waiting on Blighty leave, and no arguing him towards Paris.\n\nTonight came into \"Maps\" one Lieut. of the Pioneers: one of Jim’s sketches drying, he admired which led to a bringing out of the \"St. Quentin\" and others. Then he spoke of Lindsay’s book, and tomorrow promises to bring it along for our appreciation. So it’s a looking forward to tomorrow – to the seeing of a book I’ll probably have to pay treble the published price for, & then for a soiled copy: Oh Damn! its as useless depending on Mother for these buyings as buying them in Buire.\n\nYesterday’s battle brings us 63 O: 1578 O.R.: 150 M.G.: 2 A.T. Rifles: 6 T.M.: 1 A.T. Gun: 1.8\" How.: 7 5.9\" How.: 10 4.2\" How. and 16 .77 cm. guns. Since Aug. 8 the Armies captures reach 9770: 41750 O.R.: and the Corps of this took 541 O: 19900 O.R.\n","40":"\n\n49.\n\nEarly in the morning he brought to ‘Maps’ Lindsay’s Book of Pen Drawings, and all the day till plans of tonight’s stunt by 1st Bde. there’s been a mood of resentment on me. Damn, why didn’t I cable Angus instead of writing, yet the thin hope comes that perhaps after all they’ll have my copy ready. Apres. And it’s a book beautifully printed, wounderfully in advance of old pre-warr producing. It was a copy from Sydney Ure Smith to ? Phipson – the Pioneer Lieut. who brought it up.\n\nNo Mail.\n\nIn a grey sky and through a mist, the moon a faintly blue pearl, and a cold cold night, the trees still and beautiful against the even small clouded sky.\n\nSeptember 21\n\n50.\n\nThis, from News Sheet No. 3 issued from Aust. Corps today.\n\nThe Journal des Debats says:-\n\n\"Britain’s greatness in this war has been her acceptance as severe but useful lessons of the inevitable set-backs at the start\" … and goes on to say. \"But there is something else even more striking than the attitude of her great autonomous colonies, who also spontaneously took up the common burden, a part which none would have dared to propose to them. To-day it is to the whole of the British Empire that honour is due, and the capital is proud to record and emphasize the immoral glory won by Canadians, Australians, New Zealanders, and all these young people whose democratic spirit is overflowing in a flood of heroism which they hardly understand themselves.\" – Reuter.\n\n51.\n\nMail, a single letter from T.B.C., announcing their discovery of a Cuala edition of Lady Gregories Book of Saints and Wonders – \"which if still available we could supply for 45\/- plus postage. May we secure & send?\"\n\nReferred to C.W. Beaumont’s copy at 21\/-.\n","41":"\n\n52.\n\nBack from a walk across the grass land by the forest, above Tincourt and Buire, yarning with Geoff of the Division. Last night’s stunt – a success by us, but made a failure by the Boche surrendering to us and hardly fighting the 74th, following that of the 18th, broke the exaggerated promise final stunting .. \nJan\n Dec. 17th and September quickly passing!\n\nToday Tom turns down the six months Australia! Eric D. and Jack B. up from the unit, and leaving here tomorrow with Bobby S. and Sothers of the Ambulance. And Tom turns it down: so compleately obsessed becomes a man who surrenders entirely to his work!\n","42":"\n\n53.\n\nMorning, sheets of boundaries: and in the afternoon Disposition plans of the sector taken over by regiment of the Americans. Tom’s had the wind up all the day, and quite uselessly, the maps still in the office and unneeded.\n\nA Black night, and slow even rain: under the close Hazel undergrowth, soft faint music of drops falling from leaf to leaf, and a coolness and darkness full of a soothing benediction.\n\nIn Palestine, Gen. Allenby has taken over 18000 Turk prisoners, counting still.\n","43":"\n\n54.\n\nTo be relieved by 30th American Divn., now perhaps the full Corps rest is to begin.\n\nPasting from Anzac B. cover of Sept. 6, \"Setting up a Light T.M. in a recently captured trench.\"\n\nJim back from Peronne, and by orders through a two star Lieut.\n\nThe hope is that the relieving ‘Murkans’ will attack: the Line they’re against from A.P.s is exceptionally strong & the Boche should make a good stand for it, but hell the location!\n","44":"\n\nSusanne\n\n55.\n\nIn the Chateau – broken by warr’s passing – of the Marquis D’ Estournel: a great red-brick long chateau, on the flat of the valley, from above, on the wide road dipping to its main gate, a building that promises pleasure, and faintly recalls a note of Fontainebleau. But it’s the old pretentious disappointing chateau meaninglessly decorated and embellished, an interior of gaudily gilded and marbled galleries, panelling of rich-coloured and figured marble abutting painted plaster. The staircase of grey, black and rose-red marbles, and a ceiling of painted fat cherubs decending through a painted opening in a painted dome. Maps are on the landing by the G.O.C.’s room!\n\nIn a chapel of the Susanne church marbles from 1593 confirm the burial below of the family of the Marquis D’Estournel. The church is bare of all altars and plaster Saints: holes gape raggedly in the walls and roofing: the only sound is russelling breeze in dead leaves – old trees decorating some Boche celebrating.\n\nThe flooring of the chapel above the vault has been deliberately torn up and tiles in the centre of the altar steps: debris and bricks strewn. So a slab beneath the feet of a crucifix outside has been smashed away, and the vault of the D’Estournel opened.\n\n\"Bloody murdering barstard!\"\n\n\"Ah, he’s a no-good barstard anytime!\"\n\nFrom their shelves great old coffins have been drawn, and smashed open, and, \nthey\n from the vault the coffins were drawn and the bodies emptied to a heap: the lead of the old casing was melted and burn’d.\n\n56.\n\nWith Harold, along the canal yesterday evening to the 18th Bn. The first well enjoyed walk since those of Courcellete-Quehen last December.\n\n57.\n\nEvening … By the Chateau there’s a long building of tall windows: by the large doorway a notice, \"Boxing to-night\": Inside, plaster walls shew pannelling for pictures, and over a tiled floor parts are uneven with dried horse dung, a rough-framed stage, and a maze of 18 pounder boxes, and in the room’s centre a large packing case: today it was lifted, and underneath an old black basalt tomb slab of the founder of the house of the D’Estournels, and his heiress .\n\nSeptember 25\n\nThough horse dung and straw hide the fine carvings, the slab is richly designed and very beautiful. The case was placed over it by the 3rd Divn. party who had shown in the hall.\n\nAlways Division Guard is of finely built and burned men, but the present guard, of the 9th Bn. stands alone for smartness and beauty: one is the nearest approach to a Michael Angelo figure I’ve seen, a splendid giant built richly and 6’4\".\n\n58.\n\nNoting a plan I was on, the A.P.M. intruding in Maps a day back, he casually mentioned, pointing across the boundaries of the Divn. and the 74th, \"My men got a hell of a lot of prisoners from there!\" I pointed out that it was beyond our boundary – \"Yes: pinched them from the Tommies!\".\n\nAnd he and his \"mess\" all wear our uniform and Australia’s badges.\n","45":"\n\nLong\n\n59.\n\nSusanne left at 9 this morning, \"Maps\" and \"G\", and arrived at Long early in the afternoon. A small straggling villiage in the hill, to the valley of the Somme, we in the ‘Marie’.\n\nSeptember 26\n\n60.\n\nSome notes on the lorrying from Bois de Buire to Susanne, and to Long.\n\nSalute to Nevison! passing Hermies and the primitive warr’d country came first appreciations of the war painting, \"The Shepherd hears the Guns at Dawn\", till the 24th was the only one of his I’d appreciated, but now comes the realisation of his success and his rich impressionism. At Hendersons on Charing Cross Road I passed his book only half seeing the casually turned pages.\n\nPassing Mt. St. Quentin, a field of sudden bursting smoke bombs – bursts of blue smoke, and rich spraying of red gold and mauve patching, columns of smoke rising as clear chiselled clouds.\n\nA Tommy Motor Ambulance, and there in front – clean shaven vacantly smirking faces: every while one would lift from behind a cushion a bottle of brandy, sip it and pass it to the others. Through the window to the car, four stretchers in the racks!\n\nCrossing the valley – trench line crossing whitely, a road from Susanne to the Albert rd., trees of brown gold by its edge, rich with a vague green turning to yellow, and a terrific sky of pale milky blue.\n","46":" 26, 27, 28\n\nAlbert – and the old squalor of its ruins gone, lost in a compleat wrecking of the whole city: even the church ruins have taken on a dignity, suggesting the ruin of a building of beauty, the collapse of the entire town explains this, and a further smashing of its walls and roofing.\n\nPeasants amongst the drying grain, lately bringing in their crops, lately used trenches zagging through their fields: the harvesters old women, and two of them wearing vivid red bandannas.\n","47":"\n\n61.\n\nThe Americans attacking north of Verdun and along the line and prisoners numbering 10000 by the morning’s wire.\n","48":"\n\n62.\n\nBlankets down, when Ken comes in with word of a message by phone from Corps of Passchendaele again ours, and a push commenced between Ypres and the sea, with 1500 prisoners as an Hors D’Oivire . Canadians within a mile of Cambrai, and prisoners to 10000 theirs and 200 guns. Americans and French still advancing in the south, and their prisoners now passing 20000.\n\nTurning in last night the wire from Corps good too – of Bulgaria after a 24 hours armistice asking for peace – which was refused! Great arguments have been over the \"after a 24 hours armistice\": was an armistice granted? or was peace asked for after the refusing of an armistice? Today’s mail is equally ambiguous.\n\n63.\n\nAway after tea with Harold, and a walk following the Tow Path along the Canal to Pont Remy: awhile with Nane and Harry G. and Johnno, then with Les F. and Roby: so back to Long by 9.\n\nMail today, letters re-addressed from Harefield – from Geoff, Mother and another bonny yarning from Betty.\n\nAnd a bill from T.B.C. 9148.\n\nTomorrow the Americans on our old front: Battle Instructions Series E, with General – in command and attachments from the Aust. Corps.\n\nTomorrow should end with tonight’s good word repeated.\n","49":"\n\n64.\n\nFrom A.B. notice of Death of Sir G. Reid. A Philosophy of the whole army of ‘Diggers’. Americans doing well, Bullecourt & Nancy theirs.\n\nSir George Reid’s golden rule for the attainment of old age is worth a place in the Office Window as a corrective to all war valetudinarians: \"I have aimed at health and happiness, and when confronted by a formidable obstacle I have first tried to knock it over; failing this, to get round it; if not, then under it; and if all these manoeuvres failed I have been content to lie down in its grateful shade, lauding it as a beautiful blessing in disguise.\"\n","50":"\n\n65.\n\nBack from a yarning over Coffee at the Estaminet by the Hotel de Ville, and the wire of Armistice being signed with Bulgaria, and of hostilities ceasing at 12 noon today, and of our occupying stragetical points.\n\nToday’s \"Mail\" tells of good advancing beyond Paschendaele by the Belgians and British, of the outskirts of Cambrai gained, and of slight advances by St. Quentin, wires from Corps have been nil, map altering from the \"Daily Mail\".\n\n66.\n\nAt 9 last night along to McCubbin’s billet, and a yarning there of all that matters. A yarning of Johns, of Nevison and the Australian Artists, and of Beautiful Cities, and already Sydney has her squares ruined by bad buildings – by the Railway, the abortions of Joe Gardner, by Lindsay, and Railway Square by Marcus Clarke and Orchards. Possibilities are all about the city – and they are slighted by Building Surveyors who have the souls of louses.\n\nRain: yesterday, through the night, and all the day, heavy rain passing, slow rain, and partly clearing skies, and rain clouds heaping again and in the line hazing flares like great flames, rising and falling: yellow lightning and white suddenly out of the black of the night to show for an instant threading rain, and growing mirror pools through the murderous mud, and an imagination rioting against evil of terrible wounds and overwhelming misery, and heavy sodden great coats, numb cold fingers and desire dead.\n\n67.\n\nTurning in: In the morning early the attack taken up by the","51":" &","52":" – through the Americans. Now word is of a weird map line, and a wonder on the whereabouts of the 27th men who passed Gury. In an excitement of advancing have the Americans forgotten a ‘Mopping up’ of their ground? At any rate they’ll fight: so tomorrow’s Battling may release them.\n\nOctober 2\n\n68.\n\nMaps must await correcting. Yesterday away with Harold to Abbeville, and the day’s news all rumours unconfirmed. In Abbeville news of Cambrai and St. Quentin falling, and of troops closing on Lille. Divisional wires of touch being lost with the Boche in Flanders about Passchendaele, of the 3rd & 5th holding well and advancing, and of strong fighting by the Boche. Wires this morning tell of no definite lines, so maps must wait.\n\nOctober 2\n\n69.\n\nAbbeville’s no \"Digger City\", pale-face locals, one decent eating-house and untidy streets.\n\nGoing in, Bus to Pont Remy, then walking, passing Epagnette, we had tea, at a dandy little house by the road, served by a dear old soul of vastness and smiles. Tea in a tiny little room of vivid old wall paper, with an amateur general: all the papers of France were about him and all the maps of the war, pencilling his maps, he made notes and cross notes: then he beamed on us, and turned the machine gun of his imaginings on us.\n\nHe gave us the \"good oil\": war would be over by October 31, and Australia would be ours again.\n\nMet in Abbeville Eric G., Syd L. and Clive G.\n\nA gem of a shop discovered, closed! in its window books of Barrie, Drinkwater, Brooke’s Collected Poetry – on its 2nd Impression, and books by the good novelists. Today Eric goes in with orders for the buying of the Drinkwater book.\n\nBomb wreckings shew the old decaying construction of some of Abbeville’s high shops: there is interest in almost every street, and some of the better preserved houses shew curious design and carving.\n\n70.\n\nEvening.\n\nLate morning Tom mentioned a Y.M. Library at Ailly-le-Haut-Clocher: so tonight there with Harold, and Masefield’s \"Shakespeare\" brought back. A walk in the grey rain over high clear fields, tree clumps and stacks vague green silhouettes: all the day a thin sun has stood against growing clouds: tonight the rain.\n\nRumours grow of our going to Dieppe: today a letter from Commonwealth Bank so will have some money to back an application for a 24 hours leave to Rouen – if the tale is true.\n","53":"\n\n71.\n\nTonight to Fontaine: and a ‘bon’ night. In the half-light of the evening a doorway of the church, and the windows above it – a very beautiful design with flanking buttresses, offers a good piece for sketching.\n\nFor Coffee into a Farmhouse Estaminet, and a meeting there with three Diggers – one a 3rd Bn. lad – hat on the back of his head and black fine hair loose over his burnt forehead: the brilliant blue eyes, the Pan-like nose and lips riven in repose and white even teeth: tunic and shirt wide open, and a strong neck splendidly set on broad shoulders. Madame, a great fat\n\nOctober 3\n\nhappy animal of about thirty became amourous of him. In the light of the fire and a dull yellow lamp, a shadowed roof and gleaming pewter on the mantel and Bottle shelves, a picture from Rabelais, or a drawing by Lindsay.\n\nIn the morning the sky clearing, in the afternoon the sun: along the canal banks there with Walpole’s \"Fortitude\", and a laying down by the unused lock gates: an afternoon of dreaming – the long song of the tumbling water, tall leaning sentinel trees and their lovlier reflections, and the sun in a sky of blue patched thinly with small clouds. tonight the skies clear, blackly blue and sparsely starr’d.\n\nThe yarning came up of the 27th Div. omitting its \"mopping up\" by Bullecourt, and of the situation saved by the 3rd & 5th. The 3rd Lad tells the tale of one of their \"Mopper up’s\". From a dugout, fighting, the Boche were all killed and fighting a losing game, surrender wasn’t accepted. Pass some of the following wave:\n\n\"Well, you’re a cruel bastard!\"\n\n\"B--! I’m the ‘Mopper up\".\n\n72.\n\nArnie in tells of 2nd Div. attacking and of strong opposition: 21 O. 651 O.R. to 5 tonight through Cages. Big fighting will be along their lines. Battling will extend from Cambrai to St. Quentin. The whippets out today in the 2nd’s attack but the opening not yet for the Cavalry Corps behind. No rain in the skies: tomorrow!\n","54":"\n\n73.\n\nA morning at Fontaine, sketching the Doorway discovered last night: Madame (the lover of the","55":" Bn. lad) so happy seeing my book, after an issue of Cognac, filled straight from the bottle my glass of coffee.\n\nA wire after tea –\n\n\"G.H.Q. reports the surrender of Turkey A.A.A. Address all concerned.\"\n\nSpoke to George tonight of a D.H.Q. paper – and find him enthusiastic, so will get on to the working out: Tomorrow will see McCubbin and enlist his pen.\n\nThe second have been hardly fighting about Montrebban and tonight wire of prisoners is 28 O. 1128 O.R..\n\n74.\n\nMail: letter from Mrs. H. and this on Butler Yeats essay on \"The Modern Woman\",\n\n\"I received a book from you about a fortnight ago (and read it). His views on women I thought rather amusing!\"\n\nAnd I thought they were so ‘bon’!\n","56":"\n\n75.\n\nKen away at Samer, the whole darned crowd of Maps where only three can work, moping and full of bloody irritation, and Tom warring against one of ‘G’s letters solemnly reading the day’s filthy rag. There’s not an iota of work in, and the whole crowd of us are tied. Yesterday morning I left early with Ken to Fontaine without seeing T. & received back at midday a resentful glow full of vague blasted accusations.\n\nGive him a box of maps and a pile of coloured pencils and he’s happy.\n\n76.\n\nEvening:\n\nTea over and away along the Canal Town Path with Harold to L’Etoile: and a long enjoyed yarning of appreciation of beauty: enjoyed, as it meant attempt at definings to explain the quality and meaning of beauty, and its terrible fascination. Walks in the evening with H. are good – he’ll yarn on and on of forest surveys, rivers in flood and forded, and terrible storms amongst the trees: and awhile I’ll listen and awhile will wonder on his beautiful build, on books and on the dark colours of the water and the slow coming gold of the trees.\n\nMail: from T.B.C. \"The Title\" – read and Barbusse’s \"We Others\".\n","57":"\n\n77.\n\nTwo going mad together. Hate that grows and grows presses in and in on one, he the while with his hurt hand held in his tunic, intently turning and changing the plans and maps of our one folio. Twice in the morning he has changed and changed the placing of maps, and he held long silence while we dully sit neither reading or writing: then open a book and turning comes the asking to re-roll some old come-bying maps. A self confessed idealist and an obvious Dreamer! At Sylvestre Cappel Jim blatantly licking with him spoke of Balzac and France’s satire \"Penguin Island\" and Tom vaguely laughing confessed his Idealism, and his vague blue eyes and intent manner proclaim the dreamer. Coming to his turn for a home trip, he turned it down – telling Col. Viny he wanted to do a bit more! Then here a week ago he was to go before a fake board: he beat them and remains. It is that three years of the ruling of Maps and the Division have so excluding all else obsessed him and now rules him: all his reading is of German Divisions, of their methods of attack and their militarism: all his care is to hold from us all word of our stunts and our Division doings. ‘G\" will\n\nOctober 7\n\ntalk openly of some old action, & Tom will silently criticise their so doing, and forbid us all mention of any military doing: even when we are preparing maps of objectives, referring to them they are – ‘Those maps we were doing’ and if more precision is needed \"those maps marked with the coloured pencils!\"\n\nThe evil influence of the wholly good!\n\n78.\n\nEvening.\n\nA letter posted to T.B.C. for Arthur Symons latest – \"Cities, Sea Coasts and Islands\", Bell’s \"Potboilers\" and J.C. Squires \"Poems\", 1st Series. This afternoon out with Harold along the Tow Path to L’Etoile, and to the hill by it – on the map \"Camp de Caeser\", commanding all the country about, and a part of the valley of the Somme, the hill’s crest encircled by a great banking of earth: its cup grown widely with great beeches, and a rarely beautiful undergrowth of Hazels: each tree trunk darkly clear, and the whole ground deep and evenly carpeted with the dead leaves of years passing. A great madden brown carpet and trees beautiful as great growths of maiden hair fern, the under growth vividly green, the tall trees that hide compleately the sky yellowing and changing to clear gold: still the full splendid reds and tawny golds are to come: then the old mound encircled road will be magnificent with the ‘troubled splendours’ of Autumn.\n\nBack in Long a door to door seeking a billet, and one found by the Chateau: Madame is old and full of chuckling charm, and a quaint amusement at our conversational attempts. Eric today to Blighty.\n\n\"The Title\" read, and enjoyed: full of the comedy of the moment, and of obvious satire, a rather weak note as the introduction in the third act of the imposter \"Straight\". The book of Barbusse – \"We Others\" a collection of small tales – tales of love and pity exquisitely told, and of the beauty only possible in the writings of the French and Russians.\n","58":"\n\n79.\n\nLast night called at McCubbin’s Billet and tackled him about some sketchings for our rag (the only so far appealing title is \"The Dud\") found him ready with the offer, and \"of course I can only do stuff like ‘Inf. through Peronne’, or such stuff\". Then saw George, and after Charlie M.: he to find for us prices of publishing from his printer cousin. Saw Geoff today and from him a sketch and the promise of some written stuff. Major promises G. some contrib..\n\n Letter to Mother: no mail.\n\nOctober 8, 9\n\n80.\n\n\"Days dead are dark: the days to be a flame of wonder and of promise, and great cries,\n\n\"Of travelling people reach me – I must rise.\"\n\nJ. Drinkwater’s \"The Fires of God\" has not to do with \"The Dud\" (?) but is from the better knowing of Harold. A great poem and of a beauty almost of Thompson.\n","59":"\n\n81.\n\nToday marking the G.O.C.’s map, White comes up, and with his even fixed smile attempts his usual dictating of the line’s position: according to definite information I fixed it: scrupulously careful to take no land from the Boche that was not ours. As usual he attempted the taking of towns still theirs. Then passing unnecessary orders to line Col. Ross’s map, he left. Then he returned: \"You are in No. 4 along by the Chateau?\"\n\n\"Yes, sir!\"\n\n\"Then you’ve crashed! I want the billet for an officer of the O.A.C.: there are plenty of other billets in the village!\"\n\nSo tonight we’re away from our comfortable home, back in the Hotel de Ville in the marbled plaster Committee Room.\n\nAs a souvenir, this pasting a general order.\n\nThe Englander crows! and asserts his own ridiculous militarism.\n","60":"\n\n82.\n\nNo Mail. This morning passing from the Chateau, McCubbin called me into his Billet: yarning & he shewed me an unfinished canvas of a road from Corbie, a great passing cloud of dirt from passing lorries: by the roads side a tank, Motor Ambulances in the background, and a looming observation baloon rising. The skies colour and painting force, the dust clouds full of hazing impression, and a tree good in its suggestion: but a picture of great attempt & no achievement.\n\nCasually he mentioned, talking of printing, the cost of £50 for the 10th Field’s paper! Is it \"Requescat\"?\n\n80.\n\nThere has been today an argumenting on the utter failure of the British – and the Division people too – in their dealing with Brothels and V.D. amongst the troops. Still brothels are \"out of Bounds\", and it has remained for one woman – Miss E.A. Rout – to show the rational way: Ken, hearing the argument, and coming into it, told of her making application officially to Corps for their support. The result? No knowing, but there’s guessing!\n\n81.\n\nLater.\n\nMidday to the Chateau, found the maps line altered, and deep advancings by the French\n\nOctober 10\n\ntowards Laon and along the Lines to N.E. Rheims, so no altering of maps: Then tonight!\n\nG’s orderly in . Tom in: then out two minutes later \"just came inside for a few moments Frank!\" and I went in with a wonder if the roof were to fall. Cpl. Wertheim from before the Line map (that I’d altered according to the paper) asked if I’d altered this?\n\n\"Yes, sir!\"\n\n\"And did you alter the one in the Chateau?\"\n\n\"No Sir\" – and I went on – \"someone had already altered it to far beyond the line’s position\" – turned slightly, and saw Cpl. White by him! Then he came forward, in full assurance of a point gained, and with his damned smile – \"Oh the alterations were from the French official in the village!\"\n\nTom pointed out he’d mistaken the town gained for one ten miles further into the Boche line – but White was quite certain: \"Other names followed a sequence in the French wire, so that is correct!\" Maj. Christy \"Oh, of course it must be!\"\n\nCpl. Wertheim: Well we’ll see the wire in the morning.\n\nThen Tom and myself down to the French P.O. & a reading through the wire. The victory is ours: but beyond the allowing back of White’s gains. White has won by his insulting manner. He has fallen over himself in his anxiety to \"Bow\" to the G.O.C. & Col. Ross. But he’ll be in the next Birthday Dishonours and he’ll wear the D.S.O. Ribbon. Then there’ll be quiet again.\n","61":"\n\n82.\n\nYesterday’s sequel. White’s gains retaken by the Boche, and the line only steadily advancing. Now on all Maps a poster – Line correct to – at – By? A moral victory!\n\n83.\n\nIn the afternoon to Ailly le Haut Clocher for a bath: new change again.\n\nBy the Baths the Bn. H.Q. of 6th Bn.: their flag of scarlet and purple against the backing of a white plaster farmhouse: abutting it, a red brick wall and arched gateway greatly overgrown with the Virginia creeper – deeply red and gold brilliance and a white seen through grey woven clouds.\n\nTom away at 10 last night – for a day to the Base! for a day? for a rest?\n","62":"\n\n84.\n\nOut in the night, faint rain, an exquisitively cool breeze, a dully luminous cloud sky and darkness in the village.\n\nA Reading of Vol. 11 of Sinister St.: Michael buys Pater and a wounderful edition of Boccacio & Rabelais and Straparola: and Guy Hazlewood sells his old books to pay their debts. One explanation of MacKenzie’s facination is his compleat Book love.\n\n85.\n\nTo the Estaminet by the Church with H. Three tables there, a drinking crowd and great musick of voices, laughter and a discordant gramophone. H. Only will drink coffee and talk survey.\n\nFor a night with Les and Mac – Les with his black silk hair, and gleaming eyes that vanish as he smiles and Mac of the honey gold hair and affectedly sleepy eyes – in a smoke hazed estaminet crowded with deep drinking diggers, yarning of books and of men, tolerant of all, and greatly loving the whole splendid crowd.\n\nAs aliens drinking coffee, as aliens passing, came in two of the A.P.M.s staff, and they brought the presence of dull resentment.\n\nOctober 12\n\n85.\n\nThe only haven is in self and in silence: selfishness so perfect that nothing may touch it, silence so deep that nothing may penetrate it.\n\n\"He travels the fastest who travels alone\": God, then I travel alone, and in silence. God, but I’m tired! and my thanks for Keats. He at least knows.\n\nWrapped lightly in a brown blanket, safety pinned and stark on a stretcher, a carrying party and a shallow grave. Snow was a huddled shape in his clayey grave at Dickebusch, a gabbled sermon by a Padre who has no realisation of the body he commits to the soil; and dull illiterate sods filling in the grave. And the rain again, and another dark cross heading another grave. My heart aches and a drowsy numbness holds my sense, the whole day has held nothing that justifies it, yet I hate myself and am filled with blasphemy, they drink from gleaming filled glasses and laugh, and I am dead, a few feet of soil and another grave, an exultation and a ship that slowly moves through the blue water of the Harbour – gold arrows\n\nfrom the sun setting, filled the waving arms of the water the day we left – a hellish wind shriek and a beautify body of nerve and trembling flesh pulped to terrible bloody meat, and in there life after that sees the bodies horror? and a grouping around of men who blindly see all that remains of the man they knew.\n\nAnd so to bed: God, but my soul’s dead.\n","63":"\n\n86.\n\nTo the flat hills that look out over the valley and its string of wooded lagoons.\n\nRound and about the straight banked canal winding under the yellowing trees: whiffs of white mist low on the ground.\n\nA grey sky and a pale white moon and cold, cold still air.\n\nDarkness grows and the mist deepens: then only a deepening yellow blue of the trees tips, and growing shadows: a moon silvering the canal thread, and on the ploughed hill the dark of night and the slow silence broken only by the sad cry of a bird, and the broken whisper of a shuddering breeze.\n\nOctober 13\n\n87.\n\nGeoff H. in tonight: then around to his billet. He shewed me a great collection of enveloped papers – long essays in verse of warr and warr’s trappings. And I thought again of a recounting in Artzebasheff’s \"Breaking Point\" when he tells of an aspiring parvenue who shews to him his soul, and eagerly awaits confirmation of his dreamed greatness.\n\nToday’s mail tell of Germany’s reply – accepting Wilson’s terms – diplomatically debasing herself. Madame is excited: but …\n\n88.\n\nSome great books.\n\nMacKenzie, \"Sinister St.\"\n\nJoyce, \"Portrait of the Artist\"\n\nArtzebasheff’s \"Breaking Point\"\n\nHugo’s \"Les Miserables\"\n\nFrance’s, \"Thais\"\n\nPater’s \"Imaginary Portraits\"\n\nConrad’s \"Shadow Line\"\n\nMasefield’s \"Gallipoli\"\n\nClarke’s \"Vengeance of Fionn\"\n\nButler’s \"Way of All Flesh\"\n\nBenvenuto Cellini’s ‘Diary’\n\nBurke’s \"Limehouse Nights\"\n\nHardy’s \"Jude the Obscure\"\n\nMeredith’s \"Ordeal of R. Fevrel\n\nApulius \"Golden Asse\" and \"Simplicissimus\"\n\nVachell’s \"Quinnys\"\n\nShaw’s \"Love Among the Artists\"\n\nBarrie’s \"Half Hours\"\n\nStevenson’s \"St. Ives\"\n\nFlaubert, Mdlle. de Maupin\n\nNo mail today\n","64":"\n\n89.\n\n\"This in Dinkum! – No, ‘its \nDinkum\n’! I tell you!\"\n\n\"I tell you he played on that violin for four – hours till he’d only one string left!\" … \"an’ the wolves were afraid!\"\n\nA sky of curious dappled clouds and a vague white light of the moon behind them: to Cocquerel, and the while H. endlessly talking of …? Once it was bulls, and I was thinking of the note from Beaumonts from the Ambulance last night: \"The Budded Branch\" by R. Nichol, then it was rabbits and goannas, and the wonder was of working afterwards with Vin.\n\nThere’ll be lonliness afterward – lonliness that I’ll hold with work: Harry is dead, and he’d have kept me to the mark. Gerald? Will our friendship survive the years between? and Court? The damned amusing point is that if I go back to Lindsay I’ll be a mistrusted intruder.\n\nFrom the C.B. today word of £5 being sent through Div. Paymaster. Will settle with T.B.C. and get hold of \"The Golden Cockerel\" and \"The Budded Branch\" and \"New Paths\", a cardigan will set me then for the winter. Laon ours today!\n","65":"\n\n90.\n\nAlone to Ailly le Haut Clocher: across the high meadow of quiet lovely greens and ploughed purple earth, a silver and blue smoke clouded sky, and a splendid cleanness in the cold air. A Bath and a change at the Divisional Baths, and back to Long, back to tea, and a ridiculous argument of sculptured memorials. Ken defends the Prince Albert Memorial!!\n\nKen once taught \"Art\" in one of Victoria’s Technical Colleges: dislikes Agustus Johns on Jim’s word: is amusedly tolerant of impressionism and perpetually wears the carnival impression of a festive Methodist.\n\nMail, from Paris, the two books of Herbert French: two books to keep till a golden day for reading by the old Roman Camp by L’Etoile.\n\nGood advancings in Belgium, and Lille well saliented: today comes Wilson’s reply to the Boche note: the war still grows.\n\nWertheim G.S.O. III, last night, in a generous mood – talked of books and writers. Came in one of the A.P.M.’s runners, saluted, he delivered his word, saluted, and retired. The tale came: we were alongside one of the Guard Regiments: a Guard runner came across with a special message for the Col.\n","66":"\n\nHe entered the dugout, saluted the Capt., and asked permission to address the Col.: gained, he saluted, he saluted the Col. and handed his wire, and waited. There was no reply. He saluted: saluted then the Capt. and retired. Two minutes passed, and a Digger’s head came through the dugout door. \"What bloody fine dugouts these Brigs. \ndo\n have! Is the Col. in Dig.?\"\n\n91.\n\nOut of the mist, above the village with the moon, silvered sky behind it, the great ship shape of the church, a door opens goldly to the shadowed street, and empties a dozen yarning diggers to the night. The musick of laughter and voices, rich awhile slowly dies: a girl passed, a shadow across the road. The mists slowly curl and deepen, the ribbons of gold from shadowed windows pass, and the last light of the Chateau’s high windows suddenly dies to the darkness, \"and leaves the world to silence and to me.\"\n","67":"\n\n92.\n\nAn Australian mail in, and letters from Mother of July 31, and Aug. 25, from Betty Aug. 23, and from Mat a dear note Aug. 22. Letters too from \"Dear Aunt Fanny\", full of \"your darling Mother\" and \"your dear Dad\" – and from the Rev. Barbour, a reply to my letter from St. Sylvestre Cappel.\n\nLow has been killed! Mother wrote of Mrs. Stafford calling – her first outing since hearing: Mat in his letter confirms it.\n\nCredit note through, and three letters written: to \"The Export Manager, T.B.C., 926: to Beaumont 19: and to Mayhew 2 – part settling of the books he set aside in 1917. Met him this time while in London, and found him most charming over the matter – where I’d half expected having to reseign the books back to him, asked him too after a S.H. copy of Fletcher’s \"Architecture\" book. Beaumont for \"New Paths\" and the middle edition of \"The Budded Branch\": the Blue and Gold \"Golden Cockerel\" reluctantly passed with the Cuala Books. Asked T.B.C. after the Cuala \"Responsibilities\" and the deluxe \"Posthumous Swinburne\" book.\n\nReading today \"Brickwork\", but relief from a summary reading of \"The Battle of the Marne\" of French’s – up in the attick by one of the roof fanlights.\n\nA night of silver and cold blue, and autumn frost in the air. A wire tonight of a landing at Ostende, and ours. Tomorrow, Lille?\n","68":"\n\n93.\n\nFrom T.B.C. a three book parcel: Symons \"Cities, Sea Coasts and Islands\", Clive Bell’s \"Potboilers\", and J.C. Squire’s Poems. Pot Boilers good if only for \"Art and War\" and \"Ibsen\".\n\nA gloomy grey day, but mid-morning a wire in of cavalry by Bruges: Ostende occupied, and Thielt and Lille ours.\n\n94.\n\nCasually yarning at tea, the idea came of a way of a part rebuilding of French and Belgium cities. The Educational scheme is all-embracing: then why not enrol all Architects, Builders and Engineers, and men of the allied Arts, and set them to a reconstruction – set the reconstruction as a study on a grand scale, to be actually carried out. To rebuild part of wounderful France! there’d be in it something worth while.\n\nTomorrow read Brickwork again. Tonight J.C. Squires.\n\nOctober 19\n\n95.\n\nMorning completed four sketched pages for a Christmas Card: tonight, ten enveloped for posting.\n\nNearing Zeebrugge and Roubaix and Tourcoing captured, an advance continuing.\n","69":"\n\n96.\n\nA Library list.\n\n\"Sinister St.\", Vol. II & \"Sylvia Scarlett\": \"Architecture\", Lethaby. \"Poems of Love and Earth\", J. Drinkwater: \"Poetry of H. French\", two volumes. \"Poems\", J.C. Squire: \"Pot Boilers\", Clive Bell, \"Building Construction\", Mitchell & Cities, Sea Coasts and Islands of Symons, \nand\n Keats, a week ago a night spent in a pasting and mending of its loose pages.\n\nThinking seriously of applying for a Rouen leave, with Dieppe called in on the way. Symons and Bell both mention a St. Remy in their two books: but fancy rather Bell refers to the St. Remy in the Mezieres sheet – which is absurd seeing he refers to Rheims being in ruin while St. Remy stands.\n","70":"\n\n97.\n\nTom away this morning on his first Blighty leave: a day of quiet. Morning, saw Geoff, now G.S.O. III with green tabs exchanged for the scarlet, and easily obtained his sanction for a Rouen application: so put it in. Afternoon at McCubbin’s billet. Then to his ‘studio’ – a small half glass room at the back of the house, a great wardrobe and circular bath – littered well with colours its only furniture: on the hard walls several canvases, and\n\nOctober 20\n\none above others good, a street of Peronne: half the road is clear for traffick, half a heaping of debris from smashed houses: dragged to the debris, a dead horse – a shape suggested – and along the cleared road a line of close touching Boche guns. Haze of the sun over the foreground, and dust above the road, far far away thin column of deeper grey-blue finger fantastically up through the turning sky. A dozen small sketches, mere notes of swift impressions, are really good: these he intends to work from later: but already enlarging one to a great canvas of the Mt. St. Quentin stunt, the rich suggestiveness of the sketch is lost in the painting, a long yarning till the grey of the clouds filled the room, then back to the Mairie.\n\n98.\n\nFrom \"Estaminet Tales\"\n\n(a) A Dear Young Flapper, \"a Nymph of the sidelong glance\" stops an Aussy in the ‘Strand’ – but, \"Go away woman! we hear lectures about you!\"\n\n(b) Of the \"Sentimental bloke\", \"Where did that one go to Herbert?\" Three shells fell on the chorus, and one, \"Stop, I’m wounded! No, only gassed!\"\n\nOctober 21\n\n99.\n\nWriting opposite, with his head down, Ken is startlingly like Lindsay, even his features and stiff curling hair about the thin patching of his crown, the immediate reminding is of Best’s \"Crown of Thorns\" cartoon of Lindsay. Mother’s last letter told of Best’s death of consumption.\n\nAfternoon away to Ailly alone for a walk and a bath, grey clouds and silver lagoons in the valley amid yellow-brown trees wreathed in strands of mist. At the baths two teams of the 6th Bn. from an Australian Rules game: a splendid picture, steam from the showers and bathing men, and about others stripping from blue shorts and close black and red, and purple and red guernseys, men of close knit build, newly marched. Who could paint it: Orpen? Lindsay would splendidly draw it and Johns.\n\nPassed to McCubbin today Bell’s \"Pot Boilers\" and to George E. \"The Title\".\n\nAt Pozieres last May, 17, met El-Banks, he rather defiantly mentioned an engagement with an Irish girl he’d met on leave. Today Harold receiving a letter from him hears of his marriage.\n\nA walk tonight half-way to L’Etoile with H. along the road, with its great shadowing of trees.\n","71":"\n\n100.\n\nA Digger in the Estaminet tonight, \"Give us some Pomme d’Terres!\", and with the air of an ultimatum, \"There’s all \nmy\n French!\"\n\nOctober 23\n\n101\n\nMorning to Cocquerel, and a sketch made of the Church-Chapel and the road swinging round it. Back at Long in Maps, Ken tells of Charlie Mitchell having reply from his printer cousin, so around to the Chateau. For the printing and paper, 300 copies, £5, for the blocks £4, so away to A.D.M.S. and a good yarning with George.\n\nAfternoon away with Harold to Longpre, and from Lofty with the first contrib. of a \"Have one of our Blighties\" add. Rich in Drawings, but damnably poor in articles.\n\nA long morning: early to George E. with Lofty’s note, and another loose yarning: in the afternoon George had been to the Pay Dept. and roped in 75 orders: and while yarning \"Gas\" chips in order 25. Then saw W. Priestly, he is enthusiastic: talking he suggested \"The Heavy Hour\" for title, or the \"Bon Ton\" and Cosmopolitan, but H.H. is really good, so will probably adopt it. Then Geoff suggested following numbers to take as a subject one of the Brigades and further promised rep. articles from each Brigade and a note of his own – probably on \"The German of Today and Yesterday seen by an I.O.\", or a \"Note on Common Sense\", introducing Wilson’s 14 points.\n\nThen to McCubbin’s Billet. Mac had well dined, I heard, so the yarning a general damning of the ‘Anglias’ and a golden rioting with Australia’s future.\n\nHe to design some covers today.\n\nSo probably \"The Dud: Strictly Neutral\" becomes \"The Heavy Hour\", appropriate as stuff is ironically \"The Heavy Hour\" to Bns.\n\n102.\n\nParis dangled in front of me: and much mortal strain following. But I’ll leave Paris till the Opera opens, and stick to the original application for two days Rouen.\n\nRumours of our shortly leaving here, for Le Treport on the Coast: so will try tomorrow for a full day trip to the Abbey church of St. Riquir. Gerrong in Abbeville two days ago, brought back a guide book, \"Peeps into Picardy\" full of photographs of a wounderful Cathedral at St. Riquir dating from the fine period of Gothick. Possibly will go along with McCubbin or Geoff Hankins.\n\n103.\n\nNo mail: payed this afternoon, drawing 42 Francs, so letters to\n","72":"\n\nT.B.C. settlement, and to Beaumonts & Mayhew posted.\n\nA note written to Jim Scott asking for the support of one of his sketches to go by D.R.L.S.\n\nThis Today as an item for \"The Heavy Hour\", \"Outpost\",\n\nPassing clouds haze the grey moons light\n\nAnd White flares arch and die;\n\nMachine Guns chatter away on the right\n\nAnd the winds a cold shuddering sigh\n\nAnd my brain strives wearily towards thought\n\nand dead phantoms pass as the flares arch down:\n\nAnd the grey moon fades, and I am naught\n\nBut two eyes that peer through the dark.\n\nOctober 24\n\n104.\n\nA street of shadows, and and silhouettes against a vague far sky, and the cold paleness of a full moon, and the sound of far voices.\n\nOh the wild wild woodbines\n\nThe cold cold woodbines\n\nAre making a mess of the Hun!\n\n- Laughter and ribaldry \n\non \"Inky Pinky Parley vous\"\n\nThe Aussies are having a – right time\n\nKeeping the Tommies in the line\n\nInky Pinky Parley Vous.\n\n105\n\nMorning away with McCubbin to St. Ricquer , and walking there and back, a long day enjoyed.\n\nA richly ornate Cathedral, a quiet clean little villiage and a day of pale sunlight and clean winds.\n\nHarold back to his unit.\n\nOctober 26, 28\n\n106.\n\nTwo Crest Titles: Boche: ‘Gott Mit Uns\". Tommy \"Aussy’s with us!\"\n\nAnother cold grey day: pass for Rouen forwarded on to Corps. No mail, and a sketch for \"The Heavy Hour\" of Villers Bret. Church ruin: morning at McCubbin’s billet.\n\nA Fire in one of the places in \"G\" and a yarning of old rhum evening – of Estaminet immortal – \"Pig’s life\" of Dranoutre, \"Bully Beef\" of Sailey, and all the other old terrible names.\n\nCapt. Wertheim’s contrib.. a dull jingoist’s jingleistic string of verses – which will pass!\n\nNow the arguings on the Peace Parties of England: damn! I’ll along to discuss trifles with Mac.\n\nOctober 28\n\n107.\n\nAfternoon away to Ailly: awhile watching match between 6th Bn. H.Q. and Brigade, then a Bath and by Lorry back to Long. Morning a blue sky, and the first sun for a week, afternoon silver clouds broken with deep and silver blues, and the valley clear of mists, forests and ploughed ground chequerings of splendid colour and a while through clouds a patch of sunlight would colour to formal lines of fine far away forests and gild clustered haystacks.\n\nMail, first T.B.C. for months.\n\nOctober 29\n\n108.\n\nAn evening spent about a fire, yarning of old rhum issues, with deep mental sighs over the present drought, and of the Divl. Concert Party. The crowd back from Pont Remy, tell of a good show, and recount good tales.\n\nAn item, Monash meets Haig, in Little Lens, two years ‘Apres la Guerre’!\n\nM. \"What! Haig!\" handshake & whisper.\n\nH. \"No! I’m broke myself!\"\n\nM. One thing I often wondered at – how did you get your Austrns. home!\n\nM. \"Oh that was easy! Let me see! First we sent over the 4th Div., they’re all married now and settled down. Then the 5th, they’re good too. Then the 2nd – they’re all over S. Aus. and then of course the 2nd. Quite easy!\n\nH. But, let me see! I thought you had 5 Divisions!\n\nM. (vaguely) Five! Good God! I haven’t relieved the 1st yet!!!\n\n109.\n\nMac to London on leave, so \"The Heavy Hour\" to wait his coming \nback\n home.\n\nYarning with G. two days ago, regretted not having Gilbert’s \"Songs of a Campaign\" – \"it’d make a good item for a review page!\"\n\nG. with a hundred chuckles produced the book: so a long night I spent slaving with no result at a \"review\". Then yesterday the idea came of an Essay note on Ypres – \"The Death of Ypres\", a foolscap page of manuscript completed and the subject is good.\n\nNo mail today: Rouen leave probably 5 to 8 November, D.V. Letter commenced to Mother & one posted to Aunt Louie, so far no letters from her since leave, if Charlie has been killed it will be a most terrible thing for her – but then the lie will never be given to her created legends.\n\nWhisperings in the air of a Dance with the W.A.A.C.s from Pont Remy.\n","73":"\n\n110.\n\nThe sun all day, and afternoon to Ailly, a bath and a haircut at the 6th Bn.\n\nToday another added to the company of the two of the Engineers: a","74":" Bn. S.B. At the baths a week ago singled him from the bathing crowd, and today saw him closely again, in shorts for a practice match, with his tunic on, and on the left arm the white band and the red S.B., there is a keener beauty about his build and his expression is more severe than the loose Engineer.\n","75":"\n\n111.\n\nEvening. A wire from D.H.Q. – Armistice signed on satisfactory terms with Turkey at 1200 today.\n\nThis is Dinkum! – and prisoners taken by the Italians number to 33000, which taken with the last three days rumours of their sueing for Peace seems a tangible sign of her breaking up.\n\nThe afternoon spent on a sketch for \"The Hour\" – \"Romance\" – the old formal Chateau of Villers Bret. Ken handed in his contrib. – a pencil sketch of the Church, Hotel-de-Ville and Lock Gates taken from along the Canal.\n\nMail, a dear letter from Mother, dated","76":"\n\nPass through from Corps, for Rouen leave Nov. 5th-8th, and 60 Francs to do it in.\n\nEnds October with vague rumourings of the line again. North with General Birdwood’s Army.\n\n112.\n\nConversation of Mary Queen of Scots: yarning of Holyrood. Mr. Sorrel recounted the tale of Marie bathing in white wine and milk. \"White wine – that’s vin Blonk Mar!\" and the tragedy of Marie’s extravagance overwhelmed George. No pay drawn last week, the days have been empty of ‘vin Blanc’ – so a blackballing of M’s.\n","77":"\n\n113.\n\nEarly afternoon, a message through from Corps, of Austria having signed a Peace with Italy. Now Germany’s turn comes.\n\nA parcel from home, sox, and a bon cake – and with Cocoa from Comforts issued today, a promised supper tonight.\n\nGeorge tells of a Bayeau arrangement, \"Beaucoup promenade – beaucoup beer – beaucoup coal!\" A sandbag of coal – two buckets of beer, so an encore.\n\nSays a Digger – \"Christ! yesterday Johnno, today Austria – I can see a chap in a week’s time in hospital!\"\n\n114.\n\nA yarning about the fire that turned somehow to Bairnsfather having interpreted warr to a great part of England – that their realisation of war came from his cartoons. Mac & self held the floor against the crowd, who hardly defended his position as an ‘artist’. So a yarning to today’s writers of warr, and the days books of warr, Mac holding nothing has been produced of world value and of permanent interest as a true reflex. But he ignores Masefield’s Gallipoli – Letters of a Soldier – these principally and others,\n\nNovember 1, 2\n\nholding that \nthe\n book of war will not be written till a half centuary has passed, yet even though this is true, it will be merely a compleat book after the school of Carlyle or Prescott – perhaps it may even equal Hugo’s \"Waterloo\" or \"Les Miserables\", yet war will be as soullessly written there, as in old histories, and today’s diaries and journals will be the true reflex. So to a telling of items of a Patrol report.\n\n\"The prisoner would not come. So we brought his papers.\"\n\nOf the bomb slid into a pocket, and of 40 prisoners leaving the line thinning to 30 by supports.\n\nWarr is only temporally realised by those passing through it, and half forgotten after, but for a phantasmorgorical impression of a dream.\n","78":"\n\n115.\n\nMorning, a parade at 9.30, and a march towards Longpre, then to the left, and squad drill for an hour on the flat between the lagoons, a whole Corps on parade, and a band of A.P.M. raiders through the village of the area.\n\nNo Mail.\n\nG. at Midday – \"So Geoff giving you a contrib. for that mag. of yours, Frank! – I’m – if I can read it, too bloody intelligent!\"\n\nNow the rumour of an early move has grown to a certainty: there’ll be big attacks now in the North, and a winter campaign for the A.I.F., and perhaps some more vested insults from Sir Conan Doyle.\n\nThe trip to Rouen a toss-up. Coming down the hill with Mac, a sky of silver and vague misted mauve through multi-ting’d branches of leafless trees.\n","79":"\n\n116.\n\nMidmorning. Mac and Ken still writing, and Ken R. back from Rome leave yesterday monolouging of Italy.\n\n\"It’ll do me on the Italian Front – it’s a bonne Guerre there – Fact! – they hang their washing on the barbed wire, and notices are up \"This part of the river reserved for Austrians bathing! – \"This for Italians.\"\n\nRead till late in the night \"Poems of Today\" and enjoyed the collection, especially Stevensons and Chambers rare piece and columns, more than ever before.\n\nTwo from C.R.A. just away, after a yarning of drawings: one promises some sketches from the Artillery’s side, for \"The Hour\", the other a satire piece.\n","80":"\n\n117.\n\nMorning at 10.30 to a Requiem Mass to the Australian Dead at the Church of Long, celebrated by Monsignor the Bishop of Amiens, with George E. and Mac, in the organ gallery. The – delivered – badly and disappointingly by Padre, and concluding the Mass, from the Cataflaque and its 11th Bn. guard, a short splendid cameo speech from the Bishop.\n\nA Luncheon at the Curie’s house afterwards: Padre Berkeley presented me to him (Bishop) later. A man of wounderful presence, a Prince of the Church, the courtly gentleman, and the splendidly robed Priest.\n\nEvening, and a sudden agony of excitement over the rumour of the Boche surrendering. A rumour only: and a rumour accentuated by a Corps order cancelling the 6th’s move 48 hours.\n\nYesterday the idea of Rouen leave lost.\n\nArrived, reinforcing \"Maps\", Arthur Cox of the 8th Bn. seeming a man after Tom’s and Ken’s hearts, quietly old, with perhaps Ken’s ideas of Art – a medium for the better presenting to others minds of Morality and Ethics. Big issues of Maps in: to be issued.\n\nDamn!\n\nAddress delivered on 4th November 1918, by Monseigneur the Bishop of Amiens in the Church of Long (Somme) in memory of Australian Officers, N.C.O’s and Men fallen on the Battlefield.\n\nMy General, officers, Non-Commissioned Officers and men of the 1st Australian Division.\n\nAfter the words that have fallen but a few moments ago from the Pulpit of Truth, and from the lips of one of your own Chaplains and knowing little of your beautiful language it behoves me to keep silent, but if I gave no utterance to my thoughts as this impressive ceremony is nearing its conclusion I would fail in the fulfilment of a triple duty which my conscience dictates to me that of prayer, that of gratefulness, that of admiration. Duty of prayer for your numerous dead resting in peace in my land of Picardy and on the borders of the Somme.\n\nDuty of gratefulness for the liberation of my Diocese delivered from the enemy’s yoke. Duty of admiration for your heroism which has placed you in the foremost rank amongst the bravest in this unique war.\n\nTogether we have prayed for your dead, and their immortal souls have appeared before God who has judged them. As human praise expires on the brinks of their tombs we are powerless to grant them the Glory which they have a right to. For that reason we supplicate the Lord, in offering him the sacrifice of Jesus Christ to give them a reward worth of their emulation – may He make them perfectly Saintly and Beautiful, that they may have a right, one and all, without delay to an eternal Crown and glorious Immortality.\n\nAs Bishop of Amiens I owe you and your Illustrious Dead my heartfelt thanks because the land of my Diocese has been your Field of Battle and you have delivered it by the sacrifice of your blood.\n\nDuring the painful days of the invasion you have made a rampart of your Breast which you shielded and saved the last shred of my territory. Later, when Victory at last we smile upon our arms the Australian Army distinguished itself by the audacity of its attack, by its utter disregard of Death, by the doggedness as well as by the rapidity of its advances.\n\nIn the name of my Clergy and of my people, I offer you my heartfelt gratitude and admiration.\n\nGentlemen, your Dead were great men and amongst the most Illustrious, because they obeyed the highest inspirations. Why did you leave your far away Australia, because of your sentiments of loyalty towards the British Empire, whose Banner has protected the British and development of your country, its existence, its economic future and its civilisation, for these were in jeopardy as well as the destinies of France. It was necessary to snatch from German Military violence the hegemony of the World, for that reason you left your shores and crossed oceans, for the Honour of your Country and for its future.\n\nIt takes blood to cement the foundation of a country, and you could not refuse it in the World War to the cause of Christianity. You have indeed lavished it with a Saintly generosity and in so doing have written a most glorious page in the history of Australia.\n\nOn the fields of battle far away from your homes, the love of your Country became stronger in your hearts and children who, during the coming centuries will grow up in your homes and schools will learn through your great deeds, the reason of Patriotism. They will not be able to pronounce your names without speaking of the Towns, Villages, Table-lands, Ridges and Valleys of the Somme where you have gathered the laurels of Immortality.\n\nIndissoluble links unite our two Nations; a link of prayer because we will piously keep the Tombs of your heroes, a link of Friendship because the Freedom of my Diocese has cost you so much blood, a link of mutual admiration because the hearts of our soldiers, Australian and French, beat with the same love, with the same enthusiasm for the Saintly Cause whose final triumph will assure the futures and development of our two countries under the eyes of God who has blessed our arms.\n\nNovember 4, 5\n\n118.\n\nTo T.B.C. for Masefield’s two newly announced books – \"St. George The Dragon\" prose, and \"A Poem and Two Plays\", for \"The Adventures of Tyl Ulenspiegel\" newly translated from the Flemish, and a booklet from Beaumonts \"Barbed Wire\" 1\/6. Today’s T.L.S. announces early publishing of Dyson’s book of Warr Drawings.\n\nParcel for posting to Mrs. H., Symon’s book of \"City\" essays.\n\nNovember 5\n\n119.\n\nMorning rain and greyness. On Sunday afternoon – 3rd, to match between Emma Gees and Engineers – yellow guernseys and Blue, multi coloured sox, and vivid green ground, later away along the Canal to Caisens Camp at L’Etoile, nearing it, a great Fijian Corps on the crest of the hill, brown, purple and red, against a grey high sky, and the trees half barren of leaves, and a new carpeting of wet red greatly patched with pale yellow and the blue green of ground ivy, and vagabond winds and slant falling leaves in little clusters.\n\nThe lovliest tree of autumn in the Chateau grounds, a great flame of scarlett and vivid gold, a flame in the sun, and sullen beauty in the rain.\n\nNovember 5, 6\n\n120.\n\nMorning’s rumour of 500 villiages liberated to the French & Belgians, late night’s wire of a big assault progressing favourably.\n\n121.\n\nMail – from C.W.B., \"The Budded Branch\" and \"New Paths\": the works of Nichols printed and produced \nbeautifully\n well, the coloured decorative pieces of A.E. Rice making the pages as beautiful as any I’ve seen. Their New Catalogue announces new works of \"The Russian Ballet and Ballet Plates\". Later will have \"The Golden Cockerel\".\n\nAll day long the rain, grey cloud passing deeply steel blue behind the trees dead of their leaves.\n\nTom back from leave.\n","81":"\n\n122.\n\nReg Little from Davis & Oriole, a Bill!!! And on the strength of moving up tomorrow a pound sent over to C.W.B. for \"The Golden Cockerel\" – to be sent to Mrs. H., and then cometh a wire rumour of the move cancelled 24 hours, allowing the maps to conform with the advance, called for Café et Benediction, and the last 5 F. to George for Vin Blanc!\n\n123.\n\nIn the evening late: a 5 Blank entry. A night spent with one Payne of the 3rd A.S.C. Coy. in the","82":" Coy. A.S.C. in an Estaminet drinking and yarning. Each evening lately, for a while I have gone to the estaminet by the Church, to drink coffee and watch and listen to Emma Gees yarning and drinking. Tonight a half dozen drinks and Payne yarning of Ypres – the time last year and its memories of Hill Five comes and , then of the year before – Flers and Longeval. \"Flewers\" says Payne and half-drunk he confesses. \"I don’t mind telling you Dig, I wasn’t born in Australia, but I was there 9 years before I enlisted, and I’m going back there!\" My reply! \"Too bloody true Dig\", so passes a night yarning with an unknown, who typifying the A.I.F. spirit, arguing to pay for each drink, brings again one of the old Ambulance Rabelaisian nights to life – in a dingy brown room with the monotonous song of rain and sudden showers outside.\n\n\"And so to bed\": Oh Mr. Pepys, I would yarn with you tonight, of the sadness of the years that dull the colour of the candle light on wide shallow glassed champagne – so to bed. Good old Alan Oodle of the lined intricate drawings, and a discovery – the secret of impressionistic liberation – the\n","83":"\n\nrealising of the style James Joyce uses in the \"Portrait of an Artist\" – so to write you must be sad after a lost night of vin blanc drinking, with a hundred pens to write as they pass the million impressions that awake in the mind.\n\nNovember 7\n\n124. 8.30 p.m.\n\nThe day’s been full of rumours: early they started, from Abbeville a whispered word of a Boche Reserve crowd leaving Berlin for the W. Front: at 2 p.m. a wire through – should a German officer bearing the white Flag present himself on the British Front, he was to be received and conducted to D.H.Q.: G.H.Q. were to be notified immediately, and the paper was late: it arrived at 4 – and the heading confirmed the early morning rumour, and at 6 a thin rumour came of a peace signed, it grew and at 7 Abbeville – including the was holding high – an Armistice was signed at 5 p.m. to come into force tomorrow at 3. Tension so high the big Digger rang up Mac at Corps, they’re \"watching and waiting too\".\n\nTo leave Long in the morning, G. and Maps by lorry to St. Souplet – through Amiens, Albert, Bapaume, Cambrai and Le Cateau. In December ’16 across the long Flers valley we watched the two towers of Bapaume. In April 17 we could see from the hill by Hermies the Town of Cambrai.\n\nPassed down towards Longpre, a company band led by the","84":" in the half light of the night, and the people of Long flocked out, exited and happy. We watched them from the Balcony of the Mairie.\n\nSt. Souplet\n\nNovember 9\n\n125.\n\nRain from Cambrai to Le Cateau and in the dark arrived at St. Souplet. G.Q. and Maps in a great cold stone floored room, once an old Boche Hospital (?).\n\n126.\n\nEvening: and a half dozen yarning in a semi-circle about a fire built in a high copper like fitting in the room’s centre, while outside the drone of passing squadrons, and a keen frost in the air. Tonight the 2nd Brig. to go into line: possibilities of a stunt close following into the retreating Boche. Word is good of advancing on all fronts, though today no wires have come through. Outside a Tommy Sig. Officer, the Bulletin of some splendid stage managing of resolution and rebel demands in Germany – all to back for England’s Peace\n","85":"\n\nParty, Germany’s apparently honourable desire for peace. A reply from Foch has gone to Germany, for acceptance of his terms by 8 a.m., Monday.\n\nIn the afternoon walking about St. Souplet with Mac and Arthur and Blink. Civilians, for the most part old men and women, though there are others occupy, the compleation of the villiage’s warr’d houses. This retreat was hasty: in the churchyard his new graves with the bodies barely earth covered lie open, their hasty name boards by the hole: in one grave a coffin with neither earth nor covering. Three new A.I.F. graves – two of the 115 H. Bty. and one of the 113rd.\n\nTome is reading \"The Cloister and the Hearth\", the first English novel I’ve seen him tackle: all his other readings have been old French novels, and Boche captured phamplets.\n","86":"\n\n127.\n\nLast night came rumour again, and early this morning confirmation at 11 a.m., hostilities cease, no fraternisation, and the line reached to be fortified and held. So far the Brigades have not taken over any front: the move will probably be tomorrow: we to Asvesnes as H.Q.\n","87":"\n\n128.\n\nAsvesnes cut out! and so to Long. Mail in tonight, a great woolly muffler from Grandma, expected from last month’s mail from Mother.\n\nTonight to finish an impromptu whisky-celebration.\n\nThe reading finished today of Ian Hay’s \"Knight on Wheels\" – a whimsical light yarn of invention and love.\n\nNovember 12\n\n129.\n\nMorning, back from St. Martin, while there waiting for dinner, some notes on trip from Long to St. Souplet.\n\nAmiens midday, and an awakening city, workmen about the station repairing walls and jagged roofings: trains in the yards and about the station and a crowd newly arrived invading: and lines of Gharries waiting, shops opening and civilian traffick with military. Arrived the day’s French Paper, and with its news, great excitement laughing, the ‘Daily Mail’ followed, then drinks.\n\nAlbert passed and Pozieres: and the old Pozieres-Maulte line blown away and a heaping of distorted and fantastick iron, with burnt out frameworks of an old train crowning the mound. Passing the Cemetary on the Left side, small evenly ranged crosses still compleat, and crowning all the 4th Bn. cross and the\n\nNovember 12\n\n1st Div. in the cement basing, with a shrapnel shell’s packing, and one of its struts loosened.\n\nBapaume’s old ruin dead of ghosts, quiet in the greyness of the day.\n\nIn the dark through Cambrai, and against the deep of the sky, black silhouette of tall chimneys and high buildings, with yellow unsecured windows, passing headlights of motors shew walls jagged by shells, and comfortable whole homes and tall windows heavily curtained.\n\nCurses loud and deep from a Tommy Artillery Capt. on the Albert-Bapaume Road. We held the road’s centre, and in a Ford he tried to pass us: the lorry swerved and beat him back, curses to pull the lorrie’s wire to the driver – and the wire was missing! Twice he nearly passed us & twice we beat him back – then his rush – \"Get out of the Damn way!\" half past, and an helicon blow out!\n\nColdly and without emotion we left him, cursing scarlettly standing in the then rain while a tyre was warr’d on by his driver.\n\n130.\n\nA \"Billy Book\" of Low’s Cartoons of Hughes arrived with yesterday’s mail. -- ?\n","88":"\n\n131.\n\nMorning along to St. Martin and on the roads mending and repairing, all England Labour Corps – dull unlovely marionettes without life or vitality, and in the afternoon, endlessly passing to water their heavy draught horses I watched a crowd of the R.G.A. and on splendid mounts they were still the dull brothers of the old Labour men.\n\nTomorrow or the day following to Bohain to entrain: says rumour, to the Rhine! No!! to Marseille to enship!!! Damn! we are as in a dream, afraid to awake and wonder on the long strung-out transports and the Ocean winds for the South. So we sleep instead, and pass the tale along of the Crown Prince’s assassignation !\n\nCold, and a smoke barrage up!\n\nNovember 13\n\n132.\n\nA great sky of clear blue, hazed about the horizon, a full sun and over the hill slow winds. Morning met a French lad of 14, salving about old trenches, and whistling awhile the Marseillaise: and a morning about the hills with him to old M.G. possies, to the tune of his laughter and quick talk. He was France, but without the blue Porter’s\n","89":"\n\ncap and trousers, instead he wore old ragged trousers, and a newly torn military shirt, Boche boots and a tight woollen cap. I asked him if he spoke German, and his blue eyes laughed to a happy \"Non m’sieur! Boche? Non m’sieur.\"\n\nTomorrow to Bohain and a hundred rumours of Garrison work on the Rhine!\n\nNo mail today!\n","90":"\n\nBohain\n\n133.\n\nBut they won’t believe, and perhaps it is as well: Barbusse has written ‘warr’ stories of its red trappings, naked and terrible in the mud and the night. \"Under Fire\" read tonight by a hot good fire in a comfortably warm’d room, read to the end of \"The \nRelief\n Return\" in a growing wonder at its dull truth. \"I’ve killed 20 of them in the candle\" he grouts; \"in the big dug-out by the tunnel, mon vieux, there are some like crumbs of metal bread.\"\n\nVigil was with them too: his body wasn’t touched, but they found him with his head completely flattened out, flat as a pancake, and huge – as big as \nthat\n. And the staff! God but its true –\n\n\"The liberal professions are not represented among those around me, some teachers are subalterns in the Coy. or Red Cross men. In the Regt. a Marist Brother is Sergt. in the Service de Sante: a professional tenor is cyclist despatch rider to the Major: \"a gentleman of independent means\", is Mess Corp. to the C.H.R. But here there is nothing of all that, we are fighting men, we others, and we include hardly any intellectuals, a man of the Arts or of wealth, its during the war we’ll have risked their faces only at the loopholes, unless in passing by, or under gold laced caps.\"\n\nBut there comes to mind the great exception – Alan Seeger, and the artist of \"Letters of a Soldier\", and one Arnold Drysdale Savage!\n\nNovember 15\n\n134.\n\nThree days following of an early spring sun and skies. Morning looking for some sketch to make, but the only beauty of Bohain is the men crowding the streets and two squares, and billetted along whole rows of whole houses. A long flowing along all the streets of the A.I.F. and sprinklings of Tommies and Jacks, a great two-up school where a bomb wrecked building has been cleared away, by the stone skeleton of the burnt Mairie, and a hundred groups yarning, changing and passing each second.\n\nThe Beauty of these villiages of France, is rarely in\n","91":"\n\ntheir churches, Mairies or big Chateaus: but it quietly and unconsciously survives in the colours of their tiled and slated roofs, and the long ragged perspective of brick and stone gables, highly pitched roofs, and mild colouring of weather stained and sunned tiles. Bohain’s church is a great high and wide brick and stone and cemented building, splendidly wide and high in the nave and compleated by a great circling apse, but as soulless as a Joe Gardner’s factory or store. Now hundreds of France’s flags cluster about the altar, & decorate the nave and aisles: candles burn before side altars, and great bunches of fresh flowers are everywhere.\n\nMail today, two from Mother, one from Betty, and a note from Angus, and I’ll have the Lindsay Book and Hilders and \"Art in Australia\".\n\nMother on \"Ghutz\"\n\n\"Dear but what a funny name! so greedy!\" and Bett on Bapaume Hotel de Ville,\n\n\"What a lovely Hotel.\"\n","92":"\n\n135.\n\nCold day: payed, T.B.C. Boyd’s \"Salvage\" & Post. Swinburne.\n","93":"\n\n136.\n\nBack from \"The Sentimental Bloke\" opening show with Maurie B.: a good show and an evening enjoyed.\n\nA cold crisp night and a moon lit clouded sky: in the small narrow streets, the flickering frozen candle points of yellow and great shadows and crowds about small tables, and along the roads a tide of men yarning and laughing, broken whistled bars of \"Chu Chin Chou\", and shouted names ringing with the iron of shod boots on the ragged cobbles.\n\nYesterday a note via the Ambulance from Aussy of a coming Christmas No. and doubled prizes. Will send in a verse and sketch of George’s, \"What is a Brasserie Dig!\" \n\nMortimer coming back for the advance on the Rhine stunt, if the railways clear by the","94":" the marching will be cut out. Our objective between Cologne and Coblenz.\n\nPosted home Boyd’s \"Salvage\", Louis Hughes book and \"New Paths\".\n\nToday arrived four Diggers from a Boche prison camp, ragged in their old uniforms, weak, with a terrible quietness in their manner and yarning.\n\nIn the Aussy Y.M.C.A. Reading room, a dozen Diggers, a great fire, and about it Bohain’s ragged Kiddies. It was by Poublot!\n","95":"\n\n137.\n\nCompleated printing of the Bishop of Amiens speech after the Requiem Mass at Long on Nov. 4, for records, to be signed.\n\nWrote to T.B.C. for new sketch book, pencils, Deutsch book, and ‘Sappho’ from Florentine Press. Posted to Aussy verse and sketch. Christmas cards to home, and letter to Mayhew.\n\nMoving day after tomorrow – for Asvesnes.\n","96":"\n\n138.\n\nAll the morning the sun: and I dotted the I’s and squared the capitals of the Bishop’s address, in the afternoon out, and a great mist clouded the streets – a cold grey deep mist that hid the sun. Met Urn by H.Q. and a yarning with him.\n\nA night about the fire, Mortimer yarning of his listening post experience: then Mac on Lady Diana Manners to Maurie and self, and so to bed. No mail.\n\nNovember 21\n\n139.\n\nAfternoon to M.G. H.Q. and 3rd Bde.: their oil is good – of our not moving to Germany – Belgium our objective. Billy Hughes is dead , and has had a row with Monash, and meeting Rube Palmer by the Mairie, hear of the vile plot to dump the A.I.F. fifty miles up, in \"No Man’s Land\". Mac explains this,\n\n\"Son – if Germany jibs at the signing, well they’ll just turn around and say – ‘Y’ won’t? Right! Come, on Doug,\" will say Foch – \"we’ll bring the Aussies up and Fritz von ‘ll sign anything.\n\nNovember 23\n\nCartignies\n\n140.\n\n‘Maps’ in a building on their own, a great square, low ceilin’d room, three casement windows opening on the Grand Place: G opposite and Q away in the corner. Old beds, straw, and a good fireplace.\n\nBohain left early after the 2nd Brigade and Cartignies reached early in the afternoon.\n\nThis morning Batt. following Battalion the whole of the","97":" Bde. have marched through the square. The General came out from his Billet and took the salute alone. It is great to watch as the troops pass, the groups of French and Belgian civilians, and to watch their faces and gestures. Two of Poublot’s kiddies invaded Maps windows to throw kisses with most exquisite charm. Then they begged cigarettes for papa, and danced for pennies as for sovereigns.\n\nThe Ambulance passed, and yarned awhile with Addy and some others: the unit seems new, with the old men in the transport and tent sub.\n\n141.\n\nA dream: an hour to dress, and the first changing to old clothes after the war, a dark grey suit, & in place of the old black knitted tie, a navy blue, and a blue silk handkerchief worn in the sleeve, 2 oclock and I’d to meet Mr. Thompson at some theatre, and already half an\n\nNovember 23\n\nhour late, in a hotel marble vestibule, a meeting with Clive Goyder – the first chap I’d met since coming home, and a yarning with him of lost Rouen leave, and his last Blighty. Meeting across some green Miss Sharpe & Sybil, and then talking of a Benediction Rhum punch they had ready, and to prove the presence of the Benediction they pointed down a muddy road by Flers to where two urchins played ball with the empty bottle.\n\nStrangely this afternoon coming from Asvesnes met Clive F. At a small Café there, cocoa with Eric, Mac and two Pioneers. Eric tells of our destination - Louvain!\n\nNovember 24\n\n142.\n\nTwo bullocks, rope rein driven, drawing a long limbering wagon, drawing in its turn a small convoy of push carts & wheeled boxes, and a trailing party of all-aged people, the women in black shawls and all assorted dresses, and the men & boys in Khaki, blue porter caps, and old rolled mufflers, and propped amongst some tumbled gear and straw in the long wagon, two old old women epitomising the whole tragedy of war.\n\nAnd then \npassed\n past them as they drew into the square, the 10th Batt., with a bravely borne colour standard and a full band playing.\n","98":"\n\nThe 2nd Bde. through in the morning and in the afternoon the 3rd. Billetted above us a party of the","99":" Batt., in the dirty cold attic, and below in the tiled small rooms.\n\nA mail of a single letter form Aunt Louie: from sheer genius she posted some months ago the Moore book and a cake – addressed to ‘Maps’ A.I.F.\n","100":"\n\nSolre-le-Chateau\n\n143.\n\nMidday arrived at out Billet for a week in the Grand Place of Solre, the","101":" Bde. following, marching straight to the lovely old turretted tower that stands full in the road’s centre, where it turns towards Beaumont.\n\nMail – Invoice from T.B.C. for ‘Legend of Tyl ’ and \"Barbed Wire\".\n","102":"\n\n144.\n\nA sketch, commenced yesterday, completed this afternoon of the Mairie, the fine old tower, and the lorries of the square.\n\nThe Grand Place a great school of lorries, with a workshop established in the centre, a lathe and tool shop in the bandstand.\n\nLast night yarn around the fire, of the certainty of the building being mined! .. tonight with Geoff from C.R.E. of The South Sea Battle, and later of Gold Mines and Mining.\n\nMail, still no T.L.S. and one letter from Mrs. H.\n\nTonight we billet ourselves in the top floor of the bay we’re working in. A grey day.\n","103":"\n\n145.\n\nA grey rain mist in the morning, and in the early afternoon a pale sun and a blue thin clouded sky: and in the rare sunlight, the colours of the old masonry of the tower, and the slating of its turrets and dormer broken spine richly diverse and beautiful. Basil B. hears from some local ancient that it is of the 15 cent. and of Spanish design. But it is purely Flemish – a strongly built tower, richly and fantastically turretted.\n\nThe Church itself is disappointing where a comely beauty is expected, dull gilded Rococco altars and badly coloured Plaster saints cluster in the cold shadows, and stare vacantly at the crudely glassed windows. All its beauty is the tower, and for all its fantasy, the old Church of St. Vaast of Bailleul more directly appeals.\n\nTo the Ambulance this morning, and met there Jimmy Stanger – Adjt. of the 3rd. Jimmy greeted me as ‘Pat’ and I’d almost forgotten the name was mine – was in a hurry but shewed me his room with the crush around tonight. \"Will y’ have a glass of wine?\" – his batman’s a good soldier tho’, and the bottle was empty.\n\nAfterwards down to where Solve’s station was & where the mangled steel framework of broken trucks line the long strung ditch where the line was once: shells and parts of shells of all calibres, and long shell baskets litter the yard amongst the tangled ruin of a hundred trucks. Seemingly one end of an ammunition train has been mined, which has set off each truck along the whole line. The papers report two of Brussels station going up in the same way – with no notification from the Boche of the mine prisons.\n\n146.\n\nTonight’s rumour: By February 1919, all 1915 men will be in transport for home. This week a report is to go through of all men of the first six months of 15.\n\nNo mail: letters written to T.B.C. and to Aunt Louie: asked her to send me Morris’s \"The Hollow Land\" and Stephen’s \"Hill of Vision\".\n\nNovember 28.\n\n146.\n\nRain mists and rain all the day. Tonight with K. to the Sent. Blokes showing in the hall on the second floor of the Mairie by the Tower. No show: no Concert Party shew, but an impromptu programme by the diggers with no lights but the moving ends of cigarettes and the occasional flare of a match. For a while choruses, ending in \"The Good Ship Yakky, Yakky d’la! Then the lights, and again darkness. Cat calls and mild\n","104":"\n\nwit, and great following waves of laughter. Then some officers left. \"Fall in the Officers!\" Quick March!! \"Anzac you’re forcing me!\" ending in a protesting shriek: some more officers leave. \"Carry on Serg. Major!\" and \"Pack all your troubles\".\n\nSo back to H.Q. and a sweating on mail! Leave Solre within the next four days, for some great Chateau (that is more magnificent after each whisper) 10 kilos from Charleroi.\n","105":"\n\n147.\n\nMorning to Beaumont. A lorry caught just outside the villiage to near Leugnies, and a walk of about 3 kilos across the valley of the Hantes to the villiage. An ordinary little villiage built on the hill, narrow stepped cobble streets, gaily behung with great Black gold and red flags. Coffee with a Pioneer, then alone to the old Tower gateway through the walls to the South of the town overlooking the Hantes. A shell ruin, with staircase to the top still solid, and in the shell four or five old fire places with traces about of old carving and tracing. So on the way to Solre again and a lorry picked up by Grandrice by the Border. In it two Belgian lads, thick-set Brown skinned pagans, with wonderfully impressioned eyes.\n\nGeorge across this afternoon and yarning of Charleroi, and Namur and Brussels. Our next possy at Presles, near Chatelet.\n","106":"\n\n148.\n\nRumours: our final objective Cologne. Billy Hughes has accepted an offer from Japan to transport within four months of peace signing, the whole A.I.F. and the King is to pass Solre tomorrow!\n\nAfternoon to C.R.A. and yarning with one of the draftsmen, a yarning of places and drawings, and subjects and Lindsay and the Australians – the last subject from a notice in the Nov. 26 \"Times\" of a Dominion exhibition at the Burlington House.\n\n\"What we all hope is that Australia, Canada, N.Z. and S.A. will each in turn have a distinctive Art of its own. The Colony which becomes a Dominion must also become a society, a civilization, with its own ways of thinking and feeling, and these must express themselves in Art & in Literature.\"\n\nAnd this in the face of an actual proof of a national and most individualistic difference – a proof over three years – of the vast differences between the various dominions and the English troops. It was the Times L.S.’s cry that Leon Gellert was nearer akin to the American\n","107":"\n\nAlan Seeger (I forget the exact sentence ending bit) then to the English Subaltern Poet, they complained of his \"luminosity\" and of his treatment of his subject.\n\nAnd the prose – the prose of the expressed pious hope in a patronising manner will remain England’s attitude towards the Dominions, perhaps till Wilson delivers his interpretation of \"The Freedom of the Seas\".\n\nC.R.A.’s billet a finely designed modern house, deliberately despoiled by the Boche, panelling torn out and door architecture, doors wrenched, and carved marble mantles fire blackened and chipp’d.\n\nA cold bitter dull day.\n\nCabled today for £15 against the thin chance of a leave to Brussels and Antwerp.\n\n149.\n","108":"\n\nSolre le Chateau\n\nA cold grey afternoon, snow seeming near.\n\nAn hour ago the men of the first two months of 1915 drawn up in the square, then marched away towards the Station end of the town. A while later they returned without their packs.\n\nTom left midday, for Bohain, and so to England.\n","109":"\n\n150.\n\nA grey woven sky and no sun. Awhile in the morning and in the afternoon to the hedged fields across from Solre, to where the Brigade have their football field. Playing both in the morning and afternoon, teams of the 3rd and 2nd – the third in white underpant drawers and guernseys and the 2nd in blue shorts and green and purple.\n\nAfternoon game I watched for an hour, one of the 3rd forwards – Hill, from N.Z.: he recalled the beauty of Jake Hines, but finer in his build and more nervely muscled, he’s awakened again the wondering over .\n\nMorning, coming down the road over the hill, a Digger, a great horse, and a girl, she was modelled and painted by Rubens: she wore only a white woollen sweater, a white woollen cap and tight breeches and canvas leggings, she was as splendidly vital animal I’ve seen – so superbly built as a Flemish plough mare.\n\nStill no T.B.C. parcel or T.L.S., only a note from Harris – of Aussy – of thanks for V.B. sketch of the church tower ruin: no mention of the verse or joke drawing.\n\nLast night a celebration – Rhum hot and Port Wine!\n\nDecember 3, 4\n\n151.\n\nAfternoon in the blown fine rain, to the Bois de Madame – a forest on a hill of sullen purples and deep shadows.\n\nFrom T.B.C. \"Barbed Wire\" & \"Tyl Ulenspiegel\", ¼ read, and all enjoyed. Wrote for \"Principles of Planning Builds\" and Barrie’s book of playlets.\n","110":"\n\n152.\n\nFirst teams of the 2nd and 3rd Batts. played this afternoon, in a vile field, mudded from two games played there in the morning, and in a grey cold mist. A solid game from beginning to end, and two teams well matched. The 3rd game, 3-0, with four of their balls forced by the","111":"\n","112":"\n\n153.\n\nInfluenza, or some damned break up. This afternoon to the field, but only ragged teams, into Coy. & Batt. games.\n","113":"\n\n154.\n\n11.30 a.m. Andy Betts in a while ago, tells of Charleroi – \"Oh, a bloody lovely place – a second Paris, and bigger than Amiens – and women! I had five and the bonniest little piece ever! – an’ gin and cream puffs and every bloody thing!\"\n\nThis and more, answering my, \"What sort of a city is it?\" \n\nNo definite date for moving, but probably about 11th.\n\nMail on","114":" from Mother, receipt and catalogue from Davis & Oriole, and from T.B.C. letter answered and posted this morning asked for Country Life book of monuments and memorials.\n\nGrey and misty, and the square crowded about with the Division’s last move.\n\nDecember 9\n\n155.\n\nYesterday clear colour skies and a sun: today a greyness over all. Yesterday morning with Arthur C. to Sivry, where the 13th Bde. are billetted: in the afternoon with Ken to the 1st Bn. ground, there the game was against the Engineers, the Engineers game. Kempsey of the 1st played a great game. (Remember him with Jake, and R. Binney of the 2nd F. Coy. E.)\n\n154.\n\nStanding by the mantle two letters written, to Aunt Louie and Heffer of Cambridge for Catalogue. Afternoon with George B., Andy and George to","115":" Batt.’s ground where they played the","116":" the 9th’s game.\n\nMail, from Aunt L., Morris’s \"Hollow Land\" & Stephen’s \"Hill of Vision\" and T.L.S.\n\nMet Toby at the ground and Bill F. and others, Frank at the Ambulance after.\n\nFrank S. back from an Eng. leave spent half in Dublin and Killarney, tells of a great holiday, charming people, and Killarney as an experience in Green.\n\nMac finished reading Tyl Ulenspiegel. I’ll post it home, a bonser book and I’ll watch for De Coster!\n","117":"\n\n155.\n\nMorning’s spent wondering on dinner – cold meat and potatoes: afternoon waiting mail, then tea: and then three hours dwelling on bed. Days that were wasting, that are leaving deepening sediments of boredom over our lives.\n\nToday, dull and raining: payed: no mail: and three hours to bed!\n\nLetters posted this afternoon to Kensington School of Art and Liverpool University of Architecture. Morning, from the newly arrived Divisional Educational O. and hear from him, that if application is made for a six months course at one of England’s schools, there is a good possibility of leave being granted, and the course payed for.\n\nLater, a four page letter written to Mat – and burnt! built the fire up and mooded by it, till I remembered the pictures in the Mairie, so across with Arthur, and a Bath amongst Battalion men, and a boredom lost. The same programme as of three nights ago, but a house audience of diggers and Flemings.\n","118":"\n\n156.\n\nFor five minutes in the early afternoon, through the gray tumbling cloud sky, a lovely honey-coloured light over the square, bathing in a faint gold the tower and the close narrow houses, then grayness again, and across the empty playing fields a blown rain haze in great smokey gusts.\n","119":"\n\n157.\n\nInterminable rain: yesterday in a haze and on a field of mud the third played the fourth, 11-0. Today all practices and games off.\n\nMail, an old parcel from home. A week since, and with two exceptions \"Q\" staff changed, new men from Batt. and one from the 2nd F. Coy Engineers. Met him going to cookhouse, and remembered him then as an old Grammarian from the ‘shell’, a short yarning yesterday: he’s a type to cultivate.\n\nYarning with George C. tonight, he tells of G.H.Q. forbidding Miss C. Rout her work in Paris and threatening her hotel ‘out of bounds’ and a placing there of a M.P. guard. So turns the damnable machine of England’s Army people, on the one woman who has grappled rationally with the V.D. problem. The Army’s idea of wiping out V.D. is to install at H.Q. Barracks a Blue Light Establishment, and a dull M.O. who dully ‘lectures’ incoming troops with statistics of the cities rottenness.\n","120":"\n\n188.\n\n‘Maps’ packed for moving tomorrow morning: Maps G and Q for Presles wether in the villiage or in the Chateau a kilo from it there’s no certainty, tho’ chances are against the villiage.\n\nBlue patches through the\n\nDecember 14\n\ngreat cloudy sky, and away from Solre, a clear light over the countryside, and sudden patchings of a golden colour over far hedged fields, the Brigade moves tomorrow, so no football.\n\nMail, a brief note from A.I.F. Educational H.Q. of no information, and from Corps – Aussy – a note from Harris asking for a sketch about the verse I sent in from Bohain.\n\nGeorge B. today promoted – Serg. to Educational Officer! Ken R., Staff Sgt. in charge of G. and Bill A. Staff Sgt. Q., Kirchler and Larry Corps, and ‘Maps’ still remains modestly in the background as four privates.\n\nTo finish the evening, to the Pictures, there a few days back, one \"For France\" – a bon piece of unintentional satire. The scene on the Meuse, and in the nick of time arrives to save from the an Artist’s daughter and her Murkan F.C. lover, a squadron of Tommies. \"We have been looking all day for our Corps\" notes the screen! So Mamle. invites the officers to Dinner, and the screen shivered into, \"We have not tasted a hot meal since Mons!\" But an amusing picture, and a great audience.\n\nDecember 15\n\n189.\n\nMove cancelled last night. From Corps ref. 4th Army G.T.\/130 of 9th – re attachments to Managing and operating staff of 353 F & M Coy – and attached as a list of attachments for","121":" Div. includes 14 O.R. and 2 O., 1 O. as Foundry Manager, 1 O. as Chief Costs Engineer, O.R. to fill insignificant position – providing, \"In the selection of candidates only skilled staff and work hands will be considered\". Vacancies in the Drawing Office are two – for two officers.\n\nSuch is their bloody Educational Scheme!\n\nThe Corps News sheet 10 in tonight prints a Commonwealth Cable on Demobilisation:\n\nThe troops will return as units under their own officers. The Battalions, regiments and batteries will be divided into halves, the first-coming half containing as many men as possible meriting preferential treatment according to the priority list, as follows:-\n\nFirstly, married soldiers, with preference according to the number of their children, length of service, and guaranteed employment in Australia: secondly, single soldiers of long service, with guaranteed employment; thirdly, other single men according to length of service. Commonwealth Cable.\n\nWhat an orgy of sentiment and flag wagging and tearing emotion they’ll give to the people of Australia – what a noble sight \"these damned Soldiers\" will make for the people, and how grateful they’ll be at our reception!\n\nThe whole bearing and attitude of\n\nDecember 15\n\nauthority seems now to break compleately the A.I.F. spirit, and to so establish their position that militarism will be stronger after than ever before. Already Monash is responsible to two parties in Australia – and so the third with his Generals and officers he’ll establish a party stronger than either!\n\nAnd in the meantime screed after screed follows on the possibilities of Education in the A.I.F., and nothing is done – beyond promotion!\n\nAll the day on a large scale map of the ‘Waterloo’ Battle field, and Mons, finely drawing in a Namur sheet from an old Belgian Geological Map. And Tourist Officer came in for ‘Brussels’ sheet, and in sudden bursts of Democratic confidences, tell of visits to the field were detailing and of a great mound monument, built from earth from the battle field, and splendidly crowned by a Lion.\n\nThey should read their Hugo!\n","122":"\n\nThe day dull, and the Brigade away later in the morning.\n","123":"\n\n190.\n\nYesterday afternoon through the Bois de Reumont with K., a splendid sky of great blue gray and purple smoke clouds, and patching of dull amber and pale primrose: and from the hill above the Forest, a wounderful impression of a purple shrub and an auburn undergrowth, and one bare brown group of dead colourless trees, and back towards Solre, a fresh cold wind that demanded nakedness to appreciate it.\n\nMail – yesterday’s and today’s, a plausible note from that most inefficient firm the T.B.C.\n\nTonight two of Ken’s friends from the 24th Batt. in, and a good evening spent generally yarning. Today the 6th Brigade arrived on their way to new areas: early the","124":" marched through.\n\nThe plans of Waterloo compleated, and the great map away: so printed out the ‘Song’ back from \"Aussy\" ready now for posting tomorrow.\n\nWoods, back with \"Tubby\" from Boulogne brings towards \"Maps\" G. and\n\n"}}