{"Document Name":{"0":"Diary_0245","1":"Diary_0245","2":"Diary_0245","3":"Diary_0245","4":"Diary_0245","5":"Diary_0245","6":"Diary_0245","7":"Diary_0245","8":"Diary_0245","9":"Diary_0245","10":"Diary_0245","11":"Diary_0245","12":"Diary_0245","13":"Diary_0245","14":"Diary_0245","15":"Diary_0245","16":"Diary_0245","17":"Diary_0245","18":"Diary_0245","19":"Diary_0245","20":"Diary_0245","21":"Diary_0245","22":"Diary_0245","23":"Diary_0245","24":"Diary_0245","25":"Diary_0245","26":"Diary_0245","27":"Diary_0245","28":"Diary_0245","29":"Diary_0245","30":"Diary_0245","31":"Diary_0245","32":"Diary_0245","33":"Diary_0245","34":"Diary_0245","35":"Diary_0245","36":"Diary_0245","37":"Diary_0245","38":"Diary_0245","39":"Diary_0245","40":"Diary_0245","41":"Diary_0245","42":"Diary_0245","43":"Diary_0245","44":"Diary_0245","45":"Diary_0245","46":"Diary_0245","47":"Diary_0245","48":"Diary_0245","49":"Diary_0245","50":"Diary_0245","51":"Diary_0245","52":"Diary_0245","53":"Diary_0245","54":"Diary_0245","55":"Diary_0245","56":"Diary_0245","57":"Diary_0245","58":"Diary_0245","59":"Diary_0245","60":"Diary_0245","61":"Diary_0245","62":"Diary_0245","63":"Diary_0245","64":"Diary_0245","65":"Diary_0245","66":"Diary_0245","67":"Diary_0245","68":"Diary_0245","69":"Diary_0245","70":"Diary_0245","71":"Diary_0245","72":"Diary_0245","73":"Diary_0245","74":"Diary_0245","75":"Diary_0245","76":"Diary_0245","77":"Diary_0245","78":"Diary_0245","79":"Diary_0245","80":"Diary_0245","81":"Diary_0245","82":"Diary_0245","83":"Diary_0245","84":"Diary_0245","85":"Diary_0245","86":"Diary_0245","87":"Diary_0245","88":"Diary_0245","89":"Diary_0245","90":"Diary_0245","91":"Diary_0245","92":"Diary_0245","93":"Diary_0245","94":"Diary_0245","95":"Diary_0245","96":"Diary_0245","97":"Diary_0245","98":"Diary_0245","99":"Diary_0245","100":"Diary_0245","101":"Diary_0245","102":"Diary_0245","103":"Diary_0245","104":"Diary_0245","105":"Diary_0245","106":"Diary_0245","107":"Diary_0245","108":"Diary_0245","109":"Diary_0245","110":"Diary_0245","111":"Diary_0245","112":"Diary_0245","113":"Diary_0245","114":"Diary_0245","115":"Diary_0245","116":"Diary_0245","117":"Diary_0245","118":"Diary_0245","119":"Diary_0245","120":"Diary_0245","121":"Diary_0245","122":"Diary_0245","123":"Diary_0245","124":"Diary_0245","125":"Diary_0245","126":"Diary_0245","127":"Diary_0245","128":"Diary_0245","129":"Diary_0245","130":"Diary_0245","131":"Diary_0245","132":"Diary_0245","133":"Diary_0245","134":"Diary_0245","135":"Diary_0245","136":"Diary_0245","137":"Diary_0245","138":"Diary_0245","139":"Diary_0245","140":"Diary_0245","141":"Diary_0245","142":"Diary_0245","143":"Diary_0245","144":"Diary_0245","145":"Diary_0245","146":"Diary_0245","147":"Diary_0245","148":"Diary_0245","149":"Diary_0245","150":"Diary_0245","151":"Diary_0245","152":"Diary_0245","153":"Diary_0245","154":"Diary_0245","155":"Diary_0245","156":"Diary_0245","157":"Diary_0245","158":"Diary_0245","159":"Diary_0245","160":"Diary_0245","161":"Diary_0245","162":"Diary_0245","163":"Diary_0245","164":"Diary_0245","165":"Diary_0245","166":"Diary_0245","167":"Diary_0245","168":"Diary_0245","169":"Diary_0245","170":"Diary_0245","171":"Diary_0245","172":"Diary_0245","173":"Diary_0245","174":"Diary_0245","175":"Diary_0245","176":"Diary_0245","177":"Diary_0245","178":"Diary_0245","179":"Diary_0245","180":"Diary_0245"},"Date":{"0":"unknown","1":894.0,"2":895.0,"3":896.0,"4":897.0,"5":898.0,"6":899.0,"7":900.0,"8":901.0,"9":902.0,"10":903.0,"11":904.0,"12":905.0,"13":906.0,"14":907.0,"15":908.0,"16":909.0,"17":910.0,"18":911.0,"19":912.0,"20":913.0,"21":914.0,"22":915.0,"23":916.0,"24":917.0,"25":918.0,"26":919.0,"27":920.0,"28":921.0,"29":922.0,"30":923.0,"31":924.0,"32":925.0,"33":926.0,"34":927.0,"35":928.0,"36":930.0,"37":931.0,"38":932.0,"39":933.0,"40":934.0,"41":935.0,"42":936.0,"43":937.0,"44":938.0,"45":939.0,"46":940.0,"47":941.0,"48":942.0,"49":943.0,"50":944.0,"51":945.0,"52":946.0,"53":947.0,"54":948.0,"55":949.0,"56":950.0,"57":951.0,"58":952.0,"59":953.0,"60":954.0,"61":955.0,"62":956.0,"63":957.0,"64":958.0,"65":959.0,"66":960.0,"67":961.0,"68":962.0,"69":963.0,"70":964.0,"71":965.0,"72":966.0,"73":967.0,"74":968.0,"75":969.0,"76":970.0,"77":971.0,"78":972.0,"79":973.0,"80":974.0,"81":975.0,"82":976.0,"83":977.0,"84":978.0,"85":979.0,"86":980.0,"87":981.0,"88":982.0,"89":983.0,"90":984.0,"91":985.0,"92":986.0,"93":987.0,"94":988.0,"95":989.0,"96":990.0,"97":991.0,"98":992.0,"99":993.0,"100":994.0,"101":995.0,"102":996.0,"103":997.0,"104":998.0,"105":999.0,"106":1000.0,"107":1001.0,"108":1002.0,"109":1003.0,"110":1004.0,"111":1005.0,"112":1006.0,"113":1007.0,"114":1008.0,"115":1009.0,"116":1010.0,"117":1011.0,"118":1012.0,"119":1013.0,"120":1014.0,"121":1015.0,"122":1016.0,"123":1017.0,"124":1018.0,"125":1019.0,"126":1020.0,"127":1021.0,"128":1023.0,"129":1024.0,"130":1025.0,"131":1026.0,"132":1027.0,"133":1028.0,"134":1029.0,"135":1030.0,"136":1031.0,"137":1032.0,"138":1033.0,"139":1034.0,"140":1035.0,"141":1036.0,"142":1037.0,"143":1038.0,"144":1039.0,"145":1040.0,"146":1041.0,"147":1042.0,"148":1043.0,"149":1044.0,"150":1045.0,"151":1046.0,"152":1047.0,"153":1048.0,"154":1049.0,"155":1050.0,"156":1051.0,"157":1052.0,"158":1053.0,"159":1054.0,"160":1055.0,"161":1056.0,"162":1057.0,"163":1058.0,"164":1059.0,"165":1060.0,"166":1061.0,"167":1062.0,"168":1063.0,"169":1064.0,"170":1065.0,"171":1066.0,"172":1067.0,"173":1068.0,"174":1069.0,"175":1070.0,"176":1071.0,"177":1072.0,"178":1073.0,"179":1074.0,"180":1075.0},"Entry":{"0":"\n\n1916 May \n","1":"\n27\n\nRevielle at 4-30 a.m., dressed in marching orders returned surplus equipment. Was picked out as mess orderly and got breakfast at 5.30 am after roll calls on parade ground. I got some cold meat & toast as the dixie in which stew was obtained was dirty. Rolled overcoat instead of wearing it so as to accommodate pyjamas. Left camp, was cheered by Sig School & train left Broadmeadows about 8 am. \n\nArrived Flinders St where engine changes after waving to people en route. People on platform shook hands gave us apples biscuits magazines & newspapers. Saw Mother & Father & all from train going to New pier Port Melbourne from which we \nwere to\n embarked after roll call on pier & distribution of cards re pay & waiting. Messes arranged in mess room & on the word we were allowed on deck. \n\nThere was a great rush & I got a good position. Lass soon sighted me & communication shortly opened. Received parcel food & of papers for chap in 39th. Mother Father Dais Will Lass Amanda Harvey Walter Mrs Sims Bert Rudolph present to see me off. Saw Mr & Mrs Blackmore. Streamers of which I had five presented a very beautiful appearance. Boat moved off about 1.30 p.m. the pier look very pretty & animated with flags\n\n& remainder of streamers. Sea calm and passed through Heads about 6.30 p.m.\n\nDinner & \nof\n tea on board of first rate quality being 3 courses. Prepared bunk early so as to get a good position. Room soon becomes a maze of ropes & canvas as soon as hammocks are erected. Slept very well \nand comfortable\n.\n","2":"\n\n40 min behind Melbourne\n\nUp at 6 a.m., rolled up hammock & began to feel funny, so hurriedly finished & got up on top deck and there improved. Later went down for breakfast, came up for air half time & then returned. Sea fairly calm slight roll. Church parade at 10.45 p.m. Time different from shore time as we are running away from the sun. Lounged on deck in afternoon. Sing-song with music after tea & then arranged hammock. Went out on deck for an air and then turned in & slept well.\n","3":"\n\nTime 1 hr. behind Melbourne time\n\nBoat rolling slightly when waking and soon went up on deck for air. Uniform left about owing to hurry, buried at bottom of hammock bin. Parade for physical exercises 10 a.m. Parade with life belts on at 1-45 p.m. Buzzer practice then commenced but sea too noisy. Sea becoming more choppy but boat not effected. Awings were fixed up today with big canvas tubes fixed for diverting the wind into the “troop deck\" where we sleep & eat & which are rather stuffy. Rain expected. Sea rougher in evening & became seasick. Slept on hatchway.\n","4":"\n\nLost time during sickness\n\nStormy high wind & waves, felt funny all day & was sick pretty well every time after going below. Had all meals except tea as I was violently sick at the time. Speed of boat reduced owing to storm. Only about 20 miles travelled during day. \n\nRather exhausted & knocked out when I laid down & spread blankets over me on hatchway good sleep. Very many sick.\n","5":"\n\nArose feeling very funny, had a good walk in wind & recovered somewhat. Had breakfast brought up by Pynor and afterwards recovered. Physical exercises at 8.30 parade at 10 am & again at 2 p.m. Slept on hatchway but was awoken as sleeping there was prohibited. Went to poop deck. Day fairly fine & sea legs being found.\n","6":"\n\nHad to move from poop deck at 4 am \nto have\n so that deck could be hosed. Went back to hatchway. Walk again on boat deck in wind. Butter scotch good to take bad taste from mouth after sickness. Two very violent squalls in quick succession before dinner. Same after dinner. Swing hammock over hatchway.\n","7":"\n\nFine day and good progress apparently made. Work as usual morning & afternoon. Hammock swung again over hatchway. Time after tea very slow as it is too dark to read & no where to see. School of porpoises seen in afternoon.\n\nSaturday 3rd\n\nOrder received to be in marching order by 10-15 a.m. Felt peculiar after raising & had very little breakfast. Kit inspected and all O.K. No work in afternoon. Read & had refreshments bought from canteen. Slept in hammock over hatchway. Sultana lucheons , lemonade, tinned pineapple. Total cost for three \n2\/9\n","8":"\n","9":"\n\nService on top deck in evening Very nice\n\nSweeping decks at 7 pm, 10 am, 1 p.m. Church parade but attended it unofficially as fatigues (sweepers etc) do not attend parades for the day. Afternoon usually off on Sunday. Attended Communion with Pynor in Sergeants Mess Room. \n\nHad salt water shower after & changed underclothes. As awing had been withdrawn from over hatchway slept on instead of swinging hammock over it. Slept well. Boat rolling badly but felt alright.\n","10":"\n\nBeautiful sunrise, fine morning. Slight rain in afternoon. Still \nslight\n rolling. Getting used to boat. Fire alarm parade. Whale sighted but I saw it from long distance only. Exempt from parade afternoon as I have to do sweeping again at 4 p.m. Mended blues. \n\nUsual routine 6 am Revielle then walk on top deck 7-15 breakfast washing & reading etc till 8-30 physical jerks until 9-15 Parade 10.15 to 11-30. walking reading etc 12-15 dinner Parade 2-15 – 4 pm. Tea 5-15 pm. Turn in as soon as dark.\n","11":"\n\nWoke about 2 a.m. owing to very heavy rain storm. Day fine and time going quicker owing evidently to feeling well. \n\nWork as usual. Pay books issued. Washed singlet & underpants. Met chap Martin who went to Tooronga Rd. Big long fair fellow. Will knows him.\n","12":"\n\nAnother fine day. \n\nSubmarine alarm practice in middle of dinner. On hearing signal \nfor\n of ships siren you go to your mess deck, don a lifebelt and fall in on “after-well deck\" port side & no noise. \n\nWashing parade in afternoon did shirt, 5 handkerchiefs 1 pr. socks white hat. Doing famously. All interests except sunrises etc contained absolutely in ship & one is just becoming used to this \n\nConcert on forward well deck.\n","13":"\n\nGood day. Very heavy rainstorm at night. Sergeants Mess room bent in about 1 ft evidently by a big wave. Had shave. \nfirst since\n Nichol mended breeches torn on screw on a boat.\n","14":"\n\nMended white which was torn nearly half way round. Saw \nyoung\n whale which was about 50 yds from ship. As it came up for breath we could see about 20 ft of a brownish body about 50 ft. long, round & about 5 ft across.\n","15":"\n\nSea very calm and at places oily looking. Evidently a current where so oily. There was a long swell but no ripples at all. \n\nGreat afternoon & the finest day so far. No kit inspection as was expected. Afternoon off, chatted on boat deck with Pynor & Nichol. Washed bluies & towel, hung out & took in about 1 am next morning. Slept as usual in hammock \non\n \nabove deck\n. Alarm immediately after tea.\n","16":" “boat\"\n\nChurch parade, slight dizzle in middle. Writing on top deck in nice sun after heavy rain. \n\nGood service in evening. Finished at 7 pm. as organ was required. Service was great success & very enjoyable. Chaps wanted week night service so one for Thursday arranged. After organ taken away continued singing accompanied by a flute. Sang until we had enough. Singing which was conducted by a chap was of first rate order. The service, the singing and the home atmosphere unconsciously associated with a good lot of singing formed undoubtly the most enjoyable evening yet had on board.\n","17":"\n\nAbsolutely cloudless sunrise & a most brilliant sunshining day. \n\nNews received by wireless about sinking of H.M.S. Hampshire & Russian capture of 71,000 Germans. This is first news received since we left port and is very acceptable. \n\nSchool of whales seen spouting about 1 mile to port. Spouting looking like a cloud of spray. In afternoon whale appeared about 300 yds away & spouted. You see a brownish \nback or\n head appear about 6\" above water & then stream of spray about 6 ft high. Spray lingers in air about 5 sec. \n\nMeal arrangements improving enabling one to have meal in greater comfort.\n","18":"\n\nFine day sea calm, further war news but not very important. Work as usual \n\nSupposed to be rather north of the Cape & southerly course taken during night. Expect to reach port about Saturday.\n","19":"\n\nAnother fine day. Sea slightly rough early but calmed down. \n\nNews re capture of 141,000 received. War news evidently usual thing now, we are in touch with Durban. Had finger which was slightly septic & lanced about 4 days treated. Dead skin removed & codine & boracic applied. Nothing much the matter.\n","20":"\n\nRather rough News re Kitcheners death announced. Weather boisterous in afternoon & evening. S.W. gale raging.\n","21":"\n\nLand reported in sight as soon as we were up. It appeared to be a high bank of cloud but as I had expected to see only a very low cloud-like object when we first\n\nFriday 16\n\nsighted land I doubted that the high and apparently close thing was other than a cloud. As the “cloud\" did not change in shape were assured of its being Africa. At first it was just like a big regular cloud the higher part brighter than the lower. As the sun rose and the light became stronger we could see a range of mountains somewhat inland and the lower hills near the beach forming the darker portion of the “cloud\".\n\nThe coast consists of big sand dunes every here & there then rather hilly ground past which we cannot see with exception of high range of mountains behind. We were I suppose about 5 miles from shore at one time but now we can only very dimly see it as there is a rather big bay. We have just past Bird Island lighthouse 12 noon.\n\nA memorial service was held today in connection with Kitcheners death. It was very simple & ended with the Last Post & then the National Anthem. \n\nIt is very sunny now & the swell is pretty high. Past two steamers going in opposite direction early this morning. These were the first ships seen after being out about 2 days when we saw a rather large vessel. A township supposed to be Port Albert was passed about 10 a.m. Sighted sailing ship right ahead early in afternoon & past in just on darkness setting in. As it was going in same direction it took time to overtake it. Past \nvarious\n a lighthouse, a bouy, and a ship in evening. \n\nHad a great concert on the troop-deck and turned in pretty late after the by far most interesting day of the trip as examining the shore with glasses, viewing passing ships & alive with expectation of a good time at Cape Town made something unusual to occupy ones time.\n","22":"\n\nWeather very boisterous & barometer lowest since we left. As very heavy weather expected there are no parades & all men have been ordered off the top decks to their troop decks. Further good war news announced. \n\nStorm increased and a furious gale blowing from S.W. High seas broke over the bow after the ship had risen on a high wave & plunged down into the next. \nThe\n We had a good time looking for the waves coming over the bow & at times the blue of the waves rising right over the bow could be seen. The weather did not moderate all day. Just on darkness we saw a cargo steamer hove to. We past this as we were going at a good pace. \n\nTurned in as usual though weather boisterous.\n","23":"\n\nThe lights looked very pretty as we entered into the Bay. \nThe\n Woke at 4 a.m. owing to rain dripping on me & heard chaps calling us to get up & see Cape Town. Could see very high hills through mist & soon a searchlight was directed on us. We gradually moved in took on a pilot, turned about a good bit & anchored in the outer bay. Had breakfast and then with two tugs moved into berth. \n\nThe bay is like a semi circle with a breakwater poking out from one side. Behind this is a series of piers like sketch. The Table Mount rises up straight ahead of us, & with tracks showing on sides & with a cloud (the “cloth\") over the top it presents a great picture. Two high hills on the right & one of the left of the table make a great background for the town which lies around the beach directly at the foot of the hills\n\nIt is very picturesque & pretty well beyond my describing. We got the news of the naval fight today & of course we longing after some papers referring to it as all we hear is verbal. It is encouraging & the tide appears to have turned very strongly. \n\nThere is an auxilary cruiser “Laconia\" Transport A64 & another here. Of course we are all anxious to get off & we anticipate a route march this afternoon & another tomorrow all day. A little nigger who had news papers soon sold out when we arrived and the chaps started throwing pennies to him & he got wildly excited. We ended by getting him to sing & “Tipperary\" could just be distinguished from his noise. I was on sweeping duties but we soon finished the work. \n\nWe falled in at 1-30 p.m. for a route march. We were very glad to get ashore & we had a great march (more of a walk) to a Rly station Milton Road. We first went up a small narrow Rd “Ebenezer Rd\" & then along a fine wide Road with electric trams (two storied). \n\nMain Rd similar to St Kilda Rd leading from City to Beach.\n\nThe town is very curious as I suppose it is old. The houses are small & crowded looking even the modern ones some of the latter being fairly good looking. The people, well, are amusing. The whites are all right but the blacks are either disgusting and ludricous with a few “ordinary\" blacks. The ones who think they are a little superior are very amusing, their attempts to be European mostly being out as regards colour. Socks ties high collars & the cut of clothes & long walking sticks are evidently the primary considerations of dress & with rakish hats they amused us greatly. A darky “swell\" couple\n\n“doing\" the beach were a good show of darky flashness. The females like the pink from all appearances. \n\nThe people where we stopped supplied us with scones & coffee and on the way \nthrough\n threw oranges & mandarines at us. We had a good change of feed and the people were most hospitable and full of fun. After walking about 8 miles we reached the boat again & though slightly tired we had a most enjoyable time which we did not expect owing to a refusal to give us leave. There are a few good modern business places some about 7 stories & I think would be very up to date. A 16 mile march is on the books for tomorrow. \n\nThe “cloth\" though it was not on very early this morning has been on the Table ever since sunrise. Had a cold shower and turned in\n","24":"\n\nFalled in at 8.30 am & left for march about 9 a.m. Marched out past where we went yesterday and then on to Sea Point Had good time & was escorted by numbers of blacks who sold oranges chocolate etc at rates about twice shop rates. Sea Point is at the foot of Lions Head which is not shown on my cards. \n\nWe returned & went into the Common of which we were not allowed out. We could however buy biscuits fruit drinks etc. at decent rates and roam round. Had a good feed.\n\nReturned to boat about 5 pm & found position of boat altered to facilitate coaling. \nBoat\n Ship load of Portugese from Lisbon \nto\n going to East Africa in port. They are rather small chaps\n\nJune\n\nand have a peculiar grey uniform!! \n\nPeople again very hospitable & dogged tired we will be glad to have a good sleep.\n","25":"\n\nUp & off for another route march about 9 am marched through the business part of the city then uphill along a winding tarred & ideal road around the Devils Peak & rested near Cecils Rhodes old residence. We had lunch here buying oranges chocolate & cakes to reinforce food taken. \n\nWe then proceeded further, passed the Zoo & took a narrower road off the main road up the side of the peak to Rhodes memorial which is granite flight of steps about 50 yds across set in a bold position in the side of the hill. Nine large bronze lions and a huge bronze statue of a man bareback on a straining and powerful looking horse \nand placed\n complete the memorial which is very impressive & a striking reminder of Rhodes vitality & enterprise. The Zoo was I understand formerly his own while \nhis house and\n the estate which forms a huge picnic ground comparable with the reserve of Fern Tree Gully \nwer are\n is a gift of his to the South African Govt. A very good view is obtained from the path to the memorial somewhat like the view from Fern Tree Gully with a background of hills. The place here is however \nonly\n more thickly populate as it is only about 5 miles out. \n\nOn the way back we passed a large number of blacks who to our amusement & their own excitement cheered us. The women were evidently engaged minding the town’s washing which, as the day was fine, was stretched on the grass or over fences to dry.\n\nOn reaching the town, we marched through the Govt. offices portion then down the main St. Adderley St where we were well received and back to the ship. It was a change to se the city as it was the suburbs which we had on Sunday & Monday been through & which struck me as being curious. There are in the city some very fine & modern looking buildings and the whole place seemed busier & more modern than what I originally thought. During the march which was rather hilly we felt, at times, rather tired but we did the about 12 miles all right & with sleeves rolled we must have looked well.\n","26":"\n\nLeft ship for march 10.15 and went to \ncommon\n “Common\" by a different route past the Hospital and fort. We had 2 hours to ourselves there & indulged \nto\n in having the lunch we brought \nto\n together with soft drinks, bananas oranges & biscuits. Bought oranges to bring aboard ship and then we marched through the city & back to the ship about 4 p.m. We had a good reception through the city & after watching niggers coaling until about 5 pm we cast off and with the assistance of a tug cleared the wharves went out into the bay where the Medic & Demosthenes we awaiting us. The Warilda which had arrived early today soon followed. We all anchored in the Bay.\n","27":"\n\nWith Medic, Warilda Demosthenes & H.M.S. “Laconia\" we cleared port about 8 am & with fine weather & a good swell said Good-bye to Cape Town & started Part II of our voyage.\n\nFor the four days we were at Cape Town we were ashore on marches each day & so had good advantage of the change afforded by being in port. The fact that Tommies who were here for an afternoon & the Portugese had leave while we did not hurt somewhat but we saw a good bit of Cape Town and had a good change. The people were very hospitable and a good deal of fun was always about when we marched through the Streets. Of ourselves we made a great impression. The man in charge of the police was greatly surprised when he was informed that we were not permament troops and a “thorough lot of gentlemen\" was the type of criticism which we received. \n\nCape Town has the appearance of being well looked after the road around the Devils Peak which goes right round & comes out around the Lions Head showing that Tourist traffic is well cared for. The port is good and appears busier that Port Melbourne which has the “Yarra\" to take away all but the largest of ships. The shipping portion is like a corner of the bay (bigger that Hobsons) with a pier pretty well right around & jetties jutting in every where & little channels leading off here & there providing berths. The blacks are amusing & strong. \nAbout\n Three or four woman with big bundles of sticks (about 8’ x 3’ x 3’) on their heads passed us one time. The children are dirty & even when \nvery\n about 13 appear to be inverate smokers & gamblers.\n","28":"\n\nFine day, calm sea with good swell. Medic & Demosthenes are in front and Warilda & we follow advancing in twos. The Laconia is generally in the centre working up & down. The Warilda has been dragging behind & the pace of the other boats has had to be reduced. \n\nBuzzer practice 11 – 12 & 2 – 3 & no other parades. Attending Debating Socy & Bible Reading Class evening Divine origin of Bible discussed.\n","29":"\n\nAnother fine day with good swell. Buzzer in morning & holiday afternoon. “Warilda\" still lagging.\n","30":"\n\nChurch parade in morning. “The \nthough\n being dead yet speaketh\" being applied to Kitchener. Communion in afternoon followed by a song service on deck. Bought bottle Fruits Salts to help while going through tropics as I was feeling a trifle peculiar. \n\nWe have now settled down to the routine properly and hardly look upon this as a \ntrip\n voyage with a destination in mind but more as an unusual sort of life. Constant view of the other vessels also makes this portion of trip different to the first portion. \n\nAll lights are now prohibited on deck after dark & all portholes are closed with blackened windows. Song service took place on G. troopdeck. Had a good sing and a Chaplain & two Lieuts organized it until 7 pm. when they had to go to mess\n","31":"\n\nAnother fine day, sea very calm. Debating Socy in evening when impromtu speeches were given & a good time spent.\n","32":"\n\nFine again but rather hot. One can feel it getting warmer & today being close it is very noticeable. “Warilda\" improving in pace.\n","33":"\n\nVery hot and clothes being discarded. \nBuzzer practice\n","34":"\n\nAwnings being put up on boat deck Heat still continuing and sleeping out just the thing.\n","35":"\n\nStill hot but nothing unusual.\n\nJuly\n","36":"\n\nDetailed for Bridge Duty from 4 pm – 8 pm. Saturday & 4 am – 8 am Sunday. Flying fish seen. Crossed the equator but no festivities\n","37":"\n\nUp before 4 am for duty at 4 a.m. “Laconia\" swung round to adjust compasses. \n\nMess orderly starting at tea & to finish after dinner tomorrow. This job means to \nbook\n get rations serve up & clean up tables plates etc for 20 men. There are two on the job but there is a great deal of work & in the heat here you lose a good bit of sweat. \n\nA chap died on the “Medic\" and was buried yesterday. On a given signal all the ships stopped their engines – A signal “All Over\" came from the Medic and off we \nwere\n started again. That was as far as we participated in the burial service & \nwhich\n shows a nice touch of respect. \n\nHad a good sing in evening and also had good chats with a couple of chaps which was very edifying & helpful to me. The Great Bear was pointed out to me last night. Southern Cross could also be seen\n","38":"\n\nMess orderly duties claimed my attention nearly all day. Rained today also.\n","39":"\n\nOrdinary\n Rained heavily\n","40":"\n\nPaid 10\/- and “Ascanian\" issued. Weather still warm. Post closed at 6 p.m. as we call in port tomorrow.\n","41":"\n\nSighted land on both sides. Mountain reputed to be 15000 ft high seen on port side. Haze prevented seeing very well.\n","42":"\n\n20th Birthday celebrated by reaching port at Mindello capital of St Vincent Is in the Cape Verde Islands group. Country \nvery\n rugged, ranges running out to sea then stopping abruptly with precipitous cliffs about 1000 ft high. Most dreary looking. One hill termed “The sleeping beauty\" presents \non\n a very good profile of a man lying down. \n\nGreatly surprised to find a fairly large & good harbour crowded with ships at anchor. Counted twentyeight steamers at anchor & goodness knows how many we missed lying behind those we counted. Ships included cruisers (one supposed to be “\") 2 auxiliary cruisers (“Campania\" & “Laconia\") our 4 transports, Greek, Dutch, Portugese ships and the remainder about 18 British colliers\n\nThis place which is Portugese is evidently now being used by the British Navy as coaling station for which purpose the position is very central. A small island in the bay in which we are anchored with just about room for a lighthouse & little house presents a most peculiar appearance owing to it being about 300 ft high. \n\nWe arrived here about 6 a.m. and ever since have been surrounded by “bum\" boats which sell fruit, post cards, beads etc, etc. You put money in a kerosene tin on a rope, the niggers pull in the rope & place what you want & then you pull in. Some boats had eggs fowls monkeys (£1 each) but there was no market. Little niggers dive for money and do well. After getting tired of buying the salesmen generally get pelted with old potatoes or other rubbish or anything to add a little spice to affairs. The remnants of meat from\n\ndinner is quickly seized when thrown overboard. \nSome\n Bread is treated in the same way. \n\nFishing is the limit here. The niggers get a fish break off its head, chew some of the body, scatter some of the result on the water. The niggers get a short bamboo rod (about 2ft) with a 2 ft line with a little hook. Fish about 9\" long like mullet come round in hundreds & they flick the hook out & catch one by the tail, back or anywhere. Sometimes they dip a little net in & \ncaught\n catch them like that. Very sport. A red coloured fish about 1 ft long is caught easily on an ordinary line with the mullet as bait. Our mess put 1\/- in each & got oranges at 16 a 1\/- \n\nAnother Is. is visible on the other side of ship. Post containing a big number of my letters will go off here. At \neven\n night no lights were shown by any of the ships and the place seemed rather dreary in comparison to the Cape\n\n \n\nDid not go.\n\nThe island is very dry & barren. As rain has not fallen for about 15 years water & fruit has to be obtained from neighbouring islands. \n","43":"\n\nStill in port on rising and trade with “bum boats\" continues. A life belt & hammock inspection parade took place at 9 am. The naval pinnances look well flying about between & men-o’-war & the transports. \n\nThe Machine Gunners bought a big fish weighing about 1 cwt from natives & pretty well all the amateur photographers got busy. About a dozen of \nthe\n chaps went overboard for a swim this morning and got their names taken when they were pulled back on ropes. \n\nStaying here for today is rather wearisome as there is not much to see as we cannot get a shore & we all know we are not making progress towards our destination.\n\nThe island was named “St Vincent\" just after the battle of St Vincent in honor of the British who under Wellington were then carrying on the Peninsular Wars to Portugal’s help.\n\nThe hill which I called the Sleeping Beauty has been variously termed Napoleon, Wellington, & Washington Peak face etc. so I cannot say for certain which name is correct. Men-o’-war are the “\" \n\nThe weather here is good, the sun being hot, and a fairly strong breeze cool. Mess orderly again commencing with tea.\n","44":"\n\nStill in port on rising and had to get busy straight off with mess orderly work. Salt water for showers is cut off in port owing to its being dirty & so we cannot have showers. Very hot but the wind makes things pleasant. Usual church parades but I was not present owing to mess orderly. \n\nLeft port at about noon and very soon we were at the same old beat again. The “Medic\" “Warilda\" “Demosthenes\" “Laconia\" in the same old positions. There is one thing which is making the voyage better now. We are going fast. Before arriving at St Vincent \nat\n our pace was only about 6 knots for several days. Well we are on the last lap & mighty glad it is the last.\n\nWe have now an additional item of clothing, the lifebelt. This we must always wear or have with us. So we have been condemned to lugging a lifebelt around with us. It looks rediculous but of course it is necessary. There were no sing songs today.\n\nA Portugese River Gunboat arrived here today. It was a \nvery\n peculiar craft & a contrast to our boats.\n","45":"\n\nFine again and still making good speed. Rumour has it that we are to arrive in Devonport \non\n next Monday & we are to train at Wandsworth about 7 miles from London.\n\nThis is an absolute furphy.\n\nWe are all just longing to complete this pleasant trip and see the good “old ‘’.\n","46":"\n\nFine day sea a trifle rougher than the pretty well absolute calm which we have had since Cape Town. “Demosthenes\" disappeared to the N.E. evidently going to the Canary Is or Gibraltar. The chaps on board her are from Q.land & have been on board about a fortnight longer than we.\n","47":"\n\nFine day but sea a little rougher than usual. Buzzer test in morning. Ship preparing for port.\n","48":"\n\nAnother fine day but nothing unusual. \n\nSailing ship in full sail passed about 6 p.m. Notification given to all ships from Laconia that a derelict schooner was sighted July 1st in a certain longtitude & latitude through which we pass about Saturday. \n\nThe English twilight is now being experienced. I read in it until about 7.30 pm, which equals 7-50 p.m. in relation to the sun in Melbourne (Melbourne time being 20 mins. fast.\n","49":"\n\nGreat day. Universal kit bags bought up from hold. Quite pleased to see the old bags again. Marching order equipment extracted and as much of the contents of the sea kit bags placed in. \n\nPassing ships becoming a little more common. Owing to booms being painted could not swing hammock so slept on the deck in open.\n","50":"\n\nAnother fine day and though for a part of the day in the Bay of Biscay sea was very calm. \n\nLifebelts had to be worn all day (we had to keep them with us previously) and discomfort resulted. \n\nPlayed a game of cards called “five hundred\" with Pynor & Frost and it took us about 6 hrs to finish it. Slept on deck again.\n","51":"\n\nReal lovely day sea as calm as could be. We have had real marvellous weather during the trip and even Bay of Biscay becomes a millpond for us. Meeting of old Wesley Boys held in afternoon and photos taken of the group. Total number present 13 including 3 offices (1 man absent).\n\nLarge number of whales seen in all directions. Evening very light. I was reading in the natural light at 9 p.m.\n","52":"\n\nWoke about \n3.30\n 4 a.m. owing to the “Laconia\" blowing siren and wondered what was the matter. It was raining slightly & therefore the air was misty, Laconia blew a \nserious\n series of blasts with about 1 minute interval several times until about 5.30 a.m. when she signalled us “If destroyer escort has not been sighted by 6 a.m. ships will make port independently keeping strict watch for destroyers which are in the vicinity\" However just about 5.50 destroyers were just discernable and in about 9 minutes were abreast with us. There were four, one for each ship. Ours came close to us at a great speed and then signalled “What is course & speed\". Later “I will zig-zag ahead unless weather gets \ntoo\n thick in which case I will take position astern\". She then went ahead & has been zig-zag ahead of us except when weather was pretty thick & she fell astern. \n\nWe are now separated from other ships the Warilda with her destroyer being the only one in sight. Good speed is being attained & the old Medic has dropped behind. All day the little destroyer kept up its zig zaging & we made good progress through what is supposed to be the dangerous area. Slept below\n","53":"\n\nUp about 6 a.m. but things still the same. About 7 a.m. land was sighted.\n\nEddeystone lighthouse was passed later and appeared a great sight with the old stump sticking up alongside. The land soon became more clearly visible & the bright greenness, the chocolate coloured ploughed ground, the hedges dividing the land up and the slightly rugged coast of Cornwall showing a excellent sight. It was as pretty as I have seen, a beautiful day showing out the beauties well. \n\nWe passed into Devonport bay, had dinner while we were anchored. The town as we can see it looks very well. The whole scene speaks of age a thing which is practically absent in Australia, & S Africa. The rough gullys running into the bay down bright green hills speaks of the old tales I used to read, while just over a bit to starboard Plymouth reminds one of Drake & the Spanish Armada. The ruins of an old castle appears on one hill & on another a very old place built right into the side hints of times when caves were used as dwellings. The old fort which we have seen in pictures with its black & white draught-board squares is now at our stern & thousands of sea gulls are flying about feeding on the scraps which were plentifully thrown out after dinner. \n\nThe “Warilda\" just beat us in though we had expected to beat her with all her 17 knots. We anchored in the sound about 10 am and stayed until after dinner when we moved up a sort of wide river similar, I believe, to Sydney habour up to our berth. A submarine, two cruisers in H.M. Docks being repaired, a chain which at night is stretched across the channel and various steamers busy with ammunition we passed on the way up on one side. On the other little villages of about 6 houses very old surrounded by old trees provided a beautiful\n\nWe were tugged up\n\nold and rustic sight\n\nWe berthed a little after 3 p.m. and after long delays we disembarked about 9 p.m. Thus ended a most interesting and enjoyable voyage, one which provided me with, in one way, an unusual experience but shared by hundreds of thousands of troops whose experiences, I suppose are just the same as mine of which I have written as much. \n\nFirst of all the food was good and though except in a few directions never superabundant plentiful. The accommodation was good but of course one can expect nothing but a little crowding while being transported during a shortage in shipping. The life aboard was good. Naturally language was not always the best and the gambling of which I had heard great tales was not of so bad as one would have expected. It was only when the monotony for those who who were used to a lively life set in that the gambling set in and though much money changed hands \nand it\n the number who abstained from it was remarkable The worst feature of this was that a fair number of money belts began to be missing and it was not safe leave a belt about (a foolish thing to do at any time). \n\nThe life altogether was pretty good there being plenty of good chaps on board. The Chaplains were not too bad though one of them was very rarely see. The Y.M.C.A. man did not appear suitable at all owing to a lack of experience, an individuality and vigor. This is regretable as the Y.M.C.A. is held in highest esteem by men of all sorts. The weather, well, was perfect. The roll of the Bight of course caused little inconvenience, the one days storm at the Cape was only to be expected and the remainder of the trip ideal. A practical expression of Britain’s Sea Power and Protection\n\nwas afforded by the trip which will I think long remain in the host of pleasant memories. The good ship “Ascanius\" was excellent and as a troop ship, sea boat she has excelled over everything which we have seen or of which we have heard accounts.\n\nSo ends part I of my active service and if all the remaining parts equal it, I shall return home greatly benefited in, I think, all directions.\n\nThere is one matter though. On reaching the camp we were told that it was believed we had been sunk & that was the impression existing in Australia. Of course this angered us and if you heard any such rumours I hoped you all placed absolutely no credence upon them. A man spreading such talk deserves imprisonment and you can take it from me the excellent precautions taken leave practically no possibility of disaster.\n\nPart II\n\nJuly 18th Tuesday\n\nWell we landed about 9 p.m. & waited for train on pier. It shunted in, we climbed on board, and about 9.45 p.m. it pulled away. We shunted from one system of lines to the other starting from the dockyard line until we reached the main. There is a most remarkable system of trains, lines running parallel about 200 yards distant. \n\nIn shunting we passed to Naval College, a huge & very attractive looking grey building, Cricket fields a most pleasing green colour and nice peaceful looking\n\ncoves produced a great scene. Then we moved from there (this is during the shunting) we passed over a huge bridge built high over houses some three stories packed very tight and looking very compact. A narrow but very clean & white road running between the houses & another bridge high up a little further along and gardens etc away below you provided a wonderful scene. I cannot describe it but the train running though an avenue of big bushy trees vivid green colour grass & hedges skirting the track left me pretty well in raptures over the sight. Look to your left you see the grim dockyard, look to your right you see the vivid greeness of trees & lovely undulating hills; All this after 9.45 pm. You could read until 10 pm. but as soon as we proceeded towards Amesbury it became too dark but the view of another big high bridge over a cove & skirting the waters edge at another cove only made us annoyed that darkness prevented us from seeing this beautiful \nCornwall\n Devon & Dorset scenery. And so in the darkness we thundered on at a great rate drawn by 2 engines towards our training ground.\n\nWe had 3rd class carriages and officers first. Carriages were very comfortable and there was a map in each compartment a thing for which we all had more or less (most more) longed for during the voyage.\n","54":"\n\nArrived in Exeter at 1.45 am The Mayoress & committee had buns &\n\nhot tea all ready for us. Ladies waiting up at that hour to serve us & fill our water bottles with hot tea was far more than we ever expected and shows a little of the work of the English women. We had a chat to the Mayoress herself who was pouring out the tea and real heartfelt thanks were not wanting from us all. Of course chocolates were again bought but an Australian shilling could only bring 11d worth of goods. We had a good time which went quickly and I snatched about ½ hours sleep. \n\nWe arrive at Amesbury 4.45 a.m. with the day light again and then marched off to camp. Well I am going to try to describe the march but I know I will fail.\n\nWe soon got away from the yards & on to \nthe\n a asphalted & excellent road with wild flowers of all colours growing alongside. A few hundred yards along we struck huge old trees with thick foliage almost meeting over our heads. This took us to a village but we turned the corner just before we arrived in the main part. The quaint thatch-roofed houses covered with creepers but still showing nice white curtains at the windows looked quite romantic. And then we passed a lodge house, a high old “brick\" wall and then another lodge house, all apparently quite ancient, the roofs nearly falling in. Continual avenue of massive old trees, then a sluggish wide creek with ducks swimming about, dairy cattle grazing in wonderfully green paddocks all along until about half way to the camp where modern conditions have\n\nto a great extent destroyed the old beauty. Is it surprising that motor cycling is a rage along such roads as this?\n\nIt took us 48 minutes to march to camp and then we were allotted to huts, had a wash and dined off the remainder of the 1lb. tin of bully beef and 8 biscuits with which we were issued yesterday for yesterdays tea & todays breakfast & dinner.\n\nAway to our South is \nStonehenge\n Stonehenge plainly visible. It is just an isolated collection of rocks which of course we are itching to visit.\n\nThis is a huge camp (indeed the whole Salisbury plain is a camp) all the Australians being grouped round in this corner.\n\nWe were quarantined pretty well immediately on arrival here so could not visit the other parts. During the afternoon blankets were issued. These are of a very poor quality & were rather dirty. Mattresses were issued but the majority of us left them alone owing to the possibility of lice. The tea was not very abundant but we were not expected here & no arrangements had been made. \n\nFarnborough (the aviation school) is just over a hill from here and we see aeroplanes pretty well all day. The reinforcements awaiting calling to the front are camp here. (Larkhill) but though we see huts as far as we can see East & West that visible is only a portion of the Australian Troops here. Bill Long (old Wesley boy) was here today and he told me that Harold Ponstad was just above the Anzac Buffet in London & was in France doing well.\n","55":"\n\nUp at 5.45 am & parade at 6.30 a.m. Troop drill, compass work & semaphore drill all day. In afternoon 32 motor wagons went along a road together. Steam wagons with a steam engine in the place of the bonnet of a motor are used here. A railway line for goods traffic runs right through the camp We are housed in huts about 30 in each. Huts are galvanised iron lined inside with a thick sort of cardboard. A heating stove is provided for each huts. The huts run in streets some of which are very long.\n","56":"\n\nRevielle at 6 am. Marched to Stonehenge about 2 miles away & doubled a good proportion of the distance. We did not go into the enclosure but got with 20 yards of the rocks. They are marvellous the altar being squared off very well. All the way wild flowers of all colours were mixed in with the grass the fields therefore looking very well. \n\nOn guard to prevent chaps breaking quarantine for 24 hours starting 2 p.m. Had shift 4 – 6 & 10 – 12 (2 hours on & 4 hours off). Payed 3d in each & bought a football. \n\nIn evening we played a match between ourselves (Just B Section) We all cut down our bluies and one side wore cardigan jackets & the other white singlets We had numbers chalked on us. The blues had it on their cardigans & the whites on the seat of their trousers. We had a great games & “our\" side “the whites\" beaten.\n\nAfter having a shower the sergeant shouted us a ginger beer, the corporal bought a box of buns & we returned to our\n\nhut. We then held a meeting & formed a club for football, boxing, singing & dancing. This club is confined to 1B Section and will be great when the cold weather makes being out of door of an evening undesireable.\n","57":"\n\nA lovely day. On guard in morning & half holiday in afternoon. Washed some socks etc & had a hot shower\n\nWe are now decorating the front of our huts by working designs with small pieces of coal, chalk, brick, road metal & sand which is an ‘orange’ colour. Emblems such as the Union Jack, Australian Jack Coat of Arms, a black swan, Map of Aust. & the Aust. Engineer’s regimental badge have been excellently made up.\n","58":"\n\nA rather nippy morning but a fine day. \n\nChurch Parade by Capt Hume-Robertson who was with us on the Ascanius. We sang without the usual band & did fairly well. Just before dinner we got the order to prepare to move. We then had to clean the camp & cart of kits about ½ mile. No tea was ready at the new camp so we had it at the Y.M.C.A.\n\nAfter that \nwe\n I went to church in a YMCA further up the road and then walked to Durrington. The little old houses mostly two-storied although very low are very interesting. There was an old church there \nbuilt of flint & its church\n with numerous tombstones packed closely round it. These places are very quaint. One old place had “No Popery\" written large on its side. This was put on hundreds\n\nof years ago so that the people who rose against the Popery who make no mistake as to the inmates.\n","59":"\n\nAnother glorious day and work went very easily. \n\nMet Wallie Fielder who came on Afrie and came across France He is doing well. Went to Figheldean in the evening and saw under the spreading chestnut tree the village smithy stand, the village church and school from which the children used to troop. A leaf of tree was secured. We went through the church whose doors were unlocked It is a very old church and we saw a tombstone dated 1735. This church is probably 600 years old. We saw Netheravon a flying school not Farnborough as previously mentioned herein. \n\nThe walk was pretty solid, especially as I was still suffering from the effects of the football match. After a hot & cold shower bath I got a chap to give me a rub down so as to prepare me for the morrow\n","60":"\n\nUp as usual & put my “best\" clothes on as we anticipated going to London. At first parade those who were willing to take leave before getting paid were told to step forward. Thanks to the £3 I stepped out and was marched off about 11 am to Bulford Stn. & off to London. \n\nWe carried our haversacks with boot polish, tooth brush socks towel etc and greatcoat. We changed at Salisbury and had a good refreshment & soon reached London the train travelling over 60 miles an hour very often. We passed\n\nA hospital train in which the nurses could be seen moving about. We went to Waterloo Stn & then were dismissed. A motor bus took Pynor & I to the Tottenham Court Rd Y.M.C.A. where we booked beds at 1\/6 including breakfast left our overcoat & haversack and set out for a look about. \n\nWe strayed about, and tried a tube just for the experience You put a penny in a slot & there’s your ticket. After walking along to the stair you stand on the top step & in a short time you are on the bottom one. If you are in a hurry you can walk down these continuously moving stairways & of course we were in a hurry. We got out of the tube at Westminster Bridge Road because the name sounded good, had to pay a penny because we had come too far for a penny ticket, strayed about and found ourselves in front of the Houses of Parliament. \n\nA policeman let us in & after signing books etc got into Stranger’s Gallery where questions were being answered. In reply to a question as to why munitions were being imported the ministry stated they were producing at home as much as they possibly could. For example sulphuric acid. There is now a plant in England which produces twice the pre-war product of all English plants, \nthe\n at a cost equal to ¼ of the cost of imported product fixed a few months ago. This plant will pay for itself in 9 mos. We heard other things discussed, had a little supper & went to bed.\n","61":"\n\nSlept in rather late but had a swim in Y.M.C.A. baths (about 30 yds long) before breakfast afer which we booked beds for the night & went out again \nwith a Scotch Canadian who was very sociable\n. Made for the Army H.Q. & met Harold & arranged a meet at 5.15 p.m.\n\nWent to Westminster and had a good look round. It is a marvellous place a mass of solid carving. Innumerable graves etc every where. I think we saw all. The most impressive thing was the memorial to a beautiful lady who died suddenly in the arms of her husband The figure was of the husband with the lady in his arms \ntried\n trying to fend off “death\" (a skeleton) who is escaping from the door of the tomb beneath & endeavouring to attack the lady. A great piece of sculpture. Intercessional Service is held there every midday & we stopped in for it. A good many of the figures are covered with sandbags.\n\nIn the afternoon we went to St Pauls & was amazed by the beautiful ceiling dome & altar. In the whispering gallery which is inside at the widest portion of the dome you enter on one side & the attendant tells you to go around to the opposite side, sit down & he will whisper to you. He whispers into the wall & you hear it very distinctly just near your head. Very marvellous.\n\nWe then went up more steps to the stone gallery on the outside from which you can get a good view of the city Visited the crypt saw Wellingtons Nelsons Roberts graves & also the huge vehicle (built from captured cannon) which carried Wellingtons coffin at his funeral. I stayed half way through a service starting at 4 p.m. at St Pauls & went to meet\n\nHarold at his office about 5.15 p.m.\n\nMet one of the Jansens & another chap from the Independents and went home with Harold to tea. He boards with very nice people and I was made at home all right. After a good tea we went to Hyde Park & Kensington Gardens past the Serpentine (a lake) & saw a beautiful statue of Peter Pan. A band was playing there & thousands of people mostly young were parading about & striking up acquaintances etc. Quite a merry place We enjoyed the music, had a sit down on a chair (1d a ticket which lasts all day) and under Harolds direction soon found my way home.\n","62":"\n\nSwim first thing again & after breakfast & booking beds out again with a Scotch Canadian who was to show us to St James park. After a long walk we arrived there and saw guards change at Buckingham & St James Palaces. \n\nWe then went to Paddington Stn & got a train to Windsor (124 miles for 3\/- return) The train soon got us there (only one stop) and we had a look around the palace which was not open inside. It is a great place. We went for a walk along the “Broad Walk\" a broad grove of elms, saw deer, had a distant view of the Copper Horse and returned to the town. \n\nAfter some tea I caught a train to London, soon got there had a hurried\n\nclean up and got to Trafalgar Square to meet Harold at 7.30 pm. An apology alone met me so I disappointed set out to the waxworks where I was again disappointed, had a ride in bus to Kilburn \nSouthgate\n & was home early to bed.\n","63":" \n30\nth 28\n\nStarted as usual & went to Selfridges Store Roof Gardens. Selfridges in a big Myers & was great. \n\nWe then went to Rotten Row & saw the nuts & nutesses having their morning ride. Had a good look round the gardens & the Albert Memorial (Prince Consort) had some lunch dished up with vexatious delays & made off to the Tower which is well illustrated in the Photos. An important item is left out here. The Bloody Tower. The outside wall shown in the photo Traitors gate was built outside a previous wall & the \nrider\n river used to be right up to this gate. There was a tower over the gate & a door with spikes each end (top & bottom) & drawn perpendicularly up & down through a slit in the floor by tackle was used to open & close the entrance. The bottom spikes sank in the Thames mud & the top ones prevented invader climbing over. It is a great state of preservation as no attacks could very well be made on it as it had frontage on the river. Ridley Latimer Raleigh \n& the Princes\n were confirmed their before their execution & the Princes murdered there.\n\nThe Crown Jewells were marvellous & the armour, cannon rifles very ancient & interesting. Attendants are very quaintly dressed as shown on P. Card. We then visited the \nLondon\n Tower Bridge which is a remarkable structure. Had a clean up, tea etc at the Y.M.C.A. and went again to Harold’s place and a very interesting bus ride to Southgate. Had a good chat.\n","64":"\n\nAfter swim, breakfast we set out for Old St to see Wesleys House. We took a tube from Charing Cross & after going along a great distance we got alarmed at Old St not turning up. We found out we should have changed at Moorgate but after a little more time Charing Cross turned up again. We had gone around in a big circle. We soon arrived at Old St & went to Wesley’s House which we inspected. We paid a flying visit to an Ordination Service in Wesley’s Chapel & then after much trouble got a bus & car to Kew. \n\nInspected Kew Palace which has not been used for years, saw the famous orchids, had dinner at a riverside afternoon tea place and paid pretty hard for it. After watching cricket for a few minutes we caught bus & tube back to the Y.M.C.A. where we arrived in no time.\n\nAfter a clean up & getting our gear we bussed to Waterloo again & caught \n\n5.50 pm train back. We changed at Andover Junc. and got to Amesbury about 8-15 p.m. We had a good wait at Andover J. We looked through the chapel at Amesbury over 1000 years old was shown over by a lady who is continually writing to soldiers showing them over the church & other busying about. Had biscuits & some soft drinks & got home tired & happy.\n\nWell naturally I consider London marvellous. The police are wonderful Big fine stamps of men with a wonderful knowledge. You ask them how to get to a certain place and they just say catch a No. 49 bus and change at Waterloo for a No 11 and all this sort of thing. They know it well & they do not require to be told a dozen times what you want before they tell you like some daft people here. Patience! well they have their full share. They are continuously being seiged by soldiers all day & yet you \nnever\n get anything but a kindly & courteous reply to the most outrageous query which you like to make. Of course you are continually being lost. You find yourself in Piccidilly Circus when you think you are at the \n\nother end of the city & if you wished to go to a place you were in 5 minutes ago well even then you stand a good chance of being lost. \n\nEven when I was leaving Tottenham Court Y.M.C.A. on Saturday I caught the bus going in the opposite direction. All the bus routes have numbers & I was just getting to know them. Highest number about 88\n\nThere are Australian soldiers in plenty about the streets and the people generally & very nice. It is amusing to see the women some quite middle aged running after buses & getting on while it is going. There is a bustle getting on & off the bus but along the streets all is ordinary. The narrow streets are marvellously navigated by hosts of motor buses & taxies and the way they dodge each other about is marvellous.\n\nI was with Pynor all the time except when with Harold and so was able to have a good time. The newspapers are not much here to my prejudiced mind. Nothing like the Age which is very often quoted by the most important papers here. I will post you some when something Australian is mentioned. All our chaps are very patriotic. No place whatever like Australia which we boom to all the people with which we come in contact.\n","65":"\n\nChurch parade held with Bishop of Salisbury (?) in charge. I think it was the whole of 3rd Division in England which was present. There were about 6,000 troops and two generals. A service of this kind is not much of a \nservice\n for the men who are not near the bishop etc. \n\nAfter service we were off for the day and the afternoon was spent in writing up diary & replying to letters which I received in the morning. \n\nIn the evening we paid another visit to Stonehenge and then packed our kit bags ready for an early move off in morning\n","66":"\n\nUp at 5.30 am and after a scanty breakfast & clearing up camp we moved off to Amesbury Stn. It was pretty hot but the walk is very nice We caught a train there & changed at Porton and landed about 3.30 p.m. at Waterloo St in London. After a little wait on the platform we were marched to the free buffet and had lunch. We then caught a tube train changed at “Bank\" and caught tube train to Kings Cross. \n\nAfter catching the train there we arrived at Hitchin in 50 minutes About 15 mins. march brought us to the camp which is nicely placed amongst trees. We are housed 11 in a bell tent but this arrangement is only temporary. Except from the Lark Hill camp to Amesbury Stn & from Hitchin Stn to camp we had to carry our kit bags when walking and so\n\nwe at times had a pretty hot time.\n\nAfter getting into tents & being issued with blankets we had tea at the YMCA here & then walked the town. There is a “merry go round\" here at present. Of course the shooting galleries etc were there also. The chief attraction was confetti throwing. It was a rather rough shop and of course Australian Soldiers got a good share of the confetti.\n\nTuesday \n31\n","67":"\n\nUp at 6 a.m. And then parade at 6.30 from which we were immediately dismissed. The breakfast was great, the organization being splendid and the only thing prohibited is waste. Eat as much as you want but do not waste. \n\nWe then had to arrange our kits for marching order (a pretty good job) & then fall in at 10-30. We were marched up to the common (I think) and were inspected by a brigadier general. Then we returned to camp, had dinner which showed again good management. We then waited about to be told where we were going next day & all arrangements. I was detailed to go to Haynes Park. We then had tea after which we visited Hitchin.\n\nVarious rumours as to the dreadful state of the camp were being circulated by the Tommies and so we were not much looking forward to Haynes Park. I was not very pleased with things as Pynor was going to Fenny Stratford\n\nwhere the linemen & operators were sent.\n","68":"\n\nLeft camp about 8 am & after the usual waits caught train and detrained at Southall. We then set out for Haynes Park a march of about 4½ miles We marched at a good pace & passed a wood part of which had been blown down by a gale last April. We were marched up to the officers quarters which was the residence of the Duke of Bedford prior to his becoming Duke. We had dinner & then frittered the rest of the day away as well as we could.\n","69":"\n\nUp at 5 a.m. \nand marched round to stable\n but after a little bit of drill were dismissed again. We were paraded after breakfast before the Lieut. Col. and he gave us a talk on this camp. We were then put through tests of riding & all of us except 6 passed. This surprised the Tommies very much as we were supposed to do 3 weeks course before passing the test. The drivers passed their test in the afternoon while the others painted our tents as a preventitive against Zeps. \n\nThe Tommies get treated very badly here. The instructors & officers treat them like dogs but we get treated great. I was talking with one instructor when I should be grooming a horse & all of a sudden he starts roaring at some poor Tommy down the line. The language & the actions of the instructors is the limit \n\nThey dance about & poor old Tommy looks on without a smile. \n\nIf the instructors do anything which they think might be contrary to our desires they get quite apologetic Of course there is a limit to such things but the contrast of the treatment meted out to us & to the Tommies is \na\n striking \ncontrast\n Of course we swank about & put on a good bit of as we are the first Australians in this place.\n\nIn the evening we amused the Tommies with a rotten rough & tumble football match.\n","70":"\n\nUp at 5 am again, rather too early for me & did stables. In this we got every consideration \nagainst\n over poor old Tommy. We spent the morning talking to the chaps here who were mending cable. We start parade at 7-50 rest at 10-30 start again at 11 knock off at 12. this is after stables which start at 5.20 with a cup of coffee\n\nThere is a small village just outside the camp about 200 yds from where we were talking & we went there for refreshments You have to bend your head to get in and once in you are nearly touching the ceiling with your head. The buildings are very low & two storied \n\nIn the afternoon we went along one of the telephone lines which was not working well & found a couple of faults. This we did with one of the officers who was very pally with us.\n\nThis camp is one where Royal Engineers train. They first\n\ngo to Birmingham for general instruction & then come here for riding and cable work. After finishing here they go to Hitchin where they are up into “drafts\" (reinforcements) & sent to France or Mesopotamia.\n\nThe officers do not know why we came here as we are trained as far as this place but we understand our Major told the authorities that we were recruits & of course we are being treated as such.\n\nSpent evening in chatting with the Tommies with whom we are doing well.\n","71":"\n\n5 am again & stables after it. Spent the morning with a cable drill and had a good time when an officer personally explained things on the wagon to another chap & myself. He was a bit a dandy but we seem to “get\" them all right On marching back to our tents which are ½ mile from where we drill to, I got a mail of four letters & then prepared for leave to Bedford 6 miles away. \n\nImmediately after \ntea\n dinner we set off and were taken in by a military motor wagon. The River Ouse flows through there & is very pretty & provides good boating of which we partook. We had tea there walking about to see the place & caught a drag about 11 p.m. home. There was a decent crowd of us and so were had a good sing-song all the way home.\n\nBedford is a fairly large place & biggest we have seen after London & the River right in the middle provides good recreation for all. This was where Bunyan lived & I saw a statue of him. Had a good time & of course returned home tired.\n","72":"\n\nUp at 6 am (an hour extra sleep today) & did stables again. After breakfast fell in for church parade. the R.C., the C of C & the “Wesleyans\" have separate services & the latter which I attended was held in the Wesleyan Church Wilstead about 1 mile away. Enjoyed being at a good service again \nand returned\n Writing letters etc since returning with time off for \ntea\ndinner. \n\nWent to church again in evening when a service similar to ours was held. The morning service was primarily a military parade & the usual hymn book was not used. The old fashioned pews are used in this church which was built in 1841. Had some good singing & then went for a walk. While returning we met one of the stewards of the church & went to his place for supper and tasted Bedfordshire pudding which is a species of plum pudding.\n","73":"\n\nUp at 5 am again and after doing stables was informed that I\n\nwas to act as No 6. on a detachment after breakfast. The horse allotted to me was already saddled and after much hurry was in time for parade at 8 a.m. There is a great deal of work here to be done in a very little time. The Tommies manage all right by going without a wash between stables & breakfast but we will not do that. \n\nI had a very good time out all day as No. 6 who has the hardest job of all. Good horsemanship is required for this but as the pace never exceeded a walk & as the horse knew the work thoroughly I got on well – We returned about 3-30 p.m. as all horses must be in about 3 p.m. and after being paid £3-10-0 – had dinner (I have a snack at midday). Tea was on shortly after & then a kit inspection was held about 6 pm. in our own time. Worn out underclothing is to be replaced very shortly and inspection was mainly to see what replacements were necessary.\n","74":"\n\nMess orderly today so no parades for me except roll call at 5-20 a.m. Duties are to get the meals & to wash up the china utensils in hot water drying evidently not being considered necessary. This does not take long so I have plenty of spare time. Walk through villages at night.\n","75":"\n\nUsual early morning pilgrimage to the stables and then we were put on mending cables This lasted all day & is not too bad work. Walked to Haynes in evening.\n","76":"\n\nRepairing cables again. Worked seriously interupted by arrival of mail. There were 9 letters for me and we were all very glad to receive them. They make up all the letters which I should have received & none now appear missing Spent evening in writing\n","77":"\n\nSpent morning on air line work and received good tips from an officer who was a sergt. in the Royal Engrs. & was 11 months at the front. Repairing cable again in afternoon and spent evening on parade ground on Fire alarm practice. Just when I was going to settle down to write we had to go on parade & say there 1 ½ hours. Received 3 Australian letters today\n","78":"\n\nWent out with wagon as No. 7 which is generally easy. The hedges on the side of the road made it very hard and I worked harder this morning than I have ever worked I think. That say a very great lot indeed.\n\nAugust\n\nI was hopping on & off my horse hanging on my one leg and getting a pretty hard time in general. \n\nGot back at 1-30 and had dinner changed uniform and attended sports held by “A\" Coy. Australians were allowed entry and \nthey\n we did very well. As a team we won the Boat Race, Tug of war & Relay Race and generally showed our prowress. \n\nReceived another letter but shortly I suppose I will have received all outstanding letters.\n","79":"\n\nChurch parade to Wilstead again Remainder of morning & afternoon writing Walk to village in evening.\n","80":"\n\nOut with wagon as No. 3. We went in direction of Houghton Conquest and had a pretty good day. Evening spent in writing greatly interrupted by chatting. Had a bath first since being here. Rained pretty heavily for short time\n","81":"\n\nRepairing cable & practise of cable numbers in the grounds. Rained again. To a village in evening.\n","82":"\n\nOut with cable wagon as No. 5. Went in direction of Southill a distance of about 5 ¾ miles. The country out this way is very pretty. In evening went for a bike ride around the district.\n","83":"\n\nRaining. Lecture on phones – Everybody very sleepy.\n","84":"\n\nOut with cable wagon as No. 8. This is an easy job as you have to stay at place where they start to lay cable to be ready to look for a fault should one occur. There was a fault in the afternoon & I had to saddle up & go out. My horse was rather frisky so I was not able to proceed very fast. When I tested the line the second time I found it working well so returned.\n","85":"\n\nMess orderly today so am having time to write. Rather fine today after continuous showery weather we have been having for last 4 days. Busy all day with mess orderly duties and retired early for a change.\n","86":"\n\nChurch again at Wilstead and having leave for the day remained in village instead of marching back. We intended to ride to Luton but could not obtain bikes. Returned to camp & caught motor car to Bedford. After having a hurried look around returned to camp. Church again in the evening.\n\nMonday 21st\n\nStables again as usual and the second parade were detailed to dig dug outs. As usual the required tools were not all there but we were fixed up somehow. In the morning worked and rested alternately while in afternoon had ¼ hour. rest every ½ hrs. work\n","87":"\n\nAir line work in morning but spent most of the time doing nothing. It appears as if they do not know what to do with us & are content if we keep out of sight. In afternoon repairing cable but no requisites available. Made ourselves scarce again, remaining mainly in a refreshment house writing letters. Went to Elstow to see Bunyan’s church in evening.\n","88":"\n\nA job has now been found for us, digging dug-outs. Put in the day at this. Rode around Houghton Conquest in evening\n","89":"\n\nStarted a new hole and work solidly at it all day. Sunk 3ft by evening. We work two shifts 4 man each ½ hr on & ½ hr off. One man picks – 2 men shovel & 1 man wheels the earth away. Writing letters during spare ½ hr. to catch mail. \n\nAttended concert in Y.M.C.A. for first time tonight for stayed for about an hour only.\n","90":"\n\nStill digging and making good progress. \n\nFriday 25th\n\nBack \nof trench\n at dug out digging again. Rained heavily in afternoon so we knocked off and had a bath. You have a bath here in a tub and it reminds you of younger days. \n\nAdvised that I go to Dunstable next week.\n\nSaturday 26th\n\nDigging again in morning. \n\nWeek end leave starting in afternoon. Obtained good bikes at 1\/6 for the week end from people met at the Church instead of 3\/6 the usual week end charge\n","91":"\n\nWith overcoats strapped on the back we Frost & I set out for Northampton about 26 miles away We past through a very substantial looking portion of Bedford and arrived in Northampton about 5-30 p.m. The ride though hard was very pretty and we passed through Turvey which is a fairly large village. There is a very long terrace of oldist looking places and also the remains of an old mill worked by water There is a figure of a man standing in the water & it goes by the name of Jonah. \n\nAs soon as we arrived in N’hampton we dug up a boarding house to stop at, had a wash and the tea. We got a very pretty room with a double bed, for","92":" \nfor\n & were pretty well satisfied with our bargain. We had a good look about the town especially the fair which \nwas\nis on in the market place every Saturday and returned to bed about 9 p.m.\n","93":"\n\nWe did not get up until 9 am today as the people told us they slept in a little longer on Sundays. Had breakfast & walked around town. We got caught in rain while doing a tram ride so we returned to home & dinner. In the afternoon we went to Abington Park but could not see this at its best owing to the rain. \n\nComing home we had an experience. Owing to the long distance & as we were a little tired we thought we would take a bus to Bedford. So we persuaded the bus driver to let us take our bikes on top & were charged \nthe\n 1 fare for both. After going about three miles & while ascending a pretty big hill the\n\nbus suddenly stopped & started to run down hill backwards. The ladies on board got very excitable especially as it looked like running into the ditch. It was pulled up all right and it was found that the back axle was broken The driver took my bike and went back for another bus. \n\nAfter about two hours one came along but it was only a single story one and overcrowded as it was. We got on top where the luggage is usually carried & had a good time there. A little further on a big crowd wanted to get on. \nThere\n The annual feast was being held in this village & the people were just going home The people hold a feast in every village once a year when a merry go round & the usual shows visit the place. However the people gradually dropped off at the various villages en route and we went below about 10 miles from Bedford. We arrived there at 11-5 being 8 ½ hours on the road. \n\nAfter walking through Bedford we mounted our bikes returned them to the owner at Wilstead and got home a little after 12. The trip was interesting & Northampton is another town added to those which I have visited.\n","94":"\n\nWent out on cable wagon as No. 3. An air line was being run so I had a very easy time while the other numbers were very busy. \n\nWe went to Clop Hill which is a pretty place and saw a flour mill being worked very smoothly by water. We discovered a few ripe blackberries along the road and were given an apple by some people who had a couple of trees. The scarcity of fruit \n\nwill not be so bad when the apples ripen\n","95":"\n\nOn wagon again as No. 4. Rain started about 10 am and were advised a little after 11 to return to camp immediately We returned after resting the horses and we came into camp at a great pace \n\nAfter unharnessing the horses we wheel the wagon to its place in line with others. I was on one wheel \nbut the others on the\n when the wagon swerved my way & went over by toe. I hopped around a bit but walked back to my tent & started to change by clothes which were wet. I had changed shirt & tunic & was removing \nby\n my boot when I found sock wet with blood. I had the big toe nail nearly squeezed off so reported to the doctor. After having it washed and bandaged I was put to bed so that I would not get it knocked about further. I was very surprised to see the toe hurt like it was especially as I thought \ntoe\n injured toe nails very painful. \n\nIt is just as well that I can, if I desire, stay in bed as it is very wet & cold at present. So though I suppose I have a sore toe I am doing well and will very shortly be all well again. Spent the remainder of the day in bed having a couple of naps during the afternoon.\n","96":"\n\nCold bleak & rainy day. So I thanked my lucky stars & stayed in bed all the morning. I got up in time for dinner & wrote letters.\n","97":"\n\nIn bed until dinner time and up writing & chatting during afternoon. This is a very easy life and not too bad at all.\n","98":"\n\nUp for breakfast this time & writing chatting etc all day. Pay £1 in afternoon\n\nMotor cyclist whose back tyre flew off whilst going at a fair rate late last night brought in but is not doing too well.\n","99":"\n\nWriting chatting all day again\n\nMotor cyclist sent to Bedford. \nZeppelin\n","100":"\n\nZeppelins reported to have been near camp early in morning. Heavy thunderstorm whilst other chaps were on church parade. Spent good time in bed. \n\nWent to pictures of the Somme battle in afternoon. Owing to my sore toe I managed so that I did not have to fall in line with the others & thus got a good seat. The pictures were very instructive and one can better understand what is happening at the front. There were three showings of the pictures today so that all the chaps could see them. The show was run by the authorities here & the admission was 2d. \n\nIn evening attended a sacred concert in the Y.M.C.A. and witnessed a very good concert. This is the first one I have completely sat out since I have been here\n","101":"\n\nBoisterous day so stopped in bed until about 10.30 a.m. Spent morning in hospital and visited Y.M. during afternoon. \n\nAttended concert in evening when Clarence Wakefield an old comic singer of civilian times provided most attraction & said good bye to Haynes Park as he was leaving for the front. He was given a good send off and was a good comic.\n\nTuesday 5th\n\nHad a good hot bath and in afternoon was removed to a little hospital at Church End about ","102":"\n 1 mile from the camp. It is a two storied cottage & old. Three patients share a room which serves as a drawing room & bedroom. A “handywoman\" acts as nurse and cooks & cleans. It is very nice & the food much better than camp food.\n","103":"\n\nUp at 8 am for breakfast. Fixed up mail in morning\n\nWednesday 6th\n\nUp just in time for breakfast about 8.30 \n\nWriting during morning and in afternoon went for a short walk. Gathered blackberries in evening for tomorrows dinner \nbreakfast\n & spent an enjoyable night afterwards.\n\nMail received.\n","104":"\n\nCommenced day as usual but about 10 am were told we had to return to camp hospital. Gone were the blackberrie tart and all the nice things we had planned with nurse. Back at hospital and despatched last letters home.\n","105":"\n\nSent out of hospital & got no sick leave. I am not on duty yet, so after lying out in sun I arranged about a bed and then went to Bedford on a motor wagon, walked about a bit came back & called in at the hospital to see nurse. Put in evening writing.\n","106":"\n\nParaded sick and got 3 days sick leave and then arranged about a pass. Tried to manage getting the pass starting on Monday morning & getting an ordinary pass for Sunday & thus obtain another day. Officer would not sign it so as I could go today so hung about camp & went for a stroll in evening – Toe much better.\n","107":"\n\nStarted on pass hunting straight away and was disappointed times out of number. At last about 1 p.m. I got both pass & voucher & departed for Bedford on foot. After getting about 2 miles along a motor car gave me a lift and so greatly eased the walk. \n\nArrived at Midland R.S. about 2 p.m. & had to wait until 4-18 for a train. So went for a walk was befriended by a local who took me to his home & gave me a meal. \n\nCaught train, arrived London about 6 p.m. Strayed into a Welsh church & went to Tottenham Court YMCA. Attended a song service & then went to Bed.\n","108":"\n\nStrayed about London and came at last to Charing Cross R.S. & caught train to Gravesend. \n\nStrayed into library had dinner & called at Mr Walters place. Could not get anybody to answer, so went for a tram ride & returned. Mr Walter answered the door & had a good talk over family affairs Had tea then a walk about with Uncle Sam & then Jim took me about the Promenade & then to a show there – Returned to bed at Walters about 11-30 p.m.\n","109":"\n\nTea in bed at 7 a.m. after which I got dressed & cleaned & went for a walk to pier. Bought fish for breakfast & then went home After breakfast visited Town Hall etc and sat out on Promenade until 1 pm. when I met Uncle on pier\n\n& went home to dinner. \n\nAfter dinner went in a carriage sort of affair around hop fields saw a baloon land got some hops & plenty of plums & came home. Visited Uncles Club & the drill room (Market) & went to Pictures with Him. \n\nIn bed again 11.30 pm.\n","110":"\n\nSame pleasant pre-breakfast routine as yesterday. Afterwards visited Mrs Sparrow whom must visit again. \n\nCaught 11.11 am train to London, visited Harold Porsford strayed about until 7.30 when I met Harold at the Abbey Caught 8.40 pm train at St Pancras Stn. just in time Harold seeing me off.\n\nArrived Bedford 9-50 pm & set out for camp on foot & got a slight lift on a bike. But mainly walking I got home 11-35 p.m. doing nearly 7 miles in 1 hr 45 mins\n\nVery enjoyably surprised to find a bed already made for me so turned in straight away.\n","111":"\n\nParaded sick & awarded 3 days light duty Doctor very pleased with the way my toe is doing. Writing in afternoon \nWe held a concert in the Y.M in the evening\n","112":"\n\nChaps arrived from other camps so all the company is again together Writing all day & a ride to Bedford in evening Paid £1\n","113":"\n\nWriting & chatting all day & evening Had a fairly good time Moved into tents on same formation as B’meadows. Old routine being introduced\n","114":"\n\nParaded sick this morning & had bandage off toe. So had a bath in hospital before the orderly replaced bandage With bandaged toe I have not been able to have a bath so I grasped this opportunity by using the hospital bath which is much better than the ordinary ones. \n\nWrote, played draughts & read all day as I missed church parade by being on sick parade. Went to church in evening & had a good time. Raining in evening so returned home early, had soup supper and got to bed in rain pretty late.\n","115":"\n\nParaded sick again 3 days light duty awarded Am tiring of this loafing. \n\nAdvised that we are going back to Salisbury on Wednesday. We held a concert\n\nTuesday\n\nin the Y.M. in the evening & it partook of the nature of a farewell concert to us & the padre who leaves tomorrow. We had a good lively time greatly enjoying ourselves.\n","116":"\n\nAssisted in office for an hour or two in morning & then wrote letters \n\nPadre “marched out\" on a cable wagon drawn by 12 horses the chaps lining the road. At places brooms etc were used to “present arms\". He was a good sport & very sorry to leave us\n\nRainy day except evening when I went for a walk.\n","117":"\n\nOffice works, application for leave to Birmingham fixed up \n\nSpent evening in camp\n","118":"\n\nAs three days’ light duty was up I paraded sick again and was put back on duty – The chaps have for the last two or three days been doing route marches & today I went out also. We marched about 1 mile past Clop Hill & then returned doing about 9 miles. During an ½ hour spell at Clop Hill I visited the flour mill which is worked by water power in a very businesslike manner. The mill was very quiet & interesting. \n\nAfter dinner we marched another 5 or 6 miles and felt pretty tired after doing I think\n\na fair days work for my first day of duty for over 3 weeks. Went to bed with the news of a full day march past Bedford tomorrow\n","119":"\n\nGot ready for a big march but arrangements for taking lunch failed so all we did was a bit of a walk about 4 or 5 miles & returned for dinner. \n\nAfternoon was spent in having a bath & getting ready to proceed on leave which had been approved. Got paid & caught car to Bedford about 5.30 p.m. and found that the train for Birmingham started at 7.28 but would not arrive at Bham until about midnight when obtaining a bed would be a difficult matter. I therefore broke my journey at Leicester where I arrived at 8.30 & obtained a bed at the Y.M.C.A. \n\nOne of our chaps has people at Leicester so he showed me around the town which was pitch dark. The measures taken against Zepps are marvellous in this respect & one can almost feel the darkness. Naturally I soon returned from darkness to light at the Y.M.C.A. not before going a tram ride which was slightly amusing. I gave the conductor 1d & asked her to tell me when the section was up and she then told me it was ½ to the terminus about 1 ½ miles out There soldiers travel half fare as shown on the tram ticket which I am sending home Getting a childs ticket seemed rather peculiar.\n\nThe beds at the Y.M.C.A. where canvas ones in the concert hall & after the concert was over I got to bed arranging to be woke at 5.30.\n","120":"\n\nNot having made my bed properly I woke several times in the night & noticed no matter what time it was, there we chaps in the place having some coffee etc. The place is near the station & I suppose the fellows were waiting for a train. \n\nPunctually at 5.30 am I was awaken and after cleaning up, having a couple of eggs for breakfast I walked about the streets & finally caught B’ham train at 6.48 am. Owing to the mist I could not see much but it was not a bad district. Leicester is noted for its shoe & hosiery & has about 60,000 people. It has I believe an interesting historic past.\n\nAt one of the stations a party of munition working girls got in. They were very lively creatures but evidently decent sorts. One was a very \nyellowship\n yellowish colour which I discovered was temporary & caused through dealing with “T.N.T.\" This girl was making “pellets\" for bombs etc. the pellets evidently forming the explosive.\n\nArrived at B’ham 8.17 am & dug up the Y.M.C.A. but was not of much use to me. Was directed to Bournville where after a tram ride (2d) of about 4 or 5 miles I arrived. I called on Cadbury’s & was informed that no visitors were allowed on Saturdays mornings as it was cleaning up day. No chance of getting through the official told me so greatly disappointed I set out to see what I could of the famous Bournville. Immediately you get near there you notice the place to be more intelligent looking.\n\nIn afternoon trammed out to Kynocks munition factory and just arrived to see changing of shifts. Crowds of people mostly girls all going in just like a crowd going to the final football match on M.C.C. I walked on a bit so as to go in when there was no crush & passed a canal and saw a barge being tugged along by one horse as I had often heard but never seen. On arriving back at Kynocks I was told that no visitors were allowed unless you held a pass from the board of Directors so was disappointed again. \n\nKnocked about the streets & finally as I was having a tram joy ride I \npassed\n chummed up with one \n\nof people who invited me home to his place. Had tea & a \nbit\n good sing song, his wife playing the piano. We sang hymns & as they both belonged to a choir we tried some athems including “Son of my Soul\" “Hymn of peace\" “Seek ye the Lord\". Had a good time & supper & was finally “seen home\" by the kind chap. \nWalking\n Finding my way home myself would have been impossible owing to the extreme darkness. I was very thankful for this evening as the disappointments previously received were leaving me with nothing to do but walk the streets & feel “fed up\".\n","121":"\n\nUp today with a definite thing to do as I found out the Lane church was well worth visiting. So after breakfast I went there and got a good seat. It was a Congregational Church which Dr. Jowett used to have previous to going to America. He used to command tremendous congregations & now he returns once a year & admittance to church is by ticket only. I am sending home the church programme. The place was rather fashionable and though people \nwere did\n were rather reserved I managed to get a hymn book & greatly enjoyed the whole service. The anthem was fine.\n\nOn coming out I got a special paper two Zepps down & saw the people from church rushing the tram home.\n\nAfter walking about I had dinner & then went for a walk & ride round Moseley which is the fashionable quarter. Got back to town had tea & arrived at Station in good time to catch 5.45 pm train to Leicester. With a train at 7.48 from there I reached Bedford at 8.42.\n\nOn the station I met a Royal Engr. chap & thinking to arrange about a conveyance to Haynes Park asked if he were going to the Park. He said Yes & said he had two bikes would I ride one back. He had come to see his wife off to London. She had been visiting him & that accounted for the two bikes to go back. My luck was in and we soon arrived back in the village. He had to return the ladies bike so I went with him & were invited in for supper at the place Here we had a sing song & supper & a chat. \n\nI at last arrived home finding my bed made as I had arranged with Joe Frost I had a good time this leave but disappointments slightly minimised my good time First Ernie Pynor’s application for leave failed & I had to proceed alone & then Cadburys & munitions factorys were closed against me Anyway I had a good look at another town & found it as perplexing as London almost if not quite as busy.\n","122":"\n\nMy leave did not finish until 7-45 so I did not propose to rise at 5 am. I heard however that we were at last after numerous misfires to move off to Salisbury first thing. So I was up and got my bag packed. \n\nAfter being addressed by the Colonel we marched through the camp behind the band & said goodbye to the good old camp. The band saw us right through the village & then we plodded on to a siding nearly to Bedford, entrained in a special train & left the good old place behind.\n\nContrary to our expectation we had a fine time at Haynes Pk. Even being 6 miles from Bedford & having to rise at 5 a.m. did not blind our eyes to the fact that it was a good camp. The food arrangements were admirable & there were many good friends I made in both the camp & the village. The chaps at Fenny Stratford Dunstable etc all reckon they had a better time, (certainly they had much more leave & better hours) but the time I had at Haynes Pk was very enjoyable.\n\nAs our train was a special we did not need to change but just near London changed the Midland engine for a L.S.W.R one. Arrived at Amesbury after 5 p.m. & then marched to camp feeling rather travel weary having\n\nput in about 6 hrs in the train.\n\nAs usual arrangements were defective but finally things got settled & had a good night’s rest\n","123":"\n\nRevielle at 6.15 (what a change from 5 am) & fooled about all day on fatigues & getting camp in decent order. Continually tired today the last few days tearing around evidently requiring a little rest.\n","124":"\n\nMess orderly today but for a change was rather busy. Had a little time off to write. Rather wet day though the King inspected the 3rd Divisional and other Australian & New Zealand men. There were 45,000 men inspected I believe & there was a fine parade\n","125":"\n\nGeneral fatigues clearing up again and nothing worth noting with exception of it being a fine day. Rumours re 4 days leave & a move to France are becoming current. Writing in evening & posted mail\n","126":"\n\nMade a mounted number & had to work at stables This is slightly promising but evolves extra work. On horse picket at night but had easy time\n","127":"\n\nOwing to being on horse picket I was not on first parade. Rest of the day holiday owing to sports. Walked to camp of German prisoners & saw them building a road\n\nIn afternoon went to Sports which were held in a hollow the hills around giving good position to view sports which were very good. Something very interesting was on pretty continuously. The heads were in the hurdle jumping which was good one lady jumper being present. \n\nAeroplanes were all over the place. At one time when I thought of counting them I counted 10 in the air. One alighted close to the sports after flying close to the ground for some time and there was a rush to look at it. It was a double seater and I got a good look in both seats & at the engine. While looking in pilots seat the \npilot\n chaps came along, got in & flew off. I had a great view. After flying low for some time they went up higher and looped the loop twice just above the sports & comparatively only low down. The sports were very good, so I had a good afternoon.\n\nEvening I had a walk & returned early\n","128":"\n\nOwing to stables taking a long time we were too late for church parade. Spent morning reading walking & watching buck jumping on some of our rebels. By the way we had an extra hour’s sleep last night owing to the clock being put back at 3 am to 2 a.m. Walked to Durrington & had a rest at the local Church Soldiers tent & got back to camp in time for tea. \n\nVisited Y.M.C.A. No. 2 in evening where a sacred concert was held Very excellent program was rendered a Miss Prendegast being encored 3 times for violin solos. This artist celebrates her 100 visit to Salisbury next Wednesday week This is a rather fine performance as she comes from Bristol & once during the winter was carried on a stretcher\n\nacross the mud. Enjoyed the evening very well & in addition to enjoyment found the evening encouraging & edifying.\n","129":"\n\nUp and at it to transfer camp. Completed stables hurriedly and then packed our bags & had breakfast. Cleaning huts, returning stores, loading wagons etc all day having great fun with refractory horses & being up to the ankles in mud. \n\nAbout 4-45 pm. was detailed to take bikes to new camp & so arrived there fairly early. Tea was waiting and after consuming it got bedding issue & a hot bath.\n","130":"\n\nDetailed to a party to run lines for a section which is now isolated & waited all day to be called upon to commence work. Not much doing today\n","131":"\n\nLong expected mail arrived. \n\nCommenced cable work running lines on telegraph poles already erected. Connected 11th Field Ambulance 10th Brigade to Div H.Q. When we had finished work we all mounted on the wagon & came home just like returning from a picnic. It is very nice being on your actual work and we spent a very enjoyable day at pretty solid work \n\nPaid 15\/- in evening\n","132":"\n\nRunning lines again & generally enjoying ourselves on it. Writing in evening.\n\nThursday\n","133":"\n\nCleaning harness & doing stables in morning, innoculation (para-typhoid) in afternoon. Rainy. Horse picket at night and had a good feed before commencing.\n","134":"\n\nFooled about on cable wagons until tired of it when we did washing. \n\nLeave obtained in \nevening\n afternoon & went with Ernie Pynor to Salisbury catching a car from Amesbury. On the way in we passed a big mound called Old Sarum where excavations have taken place to see what can be discovered of the old cathedral built in very early Norman days prior to the transfer of the district cathedral to Salisbury. \n\nOn reaching the city we wended our way to the Cathedral entering through the gateway through the wall which surrounds the place. A beautiful lawn which I understood was once a graveyard surrounds the cathedral and a plan of all the graves is still, I understand, preserved so that any corpse can be located. \nThe\n We just got inside the place when a service started & we had to see it through standing a great part of the time and listening to the meaningless chanting etc which appeals to one as farcial. Just after a service one of the choir men showed us around explaining it all. \n\nAfter that we walked about & arrived at the Town Council Chambers where a light tea was obtained at a reasonable cost. These council chambers are used as a sort of tea room for soldiers each Saturday & Sunday, young ladies waiting, & an orchestra in attendance. After tea we went to a show & saw pictures of the review of Australians by the King. We had just come away from the fairly enjoyable entertainment when we struck a off to Lark Hill so we caught it & got home about 9-45 p.m.\n","135":"\n\nStables as ordinarily first thing & church parade in a picture theatre at 9 a.m. Wrote letters for the rest of the morning & afternoon with time off to “feed up\" at stables at 11 am & 4 p.m. Immediately after tea went with Pynor & Nichol to Amesbury Wesleyan Church conducted by a couple of Aust. Chaplains. Had a very enjoyable service & a good chat on the way.\n","136":"\n\nStables again & started another line Put in a very good bit of work – completing about 3 p.m. after putting up an excellent line. We had a bit of lunch at the usual time but had hot dinner on return\n","137":"\n\nReeled up a little line and had but a easy time. Writing in evening.\n","138":"\n\nOut early with wagon to Greenlands farm and laid lines having \ndinner\n lunch out there & returning to camp in time for late dinner. Tried to get into concert at YM but it was too crowded\n","139":"\n\nDetailed to Day Stables & spent whole day attending to horses & stables.\n","140":"\n\nUp at 5.30, breakfast at 6 pm left camp on wagons about 7-15 am for Greenlands farm. \nLayed\n Laid line about the camp \nuntil about 3 pm\n lunch being had at usual time. About 3.30 we were sent out to reel up a line and found it about 3 ½ miles\n\nAfter that we had to put down a line to a dug out which we could not find. After much kicking out we finished in darkness & arrived back at \ncamp\n HQ to water horses and then partake of an excellent stew cooked on an open fire. The HQ was in a cump of trees and we had very little low tents to take 5 men. Guns & observation stns were all over the country & we had to provide communication. \n\nAeroplanes were scouting & passing by the office dropped messages evidently the result of their scouting. The planes flew very low to droup the messages which we attached to a stream of red, yellow & blue cloth acting as a tail. \n\nThe artillery commenced about 8 pm. firing but little, star shells illuminated the country & the infantry were active in the trenches. We were inactive having a good sleep in our little tents\n","141":"\n\nUp at 5.30 p.m., watered horses & washed at pump in the farm near by. Breakfasted & away reeling up lines all over the place until about 1 pm then returned to our camp arriving home about 2.15 p.m. \n\nHad a feed then took our ease and cleaned up a bit. Enjoyed our little scheme & did real hard work\n","142":"\n\nStables as usual and then church parade at the Pioneers Camp. Writing and walking in afternoon Went to Amesbury Church in evening but Rev. Holden was unavoidably absent. Had good time as usual\n","143":"\n\nStables. Referendum day. All chaps under 21 were falled out & we relieved fellows over 21 who were on duty. In afternoon we were to go for inoculation but before my turn came the vaccine had run out. Later rifles were issued to us for what purpose I know not. The rifles are the long Lee Enfields. Very cold day and bright\n","144":"\n\nInnoculated with second dose of para typhoid in morning. Afternoon harness was issued & cleaned. Evening horse picket shift 12 – 3. \n","145":"\n\nHarness checked & defeciencies supplied All mounted numbers have a full issue of saddlery etc. Paid £1 & colors issued in evening Pay books were handed in for audit in London.\n","146":"\n\nMail of 8 letters arrived and a good time provided in reading same. Cleaning harness in morning & transferring stores from hut to hut in afternoon. Writing letters at express speed in evening\n","147":"\n\nDay stableman today & stuck on stables all day. The weather is very cold here though fine and at night we generally do a freeze. Stables first thing which was a sort of curse is now a blessing as going about ¾ m. & working vigorously at grooming knocks the early morning coldness right out of one. Naturally we are getting a little shrewder and will soon make up a bed warm enough for this sharp climate.\n","148":"\n\nStables again same every day. Second parade I paraded sick and had my toe inspected. Doing famously. After medical I had my teeth seen to. One was filled & others are to be done on Monday. Afternoon attended to harness & in evening walked to Amesbury with Nick.\n","149":"\n\nStables first then church parade with some chaps in Y.M.C.A. Those who wished to attended a church other than the C & E. and \nwe\n I fell out. Arrived just in time for sermon in YMCA\n\nAfter church washed my everyday breeches and wrote. Afternoon writing and in evening went to Amesbury Church though it was raining. Had supper in the S.S. after church & walked \nbacked\n back again & went straight to stables to do horse picket. Rather tired.\n","150":"\n\nMy shift was 12 to 3 and during that time cleaned harness etc In \nday &\n morning fell out for dental treatment but had nothing done. Afternoon one tooth was prepared for filling tomorrow. Writing to catch mail tonight.\n","151":"\n\nMy detachment went out to West Amesbury running a line & as I had an appointment for dentist I stayed behind and did practically nothing but cleaning up clothing & resting. Waited nearly all afternoon for filling, got done & have to return to dentist for polishing any day. Bed early.\n","152":"\n\nDone\n Cleaning harness etc in morning. Inspection of horses up till about 1 p.m. Afternoon cleaning harness. Evening advised receiving leave on Friday.\n","153":"\n\nOn harness again in morning. In afternoon paid only those going on leave being so treated. Later on spent time on harness but managed a little cleaning up. \n\nAfter dismissal cleaned up ready to leave in morning but was advised that I had to clear off tonight as now railway accommodation was available in the morning. Soon collected my but as too late to catch a car to Salisbury & so connect with a fast train to London. I had to walk to Amesbury caught train about 8-35 and after another sleepy trip reached London after 1 a.m. \n\nA mail of 4 letters from Aust. 1 from Gravesend & 1 from Miss Wyatt arrived at midday.\n","154":"\n\nArrived Waterloo at 1 a.m. and was met by a Y.M.C.A. man who asked us where we wanted to go. I only wanted to go to bed so they soon packed me in a motor car and drove me to the “Victoria League\" where I got a room & bed for 1\/-. The Y.M.C.A. car was driven by a lady & was just the thing after putting in such a dreary trip. \n\nHad a lovely sleep in nice sheets and was up at 9 a.m. Breakfasted & went to see Harold & arranged to meet him at his place at 9-30 a.m. on Sunday and in the meantime I managed for myself. \n\nReturned home to Victoria League, it was raining and rang up Miss Wyatt & arranged to meet her at Piccadilly Tube at 2 p.m. Spent a pleasant hour reading before a fire in the billiard room, had dinner at Tottenham Court YMCA & went off to Piccadilly. I was to recognise her by her extreme tallness, a black hat & coat. My disguise was the uniform with elliptical purple patches on my arm.\n\nMet all right & she marched me off to Corner House for tea. This is a fine place one of Lyon’s best places and pretty good too. After that we chased about for some numerals “A\" which the fellows who were in the first three landings at Gallipolli wear. Though we tried military taylors in the Strand & all over the place we were unsuccessful Miss Wyatt then showed me the Strand Palace a rather fashionable hotel. \n\nLater on we visited Regent House and another one of Lyons establishments These places are just wonderful the fittings being A1 At tea time these places are very crowded and the inevitable que is formed. There is splendid orchestral music at these places and we spent a rather long time in Lyon’s place chatting to an Australian soldier friend of Miss Wyatt, his sister, Miss Wyatt. During the afternoon when I was with Miss Wyatt I met a few theatre people including a Jimmie Learmouth who draws £100 a week as a comic. Miss Wyatt has something to do with the stage where evidently she met these people. \n\nAfter tea we said goodbye to the others & visited the Palladium a wonderful sized theatre. Miss Wyatt just produced her card and two tickets were forthcoming. Good seats too and had a good view of everything. The show was not too bad, not startling \nrather too\n and was over a little after 9. They run three shows a day at this place 2.30, 6.10 & 9.30 p.m. \n\nAfter coming out I said goodbye to Miss Wyatt, thanked her and went to Shakespear Hut to see if I could get accommodation there but found place full. Returned to Victoria League where I had left my gear and went to Aldwich Hut which was also full. So went to the “Little Theatre\" YM and got a bed there. \n\nThe chap fixing up the tickets seemed to catch on to my name rather easily & he said he knew people in London of my name. He said one chap was a Lieut in London Scottish and another was in Salonika A lady whose nee name was Liebert often visited the place and the chap was to speak to the lady about me & I was to call back on Sunday to hear of any results.\n","155":"\n\nUp at 7 am, had breakfast, looked about for somewhere to go at night and caught 9.20 train from Waterloo for Hampton Court. Had a little walk along the Thames and then went into Hampton Court. This is a fine old palace built for royalty about 1700 and is noted for its fine gardens & grounds. The historic grape vine & the maze are the more famous items of interest in the grounds. The photos which I posted show some of the best points.\n\nI left the Court called into a shop to buy the cards & talking the man told me the quickest way to get to the football match was by changing at Clapham Junc. Changed as advised and had dinner at a restaurant while waiting for the train. Though this is a rather poor quarter I got a real good dinner. It was in this place that a girl scout told me that my chin strap was twisted. Just a young little girl who had her chin strap carefully straight and who seemed to take great interest in her appearance. This rather amused me. \n\nCaught a train to West Bromfield which was supposed to be near the Queens Club Ground. Had to walk a mile or so and arrived at the ground all right. A \npre\n match between some of the Headquarters Sections was being played when I arrived and at 3 pm the match commenced. The match was pretty good and the 3rd Div. won after a fairly exciting match by about 2 goals over the other Training units in England. There was not much keen barracking though the match was close. A fairly good attendance was present but I did not meet anybody other than our own Coy. \n\nI went back to London in the tube & suddenly found that Bill Mason was sitting next but one to me. He has a mo now and is improving well. He is in a convalescent home in Dartford near Gravesend and managed to get leave to see the match. \n\nI hurriedly had tea and a clean up at Tottenham Court YMCA and rushed off to the Wieminister Wesleyan Hall to a concert. Doors opened at 6.15 & I was there in the que when they opened & got a good seat for a 1\/- & 2 tax. I was sitting next to a lady with whom I soon got into conversation. I soon found that she was a great hospital worker & told me that she was adopting an Australian soldier who has been badly wounded. This chap comes from Brunswick. I did not know him. \n\nThe concert was very fine and I am sending the program home. I soon got home to the Shakespear Hut where I had booked a seat early in the morning and was soon a bed leaving advice that I wished to be called at 7 a.m. next morning\n","156":"\n\nUp a 7 a.m. cleaned up & breakfast – and took things easy. Booked bed \n& left\n which took some time and had to leave in a hurry without leaving my coat. Buses were very scarce so I was a little delayed. \n\nHarold was all ready for me and we ran to the tube Stn (Victoria) and went to St Pauls via Blackfriars. Got a seat just in time many people having to stand. The crowd was very large but the service disappointing & dreary altogether. It was over at last after enduring watching \npoor\n women standing up. It was hard enough for me standing during the chanting but the people standing could not have enjoyed themselves much.\n\nHad lovely dinner at Harolds place and went out for a walk. By the way Harolds landlady Miss Cory, Rolf Jansen & a few other chaps went together to St Pauls meeting them at Victoria Tube. Had a good bus ride to Regents Park there being 6 Australians together. Walked about the park squirrels being very plentiful & tame. Even sparrows feed out of the hand of people. A woman was speaking out there on a wagon with a sign up “We want Hughes here & now\" We listened there and returned home to tea. \n\nAfter tea we went to Congregational Church where a decent service was attended. The preacher is rather famous. Rev \nMorgan\n Campbell Morgan and I enjoyed the service very well. Returned from church had a chat & supper & returned to Shakespear Hut after having a real good day\n","157":"\n\nOut fairly early amid rain and caught bus for Woolwich taking about 1 hr 22 min to arrive there. The barracks were some little distance from the bus & after some trouble found the \n\nP.T.O.\n\nThis is the last of the two writing tablets which I brought away with me from home. Luckily I got paper of the same size to act as reinforcements.\n\nAdjutant but found I was too late to see anything much so returned to London enjoying the ride very much. The fare was but 5 ½ single and was very interesting. Enquired about train for the night at Waterloo, visited Army & Navy Stores to buy some cards & had dinner at the Australian H.Q. Institute. \n\nAfter dinner went to the Coliseum – owing to rain and saw \none\n the largest theatre in London. After tea walked about the streets returning to Shakespeare about 9 p.m. \nto eat\n packed up and arrived at Waterloo Stn in good time for the 10.5 pm special train for Amesbury arriving about 1 a.m. and walking home got to bed about 2 a.m.\n\nMonday\n\nThis trip I had a good time as above accounts show. If this trip has done anything at all for me it has made me appreciate the Y.M.C.A. more. On my previous trip I stayed at a permanent Y.M.C.A., the Tottenham Court one, the National H.Q. This time I \nam\n did a sort of tour of the war-time places and am full of praise for them. Arriving at Waterloo at 1 am, being met by a motor and taken gratis to accommodation and making use of the refreshment arrangements at all hours of the night force one to greatly appreciate the work of these people mostly ladies.\n\nMiss Wyatt was very kind and greatly helped to make my time enjoyable.\n\nLondon is a fine place and though trips to Scotland or Wales would have perhaps been more enjoyable & educational I have a good time\n","158":"\n\nUp again & at stables 6 am and had rather a rude awakening that work was commencing again. Went our with wagon as a mounted number to Upper Woodford a rather pretty place past Amesbury. Had a fine time, the day being fine and everything going well. I was No. 7 and had plenty of work. We finished laying had dinner on road & then returned home \n\nWriting at night\n","159":"\n\nRaining heavily. In the morning I was shovelling mud away from the stables and in afternoon I got a washing parade & so avoided the dirty muddy work. Evening writing\n\nThursday 1st Nov.\n\nRaining heavily. In the morning I was shovelling mud away from the stables and in afternoon I got a washing parade & so avoided the dirty muddy work. Evening writing\n","160":"\n\nOut on a scheme again and had to prepare two horses as usual. The artillery signallers were using our wagon for experience & our Sergt, another fellow & myself went out to help them. Had a pretty good time & ride, got my saddlery covered in mud. Returned home fairly early and cleaned harness. Writing again.\n","161":"\n\nCleaned my duty harness & saddled a horse & took it to Divisional H.Q. for an officer. Afternoon I was brakesman on a forage wagon in pelting rain and used all the afternoon up waiting. Writing\n","162":"\n\nRaining badly again. Very miserable weather now. \n\nCompleted harness early & had a rest considering that we \nwere\n are going out tomorrow Sunday. Went to Rollestone Camp 3 miles with Vin Healy to see Claud. Batchford who leaves for France 3 am. Very wet & sore on returning in storm\n","163":"\n\nRaining and strong gale blowing \n\nMorning was taken easy and about 11 a.m. went to stables, saddled up ready to leave after dinner. Early dinner and then off to the “Bustard\" Inn about 4 miles away and laid lines until about 7 p.m. It rained & blowed for most of the time and I got wet through and my thighs downwards. \n\nIt was great fun preparing for this “stunt\". Some fellows have got south-westers, waterproof helmets, coats, caps of all descriptions. I wore over my tunic the leather jackets, then my overcoat, & then a waterproof sheet. During the afternoon the waterproof came off and that caused my overcoat to get wet. It was a most boisterous day and we worked right up into darkness, thought we lost our way home and had tea about 8 p.m. \n\nThe work is more or less enjoyable but it is not too pleasant in bad weather. Anyway we survived everything joyfully & turned into bed with the advice that we were going out again. Would it be wet or fine?\n","164":"\n\nUp sharp on revielle as usual, stables again, breakfast and straight off out on scheme. Fine day but weather resisting equipment taken as yesterday. \n\nWe were supposed to return for dinner, but as is usual did not get back until about 2-30 p.m. Laid lines etc all the morning but it was fine and I greatly enjoyed the riding about. My mare this time was jolly fine and I could enjoy greatly tearing about on it. Of course on return you have to unsaddle, water & feed your horse & then clean, feed yourself afterwards. Had a good snack off bread & jam finishing about 4 p.m. \n\nHad my kit inspection active service clothes being checked. I am in for new articles as follows hat, 2 shirts, 1 pr socks. Tonight I got my second pair of underpants which fills a long felt want. \nWe were\n Told just now that we leave here on work at 6.30 a.m., breakfast at 6 a.m. \n\nWe are working like niggers now and when we have a little spare time we are trying to dry our clothes etc. Anyway we are doing well and tomorrow we will do a little more.\n","165":"\n\nCalled up about 5.30 a.m. washed & had breakfast early. Horses were brought up from stables & we moved off very early and arrived at the scheme well in time to complete a line before the artillery commenced action. \n\nThe artillery completed their operations about noon and then we reeled up the lines on which we had expended our energies on Sunday Monday & earlier this morning. \n\nAeroplanes were competing against us for delivery messages but one came to grief descending and we beat them easily. The aviator was not hurt much just stunned and I was unlucky enough to be engaged when the actual fall occured. There was a huge crowd of officers from a General down to Lieuts looking about to see how things were worked and I think the cables were very respectable. The batteries of artillery stationed about the country were firing and things were quite warlike while it lasted. \n\nWe laid double lines and had difficulty in reeling up so could not finish before darkness compelled us to desist. I had a pretty good time though – my mare was rather lively and tired out we were all glad to get home & had hot tea. The chaps who were out today got \ntheir\n a rum issue tonight but a good few of us did not accept it. Things have taken an active service appearance. \n\nIt was fairly fine today though intermittent showers compelled us to wear overcoat & waterproof. Writing until late in evening.\n","166":"\n\nOut again to complete clearing up lines out at the scheme. We did not leave until 9 a.m. so we were not so bustled as the last couple of days. \n\nReeled up cable which was not so badly twisted as yesterday Finished a little after 1 p.m. and got home in time to see the other chaps falling in for afternoon parade. Saw to other horses and then had dinner about 3 p.m. Coming home I was centre driver in the 6 horse team and got on all right. \n\nHad a comparative rest in the remainder of afternoon by washing about ½ doz pairs of socks which have been wet through during the last few days wet weather. Writing again in evening.\n","167":"\n\nOut with cable wagon again laying a practice line from Amesbury past Stonehenge. A General inspected us during our dinner time & amp; evidently was satisfied. Reeled in line and arrived back on camp about 4 p.m. very tired.\n","168":"\n\nHard at work with cable wagon once more. Called up at 5 a.m., had breakfast immediately, saddled horses etc and moved off with wagon. Commenced work at Amesbury and laid line mainly along Avon Valley to a pretty high hill. \n\nDuring the morning I had to return to the base to test our line owing to the operator not being able to keep up communication. We had nearly finished the line when I was ordered to go back for the rations. I had to go back about 3 miles for the rations and the poor horse was rather fatigued and could not raise anything faster than a jog trot. \n\nI got the rations and stowed ½ loaf of bread, a lump a butter tea & sugar, golden syrup about my pockets etc and had 3 loaves in a bag. I hastily had my lunch on my return & had to set out to prepare the line for reeling up. We did the line, a rather long & difficult, one, in very good time and are now very tired. Of course on return the horse gets first attention and it quite appreciated its well earned rest & feed. I did the same later on but my rest was but short-lived as I had to get on to harness cleaning doing my stirrup irons in evening.\n\nThe famous Salisbury Plains are not much of plains in the river valleys where the sides of the valley are very steep in places. The places are very beautiful about where we were & the river was somewhat in flood. The rich coloured autumn leaves simply turned one hill golden and riding along \nbetween\n a little track between the trees was just great. There is no doubt but that the Avon valley is very pretty.\n","169":"\n\nNot so much rush first thing this morning but once down at stables after 9 am parade I got busy cleaning dirtied harness. \n\nAbout 10 a.m. we were ordered to pack saddles, put them in wagon and march to Bulford Camp 3 miles for 68 horses. I managed a ride on the wagon luckily On arrival at Bulford we got the horses saddled one each & lead the rest. I had 3 to lead and managed well arriving home about 2-30 p.m. We were immediately relieved for dinner (bread & dripping) and then returned to stables for allotment of horses. \n\nI nearly lost my good old mare. The officers of course had first pick & one of them picked her. Our sergeant however chipped in & said it was a trained horse and so I was left with it. The only training it has received has been from my hands I think and I was just telling him how much it had improved the last few days. Anyway the sergt of 1A stole a march from our sergt and nearly got all the best horses. There was great rivalry and now we 1B had a stable to ourselves so the chaps are shaking down well together.\n\nWe had to fix up our stable then bed & feed our nags finishing about 6 p.m. in the dark. Though beaten in getting the best horses we reckon we will get equal, gave three cheers for our stable and cleared off to tea and were cheered up more by receiving Australian mail. One from Bert, Rudolph & while the Lion arrived at dinner time. \n\nEverybody is feeling in great spirits tonight. Plenty hard work is coming our way now and the last 7 days have been full of hard work, tired nights and as a result good solid sleep.\n","170":"\n\nAt work same as on week days except that we went back to stables immediately after breakfast instead of waiting until fall in at 9 a.m. Cleaned harness & worked jolly hard until dinner time. All this work is necessary to get ready for full marching order march out on Monday.\n\nThe whole division is to march out as if it were leaving the camp absolutely & this afternoon we are to have a very necessary rehearsal – After dinner we went down to stables again this time in full marching order, water bottles, haversack, bandolier & rifle. Fixed things up, saddled horse and was ready for inspection at 4 p.m. Then returned watered fed & bedded down and got away in hurry in order to be in time for church. \n\nRushed back to camp (3\/4 m. from stables) hurried tea down & found I was too late for church Stayed behind & wrote letters at the Institute. A short service was held while I was there and writing was then suspended.\n","171":"\n\nRevielle at 4.45 a.m. and down at stables at 5 a.m. Up again for breakfast at 6 am and on parade with horses and full marching order at 6.45 a.m. \n\nMoved off after waiting about and were practically the head of a procession 13 miles long. All our company were mounted either on wagons, horses or bikes. There was a heavy mist until about 9 a.m. and after that the day was lovely. \n\nWe marched through Amesbury Winterbourne Stoke and Shrewton doing a big semi circle arriving at the camp at the opposite end to which we left it. The total length must have been about 13 or 14 miles and I was rather tired after it. \n\nOf course rushing around like a maniac to get ready in time accounts for a great portion of our tiredness and carrying a rifle slung over your shoulder with a horse jogging underneath you makes your shoulder saw. \n\nI think the march went off well and we arrived back at camp about 1.30 p.m. and set to cleaning our \nhouse\n horses saddlery & stables. Knocked off a little early and had a very much required hot tea. Wrote letters.\n","172":"\n\nDetailed for day stables and knocked about stables all day. Writing at night.\n","173":"\n\nBranding horses all day on the hind hoofs. Rather easy job for me as I was for most of the time keeping note of the number of horses. Paid £1 at night and all kit not for active service handed in.\n","174":"\n\nBranded another horse which arrived yesterday & cleaned harness in morning. In afternoon we had a parade with all teams & horses harnessed. Very cold day and leather jacket used to prevent coldness. On night picket working \n12.20\n 11.40 to 1-40 and getting \nup\n feed bags etc ready for early commencement of a scheme tomorrow.\n","175":"\n\nUp at 4.30 am fed saddled horse which I rode up to camp had breakfast togged up a bit and left camp for scheme about 6.45 a.m. \n\nIt was extremely cold today and found scarf, leather jacket, and gloves very useful. A strong wind was blowing and made your nose & ears tingle. Anyway we made a good trip to Winterbourne Stoke and after a drink of tea to Berwick St James which is a very nice village. We were to supply a line from 11 Bde to Div H.Q. & the exact location of the former was unknown. \n\nI was left with a drum of cable & barrow to run line to the exact office and the wagon set out for Div. H.Q. After a long wait it was found that the Bde was to be about 1 1\/2 miles away so I waited for the wagon to return when we ran the line. Had a long rest and then I had to return to Div. H.Q. for rations. \n\nDiv. H.Q. was at at place called Farnburgh Castle, which is but a series of mounds with deep gullies between. The offices were located sheltered in the gullies which were however draughty. The “Castle\" is the remains of Roman Earthwork defences and was a pretty good place for the H.Q.\n\nThe country about there was very peculiar. Though seemingly flat there are huge hollows in the country and are quite capable of sheltering thousands of troops. On the top the wind was most furious & cold while in the hollow or in the shelter of woods your face felt very hot. Anyway the day was very cold but the additional clothing was very protective. \n\nWe commenced to reel up and I freed the line right up to the H.Q. but the wagon went home \nbefore I\nabout half way through. I was left without orders but was told to return to camp by Lieut Ferguson a new officer who is taking great interest in the men’s affairs and appears to be a decent fellow. I returned with him and had a good ride in darkness. On arrival \nhome\n at stables we were told that 11 Bde H.Q. was burnt down & all papers etc destroyed. \n\nComing up from stables I noticed light snow falling & \nlater\n a few ticks after it came down heavier. Walked up to camp & got quite white and so experienced snow for the first time. I thought the cold was severe and the appearance of snow confirmed my opinion.\n","176":"\n\nRevielle at 7 a.m. having an extra hour in bed for a change. No snow was lying on the ground so evidently the fall could not have been heavy. \n\nWe had to reel up line which we could not get in yesterday but as I had finished clearing the line there was no work for No. 7 so I went \nhad\n out as No. 3. The wagon was unloaded as far as possible and there were only 2 men aboard. We made a very fast trip out to the place and reeled up the line about 2 miles in rapid time. There were 7 miles to ride before we started and it was as usual very cold. We reeled in in a snow storm and of course the snow flew about. At one place the line was\n\nleft in water overnight and the water had frozen over the cable. The ice was so strong that one chap had to dismount & break the ice before we could reel in. \n\nWe got back to camp about three and had lunch of bread & jam. It has been lightly snowing on & off all day and now tonight the ground is covered with it. At the Castle this morning the ground was white while here in camp it \ndoes\n was not showing \nat all\n much\n\nWe are getting used to cold now but still are glad we are not fighting the Eskimos or Greenlanders. Washed clothes in evening.\n","177":"\n\nBack to the 6 a.m. revielle and at work as usual. I was detailed for day stables and returned there immediately after breakfast and prepared horses for inspection. Cleaned up harness for inspection tomorrow.\n\nThe snow fell heavily last night & this morning everything was covered. White practically as far as the eye could reach. It was not as cold as yesterday but unpleasant to be in when the snow got down your neck. A thaw set in during afternoon & everything is now dripping. There was a little snow balling snow-man building done but I was too busy. \n\nGot off stables at 3 p.m. and cleaned up for church. Ernie Pynor had to attend a lecture but we waited until about 4.30 p.m. when we left having tea at the Y.M.C.A. We (Nick & I) arrived in good time and just as the service proper had commenced Ernie arrived. After the service the sacrament was administered and as a final Sunday in England the service was extremely fitting and edifying. It was rather late before everything was over and I can look back on last Sunday night as one of the most inspiring impressive \nI have\n","178":"\n\nInspection first thing after 9 am. parade but though we went to the trouble of getting mounted etc the inspection did not come off. Afternoon cleaned up harness dined in the morning and for evening I was on horse picket. I so missed a lecture about our departure & also the issue of leather jacket gas helmet mobilization blanket & steel helmet. In the lecture the chaps were told that we leave on Thursday proceed by rail from Amesbury to Southampton then to \nthe\n Harve march through Harve & entrain again. \nWe are\n","179":"\n\nUp at 3 a.m. for picket and busied myself about the place. Chaps marching to the Stn. Went along the road & the whole place seems astir. The first lot left yesterday and the last on Saturday. Cleaning harness in morning. Steel helmet, gas helmets, leather vest new shirts & socks issued at night\n","180":"\n\nPacked up saddles putting rug on the front with stable utensils. Cleaned up the stables while in afternoon we had a rehearsal for the march out tomorrow mainly to show us how to dress & over mounting & dismounting role it was very difficult.\n\n"}}