{"Document Name":{"0":"Diary_0241","1":"Diary_0241","2":"Diary_0241","3":"Diary_0241","4":"Diary_0241","5":"Diary_0241","6":"Diary_0241","7":"Diary_0241","8":"Diary_0241","9":"Diary_0241","10":"Diary_0241","11":"Diary_0241","12":"Diary_0241","13":"Diary_0241","14":"Diary_0241","15":"Diary_0241","16":"Diary_0241","17":"Diary_0241","18":"Diary_0241","19":"Diary_0241","20":"Diary_0241","21":"Diary_0241","22":"Diary_0241","23":"Diary_0241","24":"Diary_0241","25":"Diary_0241","26":"Diary_0241","27":"Diary_0241","28":"Diary_0241","29":"Diary_0241","30":"Diary_0241","31":"Diary_0241","32":"Diary_0241","33":"Diary_0241","34":"Diary_0241","35":"Diary_0241","36":"Diary_0241","37":"Diary_0241","38":"Diary_0241","39":"Diary_0241","40":"Diary_0241","41":"Diary_0241","42":"Diary_0241","43":"Diary_0241","44":"Diary_0241","45":"Diary_0241","46":"Diary_0241","47":"Diary_0241","48":"Diary_0241","49":"Diary_0241","50":"Diary_0241","51":"Diary_0241","52":"Diary_0241","53":"Diary_0241","54":"Diary_0241","55":"Diary_0241","56":"Diary_0241","57":"Diary_0241","58":"Diary_0241","59":"Diary_0241","60":"Diary_0241","61":"Diary_0241","62":"Diary_0241","63":"Diary_0241","64":"Diary_0241","65":"Diary_0241","66":"Diary_0241","67":"Diary_0241","68":"Diary_0241","69":"Diary_0241","70":"Diary_0241","71":"Diary_0241","72":"Diary_0241","73":"Diary_0241","74":"Diary_0241","75":"Diary_0241","76":"Diary_0241","77":"Diary_0241","78":"Diary_0241","79":"Diary_0241","80":"Diary_0241","81":"Diary_0241","82":"Diary_0241","83":"Diary_0241","84":"Diary_0241","85":"Diary_0241","86":"Diary_0241","87":"Diary_0241","88":"Diary_0241","89":"Diary_0241","90":"Diary_0241","91":"Diary_0241","92":"Diary_0241","93":"Diary_0241","94":"Diary_0241","95":"Diary_0241","96":"Diary_0241","97":"Diary_0241","98":"Diary_0241","99":"Diary_0241","100":"Diary_0241","101":"Diary_0241","102":"Diary_0241","103":"Diary_0241","104":"Diary_0241","105":"Diary_0241","106":"Diary_0241","107":"Diary_0241","108":"Diary_0241","109":"Diary_0241","110":"Diary_0241","111":"Diary_0241","112":"Diary_0241","113":"Diary_0241","114":"Diary_0241","115":"Diary_0241","116":"Diary_0241","117":"Diary_0241","118":"Diary_0241","119":"Diary_0241","120":"Diary_0241","121":"Diary_0241","122":"Diary_0241","123":"Diary_0241","124":"Diary_0241"},"Date":{"0":"unknown","1":582.0,"2":683.0,"3":687.0,"4":700.0,"5":717.0,"6":742.0,"7":744.0,"8":745.0,"9":747.0,"10":763.0,"11":775.0,"12":777.0,"13":778.0,"14":790.0,"15":806.0,"16":828.0,"17":832.0,"18":835.0,"19":837.0,"20":839.0,"21":846.0,"22":854.0,"23":855.0,"24":870.0,"25":888.0,"26":894.0,"27":907.0,"28":915.0,"29":921.0,"30":934.0,"31":938.0,"32":939.0,"33":940.0,"34":941.0,"35":942.0,"36":945.0,"37":957.0,"38":964.0,"39":974.0,"40":985.0,"41":989.0,"42":991.0,"43":992.0,"44":1003.0,"45":1021.0,"46":1037.0,"47":1049.0,"48":1085.0,"49":1090.0,"50":1103.0,"51":1104.0,"52":1105.0,"53":1111.0,"54":1121.0,"55":1122.0,"56":1123.0,"57":1128.0,"58":1138.0,"59":1142.0,"60":1146.0,"61":1150.0,"62":1156.0,"63":1168.0,"64":1174.0,"65":1178.0,"66":1179.0,"67":1180.0,"68":1181.0,"69":1200.0,"70":1209.0,"71":1210.0,"72":1218.0,"73":1239.0,"74":1252.0,"75":1270.0,"76":1294.0,"77":1297.0,"78":1369.0,"79":1379.0,"80":1396.0,"81":1397.0,"82":1402.0,"83":1426.0,"84":1436.0,"85":1438.0,"86":1473.0,"87":1492.0,"88":1509.0,"89":1510.0,"90":1513.0,"91":1514.0,"92":1569.0,"93":1574.0,"94":1582.0,"95":1591.0,"96":1592.0,"97":1593.0,"98":1594.0,"99":1598.0,"100":1608.0,"101":1614.0,"102":1620.0,"103":1630.0,"104":1634.0,"105":1645.0,"106":1649.0,"107":1653.0,"108":1665.0,"109":1678.0,"110":1798.0,"111":1808.0,"112":1840.0,"113":1845.0,"114":1862.0,"115":1863.0,"116":1864.0,"117":1865.0,"118":1866.0,"119":1891.0,"120":1955.0,"121":1957.0,"122":1961.0,"123":1970.0,"124":1971.0},"Entry":{"0":"\n\n1915\n\n","1":"\n\nEnlisted at\nVictoria Barracks, Sydney\n, together with my comrade, Doug Black. Afterwards in camp at Warwick-Farm and\nLiverpool\nwhere at different times I played the parts of Coy. Sgt. Major, Sergt. and Private.\n","2":"\n\nSailed from\nSydney Harbour\nwith","3":" Rein.","4":" Battn. on H.M.A.S. Euripides (15000 tons), as acting Sergeant, bound for the war, destination unknown, but with great hopes and expectations.\n","5":"\n\nCalled at\nPort Melbourne\n, to drop sick and take on mails.\n\nCalled at\nAlbury (W.A.)\nafter crossing the \"\nBight\",\nmy first experience of rough weather - Crossing the\nIndian Ocean\nwe had beautiful weather, passed few ships, and saw no land at all, we were out of\n\nthe usual steamship routes. - Tropical storms of short duration often passed over us, these could be seen approaching, and after drenching us with rain for a few minutes, would leave again a seaof calm, and a sky of cloudless blue.\n\nIndeed a pleasant trip during which I learned many things, and made many friends.\n","6":"\n\nDisembarked at\nSuez\n, after lying at the Canal-mouth (on which played a search-light) all night. - Suez, a lazy, hot, sleepy, town, a combination of sand, niggers, and flies. - By train (via\nIsmalia\n) to\nCairo\n, passed desert lands broken here & there by \"oasis-villages\" and pestered by Arabs selling oranges. Detrained at\nZeitoun\nand encamped on the desert at\nAbbassia\n(famous for its barracks) - Training hard here - on Christmas day \"Billy-cans\" and \"Comforts\" were distributed.\n\n1916\n","7":"\n\nNew-Year saw us at\nKasr-el-Nil\nBarracks, and on picquet duty in the city to quell possible riots which however were not as serious as was anticipated.\n","8":"","9":"\n\nMy","10":" Birthday, duely celebrated at Abbassia - We shifted camp to \nHeliopolis\n (connected to Cairo by the best tram service I have ever seen) - More hard training in the boiling sun here.\n\nAnuncanny experience on a picquet at \nMancheit-el-Sadir\n.\n\nA picquet for two weeks at \nBab-el-Sharia \n(\nWassaDistrict\n) during which I had many experiences, and learned a lot about the natives - These picquets were night affairs and we spent the day at Kasr-el-Nil.\n\nDuring all this time I learned Cairo fairly thoroughly - visited its Mosques, Bazaars, Museums etc, and got toknow the wily native - visited the \nPyramids and Sphinx at Giza \nseveral times, also the \nCitadel\n.\n\nCairo has a fascination and smell all its own.\n","11":"","12":"\n\nEntrained for \nTel-el-Kebir \n(here was fought the battle of Tel-el-Kebir in 1882 when \"Fuzzy Wuzzy\" broke the British Square, but was defeated by Wolsely). Joined the","13":" Infantry Battalion\n\nJust back from Gallipoli, and reverted to Private.\n","14":"\n\nAgainst my will I was separated from my comrade Doug.and sent to \"C\" Coy and given one stripe.\n","15":"\n\nThe Bn. moved to \nSerapeum\n for garrison work and encamped a few miles on the \nAsiatic side \nof the \nSuez-Canal\n, my recollections of this \"Hell-on-earth\" are anything but pleasant for apart from training that would break the heart of a lion, I think ofthirst, sandstorms, full marching-order, outposts at night and flies and sand.\n\nThe only pleasant break was a swim in the canal sometimes and that was salt,and we had to walk 3 miles through soft sand to get there, and another 3 back. Here we were visited by the Prince of Wales, but he didn't stay long.\n","16":"\n\nRight glad we were to pack up to entrain for \nAlexandria\n, enroute for \nFrance\n. - We boarded HMT \"Simla\" (a rotten ship), called at \nMalta\n on\n","17":" (what a change to be at sea again, in spite of \"life-belts all the way\" and \"submarine guards\" - Arrived at \nMarseilles\n on","18":"\n","19":"\n\nThe beginning of a wonderful train journey, which lasted 3 days and 3 nights and took us right across France - The charm of the \nSouth of France \nin its very green gown of early spring, to our eyes, long tired with sand and desert, held us spell-bound, and as we passed on and on, past rivers, mountains and great manufacturing towns, Lyons, Avignon, Verseilles and Paris itself, cheered by the people, we were thinking \"Here surely is a land worth fighting for.\"\n","20":"\n\nOur destination at last, \nHazebrouck\n a town in \nNorthern Flanders\n, and as we passed along its cobbled roads, (oftimes since cursed right heartily) we heard the first far away rumble of the guns in the battle zone - some 20 miles distant. We marched to a small village,\n\nStaple \n- Stayed here 8 days - ourfirst taste of billets - I was in afarm-house - We always rememberStaple - its good people and itscheap eggs and beer (1d per glass).\n","21":"\n\nMoved to \nOuttersteen\ne, nearer theguns, visited \nBailleul, Merris, Meteran, St Omer \nand \nCassel\n during our stay here. - Here also I was made a temporary corporal.\n","22":"\n\nMoved to \nSailly-sur-le-Lys\n, which showed signs of shrapnel and shells but civilians still lived here.\n","23":"\n\nMoved to reserves at \nCroix-Blanc \ncorner outside \nFleurbaix\n.\nHere I first saw a shell burst, under amusing , if excitingcircumstances, for it burst in our house.\nNext we moved to \nFleurbaix\n village and I had my first taste of fatigues, up as far as the support line.\n","24":"\n\nWe took over the \nfront line Trenches\n relieving a Manchester (bantam) Regt.\n\n\n\nand here in this \"quiet sector\" \n(Fromelles\n) I found it very lively at times; I learned the secrets of \"stand-to\", \"patrols\" \"trench-mortars\", \"sand-bags\", \"shovels\", \"rum\", \"bullets\", \"anti-gas appliances\", \"shells\" and the many other things connected with \"\ntrench-warfare\n\" - here also I saw men wounded and killed for the first time, and this is where the glamour and excitement started to wear off.\n","25":"\n\nFound us back in \"Sailly\" for a \"rest\" which consisted of drill during the day and carrying stuff to the trenches at night. All our rests were like that.\n","26":"\n\nI attended a two days gas-school at\nNouveau-Monde\nand sneaked vists to \nEstaires\n and \nArmentieres\n.\n","27":"\n\n\"\nJay Post\n\" A detached post in the support line; where I was in charge of No10 Platoon (30-40 men) and had no officer; consequently learned what responsibility was - here also I was promoted to full corporal.\n","28":"\n\nIn what was the \nconvent of Fleurbaix\n and did fatigues to such places as \"Tin Barn Avenue\" \"Wye Farm\" \"Dead Dog Avenue\" etc.\n","29":"\n\nIn the line again, just on the left of where we were before \"\nBois Grenier\n\". Here our sergeant also came back for which we were very thankful. I didn't like his job a bit.\n","30":"\n\nBack again in \"\nSailly\n\" less just one or two of the old boys - This was a time of trouble for us all \"Joe\", poor old \"Joe\" lost his stripe and then \"Jordo\" was on the mat for stouching a \"Military Policeman\" and even I did notescape, forcheeking our Sergt Major I was severly reprimanded.\n","31":"\n\nOn the train at \nBailleul\n, and rumour says we are on our way to the \nSomme\n, to take part in the great battle there which started on","32":"\n","33":"\n\nDetrained at \nHeinville-Candas\n (\nvia Doullens\n) and marched to \nSt Ouen\n (14 Kilometres).\n","34":"\n\nMarched to \nVignacourt\n (6 kilometres).\n","35":"\n\nMarched to \nAllonville\n (16 kilometres).\nThe above three days march though hard, were through beautiful country - the wheat fields were ablaze with golden wheat, red poppies and blue\n\ncornflowers - truly a beautiful sight (but how we cursed those cobbled roads).\n","36":"\n\nHere I managed to get poisoned and was sent to the C.C.S. at \nAllonville\n.\n","37":"\n\nBeing pretty bad still, was put on a hospital train and found myself in an Australian Hospital at \nRouen\n. The doctors and nurses were kindness itself.\n","38":"\n\nHospital ship \"Aberdonian\" via\n Havre\n to \nSouthampton\n (held up a day at Havre on account of Submarines). I was a stretcher case and did not see much of the journey.\nTrain from \nSouthampton \nto \nBirmingham \nmy first glimpse of \"\nold England\n\" - in hospital at \nKings Heath\n (board-school) and had a very nice time.\n","39":"\n\nTo Aust Convalescent Hosp. \nHarefield Park\n (\nBucks\n) while here had several outings including one round \nWindsor \nand \nGerrard's Cross\n.\n","40":"\n\nSent to camp at \nWeymouth (Monte Video\n) A good time here and visited\n\nPortland\n and \nBournmouth \n(Dorset).\n","41":"\n\nStart of furlough. \nLONDON\n - my first visit. I thoroughly explored its many famous places.The Tower,St Pauls, Westminster Abbey, etc. etc. Was also introduced to Horseferry Rd, well known to all Australian Soldiers.\n","42":"\n\nLeft London (Euston Station) for \nScotland\n. Arrived at Stirling next day. Travelled via \nCrewe\n, \nCarlisle\n and \nGlasgow.\nA few hours in Stirling gave me a look at its famous castle and also the \"William Wallace Memorial\"and had a glimpse of \nBannockburn \nand \nBridge-of-Alan\n - travelled on same day to \nBallachulish \n(via \nConnel-Ferry\n). Through beautiful Scottish scenery; Lochs and Braes. The heather was out and the country-side truely at its best.\n","43":"\n\nA fine trip up \nLoch Leven\n, by ferry passed the \nValley of Glencoe\n and on to \nKinlochleven \n- Here in this tiny village I stayed with friends and had a really fine holiday.\n\n- Had a trip round to \nOban,\n a pretty West Coast fishing village. - Then spent a week-end at \nGlasgow\n, staying with newly-made friends at\n Bellahouston\n.\nEverywhere in Scotland I was overwhelmed with kindness - I never met such hospitable people.\n","44":"\n\nFound me again in \nLondon\n, and the next day \nWeymouth\n again - what that first furlough meant to me only those who have had a like experience can know.\n","45":"\n\nFound me at \nPerham Downs\n; the most dreary part of dreary \nSalisbury Plains\n. I had an opportunity here of visiting \nAndover\n and \nTidworth\n two more or less military towns close by.\nHere also I learned much to my sorrow, of the death in Action of my mate Doug. Black. and alas many another good comrade in the terrible slaughter at Pozieres and Mouquet Farm, which\n\nI, luckily for myself, just missed.\n","46":"\n\nFound me on my way to \nFrance\nand the Battalion again. I went from \nFolkestone \nto \nBoulogne\n and then by train to our base at \nEtaples,\n where I stayed, over a week, passing doctors, and drilling atthe famous bull-ring.\n","47":"\n\nAfter two days train journey we arrived at \nAlbert\n(much talked of then) and here we stayed for a few days, and became familiar with \"\nSomme\n\" mud. We tramped through miles of this sticky, slimy repulsive mud (sometimes up to our knees) up to \nDelville-Wood\n,which place of ill fame had been captured a few weeks before, after changing hands several times (it was here that the South Africans did so well but alas were almost wiped out.- Scottish troops also had been in the thick of it,for the remains of the fight lay thick\n\nabout us - Broken guns - dead horses and dead men, both British & German and these sights sort of slightly put the wind up one of our party at least!\nWe found the old Battalion in front of this Delville Wood, in bits of trenches with 2 or 3 feet of thick slimy mud at the bottom, and straight into this I went.- Those days were indeed \"hell\" and made me wish for Egypt again with its heat & sand for mud and water were everywhere.\nHere in the front- line I had my First narrow escape, a shell burst at my side burying myself and another digger - after pottering round about between the village of \nFlers\n and the trenches, carrying rations or manning trenches for a week or so, we were relieved and marched to a \"Nisson Hut\" camp at \nFricourt\n,from there after more days of work in the mud we marched to \nBuire\n, just beyond\n\na5760016.html\n\nAlbert, and from there by Busses to \nFlescelles\n,it was a bitterly cold, snowy, night ride too.\n","48":"\n\nAfter 10 days, glorious in spite of drill, we marched to \nVignacourt \nand entrained for \nBuire\n, but as I was billeting N.C.O. for my company I went by motor-lorry, and spent a few hours in \nAmiens\n, (a great city) on the way,\n","49":"\n\nWe went up to the mud again - \nMametz-Wood\n, in huts.\n","50":"\n\nTo \nBernefray wood\n.\n","51":"\n\nWe relieved","52":" Bn, in \nGap and switch trench,\n- and here we spent Christmas day, shall I ever forget it. I was sharing a \"dug-out\" with Wally Back and Smithy was orderly Corporal - these were days &nights of hard work - our \"home\" often required bailing out too. - I got a shell (just a stray) uncommonly close one day - landed right in the trench and knocked \"Mick Hallett\" and myself over - but not a\n\nscratch.\n","53":"\n\nWent to \"\ngrass-lane\n\" where Fritz, plonked big stuff all night- then up to \n\"Cheese-road\"\n and to such places as \nFrost-trench\n, \nFritz folly, \nand \nGoodwins Post\n, where I had various jobs, amongst them patrols and fatigues. Many little incidents - stories in themselves, \"Jimmy Maguire's ration party,\" \"The Bombing post blown out\" \"Old Passmore in the Mud\" My day post at Fritz Folly.\nOur new year and my birthday","54":" were not celebrated as times were to hard.\n\n1917\n","55":"\n\nWe were relieved - how thankful we were - in spite of that heart-breaking march in the rain to \nCoolgardie Camp\n. This trip was worse than the last, for we had snow and frost as well as rain and mud; was there ever such a winter as this? - trench feet claimed many victims, but I managed to keep going thanks to the sox from the good folk\n\nat home.\n","56":"\n\nBy train to \nMeaulte\n, and marched to \nRibemont\n.\n","57":"\n\nMarched from \nRibemont\n to \nContay\n - bitterly cold and hard frost- football in the snow.\n","58":"\n\nMarched to \nBecourt Camp\n.\n","59":"\n\nBrigade in Reserve at \nBagentin -le-Petit\n.\n","60":"\n\nBrigade Support at\n Eaucourt L'Abbaye\n, (\nHexam\n \nRd\n - \nButte-de-Warlancourt\n) \nLe Sars\n - \nHigh Wood\n).\n","61":"\n\nFront line\n, snow and freezing cold but thank God! no mud and we had deep dug-outs for a sleep in when off post. Pineapple bombs were Fritz's long suite here - Our boys had a raid on the \"\nMaize\n\" here, but the barbed wire beat them.\n","62":"\n\nTo \nFricourt Farm camp\n via \nSuicide Camp\n and \nBazentin -le-Petit\n (Birdwood visited us here and told us to keep boxing on).I also visited Doug Black's grave at \nPozieres\n whilst here and saw our memorial cross erected on the hill there.\n\n\n","63":"\n\nAfter ten days fatigues we went to \nAlbert\n and billeted in the town, only to be sent back to \nBazentin\n, all in a hurry - Fritz was retiring, and we were to follow him - What excitement!\n","64":"\n\nWe occupied the Huns old Front Line System - \"Smithy\" and I slept on a duckboard, and counting the shells - he was shelling us, as he retreated.\nWe buried dead men here. - Poor devils had been lying there for months, we worked for days and then had to hurry on leaving many unburied still - A gruesome job, but a duty.\n","65":"","66":"\n\nWe went forward at night throught the villages of \nLe Barque\n and \nLigny Thilloy\n and took up the pursuit.\nI had 6 men on a post right on the \nAlbert-Bapaume road\n, about 1000 yards from \nBapaume\n. - That morning under cover of a dense fog, the \"Russian Guards\" raided our positions and we\n\nhad some good fun, and splendid shooting for our rifles and Lewis Guns. (I captured 2 prisoners) in this little affair, not many Prussians got back to Prussia, but we also lost some good men. - He managed to bomb our Company Headquarters.\n","67":"\n\nTo \nBazentin-le-Petit\n.","68":" Div. took up the pursuit and entered Bapaume a few days later.)\n","69":"\n\nWe then went to \nContal Maison Montauban\n and to billets (the same old ones) at \nRibemont\n.\n","70":"\n\nWent to","71":" Div. Inf. School, \nTirancourt\n and had a fine time - \nAmiens\n - \nLe Chausee\n - \nPicquigny\n- \nAilly-sur-Somme\n - \nVillers Bocage\n, - \nHaiponville\n- \nBouzincourt\n.\n","72":"\n\nFancy being able to March in broad daylight up the Albert-Bapaume Road to right into \nBapaume\n - poor old place! - what a ruin it was and stilll smoldering - then we went\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","73":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\non to \nBancourt\n - where our boyswere resting after Bullecourt,(another big stunt I managed to miss.\n","74":"\n\nBack at \nBazentin\n via \nFlers\n.\n","75":"\n\nMarched to \nBuire\n and our well earned rest - for the Battalian stayed at Buire for 3 months.\n","76":"\n\nHere I was made Lance-Sergeant and sent to \nEngland\n, with 3 others for 6 months duty with the training battalion (so we were told) but for me it only lasted 3 months. - Had quite a nice journey over via \nAmiens\n, \nBoulogne\n, \nFolkestone\n, \nLondon\n, and \nSalisbury\n to \nLarkhill\n on the plains.\n","77":"\n\nWe started duty at the camp, training recruits, during my stay here we were camped near \nStone-Henge\n - I explored that part of the County of Wiltshire, \nWinterbourne-Stoke\n \nNetheravon\n, \nDurrington\n, \nBulford\n, \nAmesbury\n\nand various other picturesque rural villages were objects of our various Sunday afternoon walks. I had two days at \nSalisbury\n and two in \nLondon\n, at Salisbury (Old Sarum) I explored its wonderful Cathedral there, and other ancient sights, - and in London I visited \nRegent's Park\n (zoo) and Madame Tussards Waxworks.\n","78":" to","79":"\n\nI had 10 days leave and further explored \nLondon\n, \nThe Thames\n, \nRichmond\n, \nKew\n, \nPutney\n and \nHampden Court\n(Wolseley's Palace) - \nThe Art Gallery\n and I visited Eric Lowe's grave in \nNunhead Cemetery\n. - Then had a few days at \nLancaster\n and \nMorcambe Bay\n - then on to Glasgow, and while there saw \nBalloch\n, \nLoch Lomond\n, \nDumbarton\n, \nOld Kilpatrick\n, \nPartick\n, \nPaisley\n etc. Had a grand time but didn't think Loch Lomond worthy of all its praises, it is no prettier than \nAwe\n, \nEtive\nor \nLeven\n, but nevertheless it is very big & grand looking.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","80":"\n\nI was recalled suddenly to \nFrance\n - I went via \nFolkestone\n - \nBoulogne\n and \nHavre\n, up to \nCaestre\n. Here we waited in Reserve for we heard the Battalion were heavily engaged in the \"","81":" Battle of Ypres\n\"\n","82":"\n\nWe expected it and were ready; we were called up at midnight, and went to \nYpres\n, then to \nCafe Belge\n, and on to \nDickebusch\n where the boys were - Next night to \nAnzac Ridge in Trenches\n. My! what a night and dark, we got lost a few times, \nJabber Track\n and \nHelles Track\n at last! and we got there - I had No. 9 Platoon. Next day we witnessed some rather exciting Aerial Combats, and that night were relieved, and went to \nHalf-Way House\n, then to \nWhippenhock (Mud-Farm\n) via \nYpres\n. - Here I had my first good look at that poor battered city, and battered it is. They say, the most knocked about cityin the battle Zone anywhere!\n","83":"\n\nFound us in billetts outside \nL'Abelle\n,where we had nightly shows by\n\nFritz's planes, and our searchlights quite interesting too. Then another trip to \nYpres\n, \nCafe Belge\n and \nWesthoek Ridge\n via \nThe Menin Road\n,\nMenin-Gate\n, \nBirr Cross-Roads\n, \nHell-Fire corner\n, \nHooge Dump\n, and \nJabber-track\n. Had a rough trip in too,remember the hammering - Five daysparticular hell on \nWesthoek\n then up the line to \nZonnebeke\n- I had the platoon without any assistance all this time having neither an officer or N.C.O.s, so have cause to remember it. - anyway it ended at last. - but they must give us another few days on that death trap \nWesthoek\n before going back.\n","84":"\n\nTo \nVancouver camp\n, near \nPoperinghe\n.\n","85":"\n\nStarted a six days march (some mad doctor's remedy for trench feet) ending near \nBoulogne\n, our nightly halting places were \nBerthen\n, Z\nuytpeene\n, \nWardrecques\n, \nRemilly-Wirquin\n, \nBlequin\n, ending at \nTingry\n outside \nSamer\n, near \nDevres\n, at Berthen Isneaked a trip to \nBailleul\n (an old acquaintance). This march was quite pleasant, for\n\nthey caried extra packs (a wonder). However we had a pleasant 3 weeks at \nTingry\n and \nLeave to Boulogne\n.\n","86":"\n\nI went to the","87":" Army Musketry School at \nNorthbecourt\n via \nSt Omer\n. Had a stay in \nLumbres\n on the way. - Spent Christmas, New Year and my","88":" birthday here and they were all properly \"kept up\" too. It was bitterly cold and snow lay thick, but better than the trenches and appreciated accordingly.\n\n1918\n","89":"\n\nFound the Battalion again at \nWytschaete\n, there just in time to do a few fatigues, a trip to t\nhe trenches\n, and be made full Sergeant, and was sent back to \nKemmel\n, stayed with the Transport at \nLindenhoek\n a week visited \nDranoutre\n, \nMessines\n.\n","90":"\n\nClimbed \nMount Kemmel\n and on the","91":" humped my pack gladly to \nBailleul\n\"en route\" for another Musketry School - in England too.I went via \nCalais\n, \nDover\n\nand London to \nHayling Island\n which is\n off Portsmouth\n and looking across \nthe Solent\n to the \nIsle of Wigh\nt, it was a charming spot, and I had the unique experience of being billeted in England - quite different to France.The School lasted 3 weeks and I had 3 week-ends in \nLondon\n, then 7 days leave which I spent in \nGlasgow\n, returning to \nFrance\n via \nLondon\n, \nCalais\n, and \nDover\n-I rejoined at \nRidgewood\n and all that month we did heartbreaking fatigues to such places as \nHill 60\n, \nImage Avenue\n, \nShrewsbury Fores\nt, \nKlein Zillebeke\n etc. - proceeding by light railway to \nSpoil-Bank\n - I remember one very close shave right on top of \nHill 60\n- at broken-bridge, but that's another story in itself.\n","92":"\n\nWe went to \nLarchwood tunnels\n and had a very \"Gassy time\".\n","93":"\n\nWent to \nTournai Camp\n \nRidgwood\n\nat \nConfusion Corner\n, and heard of the German offensive. HereI was transferred to Battalion H.Q. as Musketry Sergeant.\n","94":"\n\n\"Hurry up\" for \nthe Somme\n - light railway to \nHoograaf (Poperinghe\n) marched by night to \nGodewaersvelde\n, and entrained for \nAmiens,\n(St Roch Station). Forced march back to \nRaineville\n, and another to \nBeaucourt-sur-Huille\n, (I was the rear party).\n","95":"\n\n\"British retreating up North\" off we go again. Marched back to \nAmiens\n, where we spent what was left of the night - bombed from the air (was blown up by one) and shelled heavily.\n","96":"\n\nEntrained at \nSt Roch\n and went on the \nSt Pol-Doullens\n Line (which was under shell fire) did ever a troops train move so fast. Stopped at \nHazebrouck \n- which place was in danger - the line was broken - everyone was in\n\nflight - soldiers and civilians, and we quietly detrained, dumped our packs on the side of the road, and marched to meet Fritz. Such sights we saw that night and next day and we realised that everything, \nHazebrouck\n, \nSt Omer\n, and the \nChannel Ports\n, depending upon our one little division. But we were the \"","97":" Australian Division\n\" and that's why we were there, and we did the impossible, we stopped him for good and all.\n","98":"\n\nWe entrenched in front of \nStrazelle\n, facing \nMerris\n and stopped the advance on this line - 11 days our boys held those outposts without relief. I spent most of that time in cellars in \nStrazelle village\n, while it wassteadily pounded to pieces by H.E. Shells - what times! - what feasts - how the champagne flew - what salvage - but what casualties and destruction - shall I ever forget it all.\n\n\n\n- a lot of my old friends were killed here.\n","99":" -","100":"\n\nI went on an escort job to \nCalais\n via \nSt. Omer\n, had a rough spin getting out and what pitiable sights behind the line - refugees everywhere, but I returned by a roundabout way a few days later via Burgette and Aire, to Borre Siding, where the boys were having a few days rest but still under shell fire.\n","101":"\n\nThen another trip to the line to Meteran where amongst other things I salvaged wheat - we went in via \nFletre\n and came out via \nCaestre\n - remember the burning farmhouses?\n","102":"\n\nThen we went to \nSercus\n via \nWallon Capelle\n, where we were bombed every night from the air.\n","103":" -","104":"\n\nThe Battalion stayed in reserve this time at \nPradelles\n, I stayed at \nHazebrouck\n with the transport and took charge of the Batallion Guard - then to \nRouge Croix\n.\n","105":"\n\nBack again to \nSercus\n via \nHondeghem\n, and more moonlight air raids.\n","106":"\n\nUp to \nRouge Croix road\n again - big shells on the windmill.\n","107":"\n\nI went to the \"Nucleus Camp\" and then to \nEblingham\n where we had 2 weeks rest and quietness.\n","108":"\n\nTo \nEngland\n via \nBoulogne\n & \nFolkestone\n for a Cadet School, what luck! Leave in \nLondon\n and \nGlasgow\n 14 days.\n","109":"\n\nI went to Cambridge University (Trinity College) and started a 6 months course as an officer-cadet, but the story of my glorious times there is too long for these pages, \nGranchester\n \nNewmarket\n - \nSt Ives\n -\nGog-Magog Hills\n - \nVia Devina\n etc.\n","110":"\n\nHad some leave and \"some time\" in \nLondon\n and \nBirmingham\n (\nWest Bromwich\n - The famous Black Country).\n","111":"\n\nThe \"Armistice\n\" was signed and all the fighting stopped - what a day - what rejoicings - still\n\nat \nCambridge\n - what times with Mun.\n","112":"\n\nWent to \nCatterick\n (Yorks) \nRichmond\n and \nDarlington\n.\n","113":" -","114":"\n","115":" Leave, \nYork\n, \nPeterborough\n, \nGrantham\n and \nLondon\n - then on to \nEdinburgh\n (a noble city) \nGlasgow\n and \nKinlochleven\n. How different in its garment of snow, but still very beautiful. Had \"Jimmy\" with me - back to \nCatterick\n via \nBerwick-on-Tweed\n and \nNewcastle-on-Tyne\n.\n","116":"\n\nI was commissioned","117":" Lieutenant on","118":" Went to camp at \nSutton Veney,\n\nWarminster\n (via \nWestbury\n) - then to \nSouthhampton\n via \nSalisbury\n and over to \nHavre\n - fancy - France again and no war on.\n","119":"\n\nTrain to \nCharleroi\n, Belgium, it took 5 days via \nEtaples\n (\nParis Plage\n) \nValencennes\n \nDouai\n, \nMons\n - right through the old battle areas. I found the old Battalion \nAcoz\n, and stayed there and\n\n\n\nat \nLausprelle\n about 2 months, during which time I visited, the \nField of Waterloo\n, and had a wonderful 3 days, in \nBrussels\n.\n","120":"\n\nOrders for \"Home\" at last - what an eventful last journey, on about 6 different French railways, to \nHavre\n, via \nMons\n, \nSurvilliers\n, and \nNantes (Seine\n) - Then across to \nSouthhampton\n, up to \nWarminster\n, to \nLongbridge Deverill\n.\n","121":"\n\nMy last 4 days in the \"Big Smoke\" - \nLondon\n, where I said \"Good-Bye\" to all my friends.\n","122":" - April","123":"","124":"\n\nI started on a final \"tour round\" visiting \nBath\n, \nBristol\n, \nGloucester\n, \nStroud\n, \nCardiff\n, \nWaterford\n, (Ireland), \nDublin\n, and \nKingstown\n, via \nKildare\n, and \nKilkenny\n - I crossed the \nIrish Channel\n by \nFishguard\n and\nRosslare\n, returned to \nWarminster\n. My last impression of \nOld England\n - \"\nGlorious Devon\n\", - for I came aboard this old tub \"H.M.T. Sardinia\"\n\nand sailed the same day from \nPlymouth Sound\n for dear Old Australia, we have passed \nGibralter\n, through the dreaded \"\nBay of Biscay\n\", through the \nMediterranean\n in \"\nGlorious Weather\n\" coaled (a wonderful sight) at Port Said, through the \nSuez Canal\n, past all the old spots \nIsmalia\n and \nSerapeum\n to \nPort Suez\n; and now we are sweating in the \nRed Sea\n (had the tailend of a Sirocco at Suez): and we are now passing \nHell's Gate\n, and another few hours will see us past \nAden\n; and then out into the \nArabian Sea\n, we willcall at \nColombo\n, on 15th and then across the \nIndian Ocean\n, again past, \nCocus Island\n, to Dear old \nAustralia\n.\n\nWe saw the Southern Cross, last night, and how much it reminds us all of home, sweet home.\n\nWe will touch \nFreemantle\n (W.A.) \nAdelaide\n (S.A.) \nMelbourne\n (Vic.) and\n\nFinally \nSydney\n - early in June - Thus ending all these days, nay, years of war, with its accompanying hardships and trials - yet still mingled through it all are times of real joy and happiness.\n\n"}}