{"Document Name":{"0":"Diary_0029","1":"Diary_0029","2":"Diary_0029","3":"Diary_0029","4":"Diary_0029","5":"Diary_0029","6":"Diary_0029","7":"Diary_0029","8":"Diary_0029","9":"Diary_0029","10":"Diary_0029","11":"Diary_0029","12":"Diary_0029","13":"Diary_0029","14":"Diary_0029","15":"Diary_0029","16":"Diary_0029","17":"Diary_0029","18":"Diary_0029","19":"Diary_0029","20":"Diary_0029","21":"Diary_0029","22":"Diary_0029","23":"Diary_0029","24":"Diary_0029","25":"Diary_0029","26":"Diary_0029","27":"Diary_0029","28":"Diary_0029","29":"Diary_0029","30":"Diary_0029","31":"Diary_0029","32":"Diary_0029","33":"Diary_0029","34":"Diary_0029","35":"Diary_0029","36":"Diary_0029","37":"Diary_0029","38":"Diary_0029","39":"Diary_0029","40":"Diary_0029","41":"Diary_0029","42":"Diary_0029"},"Date":{"0":"unknown","1":1843.0,"2":1844.0,"3":1845.0,"4":1846.0,"5":1847.0,"6":1848.0,"7":1849.0,"8":1850.0,"9":1851.0,"10":1852.0,"11":1853.0,"12":1854.0,"13":1855.0,"14":1856.0,"15":1857.0,"16":1858.0,"17":1860.0,"18":1861.0,"19":1862.0,"20":1863.0,"21":1864.0,"22":1865.0,"23":1866.0,"24":1867.0,"25":1868.0,"26":1869.0,"27":1870.0,"28":1871.0,"29":1872.0,"30":1873.0,"31":1874.0,"32":1875.0,"33":1876.0,"34":1877.0,"35":1878.0,"36":1879.0,"37":1880.0,"38":1881.0,"39":1882.0,"40":1883.0,"41":1884.0,"42":1887.0},"Entry":{"0":"\n\n","1":"\n\nToday being Sunday the usual services were held. The old parson dwelt strongly on bad language & a few of the worst words in particular which he urged all to cut out before landing in Australia & he is quite right , there was also a lecture on the Queensland Repatriation scheme I intended to hear this but was so interested in \"Nicholas Nickelby\" & too comfortably perched up \"forrard\" on big coils of rope that I totally forgot the whole thing, it has been a beautiful day but a little on the cool side.\n\nThis evening a few of our lads went down below to give the engines a go & to such good purpose did they work that in 2 hours the old ship covered 30 miles a record\n\nfor her they are stopping down tonight, they must be tearing the coal in to her for you can easily notice the increased speed & vibration\n","2":" Bob Modral, Cameron, Braithwaite & I have been arguing for 4 solid hours this morning, the subject was the fighting qualities of the French & British soldiers, I don’t think we got very far ahead or brought out anything out of the common but we killed an otherwise slow morning very comfortably for the time passed wonderfully quick We passed another ship this afternoon she hung onto us for a good while but our old tub gradually forged ahead & we have now left her far behind\n\nWe have started a small paper giving all the news of the ship\n\nit is printed a leaf at a time & hung out for all & sundry to read.\n\nYesterday a chap fell from the deck right through the hatch & down to the steps of the lower deck it’s a wonder how he never broke his neck or some bones for it is a very nasty tumble he was knocked unconscious & they carried him away to hospital.\n\nWhile we were having tea this evening a Sgt who is attached to the Steward of this boat to help with the rations came down & wanted to know which sort of fruit we preferred, for he said that a lot of fruit was going to be bought at Port Said for the troops & the steward wished to know what we would like, the steward suggested dates & figs but this did in no way agree with our tastes & ideas we promptly turned this down & voted\n\nfor fresh fruit such as oranges & tomatoes, we have tons of cold storage aboard, according to the Sgt we (Sgts mess) are to have fruit daily & the Diggers twice weekly, all right if it comes off for everyone is more or less craving for fruit\n\nAfter tea Braithwaite Modral & I paid a visit to the engine room to have a look around, the firemen were drawing most of their fires for we are only going slow tonight so as we can reach Port Said by morning, we had a look round the dynamos, pumps, & then went right along the enormous crankshaft almost to the propeller itself & then up for a breath of fresh air for the atmosphere was very hot & stifling, wouldn’t take much of it to make me sick, wouldn’t care for a job down there.\n","3":" Entered Port Said this morning the same old place with its swarms of Shipping & \"Gyppos\", we passed the \"Somerset\" laying at anchor at the entrance she left Plymouth 2 days after us so she appears to have beaten us rather easily, as we passed her the lads greeted one another in the usual fashion, right close to her was a neat & trim little French Cruiser I took a snap of her.\n\nOnce we were anchored the \"bum\" boats swarmed around us with their loads of oranges dates figs, cocoa nuts & pomegrates &etc. & the niggers did a roaring trade for all were hungering for fruit & we fairly wolfed the oranges which were a little on the green side but quite nice to eat, we got 10 big thumpers for a shilling it was not long before the whole\n\ndeck was littered with their skins & the niggers were plentifully pelted with them also but they never seem to mind this so long as they are doing business, we were supposed to stop here for the night but no one was allowed ashore, I wanted particularly bad to see Port Said having heard so much about her & as this seemed the last chance of ever satisfying my curiosity I was determined to take the risk of breaking the rules & going ashore I also wanted to buy some present for different people, at any rate to cut a long story short 5 of us including Braithwaite Bill May & myself we went down & dressed ourselves & then it being dark called a native boatman that was hanging round the ship, he heard us & over he rowed we beckoned him\n\nalong to the stern where a rope was hanging down, as soon as he got under it down we went over the side a good 50 ft drop to the boat at one time the whole 5 of us were on the rope a good crowd were watching laughing to themselves at our antics we were in the boat in a jiffy and away for our life the old nigger knew the ropes & he took us to a little landing stage quite close to where our boat was moored, we paid him & then away for the town we had to pass through the Port Said railway yards & station, these were full of wheat barley lucerne meat & thousands & thousands of hides, lots of ships were loading at the wharves, no one interfered with us & we got into town without any trouble she is just like any other Eastern town little narrow streets with\n\ntumble down buildings & its variety of smells noises & sights, there is about one good street in the whole town & the buildings & shops are very poor, taking her all round I was greatly disappointed for I expected to find a much lager & more important town, she is at the present time full of French British & Australian troops all waiting for ships to go home in. I came across plenty of our light horse there down from Aleppo, they reckon this is a rotten hole & covered at the present time with 2 ft of snow, I also came across some Tommies who had been taken prisoner at Suvla Bay by the Turks, they reckon if it had not been for the Germans they would have starved to death, for they were the only ones who took the slightest interest in them, we passed a few hours pleasantly there\n\n& then started to come home but Bill May & 2 others went off arm in arm with some French soldiers down to the wharves & Braithwaite & I stopped yarning with a French Sergt Major till 10.30 just before we parted a couple of English Officers came along & Harry at that time was struggling furiously to think of the French word happy he couldn’t get it so he asked one of the officers they came over & soon the whole lot were exchanging cigarettes greetings & anything else they had a regular Entente Cordial & we all parted after many hand shakes the best of friends, from here it being late we made off towards our ship & after much riggling about we struck somewhere near the wharf where our ship was, we asked an Arab where the Port Hacking was he got terribly excited & said she \n\nhad just gone & he pointed down the Canal to a green light & said there she goes, things looked lovely but fortunately right alongside us was the Embarkation office so we dashed in here & got the official to ring up the Canal office & enquire whether the Port Hacking had sailed or not word came back to say that the pilot was aboard & she would be sailing any minute so we dashes out & yells for the boatman he was on the spot & we told him what we wanted & if he could catch the boat we would give him a £1 this stirred him to action so he yells out something in Arabic & blacks seemed to spring from all manner of places & in a rush & a jump we were in the boat & away with 4 big hefty niggers pulling for their\n\nlives how they rowed the boat must have fairly flown yet it seemed to us a snails pace, at last after what seemed hours the ship hove in sight & to our delight we saw that we would be in time, as we reached her side she was on the move her propeller churning the water white I steered the boat to where our rope was hanging I just had time to pay the boatman & grasp the rope, I started to go up first, but had not climbed more than a few feet when the boys on top sang out \"hold on & we will pull you up\" I was never so glad of anything in my life & I hung on & up I came, but when I reached the top the Adjutant & 2 officers were waiting for us, we knew the game was up when they took our names, I was up first & gave my name then came Harry & when he was asked for his name he\n\nsaid John, what else said the Adjutant \"Willis\" said Harry & dodged away but the Adjutant recognized him, our luck was dead in one way for we had the luck of the world to catch the ship nothing could have been finer, for 2 minutes more & she would have been away & we would have been stranded properly we would either have had to engage a motor boat to catch her up or try to catch the Suez train both extremely doubtful things, when all the excitement had died down we went below & found to our sorrow that the others had not so far turned up, so we knew for a certainty that they had missed the ship & were stranded in town, we went to bed after this mad escapade wondering what\n\ntomorrow would bring forth & what punishment they would give us, we are both prepared to take our medicine for we ran the risk with our eyes open & knew what the penalty would be if caught but what is life without a little excitement & its not as if we were going to the war they could not accuse us of running away, & if we were caught well it was our own misfortune.\n","4":" It appears that we were not the only ones who broke ship last night & were caught for this morning there were quite a few up for Orderly Room but none of us were prepared for the shock we got. when I went in a long list was read out & I was asked how I pleaded \"Guilty I said & he asked me what I had to say for myself I told him that I went ashore & took the risk & coming back was unfortunate enough to get caught\n\nhe then proceeded to give us a good lecture & ended up by remanding us for a D.C.M in Melbourne that’s pretty stiff I reckon & it’s a pity that this has to take place right at the finish of our Military career for myself I don’t care a rap but for my people I am sorry for they don’t understand such things & will no doubt think it a terrible disgrace &etc &etc, the privates he gave 20 days pay fine, if it comes to a case in Melbourne we will give them a go for it for we will get a good lawyer to defend us everyone on the ship reckons it is a thundering shame, & of course we don’t. I am very sorry that Bill May is missing, he may catch the train to Suez & pick us up there.\n\nWe arrived at Suez about 12 oclock thus making a very fast trip of 13 hours from end to end. the day was nice & sunny all the way, traces of trenches barb wire entanglements camps piers &etc are still showing where they were going to defend the Canal if the Turks got that far. apart from this there is very little else to be seen, you would be surprised at the wash a ship causes going through the canal itself, seems to suck all the water from the bank about 20 yards in front of the boat & when she passes the water gets very agitated & beats itself in to a passion & tears at the sandy banks its a most peculiar feeling gliding for miles through these sandy wastes & only a thin ribbon of blue water stretching in front for miles, just before passing through the \"Bitter Lakes\" \n\nAn airman came over & done all sorts of fancy tricks & waved his hand to us in greeting they still have an aerodrome in the desert. I took a few snaps coming through.\n\nThis afternoon Bill May turns up came down by train & then came across in a picket boat what a tale Bill had to tell Braithwaite & I were very pleased to see him.\n\nWe have been taking in water & goods all afternoon getting ready for our run to Colombo.\n","5":" Laid in the harbour just off Suez last night, about 6 oclock we got 70 more men aboard nearly all light Horse from Palestine all the morning the ship has been taking in stores, \"Gyppos\" come out with their boats & our lads have great fun with them, for they are just like a lot Kiddies\n\n& will scramble like dogs after a cigarette thrown among them.\n\nI saw a native do a most unusual thing this morning he was selling some views 4\/- a book he was asking for them, one of our lads wanted them for 3\/- so after a lot of arguing the native said he would toss him to see whether he gave 3\/- or 4\/- for it, so they tossed & the native lost, & up came the book\n\nWe lifted our anchor about 10 o’clock & away we went, we had not gone very far before we passed a big French liner coming home from the East, there was much shouting, cooeeing & hankerchief waving from both sides as we crossed.\n\nBill May went up today & he got the same as Harry & I, Egan is going to work our case up he reckons we can beat them easily on the evidence we have.\n\nIt is a lovely day on top not too hot for although we are in the Red Sea it is winter time & so not too hot.\n\nHave been doing some washing wonder if I can get in before someone shakes it, I do not feel in the mood for writing with this Court Marshal at the end of my trip all I am worrying about is the hope that I can let my friends & people know what happened before we get to Melbourne \n\nMistake in the date. \n19th. Nothing much to report. Only that it is getting hotter daily, & there are plenty of porpoises knocking about of a morning\n","6":" Am on guard today but there is very little to do as it is only a rag-time one\n\nAwnings are being erected all over the ship as a protection against the coming hot weather.\n\nWe are out of sight of land this morning the old ship is making pretty good pace averaging 12 knots an hour, of course the conditions are ideal the water is as smooth as a mill pond & there is practically no wind, it is lovely sleeping on deck of a night with only the sky for a covering & a full moon to make things look soft & clear, the steady throb of the engines & propellor to lull one to sleep.\n\nThey took our \"Summary of Evidence\" this afternoon, did not take long over it, they simply read the charge & evidence out & asked us if we had any questions to ask, we said no we were reserving our defence, one officer nearly made a mess of things in my case he swore & signed a statement to the effect that I was absent from the 10. AM roll call on the 18th, I laughed all the time to\n\nmyself for I was not only on parade but was being tried at that time by our worthy friend the Major, after he had finished I was dismissed but I waited outside for I knew they would find the mistake out & would want me again, it appears that Baker was confusing me with Bill May. I have one witness only against me & if we can’t beat him I’ll eat my hat but the indignity of the thing is what troubles me for I know they will think it a fearful thing home whereas in reality it is a mere nothing, at any rate it has spoilt my trip & enjoyment entirely for do & say what I will I can’t get the unfortunate occasion out of my mind, however if they make a fuss over it, & come & cut up rough, I will pack\n\nup & clear right out for good on that I am determined, for when all said & done it is only an escapade where we would have been today goodness only knows if someone had not taken risks, theres one thing I am positive of & that is if McPherson carries this case to Melbourne he will make a bitter enemy of me for life I have never to date born any animosity but this will be my turning point, & I shall be on the alert for this gentleman in the future. how they will be shocked when they get my letter which I intend to send from Colombo & also another to my various friends from Fremantle if we call there, all I hope is that they get them before the boat gets in wouldn’t a chap look nice being marched away & his friends looking on, I pity Bill May & Braithwaite \n\nfor both their homes are in Melbourne this is troubling both of them greatly.\n\nThere has been a debate on the deck this afternoon the subject was White Australia, I don’t know if the speakers threw any fresh light on the subject but they caused an amount of fun\n","7":" Been very hot & cloudy all day long, they have erected canvas baths on the deck & before turning in last night I had a dip & this morning put my shorts on A fellow wants as little as possible on this weather\n\nHave been watching the antics of a thumping big porpoise for a good ½ hour this evening, there seems to be a certain amount of fascination for people following their rapid & graceful movements \n\nOnce he got among a lot of \n\nflying fish & it was very pretty to see the way they leaped out of the water in their haste to get away.\n\nHave started writing to home & various other people telling them not to expect me with this ship & also the full strength of my case. I am quite resigned now to the inevitable & must therefore make plans accordingly, thank heaven it won’t be very long now before I am out of it for good, I am not going to waste much time on holidays once I get free I am going to combine business with pleasure & have a look round for the most suitable district to make a start possibly & possibly settle in for good for I have finished rambling & all I want is to settle down for good & finish, I think I can get a bit of help from Mitchell \n\nso with his support & advice & my own savings I should have enough to commence with & to give me a fair chance of success work might be a bit irksome for a while but I will soon live that down & get once more intro the old groove\n\nWe got some wireless news today of the progress of the English elections & the meeting of the Croat & Serbian Parliament & etc.\n\nWe covered 286 miles today up to 12 oclock, (24 hours) an average speed of 12 knots\n\nThere was great excitement on board today & many speculations as to whether the old ship would fall to pieces or sink when they fired her gun, we have a brand new 4\" aboard & today was the\n\nfirst time she had been fired, they threw a box overboard for a target & fired 4 shots at it, the shooting was only fair, but in spite of all we are still afloat & going strong\n\n22nd. There was a rather amusing little incident occurred during the progress of the concert last night, about half way through the major gets on the platform & starts going very crook about a remark he overheard some fellow pass about him while the concert was on, he challenged him to come forward & prove his cowardly & lying statement, he said he would have a go at him in the Ring also if the chap was game enough, he was in a tearing rage & could scarce contain himself, after he got down the R.S.M of the 12th Battn got on the platform & added his testimony about the major being a soldier & etc, & he appealed\n\nto any of the 12th Battn there to give their opinion, from what I could gather some one passed a remark about his getting a S.I.W (self inflicted wound) about the lowest & most cowardly thing a man can do in our eyes, he is regarded as even 10% lower than an M.P. such a remark naturally maddened him, but whats the use of going crook without catching the snoozer, for it matters little who or what the man is some low down scoundrel is bound to pass remarks whether true or not about him look how they slandered our Lord himself & if he went through it theres no reason why we should be exempt from the same, however no one accepted his challenge \n","8":" again nearly all our Coy have been on fatigue shift\n\nbags of potatoes which have been smelling terribly, they done alright out of it judging by the number of mandarins they produced after coming up.\n","9":" Passed this morning a group of rough rugged & rocky islands called the 12 Apostles, surf was breaking in great white clouds around their bases the waves lashed to fury by a gale of 60 miles an hour easily you can scarce stand on deck & spray is being dashed all over the deck showers baths are to be had for nothing this don’t trouble us for it is a blessing in disguise as it helps to cool us, I am getting sunburnt badly & my legs are like fire, this is quite a change\n\nPassed another large island on the starboard this afternoon the Island of Perim I think it is, Lloyds bought it so they say & erected a lighthouse to prevent so many wrecks\n\nwhich have taken place round about, shortly after this we ran through what they call \"Hells Gates\" which really is two islands fairly close together on the smaller one a lighthouse is erected what a lonely & miserable existence these people lead for they are entirely cut off from civilization, saw a good many flying fish round this quarter took a photo of the small island with the lighthouse.\n\n24th. Have been in charge of a working party all the morning, they are shifting all the potatoes from down below for they are going rotten at present we are dumping them on the platform & round the mast, & a bright sample they are at that, we knocked off for dinner at 12 after having which I went to a quiet little \n\nspot & laid down in the shade such as it was for a read, it was about 1.30 when Harry Braithwaite & Bob Modral came down the stairs I could see something out of the ordinary had happened by their faces but I did not ask, for out it came in an awestruck whisper, they said our C.O Major McPherson had just blown his brains out in his cabin & that the flag had been half masted in consequence. I wouldn’t believe them at first but they were in earnest, sure enough he was dead I got up & walked along to his cabin but could see nothing I wonder what on earth could have made him take his life, what a shock it will be to his people just fancy him now going through what he did & then to do away with himself when on his way home, theres\n\nmore than we know behind this act you can bet, he has kept to himself since coming on the ship I have only seen him twice, once when Harry & I went before him & the other night when he went off at the concert I am inclined to think now that it was only imagination that night he said he overheard chaps talking of him for they say he has been suffering badly from nerves, after tea this evening at 8.15 all the troops were on parade & he was put over the side sewn in canvas, the bugler blew the \"Last Post\" & the parson read a sermon or service over his body & then he was consigned to the mighty deep\n\nCharlie Ross then played on the pipes the \"Flowers of the Forest\" a fine old Scotch tune, it will\n\nit will be a memorable Xmas Eve, & I shan’t forget the crowd of silent men in the hot semi darkness of the Arabian Sea & the lazy splash of the waves against the ships sides for we stopped while he was being buried, this is to allow the body to sink below the propellers, everyone on board is shocked at the happening it has been a regular stunner, its rather funny to record but when I was laying down reading two chaps were talking of deaths & etc & one of them said we will have to have one on our boat or she wont be a troopship, little did we dream that there was then a dead man on board & least of all did we realize it was the C.O. I expect it was on account of his nerves that he treated Harry & I like he did when we went before him, for ours is not a serious charge\n\nHave been playing bridge nearly all night it is now 12.30 we left off to attend the funeral & then started again, so you can see we have spent a pretty quiet Xmas Eve.\n","10":" & the second I have spent on the ocean & 5th since leaving Australia 2 in France 1 in Egypt & 2 on the sea, this one is easily the happiest for the war is over & the world is now resuming its former quiet occupation & giving up cutting each others throats, I slept on deck as usual & rose or rather was pulled out by Penfold about 6.30 who was wishing all & sundry a Merry Xmas & etc, folded up my blankets & rolled them into the hammock then down stairs to sling them in the bin & there for a wash to get the grime off for sleeping on deck though cool & nice\n\nis a very dirty business for we all get the dust & ash from the funnels we had our breakfast at 7.20 & after that a parade & then followed the Xmas service we sang 3 hymns Once in Royal Davids City, \"Hark the Herald Angels sing\", the other one I forget, then Sims our Y.M.C.A. representative gave us a jolly fine lecture I must say it was the best I have ever heard I do believe. I know I was never so gripped before & every one said the same thing, he was really fine, did not fall back on the wowseristic arguments like most padres do, but made the sermon a real live & interesting one, after we had sung the King & dispersed we or a few of us went & had a dip in the canvas bath we had some jolly fine fun splashing & diving about & ducking one another, the\n\nbath is about 20 ft long 7 wide & 4 ft deep fresh sea water is running in the whole time by means of a hose pipe so it is quite a comfortable little affair, after the bath dinner followed, they put a good one on Giblet soup, Roast beef turnips potatoes & etc. roast goose, plum pudding, oranges, dates, walnuts pea nuts, lime juice & so on, each man was presented with a pipe & a little card from the Shipping Company. & the Y.M.C.A. gave each man 90 cigarettes so it was a pretty good turn out, bit different from our last Xmas, but for all that I for one can’t realize its Xmas Day, the word seems to have lost all its old meaning but lets hope next one will be a far happier & merrier time & by that time we will have resumed \n\nour old style & methods of living.\n\nWe had a stoppage this morning from 9 to 10 on account of a steam pipe blowing out in the engine room. Our firemen are giving more trouble they are I am afraid a bad lot, they threw their dinner today all over the officers saloon & also heaved the pudding over the Chief Steward, some way of carrying on isn’t it, the food question again, this time I am satisfied that they are in the wrong for I made enquiries & saw the food for myself & its practically the same as we are getting so heaven only knows what they want, it’s a pity they could not have been with us for a while on Gallopili or 1916 in France, they would have known something about poor food & short rations then, I don’t suppose they have lived better in their life than they are now. \n\nIt appears that McPherson shot himself through the heart & not the head, he arranged everything before he done the deed & appointed his successor Capt Williams & etc, the officers did not trust him it appears that one of them was told off daily to watch him, but yesterday he had dinner as usual & then went to his cabin locked the door got into his pyjamas & then shot himself laying in the bunk, theres no doubt but what he was sane for he planned it all , he must have been a very brave man to do this thing in cold blood, & I’ll bet theres a woman at the bottom of it all he belonged to Ulverstone Tasmania strangely enough Williams is a Tasmanian too, his name appeared in orders this morning as having died at sea.\n","11":" oclock & we are passing a big\n\n Island on our starboard I dont know whether its Somaliland in Africa or a group of islands called Socrates opinions seem to be divided but I favour the latter, weather is all that can be desired a gentle breeze is blowing & the sun is just what you would call hot, all I have on is a thin flannel a pair of shorts (very short) & a pair of shoes this completes my Xmas costume, nearly Garden of Eden style.\n\nThere was a certain amount of beer on sale today ½ a bottle a man, this is all that is allowed for the voyage otherwise we have a dry ship, some of the old boozers are dying for a good bust up, what a time they will have when they get loose in Melbourne.\n\nGreat commotion on deck this evening the mob have been on the ramp catching & ducking anyone they could lay their hands on in you went no matter how you protested\n\n& struggled, the more you fought the better they liked it, theres one good thing its warm\n\nThe Captain of the ship put his foot down properly tonight on the firemen he told them that if they caused any more trouble he would put them ashore & in the clink in Colombo, & he also cut all their extra rations which he had given them some little ago, down to their contract allowance\n\nAs I write this the mob are making a raid down here on the deck so I will have to finish \"toot sweet.\"?\n","12":" This morning I had my payment of money fixed up, am going to get it sent to the Bank of N.S.Wales in Hobart, it will be handier there.\n\nHeard a whisper today that they are going to tear our crime sheets up & let the case slide \n\nseems to good to be true I am not taking any notice for I am too used to rumours by this time.\n\nPassed the coast of Somaliland yesterday could not see it very plain for a mist was hanging over it.\n","13":" Very quiet today nothing much doing with the exception of some impromptu speeches which caused no end of fun for one did not know what his subject would be, & when he did he had 1 minute to think about it.\n\nHave been hard at it washing clothes I tackled my tunic, I don’t know what kind of a job I made of it but I know I got an amazing lot of dirty water from her.\n","14":" Come a terrible thud last night, I am in the habit of sleeping on top each night, I was in bed & it stated to sprinkle but I laid \n\nthinking it would be over each minute but it kept on coming down the faster & I could feel the wet all over, at last I could stand it no longer but leaped out of the sodden blankets gathered them in my arms & joined the crush making for below like drowned rat, we looked a pretty lot for there were dozens in the same boat as myself, we hung our hammocks on the hooks, & got what rest we could in the hot stifling atmosphere of the lower deck \n\nthey are paying the ship again today\n","15":" A memorial service was held this morning for our late Major at the conclusion the parson asked all present to keep his death a secret from other people, a most impossible &\n\nunheard of thing, what a thing to ask men to do.\n\nIt is very hot today & I have got a lovely burn on my arm.\n\nAbout a week ago we sent a message by wireless to Colombo asking the authorities there if they could arrange a trip to \"Kandy\" for 500 men we got our reply yesterday saying that they could fix things provided the Military in Colombo were agreeable, they have taken the name of all those desirous of going, I put my name in & chanced whether they stop it or not over our \"Port Said affair,\"\n\nWe were paid again yesterday & no sooner had they got their money than \"two up\" started, so this morning the C.O. reminded them on parade about the \"orders\" respecting this Australian pastime &\n\nwarned them what would happen if they did not stop the practice\n\nHave just come back from a \"boat alarm\" when 2 blasts of the ships horn goes we have to collar a life belt & rush to our stations & remain there until the bugles blow the \"disperse,\" this of course is to get all men used to the action taken in case of an accident, & though all curse it, it is a necessary thing\n\nHave been laying on the big coils of rope on the gun platform for a couple of hours after tea this evening, it was lovely up there & a favourite place of mine at any time. I watched the sun go down right up till the time she sank like a big ball of fire into the sea, the sunsets are getting very fine now, it’s a most peculiar thing but in\n\nEngland & N. France the sunsets are very poor, I think this can be accounted for by the lack of fine dust in the air for this according to science is essential for good sunsets. I do all my thinking on the same coils of rope, but all the results I have got so far amount to good headaches, I revolve all sorts of plans in my mind & look at them from all possible points & angles, but they all tend towards the land, what I am trying to settle is in what capacity I will make my start in, whether to take up Crown Lands & work for a life time improving it, or go share farming & take the risk of bad seasons & setbacks not that I am frightened of the latter or hard work then again I think of taking up contract work in the bush & get\n\na gang of men, another plan I fancy sometimes is of getting a job for a year with some successful farmer in the district I decide to settle in & keep my eyes open & learn the methods & at the same time look out for my land. I don’t want to rush in blindly & grab anything, I have made up my mind to waste no time holidaying a couple of weeks in Tasmania & a week in N.S.W. will satisfy me\n\nI am going to combine pleasure with business as much as possible & all I ask is for my discharge from the Army & let me get to work, if ever any one is sick of this loafing about it is me, I am itching to get to work once more\n\nGod only knows how fed up I am with the Army, it would break my heart to be compelled\n\nto stop in it much longer. I am certain I would run amuck & break all sorts of regulations, now the war is over I consider myself a civilian & anything Military I thoroughly detest. never no more for me, the only time I would fight again is in defence of my own country, I would never go out of \"Aussie\" seeking stouch I have had my fill of it, at the same time I am glad I came to this I will never regret it as long as I live, but now the job is done I want to be out of it.\n\nTheres 2 things I have noticed since leaving Suez, one is the way the days are lengthening the sun don’t set now till 6 o’clock, the second is the way the stars are altering in the heavens especially what a lot of us call the \"arm chair\" the back points towards the earth now & is shifting gradually northwards.\n","16":" The finals in the boxing tournament took place today on the aft hatch, practically the whole of the ship was there thinking to see some good fights, if so they were sadly disappointed for they were rotten, I took a snap of the crowd during the last fight Wells & Roscoe won the finals\n\nIt is now just on 12 oclock we have not long finished playing \"bridge\" & I have just come down from on top. I am afraid I will have to sleep down below tonight for things look very ominous on the horizon where great masses of cloud are gathering foreboding a storm & I have no wish to be caught a second time, the water tonight is simply blazing with phosphorus & it looks very pretty\n\nswirling & eddying away from the ships sides, there is much more phosphorus in this part of the world where the water is warmer than what I have noticed in colder regions\n\nGot my legs & arms burnt dreadfully yesterday, & tonight they are giving me something to think about I rubbed some \"Hazeline Snow\" into them hoping to steady the pain but so far little impression has been made\n\n31st. Have been very busy all the afternoon, took my tunic which I had washed a few days ago up on top & sat in a nice breezy place & sewed all sorts of things on.\n\nThere was a debate this afternoon on Prohibition or otherwise. I never heard it but I believe it was very funny & so were a lot of the argument they brought forth.\n","17":" Another year started but under far more happier circumstances than any for the past 4 years, we never went to bed till well after 12 o’clock, we were playing \"bridge\" till 11 oclock, then an argument started about Egypt & India & this kept on going till the bands came round & told us that the New Year was coming in, they woke practically everyone on the ship & sang all sorts of songs, \"Auld Lang Syne\" Annie Laurie\" \"wedoch & Doris\" & so on & so on the old year went out, probably one of the most remarkable years of the worlds history certainly for the British Empire for it was touch & go for us, but now we are in a stronger position than ever & the same year saw both these things.\n\nSaw a most remarkable sight\n\nlast night a little bunch of us were sitting up on my favourite place on the coils of rope when enormous shoals of flying fish started to hop out of the water, there were millions of them & the noise they made as they sprang out of the sea sounded like great coveys of quail rising, they look for all the world like swallows skimming the waves but they don’t seem to be able to dodge the waves for they disappear as soon as they hit them, they can fly till their wings get dry & then they drop in to the sea, they must have had a lot of sharks or something amongst them to make the fish leave the waters in the numbers they did, they say these fish are very good meat but hard to catch, they grow to a couple of pounds weight by the look of them & from a distance are a grey color.\n\nI never saw so many stars in the sky for a long while as there was last night, the \"Milky Way\" was like a jewellers shop, yet even so it did not guarantee the night being fine for early this morning we were driven hastily downstairs by a heavy shower which nearly drenched us. You can never depend on the nights here it seems for storms spring up so suddenly & without a trace of warning.\n\n\"Orders\" came out yesterday (30th) to the effect that no one was allowed to leave the boat at Colombo without permission, I am thinking that if they don’t let the men ashore there, trouble will be in store for some one.\n\nLife on ship is going very slow now We haven’t sighted a ship since the 20th. nothing but the sea wherever you look.\n\nA heavy6 wind accompanied by rain sprang up after breakfast this morning & it was no time before I was feeling anything but gay & to make matters worse I had pains in the stomach. I felt crook the whole day & had no dinner nor tea but laid on my coils of rope right up till 8’ oclock tonight when we entered Colombo, there was nothing much to be seen only a row of lights & a lighthouse throwing out warnings.\n\nWas doing a bit more sewing a little while ago & managed to run the needle right through my fore-finger\n\nThere is a chance of us not going ashore at Colombo for it appears we have a patient with meningitis aboard, if true we will be kept in isolation for this is an infectious disease they operated or inoculated him this evening\n","18":" Slept on the coils of rope on my gun platform last night & did not wake up till Harry Braithwaite woke me at 6.30 with a cup of tea for me, he brings me one every morning so I do not do too bad, he rises much earlier than I & being a terror for tea always makes some & so I get mine, the sun was up nicely & one could get a fair look at the port, it is now 5 oclock & the heat of the day has passed, our ship is in a frightful mess from the coal dust for we have been taking in coal & water the whole day, we have had hundreds of Indians on the job on both sides of our ship, I timed them several times during the day & find that they average about 16 bags weighing roughly a cwt per minute, in the morning the boys got them fighting with the gloves & it was\n\nthe fun of the world to watch their antics for they know nothing whatever about the game & the way they tear into one another for a few pence is amazing, in addition to the boxing we had conjurors, contortionists & singers some of which I snapped, banana’s are plentiful & cheap 12 for 6’ & cocoanuts are the same though a little dearer.\n\nwe are fairly close in to the shore right in front of us are forests of cocoa-nut palms with houses showing here & there between them & ships ships are everywhere & for some reason or other all are flying the yellow flag surely it can’t mean isolation for the lot though in our case it does, of the town itself little can be seen for it is hidden by the amount of shipping thronging the harbour I never thought so many ships were left, a little while ago the Leicestershire came in crowded with Australian troops from Weymouth.\n\nSaw some fine fish playing around our boat this morning, must have weighed 30 or 40 lbs.\n\nNo one is allowed ashore here the authorities in Colombo are willing but our Defence people have forbidden it for some reason or other, so the Y.M.C.A. have been taking orders for silks cigars curios & etc they had an order for over @pound;350\n\nIt is lovely now & one can almost smell the spicy breezes that blow from Ceylon Isle\n\n8.30 Have just heard that the Y.M.C.A. could not get the things ordered the job was too big or something to that effect, we are still taking coal & water aboard got some 300 tons of the former \nlatter\n to collect yet, so theres not much chance of us getting away tonight\n\nTook a snap of the Indians who were having dinner today, they all line up & each man is issued\n\nwith a big palm or banana leaf, he then gets a big dollop of rice & currie with fish mixed among it, this he takes & sits down & starts to mix the lot up with his fingers, I should have mentioned that before being issued with the food they line up & wash their hands, they eat all of the food with the fingers & seem to enjoy themselves\n\nThe harbour looks very pretty tonight with its myriad of lights shining from the town & ships, she is very much alive too judging from the jangle & clang of machinery which comes floating across the harbour, we are still busily at work coaling, time 10.30. P.M.\n\nThe little chap who took ill a few days ago, we sent off this morning & to make matters worse a chap has come on board (an Australian) & he can’t be found, unless we can dig \n\nhim up they say we will be quarantined in Melbourne for 3 weeks, our people are very frightened of bringing this \"flu\" into Australia, & they are quite right for it is a dreadful business once it gets a hold, I saw enough in Plymouth to satisfy me, at one time they could scarcely bury the dead so plentiful were they\n\nWould almost sell my soul for a drink of cold water tonight but it seems to be out of the question for all liquids on board are half boiling owing to the intense heat during the day.\n\nGot news yesterday to say that the Coalition Party in England (Lloyd George) has been returned by a majority of over 200, shows how popular he is & no doubt he is a wonderful statesman & has England especially the poorer\n\npeople behind him, what a slug for old Asquith & his pro-German crowd .\n","19":" Finished coaling about 11 o’clock this morning, I shall not forget our morning in Colombo, it was the hottest I have ever felt not a breath of wind & a pitiless sun, it was a touch of hell, they posted a notice up to the effect that stowaways were suspected of being on board & that if they were caught between here & Australia we would all be put in quarantine for a considerable time this must have frightened our lads for shortly afterwards they caught one, he belonged to our Battalion, while coming home he had been taken bad & put off at Colombo & there he has to stop while the town is quarantined, there are 4 of them altogether & they keep on trying every ship, with the hope of getting away, I feel sorry for them.\n\nA little party of us managed to get a few articles to take home, it happened this way I got into conversation with an Indian official who came aboard about our coaling & I asked him if it was possible for him to get us some stuff to take home, yes he said I’ll bring you some samples back this evening & you can take your pick & I’ll get them for you, time enough he brought them on & we selected our articles, that was at 11 o’clock he then went away & we waited & waited until 2 o’clock I had just began to think we had seen the last of him & we were kicking ourselves for missing our sleep when we spots a little boat making for us his proved to be him & he had all our articles sure enough, I got 1 box of cigars, 2 ebony elephants\n\n1 walking stick, & 1 inkstand & a few more little articles, we were practically the only ones who got anything worth talking about & the rest of the lads were very envious\n\nAt 12 oclock much to our relief we pulled up our anchor & steamed out & in a few minutes we were in the open sea for in Colombo there is no harbour only that what is fenced off by a big breakwater the water enclosed is supposed to be a mile square & from appearances always crowded by shipping for it is half way to the far East.\n","20":" frightfully hot yesterday afternoon & last night, I slept on top the whole night without a stich of clothing, ever since leaving Aden we have been passing through jelly fish & we are still among them, this morning they were thicker than ever, they float along at a depth of 10 or 14 ft.\n\n& in these highly transparent waters can be seen quite easily\n\nI saw a peculiar & pretty cloud just after tea last night, it was a bright green one & both sides were salmon colored, it remained in the sky for a good 1\/2 hour.\n\nThe bread we have been getting for the past week has been simply shocking being both sour & only half cooked we are making great noises over it but little improvement has been shown so far, we took a lot of bananas & cocoa nuts on board at Ceylon & we get a certain amount each day\n\nSoap has run out on the ship our canteen hasn’t got a scrap so we are forced to fall back on the ships stores, they are taking advantage of this & are charging 2\/- a bar for common soap, & we have to give it for soap we cannot go without\n","21":" What a day this has been for we \"crossed the line\", the fun started bright & early, gangs of chaps were on the go catching & dipping everyone they could lay their hands on, practically every one on the ship has been chucked in the water & half drowned, some went quiet as lambs others struggled & resisted furiously but all to no purpose they were carried or dragged to the bath & in they went with a mighty splash they had no sooner hit the water than they we seized by other already in the bath & dipped & dragged under the water till they had scarce any breath left, we used to catch anyone, take their valuables off them & sling them in clothes shoes & all, we went down into the officers cabins & dragged them out, the padre\n\nwas one of the first to suffer, he took it all in good part, the ships officers & crew were also ducked, it has afforded us quite a lot of fun if nothing else, & whats more I have got a lovely sunburnt back body & arms out of it, the day has been a regular scorcher, & the sea a bit like one huge sheet of plate glass not a ripple breaks its shiny surface save here & there where flying-fish keep leaping out, from what I can learn of these fish they must lead a pretty hazardous life for everything that swims is an enemy of the flying fish & they even eat one another at times this is because they have 2 ways of evading their enemies I suppose & is Natures way of adjusting the balance.\n\nI believe I saw the \"Southern Cross\" \n\nearly this morning at about 6,30. it was very low in the heavens, we will soon be able to see it distinctly now we are over the line.\n\nGot roused down last night by a heavy storm of rain.\n\nThis evening just after sunset I went along \"forrard\" to have a look at things, there was a most beautiful sunset all purple gold red & pink & the reflection was shadowed on the still water, it was one of the prettiest things I have ever seen & was a worthy rival of the Gallopoli sunsets, but they don’t last long in these latitudes, darkness follows very fast after the sun disappears & then all the pretty clouds turn into black ones when darkness set in the water that was being churned up by the prow appeared to be a pretty \n\ngolden whitey color from the large quantity of phosphorus that is mixed up in it, & the stars were reflected as if by a mirror in the calm unruffled sea, it was a scene I could look on for hours & I was only wakened from my dreams by the appearance of rain for storms gather very quickly in these tropical regions, & I had to beat it for down below, but it was of short duration & soon we were on top & singing hymns for it is Sunday night.\n\nJust after tea this evening I saw a number of enormous fishes rolling & diving & showing great fins above the water no one seems to know what they were, they were far too big for porpoises not big enough for whales & the wrong color & \n\ncut for sharks so its an open verdict as to their species.\n","22":" Another frightfully hot day scarce a breath of wind to break the intense heat I have been sweating freely the whole day even though I have next to nothing on, the only remedy I can find to keep any where near under boiling point is constant showers & washes, its surprising the amount of dirt that comes out of your body through constant sweating\n\nI weighed myself this evening & I find that I turned the scales at 158 lbs stripped (11st 4lbs) I did not think I was anything near that weight. \n\nJust before tea this evening a heavy shower came racing up & poured down for a few minutes, it has cooled the air wonderfully & its lovely up on top now.\n\nNew South Wales won the final\n\nin the tug-of war this evening that means more arguments between the Vics & us, our table is a regular storm centre for inter state discussion\n\nHave been busy for an hour or so making boxes for the things I got in Ceylon, I am frightened to let them stop in the bags for fear of getting them broke.\n\nOur food which had fallen off a good deal is beginning to improve once more this is a result of the constant rows & complaints made by us you can’t beat keeping this sort of thing constantly under their noses, promises are of no use, we want results\n\nWe are making very slow progress covering only 236 miles daily they reckon it is on account of the poor quality coal we are using African they say, when they throw\n\nthe clinkers into the sea of a morning it turns to the color of clay.\n","23":" Been a very quiet & tiresome day how the time drags & I suppose the nearer we approach \"Aussie\" the slower the time will go, I am just beginning to realize that at last I am going home, & I wonder & ponder how everyone will seem to me after being away so long they are certain to see a vast change one way or the other for it will be just on 7 years since I left Tassy with the intention of stopping 18 months in N.S.W. but as the old saying goes \"man proposes but God disposes\", & this is what my few months have led too, & during that period a chap must alter considerably \n\ntheres one thing this knocking about has done for me & that is killed all desires I might have had for rambling\n\nall I wish for now is to be allowed to settle down quietly on the land somewhere & work towards my goal for I have a certain thing in view & I shall not be satisfied until I get that far.\n\nGot caught on the boat deck this afternoon in a heavy shower, I and a few more were laying under a lifeboat & before we scarcely knew what had happened we were flooded out by this tropical storm & had to beat it for down below\n\nA big bird has been circling round our ship for hours, it settled at last \"forrard\" & one of the boys caught it, by the look of things it had got out of its track & was just about exhausted they gave it some food & after it had had a good rest it flew away\n\nOne of the firemen on this ship broke his wrist while boxing one of our lads a few days ago, he is now unable to work & the ships Captain is stopping his wages & also making him pay for his passage & even food\n\nSome of the boys have taken up a collection on the boat for him, it appears he went into the ring against the Captains wish with the above result Anyhow it is pretty stiff on a man\n","24":" Been very much cooler today thank heaven & it has been quite a pleasure to be on top, but last night was a corker for we all got properly flooded out & wet to the hide by a tropical storm of some violence the decks were all flooded in a couple of secs & we were nearly swept into the sea, took us pretty well the whole day to dry our blankets & etc.\n\nAm Orderly Sgt today but have not had much to do beyond warning the Guard, this is generally a hateful job for on this ship no duty roster seems to be kept & everyone fancies he is doing far more than his share, the result is that when any duties come along there is always arguments, but today everything went very smoothly\n\nAfter tea today a little batch of birds that have been hanging on to us for some time settled on the ropes right forrard only a few feet from the ground & so tired were they that they took no notice of the crowd that had gathered round them they were not unlike a duck to look on but larger they remained on the ropes for a good 1\/2 hour. I took 2 snaps of them I hope they turn out alright for they should be \n\na novelty.\n\nWe have had a concert tonight, it appears to be a very difficult thing to get a party together good enough to amuse the boys & this one appears to be very little more successful than its predecessors, but our orchestra is improving rapidly & they keep things moving\n\nThere was some rare fun today with the pillow fighting, if it wasn’t for these welcome little; breaks we should all be bored to death with a vengeance \n","25":" Saw for the first time last night or rather early this morning for the hour was 3. A.M. the good old \"Southern Cross\" there she was sailing high & dry in the heavens & it struck me as if welcoming us home, to me she appeared in the light of an old friend after our long absence, & now I fully\n\nrealize that we are homeward bound at last, the very sight of her brought back old memories of guns, horses, gum trees, home & etc & very little sleep I got the rest of the night.\n\nThe final of the heavyweight tourney was held this afternoon in glorious weather, a brilliant sun was shining but the heat was tempered by the cool S.E. trade winds which have been fanning us the last few days, the fighting was of the usual sort nothing out of the ordinary, Wells won from Nelson who threw the towel in after the 5th round. \n\nThere was very near some blood shed this morning, our Sgt Major, Clynes was laying in his hammock & Reveille had gone, some one started to chip him about not turning out & etc, it was only \n\nsaid in good humour but Clynes took it the wrong way & said to Braithwaite who happened to be near him \"get out you silly B----d, now this is a fighting word 9 cases out of 10 & this was no exception to the rule for Harry walks up to him & says in a very dangerously cool manner \"say that again & I’ll knock your head off\" Clynes although a much bigger man in every respect never said a word I am convinced that he is a squib now, for this is the second time I have seen him bluffed in front of men & he shuts up like an oyster he is a man that very few of us have got the slightest time for, he is both very sarcastic & is always sneering & throwing off at some one, but I have an idea he will keep his tongue a bit more to himself between here & Melbourne, he wants a lesson\n\nor two like this for it should do him the world of good.\n","26":" Another nice & cool day but very windy, yet I fool like succeeded in getting my face badly burnt through lying on the deck.\n\nWe are making very slow progress covered only 241 miles again they say we have an adverse current set in against us from the South..\n","27":" Still blowing strong & keeping the weather cool, but it’s a funny thing during the day there is a never drop of rain, then about midnight clouds appear & it rains cats & dogs & last night was no exception to the rule, Braithwaite & I got up on the boat deck & got to bed early with the fond hope of getting a good nights rest, all went well till 1’oclock when a slight shower sprang \n\nup, we stuck this one out & imagined it was the finish of things just as I was dozing off again down she came in bucketfuls, I sprang out, grabbed my blankets & clothes & beat it for my life with sodden blankets, on my way I dropped my pants shoes & belt & when I woke up this morning of course the whole lot were conspicuous by their absence, there was nothing else for it but to borrow off my mate I then went out to look for my lost garments & by good luck I found the lot scattered about on the deck stairs ladders & such like places, I have had the whole show hanging out drying, this is about the 7th night in succession I have had to pack up so I think I will give it a rest for a while & sleep down below where one can be sure of not getting\n\ntumbled out of bed at all unearthly hours.\n\nThey took a blanket off each man today, leaving us with two.\n\nIt has been decided to have a book printed of our trip when we get to Melbourne, the Y.M.C.A are undertaking the job, 5\/- is being asked for each copy, I put my name down for one & chance what it turns out like\n\nHave been passing through lots of flying fish today, I like watching them dodging the boat\n\nCovered 266 miles yesterday a vast improvement on the last week\n\nWe are getting wireless news from Perth now, it has been decided that the W.A get off at Fremantle instead of going on to Melbourne.\n","28":" Ran into a very heavy swell last night & we have been pitching & tossing like a cork the \n\nwhole day long, at meal times our plates, cups jars & etc roll up & down the table as if it were a grassed plane, & we are all the time grabbing & lunging desperately at something we let go our plate to rescue our cup of tea which promises to dash itself to pieces against your mates plate or else slide off the table with a sickening crash spilling its hot contents overs some unfortunate leg, you have just succeeded in roping your cup in & glance round to see the pickle jar & a loaf of bread making a bee line for your plate, you gaze hopelessly for you are afraid to let go your hold of plate or cup, but luckily just as the shock is about to take place you shut your eyes & wait, but nothing occurs the old ship gives a lurch the other way\n\n& then it is someone elses turn & so the meal goes on, you eat when you see an opportunity & watch your chances like a boxer & hop in for you cut when she is still for a second.\n\nThe W.A. had their photos taken this afternoon this will be their last Sunday on board & thank heaven only one more for us.\n\nWrote a short note home yesterday to Mother telling her not to expect me home just yet awhile, I have not told her scarcely anything about our case just the bold outlines I don’t know whether I ought to go into the details or not at any rate I don’t feel equal to it so I am making the note a short & brief as possible\n\nI am writing in hopes of them squashing the whole thing which\n\nthey could easily do, there is a pretty strong rumour that they are going to, but little things that are happening make me think otherwise for instance the W.A.s who were in it & were fined have had it put in their pay books that don’t look very encouraging, at any rate I am quite prepared for anything now & all I am looking forward to is the day when I get my discharge, I expect when I get home Lens leave will be up I am sorry for this for he would be such good help for me round about seeing as I know so few people round Campania or for that matter anywhere in Tasmania, & whats more I have very little desire to know much of them outside my own people & its not much I intend to trouble with outsiders if I know anything of my opinions & nature\n\nIt is now 8.A.M. & they are holding a sing song on top & old Brotchie a Sgt from our table is singing for the 6th consecutive Sunday night \"Where is my wandering boy tonight\" much to the amusement of everyone the service wouldn’t be complete now without old Brotchies solo.\n","29":" Still as rough as blazes & last night I felt real rotten had to go to bed early to save myself from being sick, I am proving a really rotten sailor this trip, & I am not looking forward with any great pleasure to my run across \"Bass Straights\". \n\nHave just come down from listening to a challenge debate between our YMCA. Rep & C.SM. Kemp, the former put up a really fine argument & brought all sorts of facts to prove his statements.\n\nAt the conclusion we voted by a show of hands first as to who had put the best case, (I should have mentioned that the subject was \"Is prohibition detrimental to the state of the individual\") Mr Sims won by about 10 to 1 on this & then there was a vote on prohibition itself & to the surprise of even myself the prohibitionists won by quite 2 to 1, I had no idea there were as many temperance advocates among us as there really are, I am among these latter myself for I have a regular down on the rotten stuff, after what I have seen these last 4 years.\n\nThe wireless people have put a notice up to the effect that we can wire to Australia or any part of the world now for 11’ a word, some of the lads are sending messages, advising their people of their coming.\n\nThe amount of money collected for Ellis the fireman who hurt his wrist while boxing some time back was published yesterday & amounted to £27-10, &pound20.0 of which they cabled to his wife in England so he won’t be very much out of pocket after all.\n","30":" Not quite so rough thank goodness today but still bad enough for me.\n\nThe day dragged its dreary length through, the afternoon was made a little shorter by some \"lemon slicing\" which caused a fair amount of fun from the antics & caperings of the contestants\n\nThe crew have been busy holystoning the decks, getting her clean & shipshape for our run into port, they are also battening down the hatches so they must be expecting\n\nto run into rough weather shortly I’m in for it if we do, Lord wont I be crook for I’m about the worst sailor who ever trod the desk of a vessel, George Horan & I are a jolly good pair & are renowned for our love of on top when she gets rough \n\nI’ll take some kidding after this to get me any distance on the water\n","31":" It has been a most beautiful day & the sea has dropped to nothing all dangers of the storm they reckon has vanished.\n\nBeen more sports this afternoon cock fighting & it caused quite a lot of fun & amusement at the conclusion the old \"Boatswain\" of the ship was presented with a tobacco pouch & pipe & £3 to boot; the old chap got a great shock when they pulled him out of his cabin & fetched him aft, he has been very good to\n\n& nothing was ever a trouble to him & it was a rather nice little way of showing our appreciation.\n\nThe W.A.s have been parading 2 or 3 times today for roll calls & etc. They are going off at Albany now instead of Fremantle\n\nBill May went & saw the Adjutant this morning & tried to find out definitely what they are going to do with us on arrival in Melbourne he promised him we would be let get away as far as he was concerned with the rest, but I place very little faith in this for the Port Authorities are in charge then & we will be at their disposal, so I am quite prepared for all eventualities & am posting my letters advising friends of what has happened, I am quite resigned to the inevitable now & the sooner it is over the better\n\nWe’ll give them a go of it when the time comes, & if Braithwaite & I don’t beat them I’ll eat my hat.\n","32":" There was a rare bit of fun last night at the concert, Braithwaite Bill May & Brotchie took part in \"4 jolly sailors\",& they were all as nervous as could be, while they were singing someone threw a penny on the stage & another chap sings out \"lead trumps Bill\", (Bill is a great bridge enthusiast) this broke them up & they forgot their lines, & we all nearly killed ourselves with laughing, they reckon after they came off that wild horses wouldn’t drag them on the stage again.\n\nOne of our pay Sgts gave a pretty good turn with hypnotism, he had old \"Treacle\" washing himself in flour, pulling faces at monkeys, & pelting them on the rigging, then he \n\nhim he was lousy, Treacle started scratching & rubbing like blazes & finally pulled his shirt off & would have taken his trousers off too if he had not been stopped, we nearly burst our sides laughing this one was a thundering good concert the best we have yet had\n\nGot our first sight of \"Aussie\" at 10.30 this morning, as we got closer we could see bush fires burning but to me it looked as if some one was doing a bit of \"burning off\", Cape Leewin they say it is \n\nSaw a ship going our way the first boat we have sighted since leaving Colombo\n\nFound my overcoat which I had given up as lost this afternoon.\n\nHave been playing bridge practically the whole day long its the only thing that prevents us\n\nfrom going mad, there is some rare fun at times some of the lads bite like snakes we had one of these this afternoon & nearly drove him mad.\n","33":" up late last night discussing farming & the land & etc, there are a few city chaps on our table who are going to give it a fly & they are very anxious to hear our versions of it, drawbacks, advantages & etc\n\nRan into King Georges Sound at 6.15 this morning, had an early \"reveille\" & breakfast, it was mighty cold on top a heavy wind tearing & beating the open waters of the Sound to fine spray which occasionally dashed over the ship\n\nAlbany looked very pretty when the sun came out from the clouds put me in mind of Gibraltar with its red roofs & white walls with 2 big hills flanking the town only &\n\nnot so high or majestic as old Gib looks, we had not long been anchored when motor boats came rushing up with health officers & etc the \"Sandgropers\" were very excited at the thought of getting home some of them had been up half the night getting ready, about 8 ‘oclock the townspeople got wind that we were in the \"Sound\" & a boat came alongside us with a lot of girls on, these were the first \"Aussie\" girls that we had seen & I could not help noticing how brown & tanned they were after being among the English girls for so long but still to me they were a fine sight& one felt home once more the boat they were in brought us potatoes & fruit & the girls also sent a lot of oranges cigarettes & such like to us\n\nthey seemed very much concerned to know how many men were married its easy to see they don’t like the English girls, there was a lot of chaffing between the girls & our chaps\n\nat 10o’clock the \"Sandgropers\" filed on to their launch & as they moved off one of the chaps played \"Auld Lang Syne\" & cheers were exchanged most heartily, one could not help wondering if he would ever run across any one of them again the \"Sandgropers\" had a bitter disappointment in store for they thought they were going straight on to Perth & then home but no, they took them across to the quarantine station & its hard to say how long they will be kept there, at 12 oclock we pulled our anchor up & steamed\n\nout for the last stage of a long & tiresome voyage, this is a very fine harbour & is nearly land-locked & could shelter any number of steamers but it will be many years I expect before it is used to any extent, just before the W.A.s went ashore I gave Andy Davidson 2 letters to post for me telling them of my probable delay in Melbourne We had no sooner got out of the Sound than we ran into rough weather\n\nMountainous waves were rolling & rushing like fury one minute we would be in a big greeny valley with waves towering above us, then the old ship would roll & we would be sky high looking down in to dizzy depths, how she rolled & plunged, I thought I should have been nearly dead but\n\nstrange to say I felt as fit as a fiddle & chaps who had so far not been sick were flat out to it now down below there was a lovely scene practically all the crockery had been broken, it was impossible to keep anything still, even we ourselves find it hard to get about on account of the heavy rolling.\n","34":" Still very rough & one has to watch himself when getting about\n\nThis morning an \"order\" came out about going to our homes from Melbourne instead of having to go to Military Districts where we listed from. I had my name transferred to Tasmania as it will save me both time & expenses although I expect I will be hung up in Melbourne waiting for our trial & perhaps quarantined to boot.\n\nWe got a lot of papers on board at Albany & on reading through them I was struck by the number of unemployed there are in Australia & the trouble they are having with them\n\nIf they can’t handle the few there are there now, goodness only knows what will happen when the mob come back, according to the W.A. papers conditions are very bad there & work scarce, but things will right themselves in time, it should not affect me much as I am going on the land.\n","35":" & heaven be praised the last we shall spend on the boat at the conclusion of the service this morning Mr Sims our YMCA Rep. spoke a few parting words he has proved himself a regular godsend to us & is about the most popular man on the boat \n\nOn our usual Coy. parade this morning \"orders\" were read out to the effect that every man has to wear on his tunic a red white & blue rosette with tails 3\" long of the same color, some say it is the wish of the French Gov. & is a compliment to Aus (a lot of rot that), others say that it is to be our \"pass\" while on furlough & will entitle the wearer to all sorts of privileges, be what it may it is about the sillest thing & that is saying something that we have yet done, every one is roaring about it & so they should for we will look ridiculous in the eyes of the people, what are we all that we should be made such walking fools of, surely we are entitled to more respect than that, we have to have them sewn on our tunics by tomorrow morning.\n\nAll clothes on the ship are being\n\nfumigated in the hope of them letting us off in Melbourne without going into quarantine which we fully expect to do on account of this influenza epidemic that is sweeping throughout the world, but we have nothing of this sort on our ship, perhaps the inoculations we received at Plymouth saved us At any rate the way it is being carried out now is nothing more than a farce no check on anything there won’t be half the ship done\n\nIt is a glorious day on top & the sea has gone down a lot, several ships have passed us this morning including the \"Sardinia\" of gambling fame on whose trip an enquiry has just been held\n\nEvery one on the boo is in a great state of activity, cleaning boots airing & brushing clothes\n\n& so on, but there is very little excitement everyone taking things as a matter of course, I don’t suppose I shall be in the least excited until I get to about Colebrook coming home then I shall be on the lookout for old familiar faces which I have not seen for years a chap will about realize then that he is really about home at last.\n\nSat up to about 11 oclock as usual playing \"bridge\" last night, we have played this game constantly ever since leaving England & it never seems to grow stale it has helped us in a wonderful way to break the monotony of the voyage, cards when properly used are a regular godsend to kill time, nearly every table on the deck has its little crowd who always play together, some play bridge others crib, whist, 500 \n\n\"rummy\", casino, 7’s & so on, & there has never been a squabble the whole time, because no money was hanging to it I suppose, anyhow the old \"broads\" as they are called have helped us wonderfully\n","36":" According to what I can hear fumigation yesterday was an even bigger farce than I thought it was for the clothes that were put in the room never had a thing done to them, the boys just took them out as they were put in.\n\nDinner just over, have been laying on the broad of my back all the morning right \"forrard\" sunning myself for it is a nice morning though a heavy wind is blowing & the sea beginning to get rougher, spray is flying all over the place & the ship is starting to roll heavily but we are nearly out of the \"Bight\"\n\n& it won’t affect us much longer\n\nthey caught \"Flash Jack\" this morning this is the rotter that got aboard at Plymouth somehow & managed to keep clear till the present, they say that this gentleman has never been to France but has been in Blighty the whole time malingering & robbing his mates, hes a proper master & looks it\n\nAustin is his name, they now have him confined in the barbers shop & the Guard looking after him.\n\nThe whole of us paraded in our Military Districts this afternoon we all had out \"aeroplane colors\" on, the rolls were called, my name being among the Tasmanians.\n\nAfter this we were all supposed to go through the fumigator but it was just as big a farce as the clothing stunt was, no names were taken, so you can guess what it was like.\n","37":" There was a farewell concert given last night but the showers spoilt it a bit.\n\nIt is simply a glorious morning & I & a few others have been stretched out full length on the deck \"forrard\" this is the best part of the ship for it is always clean & there is no vibration on it or traffic, we have been talking over all sorts of topics as is usual when men get together but it nearly always turns on prospects to when we get our discharge & about marrying & settling down, we practically agree that we have had enough knocking about but when to marry seems the biggest problem for all of us to settle & some of the arguments brought forward are very funny, I guess when all said & done all plans will go overboard & we will act on \n\nthe impulse of the moment\n\nGot nicely burnt about the face yesterday & this morning my nose is like a ripe cherry, hope it goes off before I get home or they will be thinking that I am a walking advertisement for \"Johnny Walker\"\n\nThe whole ship had a kit inspection this afternoon & all military & surplus articles were taken away from the men you would have been surprised had you only seen the immense quantities of clothing, such as hats breeches shirts boots tunics & extra blankets that were collected, luckily for me I missed this for I was put on one of the gangways to stop all troops from going below while they were examining kits & clearing the decks of clothing & etc, & so I have still got the few things in my black kit bag, & I think I have a good chance of getting through with them now \n","38":" Paraded with the Tasmanians yesterday as I belong to them now. \n\nAnother glorious morning & scarce a cloud in the sky, the sea is very much quieter too, only an occasional big roller spins us about we sighted a lighthouse just after breakfast on the \"port\" side they say it is close to Portland.\n\nTons of fun at breakfast table this morning & bites were plentiful you only have to throw out some little disparaging remark about Victoria to start things moving, & next table to us is a \"Tassy\" he is one of the best bites on the ship, it’s the fun of the world sometimes to listen to them, Victorians & Tasmanians they throw off at one another & N.S.W. & Victorians are deadly enemies as far as the State is concerned, \"Sydney Harbour\" \n\nor as the Victorians call it (\"our harbour\") sarcastically, & the Yarra form the pivot around which most of the storm centres, Queensland & Tasmanians generally support N.S.W while S. Australia backs Vic. up & so the baiting goes on, our Table is the centre for all this hot air & I have a fair cut at the Vics, it has been the same right through for there is the keenest rivalry between Victoria & N.S.W, & the place to see it is when sports are being held.\n\nSoap has been unprocurable for the last 10 days we have had the job of the world to get enough to wash ourselves let alone our clothes consequently the latter are in a deplorable state, I am going to pitch mine overboard tomorrow for they are absolutely black, & there are many more in the same boat\n\nPassed Cape Otway about dinner time the country behind looks to be well wooded, but the foreshore is sandy colored, we skirted the Victorian coast all the afternoon heavy bushfires appeared to be raging along most of the coast, & a thick mist hung over all, shortly after tea we entered the heads, there has been much speculation as to whether we will go into quarantine or not\n\nWe will soon know now whats doing, the pilot has just come aboard & we are slowly going up the Bay, its too dark unfortunately to see anything save the glimmer of the lighthouses, the sunset tonight was a dinkum \"Aussie\" one bright red the first one of its kind for over 4 years, most of the lads are highly excited so far I have not gone or done\n\nanything silly, but I suppose my time is to come.\n\nWe were all paid this afternoon those who had enough on their books got £10, this ought to carry us home there was also a brief medical inspection, but we have a clean bill of health a rather unusual thing I should think for a ship with so many troops & coming so far, on board, we have not a single patient\n","39":" Reveille at 5.A.M. we are now lying at anchor off Queenscliff, the quarantine staff have come aboard with masks on to have a look at us I have just been done with the Tasmanians we fell in on the boat deck & a Dr came round & took every mans temperature, it all depends how we get on whether we go into quarantine or not, on looking through the paper which came aboard I was surprised\n\nto see that we were reported as having mild cases of influenza aboard this is absolutely untrue for there has not been a trace of it everything is all bustle & rush this morning rolling blankets handing hammocks & etc in & getting ready for anything that may come along, quite a lot of telegrams came aboard this morning for various chaps, everything looks so peaceful & quiet there is not a ripple on the water.\n\n9.A.M. After the Drs examined our ship they went off to breakfast & were coming back again to give their decision, now we thought we are set & we dragged off all our belongings up the stairs & stacked them then waited impatiently for the ship to get a move on, every one was ready dressed up to go ashore\n\n& all were in high spirits, but what a shock we got, for a notice was put up on the board to the effect that we were to be quarantined for 7 days, then the long pent up feelings broke loose the disappointment was too much, & a perfect storm of curses broke loose, they cursed everything under the sun, just then a Red Cross boat came alongside & sang out, hullo there we have got something for you chaps\" oh the abuse they got, they told them to do all sorts of things with it, impossible & otherwise, they were in a proper ugly temper & when Australians get these moods they are fir for anything, what made it all the worse was the fact that we have not had a single \"flu\" case on board & all are in good condition also the \"Leicestershire\" who had \n\na mixed lot on board went straight up & unloaded at the pier, while we who had been away all this time were forbidden to go any further & no one would have the slightest objection if we really did have any disease on board, looks to me as if they are starting already to put the boot into us, everyone is going about the boat looking as black as thunder & fit for anything, our dinner was a beauty too, for \"orders\" had been given that all bread had to be thrown overboard after breakfast for some reason or other consequently we had big hard ships biscuits & bully, this within a few miles of the city, but of course anything is good enough for soldiers now the war is over, it has been a proper shock to everyone & has knocked all plans in the \n\nhead, there is a great string of chaps at the orderly room now sending telegrams to their people, & swearing like troopers at the same time.\n\nI sent a few letters & cards away this afternoon telling them of our quarantine\n\nHad some nice peaches & apricots for tea this evening, but no bread, biscuits\n\nSome of the lads have been fishing off the boat & caught one or two nice flathead & a few young sharks.\n\nA nice Japanese passenger boat anchored quite close to us this afternoon & later on after the health authorities passed her she cleared out, there was also a pleasure steamer ploughed her way down the bay filled with people all waving & cheering, its good to be amongst your own people once more, a lot of the Victorians are getting letters tonight addresses to the ship\n\nThe Dr condemned all our blankets this evening so they are getting new ones from Queenscliff, those on the ship were lousy in lots of cases\n\nI believe the old Captain of our ship went raving mad when the Drs refused to let us land, he told them off a treat & as they were going away in their boat our boys gave them a beautiful time called them for everything they could lay their tongues too \n\nthe Drs to have some grounds for quarantining sent Corbett off to Portsea with a temperature of 99.2 they had him up 3 times & tried 6 different testers on him, before they could get a sufficiently high enough one, this is quite true no stretching things, why if a man were to parade sick with a temperature like that in France they would almost charge him with\n\nmalingering & call him a waster\n\nGambling is in full swing on the boat again its going on all over the place, if had my way I‘d put a stop to this for it only means that a lot of the money gets into one or two hands & leaves numbers without a penny, then some of these to make up their losses pinch other chaps money & so it goes on\n","40":" There was a rare fight on the boat this morning over the ownership of a fishing line, the principal contestants were Harper a notorious pug & a dark horse so far as the boat is concerned & Johnson the ships R.S.M. they fought like tigers for 5 rounds the first 3 with bare fists & the later with the gloves, punishment was meted out freely & heavy blows were exchanged, Fisher another R.S.M. (Tassy) stopped the fight for they were both good sort of chaps\n\n& very evenly matched & there was no sense of them both disfiguring themselves at this stage of the game\n\nthis squabble can be put down to the disappointment of being quarantined for everyone is in a very bad humour & only too ready for a row, in fact it would almost be welcomed as a means of letting off pent up steam\n\nThe Drs came aboard this afternoon again & took our temperatures, in addition to this we have to go through fumigating, they have rigged up 2 small rooms holding about 50 men at a time & each batch gets a good 10 minutes steaming with hot steam & chemicals, what a farce this is for we are as clean as can be, they reckon we have to go through this 3 times & that most likely we will proceed to the pier early on Monday morning \n\nAn \"indigation\" meeting was held on deck last night & a resolution passed after a lot of talking, to the effect that the Padre, should send a protest to the Returned Soldiers Association against our unfair treatment & etc & to ask them to take action in the matter & get tings sifted out, also a letter was to be sent to both the \"Age\" & \"Argus\" stating our case quite plainly, officers & all are concerned in this matter. \n\nThe boys have been catching a few fish today mostly flathead.\n","41":" The \"Nestor\" a fine big ship came in last night loaded with wounded & invalids, she has got to do 7 days quarantine, Corbett the chap who was taken ashore as a suspect the other day has returned, couldn’t raise a temperature the whole time he was there\n\nThe Drs put us through the same rigmarole this afternoon but its only a farce for they know very well that there is nothing the matter with the men, our protest was printed in the papers today\n\nHad a sharp reminder that we are back once more among flies at tea this evening for I found maggots crawling in my meat the first I have seen for 4 years.\n\nBrotchie a Sgt at our table is a long way overdrawn through the Authorities fault, & because of this they would not pay him any money \n\nWe did not like to see him go ashore penniless so our table threw in 5\/- each & made him up a £ 1 or two\n\nHave had the Victorians biting like one thing this evening over their papers, quarantine, rivers & etc \n\nBraithwaite & Bill May are both bonza bites, they swallow floater sinker & all, I can get them going any old time\n","42":" again & Church services as usual, it has been a lovely day nice & sunny.\n\nA big barracouta was caught off the stern of our ship this morning\n\nSaw the \"Marathon\" & a few more ships go out today.\n\nWent through the usual inspections today & the ship was pronounced clean, at dusk the pilot came aboard & our flag was hauled down, we are leaving at midnight for Port Melbourne.\n\nAll sorts of rumours have been flying around as to what they are going to do with Braithwaite, May & I, the officers don’t even\n\nknow themselves, they are sick of the affair & want it wiped out but it lays to the Authorities in Melbourne, I would like to have telegraphed home but can’t do so for I don’t know what they intend to do with us & its no use disappointing them\n\nThe chaps running the 'roulette’ board come a bit of a \"gutzer\" this last couple of day, they lost over £300 in 3 days & this morning they had to close up that’s what I like to see happen to all these sharks\n\nEveryone is in a great state of excitement tonight getting cleaned up once more for I think it is \"dinkum: this time & soon we shall be home, I can’t realize that we are now even in Australia yet but once we\n\nhit the land we will understand\n\n"}}