{"Document Name":{"0":"Diary_0161","1":"Diary_0161","2":"Diary_0161","3":"Diary_0161","4":"Diary_0161","5":"Diary_0161","6":"Diary_0161","7":"Diary_0161","8":"Diary_0161","9":"Diary_0161","10":"Diary_0161","11":"Diary_0161","12":"Diary_0161","13":"Diary_0161","14":"Diary_0161","15":"Diary_0161","16":"Diary_0161","17":"Diary_0161","18":"Diary_0161","19":"Diary_0161","20":"Diary_0161"},"Date":{"0":"unknown","1":326.0,"2":327.0,"3":330.0,"4":332.0,"5":333.0,"6":334.0,"7":335.0,"8":338.0,"9":341.0,"10":342.0,"11":343.0,"12":344.0,"13":345.0,"14":346.0,"15":347.0,"16":359.0,"17":374.0,"18":445.0,"19":446.0,"20":447.0},"Entry":{"0":"\n\n","1":"\n\nThis morning we came inside the harbour. We have been taking in water & various provisions &c.. The \npeople\n natives who come out to the ship are extremely interesting to one accustomed to the stolidity of the Anglo Saxons.\n\nThese are an exciting and extremely solicitous people. Perhaps it might be fairer to modify the latter to the statement that they cannot take no for an answer in business. They dress in all the colours of the rainbow pink and patterns of that design formerly peculiar to the Highlands of Scotland being peculiar favourites. Headgear may consist of almost anything at all sometimes it is nothing at all. Some twist a handkerchief round the forehead and the back of the head leaving the top entirely exposed. Most use the turban but caps and straw hats may also be seen. \n\nThere were 3 rowers all rowing on the starboard side. The 4th rower stands up and uses his paddle both to guide the boat and in propulsion. Both ends are pointed and rise from the water. There are also clumsy looking boats used for conveying merchandise out to the steamers. They are \nshaped\n hexagonal in shape on top. There are no rails round the sides or any other structures the top being quite bare. They them about half-a-dozen at a time. There are numbers of motor launches about here. This evening 3 natives came out in a boat with a number of tins of Capstans Cigarettes. These they offered for sale at 2\/- per tin. They got on one of the aforementioned boats used for loading and with a \nbedsheet\n narrow deep basket with twp ropes tied to it passed up the cigarettes. It was doing a thriving trade, when some native officer came over in his boat.\n\nThe tins were at once planted. An excited colloquy ensued. The retailer proffered. A few shillings were paid over the newcomer departed smiling and business was resumed. The chatter and clamour of these people are extremely amusing.\n","2":"\n\nWe left Colombo on Tuesday night. The fleet so now split up. There are only two lines of transport in our lot. There are 5 in the second line which is on our starboard. I do not know how many are in our own line. Am not too well today. Tucker has been pretty crook this last week or so. It is the same eternal round. Always potato and haricot beans or peas with meat more or less uneatable. Today we had for the first time some squashy pumpkin or suck like muck. When speaking of the soup it is usually prefaced by the word \"shadow\". It is either as salt as the sea or tasteless as grease.\n\nThe meat is sometimes tripe and never fails to remind me by its action on the olfactory nerves of the \nheart\n duck farms we passed at Randwick. The porridge is at once watery and lumpy and has no salt in it.\n\nFurthermore there is no sugar wherewith to sweeten it. The only decent eatable is the sausage. The bread has of late been frequently doughy. We have even had it hot from the stoves. There was one thing which I forgot to mention about Colombo viz. that the breakwater consists of 3 parts and there are 2 entrances.\n","3":" \n\nThis morning the whole fleet was stopped. The generally accredited report in explanation is that two men fell overboard on the Shropshire.\n\nIt is a curious thing however that the Japanese battleship went back through the lines. If \n\nher action had anything to do with the stoppage it could hardly have been occasioned by such an accident as related above. The bread continues as sour as ever. A great number of the men now sleep above. There is not much to tell. We had no parade this morning owing to want of space.\n\nWe might get to Aden in a few days. Have read Rob Roy by Scott and The Three Knaves by Eden Philpotts since I came on board. I have also gone through Shakespeare’s practical pieces & sonnets.\n","4":"\n\nTo-night (in fact \nabout\n in a few minutes) there was a spar between Vic Brown & Culpane the Pay-Corporal. An argument arose as to whether the Southern Cross could be seen from this latitude or not and C losing his temper invited Vic to settle it per\n\ngloves. Vic accepted and we adjourned to K Deck. C led on points but in the third round Vic sent him to the floor. C rose very much shaken and after standing in a dazed condition for some seconds gave in. The parties then shook hands and harmony was restored.\n","5":"\n\nThis morning the sea was like a sheet of molten glass. All day the sea has been exceptionally calm. At times the masts and funnels were reflected in the mirror-like surface. \n\nWas on fatigue work this morning. Had to polish the brass work in the lavatory to give it a chance to get dirty again. We are to get in at Aden to-morrow morning sand has been visible in the distance for the greater part of the day. Some one down here is attempting to draw\n\nharmony from a \nvery\n somewhat reluctant violin. Letter writing is going on literally all over the ship. Vic Brown has got his first stripe to-day. Weather at present is just nicely warm. Play \"house\" for the first time last night and lost about 6\/-. The only one who is certain to benefit in this game is the owner of the outfit.\n","6":"\n\nThis morning we got into Aden. There are two huge rocky islands in front of Aden and grim portals they form. They are almost absolutely bare of vegetation and steep and precipitous as a mountain peak. They rise against the sky in a sharply cut rugged and broken line. On one of these islands the British garrison has its quarters. It must be an awful life for any man condemned to pass any number of years here. The place is dull, & bare. Seaward rise rocks even of the \n\nsea gull. Landward a low sandy shore comes down to the water and dimly discernable through the haze rise more rigged mountains. Beyond again are only sandy stretches and fresh mountains. There appears to be but little commerce. Aden I think owes whatever importance is attached to it to the fact that it is a coaling station. The natives (those that came alongside) were dressed in the usual gala colours of the Orient; sometimes they were dressed in very little. I observed three men and a boy devoid even of a covering to the head. These men were naked to the waist. From the waist to the knees their dress consisted I think of a piece of cloth worn in a manner similar to that which I remarked at Colombo. Tartans, khaki pink and white predominate. Turbans and the fez constitute the usual head gear. Very few white men came round. The natives invariably went bare-footed. The natives are much darker than those observed at\n\nColombo. Sometimes the hair was frizzy. I heard to-night that fearful scenes were witnessed on board the Emden some of the men being insane when the English boarded the vessel. It is stated that of 12 men who were in the turret when a shell exploded not so much as a thumb could be found. In places the blood was 2 inches deep. Over 100 killed and 20 wounded. If ever these figures and statements are correct the incident goes to show in a most graphic manner what a truly terrible proficiency has been attained in the science of destroying human life.\n\nIncipient moustaches are the fashion all over the ship. On of the sergeants (not in our coy) is inordinately proud of a dandy growth of fiery hair which with the aid of a little wax and a great deal of perseverance he has succeeded in giving an appearance to at once smart and martial, nay, even provocative in the extreme. Some prefer the old Viking style, others more\n\nfrom force of circumstances than their own volition cultivate a short thick growth terminating abruptly at the corners of the mouth and clipped short above the top lip. This style is neater and saves sipping the tea off again but lacks the beautiful drooping proportions of the Viking style. The moustache in a half developed condition is rather an unlovely supplement to masculine beauty, like an adolescent jowl it lacks at once the downiness of the very young growth and the smooth firmness and finish of the mature product. So much for moustaches\n","7":" Anno Domini 1914. This morning we left Aden. It is rumoured that the Sydney has destroyed a fort some little distance from Per; in fact the alleged remains of the said fort were pointed out to me this afternoon. It now transpires that the Sydney did not go back to Aus\n\nat all. We passed Perim this afternoon. It is a small naval station just a few buildings scattered over what appears to be a very barren island. The buildings are white and there is a lighthouse at one end of the island. I have heard that there are 250 000 Turks within 100 miles of the Suez and that there are 14 000 British troops guarding it. Another rumour is to the effect that we are going to Egypt. The Arabian coastline is made up of a succession of sandy stretches and bleak precipitous rocky bluffs. A stunted growth of some vegetable life appears grow on the sand. From the shoreline the sandy stretches recede to rocky precipitous mountains scarcely distinguishable from the cloudy background.\n\nAcross the sand lie beautiful blue velvety shadows. Here and there rocky knolls have been half enveloped in the sand driven by the wind. The sunset tonight was succeeded by an after reflection when the rays of the sun catching the vapours of the sky spread out fanwise. The beauty of this phenomenon was further accentuated and heightened by the obstruction of the sun’s rays in places by the small clouds which left here and there a shaft of blue sky interspersing the amber and crimson. I have noticed on more than one occasion in these low latitudes that the sunset is succeeded by this second reflection. Another peculiarity is that not only the west itself but the whole circle of the sky is lit up with the reflections.\n","8":"\n\nWe are going to Egypt. Various rumours are of \n\ncourse afloat but it seems certain that we will proceed to Cairo. Was on guard yesterday and could not very well make any entries last night. The weather is as warm as a hot day in Australia so Christ only knows what it is like here in Summer. Guard is a part of military duty which certainly offers no attractions. Last night I paced up and down for four solid hours guarding a doorway that no one offered to enter. This morning it turned cool and has been pretty fair all day. The light to-night is . Our kits were inspected this afternoon and we were supplied with missing articles. I have lost two hats since I came on board. Complaints re lost property are universal. I think that there is no doubt that some of this loss is attributed to carelessness yet the greater part is due to deliberate theft. \n\nWe have been out of sight of land for \ntwo days\n nearly 3 days. The last shot that we saw consisted of a few rocky islands barren as a blown egg.\n","9":"\n\nMonday passed very quietly. This morning when I went up on deck the first thing that met my gaze was the sight of a rocky and sandy coast line. Bare ridges, their sides angular, facetted and naked rose from the sandy stretches their tops leaping hear and there into flame-like pinnacles \nin the morning light they\n About them hung a light violet haze deepened whenever on the sides of the bluffs. Shadows were thrown A striking characteristic of the Arabian atmosphere is the predominance of violet in the colour scheme. The very clouds & sand seem to come under its influence in an usual degree. We got to \nAden\n Suez this afternoon. We are \n\nat present anchored outside the canal. The town is divided into two portions \nquite\n the distance between being about a mile. The architecture (from a distance at least) is simple rectangular and block-like. The houses seem to be built of stone some white and the rest of a grey sand stone. The fronts are perforated by 2 or 3 tiers of windows. The roofs of course are flat. There are few trees about. Whatever trees there are consist of \na\n varieties of palm. \n\nThere are a number of huge tanks lying to the left. These remarks apply to what I think is the native portion of the town. The other part which lies by the \nmouth of\n entrance of the canal is I judge from its appearance the British quarter and of course includes the officialdom of the port. \nThe houses are\n There are a greater number of trees, \n\nmore variety in structure and general improvement in appearance, of the houses. The other and by far the larger portion has something very peculiar about it. There is something detached in its appearance. It is like no other town that I have ever \nscene\n seen. The absence of striking natural features as a background the simplicity of architecture and the want of artificial substitutes for nature’s lack of floral adornment all serve to give it an unfinished appearance. The houses are as it were \"dubbed\" on the bare stretches of sand almost in the same way that a child \nmay\n might place blocks on a table. I was talking to one of the soldiers this afternoon and he told me that the town has gone ahead a good bit in the last 8 years. There are the usual boats knocking around carrying one sail rigged on a single mast with a cross piece.\n\nI saw only a few of the \n\nnatives and they were dressed in European style except for head gear which consisted of the usual turban. These natives were at most westernised sartorially one then sporting a fancy waistcoat. Ships passing into the canal present from a distance a peculiar appearance as they seem to be sailing on the desert itself. There was a willing go with the knuckles on our deck to-day. I have got the deuce of a cold hanging on me. This morning our equipments were once more inspected. We were paraded in squads or rather were divided into squads during parade the breeze \nis quite\n has been quite cold to-day. The gramophone fund is getting in good work just at present. \n","10":" \n\nWe have got into Port Said. We arrived an hour or so after dinner. Port Said presents a scene\n\nof great activity at present. I hardly know where to begin there is so much that is strange. As we were going to anchorage we passed two remarkable and imposing buildings, one of which reminded me somewhat of Mark Foys place in Sydney. The other was typically eastern; it \nwas also built of grey sand\n is a grey stone building & the windows are long & narrow curving to a point at the apex. It has a large frontage standing back a little from the waters of the canal and is surmounted by three green domes. The streets of the town are narrow but hard and level. There is a long esplanade (The Francois Joseph Inay) running for some considerable distance along the canal. Boatsheds are built off the quay in which are kept numbers \n\nof rowing boats. The boats are placed in position by running the keel along a groove prepared for it. Bright light colours are prominent as usual but the tartan here is conspicuous by its absence. Bright bright blues, reds, \nand\n khakis and whites are the chief colours. The fez and the turban constitute the chief headgear but I also noticed skullcaps and another similar form shaped like the bottom half of as cone cut off parallel with the base. The top edge of this is produced into a vertical about an eighth of an inch high Boots are worn and not worn. A great number wear a kind of overall which consists of \nsome\n a loose tubular sort of garment with sleeves and having an angular yoke. Under \n\nthis are worn a singlet and white baggy trousers. \n\nThere are many fine buildings in Port Said some rising to five storeys. There are not a great number of Europeans. The native women go around clad in black and with half their faces hidden. The nose also is partly concealed by a vertical strip dropping from between the eyes. The rowing boats are different to those that I observed in Aus in that all available space is taken up for lockers. There is one fore and aft and one under each side seat. The natives are beggars without a doubt. They hold out their hands, grin, nod their heads, importuning \"backsheesh\" which being interpreted means money. I saw more money thrown into the water than the boats. There were two coal barges alongside. They are rectangular in shape and fairly deep. They were filled with coal\n\nand lying or sitting about on the coal were the coal lumpers. The greater number were sleeping or apparently so. Their clothes and they themselves were filthy dirty and their attitude seemed to suggest a certain hopelessness or even despair. Poor devils! they seemed dead tired. About 4 o’clock they began to load the coal. Each lumper has two baskets, while he is carrying one the other is being filled. Planks are laid from the ship to the barge. A basket is filled, the lumper takes hold of it, and assisted by the shoveller, swings it up in front, and bending his head places it on the back of his neck. He keeps it ion place with the right hand \nand\n using his left to pull on a rope running along side the plank. He wherever he has room to do so,- loaded up or\n\nwith empty basket. From \nthe time that un\n start to finish of unloading a continuous stream is to be seen toiling up the plank. As they go they give vent to a kind of chant which apparently helps them with their work. Having emptied their basket they run down the plank leap into the barge throw down the empty basket, whip up a full one, and trot off again. This evening they have had no tea. Some of them say their prayers wherever they may happen to be. I have seen 3 or 4 at this caper to-day. I observed one after dinner. He washed (or rather laved his hands arms and face) in the water of the canal, put a little of the water on his hair, gave a bit of a round in his ear holes, and then dried himself on a handkerchief which he took from a coat pocket. Then he spread \n\na piece of matting (I think he got this from his boat as he was in the boat shed at the time) stood on it, and, crossing his hands in front prayed for a while. Then he bowed, bending his knees and his body at the waist and placing his hands above his knees. Straightening up he bent again in the same fashion, then went right down on his knees, placed his hands on the matting and bowed his head to the ground. Then he sat up again with his hands above his knees and \nafter that\n then again bent his head to the ground. He resumed his former position with this difference that the right hand instead of being placed flat on the thigh was clenched, the index finger, \nand\n\nthumb\n however, pointing outward. He went through this several times. Once he nodded his head right and left at the ground scratched his head gazed vacantly around and I thought it was all over. I was mistaken however, for at it he went again. I got tired of following his givos and the foregoing is as near as I could get to it. When he had concluded he washed his feet, put of his socks and elastic sides and sauntered off. The New Zealanders went off to Cairo this afternoon and were heartily cheered as they passed along. The canal is about 90 miles in length.\n\n For a great part of the way the sides are bricked in, the ships are only allowed to travel at a certain speed as the wake from the swell\n\nwears the banks down. This bricking is done in rather a peculiar way. Stakes are driven it at intervals of a foot or so and roughly rectangular blocks of sand stone are placed behind them, the surface rising obliquely from the water \nThis part of the wall is about\n The wall rises in this fashion for about a yard. Above this comes a second wall, \nincling\n based on the first and inclining more to the perpendicular. The stone may be ocherous coloured or dull crimson lake. It is sometimes worked in in mosaic fashion, sometimes in a roughly rectangular manner. The upper portion may or may not be cemented. Again the pattern may be hexagonal. At intervals of 100 yards or so tying up posts are sunk in the ground. These are supported by a \n\nhorseshoe-shaped contrivance sunk in front of the post. I also observed numbers of \"T\" shaped holes sunk in the bank but do not know what these were for. A railway line runs alongside the canal. There is a fence erected to keep the sand from driving over the railway line. There \nwere\n are several stations along the line. They are usually roofed with red tiles one storey high of a light ocherous colour picked out in a white or dull red. A mile or so from the canal regular groves of trees are growing. They appear to be some variety of pine. This is to be observed after leaving the lake. The country there is sandy, with a low tufted isolated shrub growing. We passed one military encampment \nin a state of defence\n ready for attack and several outposts.\n\nThe troops were all natives of India. After dinner we passed much marshy country and some that has been flooded as a hindrance to the Turk. The English stations usually comprised, in addition to the residential buildings, a dozen or so of semi-detached houses (with bars over the windows. These may have been prisons, as the bars would seem to indicate. At Port Said are used in lieu of cabs. There are few lorries or drays(at least I saw none) but the vehicle most in use is a little hand cart. This has two short shafts running out from a floor with no railing around it or side support of any kind. Under this is a box-like affair from the front of which two short legs. Two rather small wheels are placed to the back of this\n\nbox like structure.\n","11":"\n\nLast night almost the whole of the","12":" Battalion were half poisoned. Some of the men began to get bad an hour or so after dinner & and there was a run on the A.M.C all night and even this morning. The writer took bad about 6 o’clock and was vomiting until about 3 in the morning. He was also pretty crook until about dinner time when he had a cup of tea and some of that doubtful aeration known as \"duff\". Had no breakfast at all. The sickness was accompanied by more or less violent spasms in the higher abdominal regions. We got to Alexandria this morning but I was too crook to take much notice so cannot note down any observations re city &c. We are to proceed to Cairo where it appears we are to \n\nstop for some time at any rate. The A.L.H. are to proceed to the front after a few months training.\n","13":"\n","14":" \n\nWe are now travelling to Cairo and I am writing this in the train. The carriages are lined with varnished wood the seats are constructed of the same material and the light is of gas. We got word about 12 to-day to parade on the boat deck with kits, equipment & rifles. We then made our way down to the cars, where after waiting some time we put we put our equipment & rifles in the places we intended to sit we took our kit bags along to a car set apart for their conveyance. It was some considerable time before we got a start on. It is now\n\ndark and we are still travelling. The country we have passed through is flat and apparently very rich. It is well irrigated. Channels about 2x2 run longitudinally through the fields. Corn & lucerne are grown also other products that I did not know the name of. There were groves of date palms here and there. These trees go straight up and branch out into drooping leaves at the top. Beneath these hang the dates in large branches. Some of these branches I observe to be protected in bagging. The animals consisted mainly of buffaloes and donkeys. There were also camel, goats & now & then a horse. The ploughing is done with oxen; two oxen to a \n\nplough. They are very quiet animals, the smallest toddler being capable of managing them. They have a hump over the shoulders and in the hind-quarters sharply to the tail. I also saw some European cattle. The camels and donkeys were employed in carrying loads usually of an agricultural nature. Both are of course ridden. The rider sits further back on a donkey than on a horse. The donkey looks ludicrously small after being used to the horses of Australia. We passed numbers of little villages of mud huts. These huts were always clustered together sometimes even enclosed by continuing the outside walls between the huts. Some had windows but usually there was only a very small\n\naperture. They were built low and were rather square in shape. On top were rounded conical projections to allow I suppose of the egress of smoke. A good idea might be got of them by supposing a China tea-cup devoid of a handle to be cut in halves longitudinally. There was usually to be observed on house of stone in each village!! Usually of 2 stories and altogether different to the mud huts. The railway stations we had passed are all very good structures. Leaving Alexandria we skirted the shores of a shallow lake where some fishing is done. Net fishing is also carried on in the small irrigation drains. The road runs alongside the drains. The houses are usually\n\nflat roofed and built of a white stone in mosaic pattern. Sometimes the stones are hexagonal. The people appear to be quiet happy, contented and fairly prosperous. Some of the corn crops have been a failure. In some places the corn stalks have been cut and built into a small enclosure in which the corn cobs are placed for drying. The corn is white. In Alexandria there were trucks laden with wool but grain is the main product. In one place there were about 200 head of the \nEgyptian\n buffalo, in trucks. Tonight for tea we had one large biscuit and some bully beef. The men in the country here dress in the usual turban overall and white baggy trousers.\n","15":"\n\nOn Friday night we arrived in due course at Cairo. On leaving the train we were given a drink (very small) of cocoa \nand\n a roll of bread and a slice of cheese. This last was very good; as a matter of fact the other two were so also. We were then marched to barracks where the great majority of us slept on the stone floors of the corridor. Next morning we were up at six and were marched to the same place as the night before for another snack of cocoa bread & cheese. We were marched in single file, one man gave us a mug, another the cocoa & a third the roll & cheese. Shortly after we got on the trains and were conveyed out to camp. The camp is situated about due west of the Great Pyramid, and about ¼ of a mile from the train terminus. When we got off the train the natives passed among us trying to do business. They were selling cigarettes and chocolates. Almost every native had some alleged antiquarian coins taken from the pyramid. These of course were faked. They offered them for sale according to what they \n\nthought they cold get. Some of the natives had little statues of Ramases also alleged to have been taken from the Great Pyramid. These priceless curios were selling at 1\/- each. There was one individual (an Arab) who engaged to tell you a good fortune a very nice fortune for 1\/-. He could tell you what had passed and what had became. I saw him sell one fortune. The proceeding was somewhat as follows. The person desirous of knowing his fate held out his hand and was told to clench it. He did so tighten said the fortune teller. The hand was closed tighter still. The Arab (for such he was) studied it imperturbably for almost 5 seconds and then told the man to open it again. He then, I think, made a few crosses after which, using the index finger he touched the palm on the corners of I think an imaginary quadrangle. He went round the supposed figure about \n\nhalf a dozen times and then spoke party of the fortune. Then he went on with the of going round the imaginary figure again. Usually it was a triangle. Then came another bit of the fortune again and so on until it was all told. Roughly it was as follows. Six weeks ago he had been very sad but now he was better. He had left 3 or 4 people, one of whom loved him very much. He was shortly to rise in the world; (Going to be Lieutenant Col interjected one of the men) he was to attain a good position. He was to marry and the person who loved him to distraction was to bear for him (I forget the exact number) but anyhow one was to be a particularly fine boy and the cherub was to be the cause of mutual rejoicing and happiness. Shortly after marrying he was to start a business wherein he was, of course, to be pre-eminently successful. He left out the statue to be erected by an admiring posterity, but that little bit could be left to the imagination. All the fortunes told were I believe strangely similar. There were also donkey & \n\nboys with patient steeds for hire. These boys run behind the ambling steed and beat it in the good old fashion. I have seen both described and pictured. By the way, when a few of these donkeys are tied up near each other the united smell is decidedly unpleasant. \nThey are usually\n Part of their harness is usually adorned with gaudy tassels. There was one open air restaurant, eating house, café, or whatever you like to call it there. A woman clad in black with part of her dress thrown over her headlike a shawl, sat on the ground. In front of her and raised about a foot above the ground was a board. The menu was to people of Western customs, truly a strange one. There was a big vessel of this shape containing a quantity of cooked beans. These beans were of a purplish colour and already shooting. They were placed in an enamel basin and some oil from a tin jar was poured over them. When the diner had finished with the \n\nbasin it was thrown into a greasy dish of water where being swilled around it was ready for the satisfaction of the next appetite. There was a kind of cucumber with blackish skin. This was cut up ready for use but I did not see any purchase it. There was also a pinkish, slimy, root-like eatable which I do not know the name of. The bread was most peculiar. It consisted of round \ndisks\n discs about 6 inches in diameter and hollow inside. It was of a brownish yellow colour. I feel pretty sure it was not made of flour or not good flour at any rate. There was also a basket of little thin greenish coloured cakes made of some coarse meal. These cakes were about 2 inches in diameter. Some of these were always (so far as I saw) purchased with the bread. One of the pancakes (that’s the best name I can give them) of bread was then opened up and the small cakes placed inside them. These pancakes had\n\nthen somewhat the appearance of a tobacco pouch with a quantity of tobacco in it. The bread and the cakes were eaten together. There was also sugar there. This was in a big lump and was of a dirty grey colour. It was cut with a knife and broke off in flakes. It was not in crystals the same as our sugar. I tasted some of it and it it was sweet but there was also some foreign flavour about it. \nWhen we\n Afterwards we were formed up in a line and marched round to the camp. The camp is very new but is apparently to last some time. They are laying on water and running the train lime out there. Latrines are being put up and all necessary work is going forward. The canteen (dry) has started off very well. The same applies to the wet. You can get 8 bottles of good lemonade for 1\/-. There are forms and tables where you can dispose of your refreshments comfortably. The sand will no doubt make things somewhat less comfortable but it is clean at any rate. The camp lies\n\nin a hollow. Our tents have not yet gone up. It was not very cold however sleeping in the open. I have not yet quite got over the effects of the poisoning on the ship. I learned incidentally to-day that when the Emden was destroyed we were 100 miles away. The pyramid from the positions I have so far viewed it does not at all \nconvey\n give that impression of grandeur & isolation with which we are wont to associate it. There is a French eating house close by. A roof is erected longitudinally over half the dining room \nwhich\n and the other half is shaded by trees. It is very pleasant to sit and eat here. In fact, I am now making these notes in this identical room. The waiters are Frenchmen and Arabs. I happen to be on guard this morning near to the restaurant. But to continue, there are about 30 tables set out covered with \na\n red cloths, in which a white design is worked. This morning I observed a troop of little girls very dirty, with baskets on\n\ntheir heads. They were engaged in the pleasant occupation of picking up manure from the streets & putting it in the aforesaid baskets. They run about in the most unconcerned manner. The feat of balancing the basket apparently giving them no trouble whatever. There are some Arabs who carry a collapsible stand and a huge tray about with eatables on. When moving from one place to another then tray is carried under the arm, and the tray with the stock-in-trade on the head. Some of the Arabs squint a lot and are subject to considerable attention from the flies. Some of the Arab horses about here are very fine animals. The lorries they use here are drawn by 1 horse or mule always light build. The lorries are about 2 feet wide and take a load of anything up to about 10 bags of wheat or chaff. A great number of people have been out here to-day from\n\nthe city. Monsieur & Madame are to be observed here pretty often. The donkeys which are \nhired\n for hire are accoutred in a manner entirely different to that of a horse. The pommel of the saddle is large and rounded. The seat has no hollow. A strap passes round the front of the pommel \nand\n along the side of the animal and hangs down in & fashion at the rear. The \nharness\n clothes are usually ornamented in a tawdry fashion. There is a girth, bridle, & stirrups of course. There is a pretty fair piano at the restaurant. I am told that the hospital at the camp is run on lines entirely different to those of which we have had experience. The Arabs are mostly tall muscular men of good physique. \n","16":"\n\nThings have been going on pretty much in usual camp tradition. The last week the parades have been run differently to any we have had before. We are out for about six hours in the morning and there is also a night parade. Night\n\nparades commenced on Thursday night. The long morning parades commenced on Monday last. We were marched out in full marching order over the sand for something like two miles. The Major very lightly equipped led the way. The pace was, to say the leats, hot. At the end of the march we had to climb a gravelly slope. Here the men simply melted away. Think that at most not more than half of our company kept in place to the top of the hill. Then the Major turned around and with a very grim smile on his face waited for us to come up. It was a very severe test. We did but little for the rest of the morning.\n\nThe next day and for the days \nthat\n following the marches were made steadily. We have the usual work: extended order, squad drill &c. It seems that we are to go the front in a few month’s time. A rumour is also going round that we may have to go to Suez. The mists have been extremely heavy for the last three nights. One morning \nthe Great Pyramid present\n I observed a very striking phenomenon. A mist had gathered about the Great Pyramid during the night. With morning it began to drift westward \nas the sun began to pierce through the mist\n When the sun came up the mist glowed a light\n\ncrimson colour and the spectacle was presented as of some liquid fire drifting up and over the Pyramid and floating away to the west. The camp is being extended and slowly improved in different ways. Tents have been put up, although still not to the regulation number. These tents are somewhat different to those used in Aus. There is only a fly and the wall of the tent is higher. The canteen here is pretty good. One can buy a great number of different things. I went to Cairo one night. Cairo does not (so they tell me) begin to get properly lively until about 11 p.m. If you stand for a moment at a street corner you are immediately surrounded by a swarm literally a swarm of youngsters. Clamourous to clean your boots. They carry a sort of abridged boot cleaning apparatus, and are as pervasive as flies round a honey pot. They will tak your foot and attempt to set it on the stand, or start to brush them when you stand. The cafes here are often open air. Prices are reasonable but one wants to beware of spirits. We went to one place where there was a dais, on which was installed an orchestra. You drank your cocoa (very strong) out of \n\na cup somewhat larger than an ordinary thimble. Two pretty girls (one very much so) served out the goods and gave nice smiles gratis. There was a rather striking looking and dashing young Col Sergt there who imbibed not wisely but too well. He seized a chair and offered it his arm. Apparently the chair refused for \nthe\n he expostulated, shrugged his shoulders, protested & explained in dumb show. The obdurate article was apparently at last won over and graciously permitted itself to be waltzed and ragtimed across the room. He also danced with the two pretty girls and drew much applause. Apparently he was in favour for the prettiest girl obstinately refused to be partner with a less lucky aspirant. At 11.30 the Red Caps came in and kicked us all out. Conveyances for hire here are . They are usually rubber tyred. It is 7 miles out to the camp and it cost only 4 shillings to take 5 of us out from Cairo. Cairo is licentious in the extreme. In fact, this, which\n\nis usually regarded by the European as an aspect of immorality forms part of the religion here. The other Sunday Vic Brown and I took a walk over to the plantation lying along the river and north of the camp. None of the natives over there can speak English. There are a number of ducks in marshy places there. Cotton and cereals are grown. There was no roads as we understand it but just a defined track through the sand. Some of the natives regarded us pleasantly enough but others looked at us in a surly questioning manner. The houses (isolated ones) were built of stone cemented in mosaic fashion. They were flat roofed and \nmore\n and of the usual rather monotonous looking type. The land is very carefully irrigated and tended. In places the soil is raised a few inches so as to enclose squares with nets something over a yard in length. At one place there were sheep goats and the hump-backed buffalo. These cattle have a very small . The beasts of burden are the donkeys and cattle. Perhaps I might have also included some of the women in the last category as I observed some \n\nsome carrying pretty large loads in baskets on their heads. The strength of these little donkeys is marvellous. They will carry a decent load and on top of that a large man and that is in quick time too. At last we reached a village, but when we got there one of the natives waved us back. Two children fled at the sight of us. The village was \nconstru\n composed of the usual mud huts I have elsewhere described. It is nice and our cool walking in the shadow of the palms which are cultivated all along there. Coming back one of the natives gave us two small cakes. I tasted one and it was of a strange flavour. \nreally an accid\n Aciduous, yet sweet and not altogether unpleasant. This native strange to say had a moustache so light in colour as to admit of being designated \"ginger\". He was a very pleasant sort of individual. I have noticed a trait peculiar to these people. When animated and pleased the head is thrown backwards in a slanting fashion. The motion is a graceful one. The Egyptian notion of music is peculiar and the singing is reminiscent of a lullaby.\n\nThey break out at any old time or place. At the excavations one sings a tune and they all then they all join in and heave at the same time. Then another line and another heave and so they get through their work. The Arabs can walk quickly over the sand but the gait is an awkward one. \n","17":"\n","18":" and the New Year have both come and gone. A new movement has been inaugurated. We are now formed into double companies. We have the Colonel and Major. Then come\ns\n 4 majors. Each of these officers is in charge of a coy. A coy consists of about 240 men. Under each major comes the second-in-command. The coy is divided into 4 platoons each equal to an old half coy. Each platoon is commanded by a lieutenant. Each coy has a sergeant major who stands in the same relation to the new coy that the col-sergeant stood to the old. The platoons are divided each into sections. Each\n\nplatoon has a platoon sergeant. The section\ns are\n is equal to the old squad & \neach\n is in command of a non-com. There was a good deal of drunkenness at Xmas even some of the guard were drunk. On Xmas day we had meat, duck, potatoes and cabbage. Soft drinks also were provided. The Aus troops have been earning a very bad name for themselves. Without doubt their carrying on are a disgrace. The natives are insulted and brow beaten. Their animals misused. There is a certain type of soldier amongst the Aussies(not by any means necessarily an Australian) who appears to think that he is most a man when he makes the air reek with profanity, abuses the passers by, ill uses those weaker than himself. It is a favourite pastime of these amiable individuals to upset the goods of itinerant vendors in the streets. The spectacle of such a ill-used in this manner on weak and defenceless old man is as pitiable as it is deserving of punishment. The perpetrators of these \n\noutrages unfortunately like the limelight and the main thoroughfares are usually the scenes of such degrading sights. These remarks apply to only a very small minority. We have now got mess houses. These are constructed of pine board throughout, including the roof. The floor, however is of sand. The tables are of pine. They are well lit up. A few days ago we were received by Sir Geo Reid. His speech was unfortunately inaudible or only partly audible to the greater proportion of the troops. He said some things that might well have been taken to heart. I had as close a look at him as I could as this was the first occasion on which I had seen him. His most striking characteristic appeared to me to be his humorous and twinkling eye. His obesity is extremely pronounced and he walked but slowly. His complexion is florid. I have not been to Cairo much. I understand that our parades are to last until 3 o’clock\n\nin future. The leave we get is poor enough as it is and this will not serve to make things any better. Heavy punishment is being dealt out to offenders and in some cases it is well deserved. Those who go raising Cain in Cairo can do with all they can get.\n\nGot this song from a friend\n\nTill the sands of the desert grow cold\n\nTill the infinite numbers are told\n\nGod gave thou to me and mine thou shalt be\n\nFor ever, to have and to hold.\n\nTill the story of judgement is told\n\nTill the mystery of heaven unfold\n\nI’ll turn \nunto\n love to thee my shrine thou shalt be \n\nTill the sands of the desert grow cold\n\nThe hot winds that come to thee\n\nOer desert sands all blow from thee\n\nI bid them to tell thee that I love thee\n\nSpeeding my soul to thee\n\nHot sands burning, fire my veins with passion bold\n\nLove I love thee, till desert sands grow cold\n\nLove me! I’ll love thee\n\nThe desert a burning sea\n\nA barrier stands ‘tween thee and me\n\nAll\n The love fast as light hasten to thee\n\nQuenching my thirst in the Noon suns finds me, far beyond the caravan\n\nDeath there warns me how vain is the strength of man\n\nLove me! I’ll love thee.\n\nThe fiery reservoir that rides the vault\n\nA spendthrift spending ever yet unspent\n\nUpon this earth man’s floating tenement\n\nWith life deriving showers makes his assault\n\nWith life imbuing light makes his assault\n\nTransmutating With the properties \nof transmutation charged\n imbued\n\nHe spreads the coloured galaxy below\n\nThe dull hued earth crops forth in \ngoodly\n painted show\n\nFrom bankrupts nought to beauty’s wealth enlarged\n\nAnd floral vestments clothe the barren nude.\n\nPotential powers to culmination adoring\n\nAnd multiplying increase to bounty breaks\n\nObservance hides the skeletons of death\n\nAdmirer’s profits further profit’s \n\nAtones remote from sight world aspects change\n","19":" Mena Camp\n\nIt is now considerably over 2 months since I made any entries. In the interim training has been going on in the usual fashion. We have got thoroughly used to marching over the sand. One cannot march nearly so far as on a good road, but the hard road, after training has been constructed on the sand for some weeks, blisters the feet \nand\n tires the muscles and jars the joints. After a 15 or 16 mile march over the asphalt one day a great number were unable to go out the day following. We went out a week or so ago to carry out an attack and bivouac. We left camp about 4.30 and began the attack about 6 p.m. Our coy were in the support and did little firing. We had tea about 7.30 and mostly did waiting after that. Eventually and by slow stages we retired. We bivouacked about 12:30 and were up again an hour before dawn. Distant firing showed that the battle was not all over but we did not participate; and after waiting a couple of hours marched back to camp. We had only our overcoats and rubber sheets. It was pretty cold during the night and twice I got up and walked around\n\nto restore my circulation activity. However, slept very well considering. There was a constant stream of men on the peregrinating racket. The sixpence a day allowance, like most things, starts well and by slow stages works itself into the category of unsatisfactory. This morning we got 1 ½ eggs per man; we have missed butter a couple of times lately (this notwithstanding the fact that the coy was lately using a quantity of Aus Gift butter); bread is not always as plentiful as it might be; and the very syrup is of inferior quality. Sometimes we got 5 small sardines between 2 men. At intervals more or less regular, according to circumstances, we get porridge or rice with raisins. 4 tins of condensed milk are thought fit to supply a sufficient quantity of lactility to modify the opprobrious liquid supplied to us under the name of tea. The writer can recall glorious times when we revelled amidst unlimited quantities of tinned fish, serious jam and 4 or 5 eggs at one time. Coming to the regimental \nallow\n rations we have bread (very hard, very stale, and very heavy) and made of exceedingly inferior flour. Then there is the inedible \"stoo\" which would baffle an analytical chemist. Whenever it is exceptionally \n\noutrageous a quantity of curry is put in to palliate our palates lest be done. When the food is brought in half the men instantly become temporarily insane. The dixies are besieged, the passages between the tables blocked up, \nand\n there is a wild medley of waving arms and overflowing tins and basins, excited individuals spill hot tea & soup over other excited people, the orderlies bustle drag and ladle, the ord corporal roars at everybody & is taken notice of by nobody, and profanity, irritation, and general cussedness prevails generally for about 5 minutes. The others sit at their tables & saying little, think much. These lot habitually congratulate themselves that they are not as the other people &c &c. then there is the 6 ration to be drawn. This operation brings home forcibly the truth of that grand old saying which is to the effect that all things come to those who wait. He who is unlucky knows to find himself at the end of the line also finds time to realise the truth. We have been having a lot of trench digging lately. This is a grand pastime. Its one supreme advantage (in the sand) is that it is an occupation that never gives out. As long as you are content to throw it out \n\nit is quite willing to fall back in again. We struck a job like this the other day. We fell to work in all the flush and pride of our strength and lightly and gaily tossed the sand aside. When engaged in this exhilarating occupation it is well to remember that every time you lift a spadeful of this elemental combinations half of it falls off again. This is rather dampening to the ardour born of novelty but it saves the wear & tear of pernicious reactions. Well, as said we started off with much unnecessary flourishing and wide sweeping of arms and a beautiful sight it was to see the sand shooting out like smoke from a Jack Johnson. Sometimes a well meant but somewhat inaccurately judged shovelful would be deposited down the back of some toiling neighbour. But little accidents like these were overlooked, such was the prevalence of good spirits. Well we got down a foot or so and by that time were beginning to find some benefit in straightening up every now & again to admire the scenery or watch the progress of our neighbour. It was really wonderful too observe how scientific & observing many of us became. Stones that before had seemed quite commonplace and\n\nuninteresting, suddenly and most unaccountably possessed a fascination and interest that before we would have thought impossible. It is surprising how much discussion and argument we could raise on points whose existence we before had not the slightest cognisance. We reverted to our happy old schooldays and \n\n Ruins east of second pyramid","20":" \n\nfound that we could remember things that surprised the best of us. We waxed quite warm it times. I would never before had thought it possible that so many conflicting ideas and theories could have been brought to the solution of the origin and history of these pebbles of the desert. Some of us too, \nwere\n found that we \n\n East of small pyramid looking to quarry West of second pyramid Sunday 14\/3\/15\n\n1 stone near second pyramid measures app 23x62ft not including another piece running at right angles to the main block. Another 24x45 app.\n\nWe had never before definitely settled the age and the height of the pyramids. It became of vital importance to us to know who had built them and why how and when. The mathematicians became involved in abstruse mental calculations to decide whether that pyramid really covered 13 acres of ground or not. Many notable original \nand\n hypotheses were put forward. One gentleman found the explanation of the possibility of their construction in the fact that at the time they \n\nwere built gravitation had less pull. Our vivid imaginations gave us startling pictures of that buoyant period. Men walked up the sides carrying a ton block like a portmanteau. Others hoisted 20x8ft pieces on their shoulders & walked with it as though it were a bag of wheat. Also, it wouldn’t matter much in those days if you fell. A man in a hurry would simply \nfling himself forward and when in these dull times slowly\n take 3 bounds in order to come from the top of the pyramid where in these dull times we \nlabour\n progress labouredly for 10\n\nminutes. However to come back to the trenches. Having excavated a foot or so we would suddenly find that the \ntrenc\n side would not hold and ½ cwt of sand would suddenly dislodge itself. \nand we would Excavating\n Extrication ourselves and swearing mildly at the sand trickling into our boots we would resume operations. It was wonderful how \noften\n long it took to get rid of that sand and how much seemed to be constantly trickling down. Our hair was getting gritty with the dust, it stopped \n\nup our olfactory passages and settled in our acoustic organs \nlike sno\n in duffs. we were just beginning to feel a bit fed up of the game when came the welcome order for the next relief to fall in. Then we marched out and lay down on the sand. I fell into a deep and dreamy reverie. Never mind about a close analysis of all this. It seemed to me that I had only been revering for about 5 \nmonths\n minutes when 1st relief fall in sounded with brutal and convincing \nstar\n clearness. I sat up. Could it be. Yes, it was; the others were already half way down to the trenches and the sergeant hurried my lagging footsteps. Somehow there seemed to be a blank or a void somewhere. I felt injured and as though I had been done out of something. When I got into the trench it seemed about 3 inches lower and more sand had fallen in. I sat disconsolately \non the\n against the side to review the situation and immediately my feet became immersed. I stood up again and the force of the \nmovement\n impetus brought down another avalanche and left a big in the side of the trench. Then I \n\nset to work feeling as though I deserved a DSM. and laboured steadily for about 5 minutes. At the end of that time I straightened up in the proud satisfaction of having the trench cleared once more. Then I continued to delve. The perspiration trickled down my face making little channels in the dust. I developed a thirst. The thought of the canteen was delectable in anticipation but absolutely painful by contrast with the moment. Well we marched out and fell in again alternately so often that I lost count. The sides continued to fall in and when we got out and shifted\n\nback the sand we had thrown out it fell in more than ever. Eventually we had to leave it When we had got down about 3 feet, \nThe only there\n one of the things we did not try to calculate was the quantity of sand that \n\nwe had thrown out. Coming back to camp a dust storm flew straight at us. I put my head down, covered my eyes with my hat, and the last thing I remember until we got to camp was watching the feet of the \n\n"}}