{"Document Name":{"0":"Diary_0486","1":"Diary_0486","2":"Diary_0486","3":"Diary_0486","4":"Diary_0486","5":"Diary_0486","6":"Diary_0486","7":"Diary_0486","8":"Diary_0486","9":"Diary_0486","10":"Diary_0486","11":"Diary_0486","12":"Diary_0486","13":"Diary_0486","14":"Diary_0486","15":"Diary_0486","16":"Diary_0486","17":"Diary_0486","18":"Diary_0486","19":"Diary_0486","20":"Diary_0486","21":"Diary_0486","22":"Diary_0486","23":"Diary_0486","24":"Diary_0486","25":"Diary_0486","26":"Diary_0486","27":"Diary_0486","28":"Diary_0486","29":"Diary_0486","30":"Diary_0486","31":"Diary_0486","32":"Diary_0486","33":"Diary_0486","34":"Diary_0486","35":"Diary_0486","36":"Diary_0486","37":"Diary_0486","38":"Diary_0486","39":"Diary_0486","40":"Diary_0486","41":"Diary_0486","42":"Diary_0486","43":"Diary_0486","44":"Diary_0486","45":"Diary_0486","46":"Diary_0486","47":"Diary_0486","48":"Diary_0486","49":"Diary_0486","50":"Diary_0486","51":"Diary_0486","52":"Diary_0486","53":"Diary_0486","54":"Diary_0486","55":"Diary_0486","56":"Diary_0486","57":"Diary_0486","58":"Diary_0486","59":"Diary_0486","60":"Diary_0486","61":"Diary_0486","62":"Diary_0486","63":"Diary_0486","64":"Diary_0486","65":"Diary_0486","66":"Diary_0486","67":"Diary_0486","68":"Diary_0486","69":"Diary_0486","70":"Diary_0486"},"Date":{"0":"unknown","1":1105.0,"2":1106.0,"3":1107.0,"4":1108.0,"5":1109.0,"6":1110.0,"7":1111.0,"8":1112.0,"9":1113.0,"10":1114.0,"11":1115.0,"12":1116.0,"13":1117.0,"14":1118.0,"15":1119.0,"16":1120.0,"17":1121.0,"18":1122.0,"19":1123.0,"20":1124.0,"21":1125.0,"22":1126.0,"23":1127.0,"24":1128.0,"25":1129.0,"26":1130.0,"27":1131.0,"28":1132.0,"29":1133.0,"30":1134.0,"31":1135.0,"32":1136.0,"33":1137.0,"34":1138.0,"35":1139.0,"36":1140.0,"37":1141.0,"38":1142.0,"39":1143.0,"40":1144.0,"41":1145.0,"42":1146.0,"43":1147.0,"44":1148.0,"45":1149.0,"46":1150.0,"47":1151.0,"48":1152.0,"49":1153.0,"50":1154.0,"51":1155.0,"52":1156.0,"53":1157.0,"54":1158.0,"55":1159.0,"56":1160.0,"57":1161.0,"58":1162.0,"59":1163.0,"60":1164.0,"61":1165.0,"62":1166.0,"63":1167.0,"64":1168.0,"65":1169.0,"66":1170.0,"67":1171.0,"68":1172.0,"69":1173.0,"70":1174.0},"Entry":{"0":"\n\n \n\nFricourt\n\n","1":" A cold bleak morning with lowering clouds. Left on horseback at 10.30 for the Chateau rather a misnomer for in the centre of muddy and splintered wood is a small collection of huts and dugouts which mark the site of the old building. There at Bde H.Q. saw the Brig. who was unwell but happy in the gazetting of his tempy full Colonelcy. Struck out for Montauban getting pretty wet. Fortunately a steel hat does not readily lose its shape in rain and an Aquascutum coat also keeps out wet. The road commenced to get crowded with traffic most 4th Div on their way up and passage was necessarily slow. A wonderful sight this throng of traffic greater than many a large city with traffic inspectors and policemen keeping it under control. Everywhere the old Australian slouch hat, proud emblem of insolent independence and typifying the care free propensities of our army. Cursing and flogging the drivers keep their mules straining at collar and trace.\n\n \n\nFricourt \n\n21\/12\/16 From the other direction came a dribbling straggle of poor exhausted devils from the trenches. A sight that made one’s heart bleed. A crucixion of the flesh in real earnest and such as would do some people at home the world of good to see. With pinched faces, thin stubbly beards and mud covered clothes they lurch along wearily, dragging one foot after the other, to their camp. Occasionally one falls and sits down in mud or wet. Some feet some of them have – one chap was limping along with a sandbag wrapped round a foot from which he had lost the boot. And so we passed hundreds of them all \"fed-up\" but only wanting a little comfort and hot food to put new life into them. At Mametz we passed a tangled rubbish heap nearly grown over with grass. It bore the sign board \"Mametz Church\" rather ironic as the ground has been swept by shell fire until it is as bare as a board. Rode through Montauban\n\n \n\nFricourt, Mametz, Wood \n\n21\/12\/16 past Bernafaye and Trones Wood until we found ourselves right among Tommies only and commenced to strike French dumps and noticeboards so we concluded we had come too far and turned back. Struck a \"Town Major\" in a German dugout many feet below ground a decent English chap who directed us aright. The back round Bernafaye Corner past a big A.M.C in an old system of trenches and saw many chaps being carried to ambulances with feet swathed in bandages. Turned in on to some duckboards and found the 21st in huts and reconnoitred there. The ground around pitted very much with shell holes but Dame Nature is putting her green mantle over all to cover the scars. Returned the same way and reached camp after dark. A few big shells went hurtling over and burst with loud crash. Odds and ends to fix up during the evening. Dr. roused out to nosebleed & crook in guts!!!\n\n \n\nE Camp Bernafaye Wood & Needle Tr \n","2":" Awakened early and roused up the doctor for being late on his sick parade. No good keeping sick men about in the cold. Moved off at 11.45 and had a good run through in spite of heavy traffic. The heavy early morning rain had made the roads slushy and gangs of men were busy with brooms and scrapers cleaning them. Thousands of vehicles and horses coming and going in ceaseless chains. Reached the huts as yesterday and put the men into them ploughing through a sea of mud up to the knees in places. Met Pedler and had a short yarn and then set out for Needle Trench walking along duckboards all the way. Passed an old factory – a mass of tangled iron and some huge old boilers. Noticed a German grave with a cross painted on it and afterwards saw a German prisoner being marched down under guard wearing his big steel helmet. Plugged along over barren shell pitted\n\n \n\n\"E\" Camp Needle Trench\n\n22\/12\/16 A gun flash showed gun positions now and then and big shells were screaming overhead. Shrapnel puffs flecked the sky. The duckboards wound sinuously over the rises and at last we came to a series of trenches in which I found a dugout containing Col. Forbes from whom I gleaned some particulars. 2 men killed there today. Returned in the dark and feet very tired and sorefooted as boots were ill fitting and loose. We then took a wrong turning and were quite hopelessly lost for a time but at length came into camp and had a good tea and some liquid nourishment. Some had got parcels so the mess benefited to that extent. Issued operation and other orders during the evening and other orders during the evening and had a talk with Q.M. What a host of details one has to think of! The little \"Pard\" quite excited over the soup kitchen he is going to run. Some big shells going over. Went outside and got hopelessly bogged in the mud.\n\n \n","3":" E Camp & Needle Trench\n\nA wet gusty morning which later cleared up somewhat. Completed arrangements for move into the supports this afternoon. About 200 men will be remaining behind. A rather tragic thing happened this morning. King our M.G.O. had a brother in the 58th and had received no word of any casualty to him. This morning I sent King to the cookhouse to arrange our rations. Three wooden crosses were standing outside. One of these bore his brother’s name. a great shock to King. Mud very bad – am putting on sandbag gaiters. Trench boots make feet too sore so am sticking to the ankle ones. We leave our valises here and can say goodbye to comfort from now onwards. The men carry up 48 hours rations on them and also draw 2 bombs each. Am trying to carefully select the men for English leave but much heartburning results, I know. Noticed a story without words. A grave on which was a steel helmet with a 2 inch hole in it & a 77 mm case & nosecap.\n\n \n\nNeedle Trench\n\n23\/12\/16 Left E Camp at 1.30 p.m. and proceeded to Bde HQ there seeing Colonel Smith and Brigade Major both of whom seemed unwell. After a few minutes there pushed on with a runner along the duckboard. Half a gale was blowing and one was \"canted\" sideways by it. The scene was desolate in the extreme – a brown clay waste speckled with shell holes with scattered men and packhorses moving over it. Passed an old tank covered with screening and noticed a fair number of gumboots &c dumped alongside the path. Shelling was in progress on other parts of the line than ours and black puffs of shrapnel and occasional vivid dots of flame picked out the shell bursts. Reached Needle Tr. And took over from the C.O. of 59th Battn. and then started to look round for accommodation for the \nother\n people coming in tomorrow night. The men will land in quite wretched trenches all full of mud and water and they then have to set to work to make themselves\n\n \n\nNeedle Tr:\n\n23\/12\/16 In the dark they commenced to arrive and we fed them in through the mud and water. Nearly all new men there were very few who had ever been in trenches before. A quiet night. Fatigue parties passed with material for higher up and we sent some from here. Saw Forbes – he has never been any further forward than here but has sent Duggan on ahead. This is a large deep German dugout – unfortunately dripping water tonight and is crowded with batmen, sigs and A.M.C. All the officers turned in and stood by the ‘phone for the first part of the night – a very long and cold evening. Only the sound of heavy breathing is heard – flickering candles gutter on the walls. From outside comes a low muffle of guns. All of us are filthy I am mud up to the waist and wear a cap – balaclava like. Alf the Sea Lion. Filthy but happy. We eat army biscuit and pork and beans. Turned in beside Dooley after midnight and slept soundly\n\n \n\nNeedle Trench\n","4":" Early up and round. Only a few scattered shells. A fine day and all the fellows working like bees with timber and iron to get comfortable. By 10 a.m. most of them were in fairly good \"bivvies\" and quite at home. Under the parapet of some rear trenches noticed about 6 dead men all rotting in the mud in a heap – whether our own or the Germans it was impossible to say. Ordered them to be covered over with mud and a cross put up. Although there was a great deal of movement there was no shelling. Stayed below in dugout most of the afternoon and had all the officers seeing to their mens feet – rubbing and seeing them chafed. Colonel Smith to 5th Bde today and Forbes in his place. Went over and saw Duggan in the evening and found him 50 feet underground and eat some of his Xmas cake. Fogarty Joe’s wedding day today. Inf. came in that a relief was suspected so we switched the artillery on and heavily shelld Fritz’s roads & approaches. A good bombardment saw Xmas Eve out.\n\n \n\nNeedle Tr. & Firing Line \n","5":" Awakened at 2 a.m. and got up and issued orders for the shift tonight. Only 50 yards for H.Q. to go – just across the duckboards there. The guns put up a heavy strafe about midnight, quite like old times, but the enemy’s response was poor. Rations and hot tea and other foods are a great source of trouble. In the firing line we have 80 men and three officers doing nothing but superintend the coming up of the stuff and its issue. About 3 pm I crossed over & relieved Duggan – a much better dugout very deep and dry and comfortable. Much telephoning about guides &c &c. Our men left at 4 p.m. and started to file up in the dark. Their rations also started to arrive and the special carriers took charge of them. Major Main is in charge of the forward headquarters. McGregor & two artillery officers messed with us. The former had received some parcels so we dined well. At 7.30 relief was proceeding well but one party got quite lost. Dog tired tonight but have to stay up all night.\n\n \n","6":" Zenith, Spectrum, & Gusty Trenches\n\nA very busy night almost as many telephones as an Exchange. Our right party for strong post got lost and we had no tidings of them at all until about ¼ to 1 when they reported all correct. Awful mud and conditions. One poor devil lost his boots and was wandering about in bare feet. Gusty being too crowded we shifted a few back to Millars Son. After getting in, the ration men had to go back and cart their food up and orders also arrived for a patrol to go out. Arranged all this by telephone and heaved a great sigh of relief when at last the welcome message arrived \"Relief complete\". Sitting in this deep dugout with 35 feet of earth on top and a staff of runners and signallers I control all this area. The R.S.M. leaves in the morning with VD contracted from a mademoiselle in Flesselles. The Doctor is bad with bronchitis and says he thinks he is getting T.B. This absolutely the worst Xmas in my life so far and we shall be up here again on New Years Day.\n\n \n\nFiring Line (N.34 b 9.9 – N.28 b.3.3)\n\n26\/12\/16 Long steep stairs have to be gone up to reach the outer regions and having occasion to go up I turned turtle in the mud and sprawled full length. Just about a climax. About 13 wounded men passed through us today. Frenger’s head has been tender ever since he got a bullet through it and today on the way up he relapsed into delirium and had to be laid up in a dugout. Rations short in some respects – more worry there. \n\nR.S. rang up referring to a message he got this morning. Despite his reprovals some particulars later requested by the B.M. showed representations had borne some fruit. Find the steel helmet saves the head from some nasty knocks when one is groping round stairs and the low passages ways of these rabbit warrens. The head simply bounces off all the beams it comes into contact with and the rubber shock absorbers take all the concussion. The village of Les Boeufs just neighbouring here is the usual well strafed mass of ruins & shattered trees\n\n \n\nFiring Line\n\n26\/12\/16 Awoke Cawthorn at 3 am and having installed him at the telephone turned in for sleep being just about all out and everyone commenting on my ghastly ill looks. Very cheering: Feel any how with sore throat and heavy cold with headache and stayed in all the rest of the day until 4 p.m. but subjected to frequent interruptions in the way of messages, callers &c. Two aeroplanes brought down in flames about 10 a.m. Conditions bad. One poor man drifted in. he had been bogged up to the shoulders and his party had to leave him there and push on. His greatcoat was a solid mass of mud and pockets full. He was a man who had never been in trenches before and true to the instinct of a new hand he had struggled 2 miles \nback\n instead of pushing \non\n 70 yards! After a rest and some foot massage the Dr. ordered him up again. About 4 men missing – one later turned up minus boots away to the left. The Dr. very unwell today temp. 100 deg.\n\n \n\nFiring Line Needle Tr\n\n26\/12\/16 Felt feverish but found my own temp. sub-normal. Rodda returned today. Archer coming up last night fell and wrenched his knee. No luck with some of these new chaps – the old men are always on their posts. Some backsheese stuff arrived from Comforts Fund and ginger among other things made quite an agreeable addition to menu. After much worry and wandering in mud and darkness, \"all correct\" reports reached me re rations. Grow more and more convinced that the keeping of food hot for men by means of vacuum arrangements is not a success. Sending up tommy cookers and alcohol for boiling up cold stuff proves most satisfactory. The men who have to do any movement through the mud finish up dead beat after a few trips. Maj Smith over in the evening and got all details for his tour. The ‘phones are good and enable good touch to be maintained with everyone. Have the receiver in hand more often than out. Small table very crowded\n\n \n\nFiring Line (Needle Tr) \n\n26\/12\/16 covered with papers and books whisky & mugs, cigarette tins & tobacco knives pencils candles electric torches & enough rubbish to drive a good housewife mad. Artillery liason officer reported and as they put a few shells into us I asked for retaliation and our guns sent over beaucoup. On the left our artillery put up a four hours concentrated bombardment –quite a good shoot. Only normal shelling round us. Yarned during evening in intervals of telephoning and fixing up ration difficulties, with Rodda & McGregor. Talk turned on very few topics as War is our be-all and end all and absence so long from other interests leads all conversation into that of fights, past & present, Gallipoli, trenches, Pozieres, mud, wounds death trench mortars, officers men, shells, our own & Fritzs &c. &c. Toujours la guerre! They all turned in fairly early and I took up the night watch and sat up alone close to signal buzzers. A dark night flares not over frequent.\n\n \n\nFiring Line (Needle Tr.)\n","7":" Played patience in the small hours of the morning and after many vain games found the pack was one card short. The intelligence summaries were slow in coming to hand and disclosed nothing of importance. 2 Huns gave themselves up to the Shropshires on our right. Our snipers killed a man in front of Zenith and a Lewis caught a party at Finch and put a magazine into them. Groans and cries were heard which died away after a few minutes. Our boys sniped hard and more groaning aloud followed. Slept during the morning but had some visitors in the shape of Col. Forbes, Col. Bridges G.S.O.1 and Colonel Cary R.E. and we decided to shift this H.Q. further ahead when chance arises. A man wounded today by one of our own shells falling short and it was not the only one. Put in a strong report about it. Some heavy shelling round here this afternoon. Word came that we could send 11 men on leave and I decided to send men right from the desolation of the front\n\n \n\nNeedle Tr (Firing Line)\n\n27\/12\/16 shell holes. They arrived at all hours filthy and weary with skin & clothes one mass of mud but report everyone quite cheery but longing for their relief. All agog these fellows at the idea of going over to London. The seat of the lats. here is certainly the most curious I have ever seen used for a similar purpose. It is a grave cross of some size in memory of a Pte. Of the R.E.s and resting on its sandbags its base makes quite a good seat. Our M.O. Sanbrook evacuated today and Fraser came in his place. A quiet evening with any amount of clerical work and tremendous lot of telephoning. Next time come in our carrying system must be altered. At present it means tired men from firing line carrying their own stuff and the result is that it simply does not reach there. Propose another relay further up who will carry the stuff right on. Everyone is suffering with a sore throat that makes one want to retch at every cough. The South of France seems a recuperating ground for this and for bronchitis. Returned officers notice the mens bad language very much for the first few days\n\n \n\n28\/12\/16 Needle Tr. & Firing Line\n\nA quiet night. Tried to play a few games of patience to while away the time but, being desperately tired, found myself nodding and cards slipped from fingers and fell all over the floor. Turned Cawthorne out at 2 am and went into his bunk and was awakened for the intelligence reports. Our patrols were active but otherwise things were quiet. A little artillery officer named Brown slept here all night. A nice quiet little good looking subaltern. He left the dugout & a piece of shell cut through his steel helmet like paper and blew his brains out. The body was put up on the parapet out of the way Feeling very ill. I stayed in bed until 2 pm. Relief by 23rd commenced 5 p.m and was completed fairly satisfactorily. All coming out in a dreadful condition but we have hot coffee in food containers waiting for them. Slight barrages kept up. Men vary. Our old chaps are unsurpassed but many of the new ones are chickenhearted & inclined to sit down and cry. The old boys plug on. Spiller came in shell shocked and exhausted. He had been blown up and was\n\n \n","8":" Needle Tr.\n\ncrying. Put him to bed and fed him up and he improved very much. Dooley was nearly right out to it poor old chap. Told him that he had been awarded the Military Cross, poured a rum into him, fed him and then stuck him in a bunk. Bazeley was as usual still going strong and sunk down into sleep at once. I slept with him and we kept each other warm Some of the 23rd lost their waders going in and went on with bare feet leaving their other boots behind. Relief was completed at 9 pm. Our Army slang is becoming Frenchified and Arabic is falling into disuse. Instead of ‘Eggere’ everyone now says \"toute de suite\" The mud in places is, without a lie, up to the waist and instances have occurred of men going up to their ears in it. Old Adams of \"C\" Co. was remarking how the new men lack guts compared with the old boys. Of course the latter are the residue after an extensive process of natural selection. Adams tried to pull one passively helpless chap on by means of his rifle when the chap let go and Adams went head over ears into a shell hole full of water.\n\n \n","9":" Needle Tr\n\nSlept in until late being still unwell. The Dr. had a sick parade and about 20 cases of trench feet were evacuated. One chap who had got lost and fallen into a shell hole lay there all one day too weak to get out. When he was examined this morning we found he had awful feet which had gone gangrenous being dead in patches. He will probably lose one foot by amputation or at least have the dead patches cut out of them Most of the cases will take about 3 weeks in hospital before they recover. The Huns are putting in some strafe round here this morning. Relief complete at 7 pm. Returned to the huts uneventfully but it was a long journey and we were exceedingly thankful for the cocoa that was on issue at the padre’s soup kitchen. Going home all plugged along with good heart through the dark. Duckboards are a great boon but awfully monotonous. No shelling. At the huts the officers there had a good dinner for us and most had washed and cleaned themselves up. Davis to England tomorrow – Elmige returning.\n\n \n\n\"B\" Camp Thoneswood\n","10":" Stayed abed until late and then got on to a great deal of clerical work. Both Pedler and Slater have reported for duty A cold day. The men resting in their huts surrounded with their Xmas. parcels like children with their toys. Filthy lousy bearded individuals they all are. Baths were to have been available but the boiler blew out and upset all plans. Two men passed on their way back from the front trenches and were just about all out to it with fatigue limping along with bad feet and wearing their full battle order. About 2.30 our heavies plastered some positions and their retaliation led to a few stretchers coming down to our Dr. (Fraser). In U-shaped huts here and very comfortable they are too. Men are rather crowded but appreciate the huts. After being up in the front line system. Big shells have been whistling fairly close to this camp today but fortunately the groups are well scattered and do not offer any very large mark\n\n \n","11":" \"B\" Camp & Thistle Tr\n\nAt night 30\/12 orders came to reconnoitre a new piece of line and myself and all Coy Comdrs had to be a BHQ at 9 am. just when we were promising ourselves a spell of a few days and a little rest. Saw the Brigadier and then set off guided by two Tommy guides who seemed to plug along interminably in front. We went along a broad road past many heavy guns just like Delville Wood. and then took to duckboards across the usual dirty country. After many trials we reached Ozone Alley where a good strafing was in progress and had some narrow shaves but they did not seem able to hit us at all. Our guns put up a good bombardment on them and we watched the shells bursting thick with a good deal of interest. Entering this sap we found good duckboards part of the way and then troubles started and we sank past the thighs at each step and soon had feet and socks oozing mud and water at each step. Reached a filthy tumble down collection of dugouts near a sunken road and dived down many steps to a deep dugout – Batt HQ. The coy. commanders went on to the line\n\n \n\nThistle TQ\n\n31\/12\/16 The officers of the 6th Dorsets were of the usual type and most of them preserved their usual spick and span appearance in spite of the rough elements. Took over full particulars of the front as far as it could be ascertained (& on some things these people \nare\n vague) and then had a frugal meal of biscuit and meat which they kindly asked us to. Their men march in with 48 hours rations and get out at the end of that time so the question of ration carrying does not worry them much. They seem to just sit down in the line and pray for relief. adopting quite a passive attitude. Left here about 1.30 and set off for the rear again getting well shelled but he was unable to hit us. We went along the front of Cow Tr. And his shells kept going about 50 yards over the back. Reaching the duckboards we set out towards home passing through 2 barrages. Some very heavy stuff was going over towards the wood in rear of Les Boeufs. Called in at Brigade and then had a drink at the Padre’s soup kitchen. A big shell landed a few yards off here and\n\n \n\n31\/12\/16 Thistle Tr\n\ncovered us with dirt. Reached home tired and heard some Orderly Room cases and then had a conference of coy commanders and went to a great lot of worry over details &on.\n","12":" New Year’s Day. Pottered round the huts all the morning & issued orders ready for move into support tonight. Pedler came along and got his orders. At 5 pm set out for Needle and relieved Maj. Smith (23 Bn.) there getting all in fairly early. Much too crowded here tonight as coy. Officers have come in and though one does not wish to appear dog-in-the mangerish I must give orders that only our H.Q. staff sleep there in future. There is so much to be done, and so much of a confidential nature, that room and privacy are essential absolutely, besides which when the men are in wretched bivvies their officers should share their discomforts with them. The watch was shared by Cawthorn Pedler and myself and Bde. Operation Order coming in I sat up and drafted my own orders until midnight leaving Adjutant to issue\n\n \n","13":" Thistle Tr Firing Line N.28 d 5.5 – N.35C 6.6\n\nTurned out rather early and had all Coy. Comdrs down at 9 a.m. for orders. Fritz started shelling fairly close and soon Cpl. Robinson was badly wounded one arm broken and one leg shattered and a nasty mud filled wound in the fce. The shell burst between him and another man who escaped unhurt. All ankle boots were called in and stacked in dump near Needle. Arranged all details of rations etc with Pedler. During the day enemy shelling continued brisk and in the evening another man was wounded (slightly) and another killed. He was blown about badly body torn and face blown off. His mates buried him and handed in a riddled pocket book in which was a letter addressed to his wife \"in case anything should happen to me\". At 1.30 our Lewis guns and 1 off. per Coy had gone on ahead and at 5.15 the remainder set out and picked up guides at the Cow dump. Two of these guides were killed coming down and their officer wounded. Followed on ourselves and made for the HQ\n\n \n\n2\/1\/17 Thistle Tr \n\nwhere we found the 6th Dorsets. As soon as one put head inside the dugout a scent of perfumed soap met the nostrils. Not the war-weary warriors we are. There was an Artillery officer there and a young Dr. good lookers both. Our doctor, Fraser, again 101° and will have to go sick tomorrow. Relief complete by 9 pm. Two new telephone lines laid and they work satisfactorily. A fairly quiet evening as far as strafe goes. The relief went well and mud was not too bad and our ration parties got to work at once to carry the stuff up. This dugout is a Hun one and very neatly built all wooden pieces and much neater than the British type is. Table with telephone at foot of first flight and then recess holding spring bed. Down one more flight and there is a corridor with the signal office and the batmen. Stayed up all night busy with orders and ‘phone. Rumours – that Smith, Forbes, & Plant have each got D.S.O. and that Austria is suing for a separate peace. Some furphy, what! A quiet night.\n\n \n","14":" Thistle Tr\n\nTurned in at 2.30 am and awakened at 5 to supervise compilation of the Intelligence Report which left here by runner. Sniper had been giving us a deal of trouble and patrol located him. It is proposed to kill him tonight. Beyond hearing coughing and talking nothing else was seen except some large working parties behind their lines who were observed on gun flashes. Taking out a flare pistol tonight so as to locate a working party and put artillery on it. Slept again until 9a.m. and then breakfasted afterwards walking round the line. From battn. H.Q. to A&B H.Q.R.s is about 600 yards across open troubled ground and bad mud. A few dead men lying about one with bloody disfigured head. Noticed a few steel helmets lying round with big holes in them and a number of rifles with fixed bayonets, their owners resting in graves alongside. Bodies soon moulder in the open. No shells very close to us. Found Hogarth & Main with about 40 men in a deep dugout rather badly constructed but warm and a place where men can sleep\n\n \n\n3\/1\/17 Thistle Tr\n\nand have their feet rubbed. From here set out to firing line about 200 yards in front having to stoop during the latter part of the journey. Found quite a good trench hereabouts duckboarded and the men all happy and hard at work doing bivouacs. Walked right along the line to the right and it was very bad in places right up to the waist in very sticky creamy mud. A number of men here had no shelters. All seemed keen on looking after their feet and socks. Returning met Col. Forbes and others and busied on odd jobs. The rest of the day was spent in the dugout alternately sleeping eating and working. Went to bunk about 6 and stayed in till 10 p.m. and then rose like a giant refreshed and cleared the decks for a heavy night on maps and plans. All the others went to bed. The night was quiet only the steady roll and drum of the guns disturbing the silence. Our snipers claim to have killed 5. Our patrols bombed suspected posts but found nothing. Others went right forward close up & saw Huns\n\nThistle Tr\n\n4\/1\/17 Toiled hard in the small hours with maps and plans doing Disposition \n\nReports for Brigade and Division. Finished with a tired mind about 3 pm and devoured bread and cheese and \"Three Weeks\". At 4 Groves came in and collated Intelligence reports – one has constantly to guard against the enthusiastic specialist and exaggeration. The machine gunner who fires on a working party always \"mows them down\". One of our Vickers claimed 25! A burst of 50 cartridges did this. Turned in about 6 and slept till 9 when General M Smythe G.O.C. 2ND Division came in from tour \"round the line\". A practised eye at once saw not much mud on his puttees so some of his leading questions fell on stony ground. At 11 set out for the trenches but was stopped at the door by an order to accommodate 60 more men up here. Devil a shelter and plenty of rain. Went round with Ped. And managed to fit in a good many of them and with some iron and a few duckboards hoped to get them sheltered later on\n\n \n","15":" Thistle Tr\n\nWent on to the firing line with a guide and just at rear of our present line had been a charge. Bodies lay thick in patches – huddled masses sinking into the mud. Head wounds seemed to have stopped a few but shells had cut some up. One chap’s head and shoulders were lying on the ground. Another’s legs were at right angles to his body – severed. Passing here the enemy must have seen us for two 77 shells landed within a few yards and covered us with smoke. A very narrow escape from becoming one of these brown little heaps on the ground. In the firing line things were considerably better than yesterday but still no bunch of violets. Went along the line getting up to the waist in places in the creamy mud. Returned in heavy rain to H.Q. and put in a busy afternoon on routine stuff. Dr. Morrison turned up to relieve Fraser who is still far from well. Papers came in the rations and Pedler & myself found we had both been awarded Military Cross. Good for the Y.Bs\n\n \n\nThistle Tr\n","16":" Spent the early hours writing up the log book and doing intelligence. Our snipers and patrols were busy again. Fritz sent a party of about 12 against one of our bombing posts working round to bomb our chaps who fired on them. One man fell and then we got a rifle grenade into them which seemed to cause them some trouble. Only a few of our men were out so had to wait for a while before reconnoitring. On going back to the spot they found no dead or wounded but found a bag full of German bombs which had evidently been dropped by one of them. Otherwise all was correct. Turned in about 6 and slept till 10 after which had breakfast and did odd jobs all the morning. A beautiful sunny morning with plenty of aircraft up and one enemy balloon. Intermittent shelling until after 1.30 when our heavies started a concentrated and intense bombardment on their front line with apparently good results. He put a barrage upon us and my code report to Brigade\n\n \n\n5\/1\/17 Thistle Tr\n\nwas unintelligible when it reached them owing mistake in transmission by signallers. Much excitement. A 5.9 burst right in our trenches and covered a group of men with thick mud from head to foot but hurt no one. Macgregor says some munition workers were round our lines today looking at things. Relief by the 24th was carried out without incident and was complete at 9 pm. when we returned to H.Q. at Needle. The night was bright moonlight and the way lay over tilled fields with regularly lined self sown crops of turnips mangels &c. Stewart reported back to camp and Dr. Sanbrook also. Air down into the dugout becomes very vitiated and foul with so many living and sleeping below and no ventilation. The men on the isolated posts came in very dead beat and exhausted and some feet were bad and swollen. They are very kind and tender to one another in illness our men and in the sections is a splendid feeling of comradeship.\n\n \n\nNeedle Tr. & B Camp\n","17":" An uneventful day at Needle. Relieved by 23rd. at 7.30 pm & returned to C Camp. Good to get letters.\n","18":" Quiet day in Camp\n","19":" Dr. Pedler went into Albert with a limber to buy goods for a regimental canteen which should be popular with the men as they get paid today. Most of them away at baths during the day and on fatigue at night. Went to BHQ during morning to an interesting lecture on counter battery work by Col. Pritchard DSO. General Smyth there with his tunic ablaze with ribbons headed by the V.C. A good lecture showing to what a science gunnery & air work is now reduced. Being a cold day spent most of it indoors with phonograph going on opera music. Unearthed a familiar tune in \"Madame Sherry\" an old Casino chant. Find that men will not look after things themselves. For instance we got about 200 Tommy cookers after much trouble and nearly all were left in the trenches when the Battalion came out. Turned into bed very early and slept soundly through a cold night. There was a light snowstorm\n\n \n\nNeedle Tr\n B Camp\n","20":"\n\nSpent in camp. Cold and wintry and the brazier was kept going all the time. Also we got a lot of canteen stuff from Albert and started a canteen in one of the huts. The takings were soon over £100, our prices cost price. Profit arises from our 5% cash discount. Some mess stuff also to hand and one tongues a bendictine or curacao after dinner. Colonel Smith and his staff came in before lunch. Forbes rang up regarding officers so I put in two recommendations for first commissions to make us up to establishment. We fight with only about 15 officers, all the rest are away at schools &c At Orderly Room tonight I dealt with a case of malingering – the man has been constantly on sick parade trying to dodge work and I had him examined by two doctors found fit and then handed him 7 days No. 2 by way of reward. Pedler’s promotion held up temporarily, will see Smith about this on the morrow and get him to hurry it on if possible. Heavy stunt started 5 p.m.\n\n \n\nNeedle Tr\n B Camp\n","21":" Some very heavy guns at work during the night. Loud deep bursts to which our guns responded. Sat on a Court Martial with Pedler and Cull during the morning and tried a case of absence without leave rewarding 2 years H.L. Sunny and cold early and the dull patter of two aeroplanes fighting with machine guns overhead. Later cold and wintry with an icy wind. Huts are growing up fast alround with big parties at work on them. In the afternoon stayed inside all the time only going out to try an Orderly Room case and to look at a Taube which was flying very low and at which our A.A.’s were plastering shells thick. At 5.30 went down to 5th. Bde H.Q. to dine with Colonel Smith and found him housed in a dugout palace in a quarry 60 feet of earth on top of the rooms to which you descend by staircases. A wonderful place which houses many men. The boys have it that this was the home of the Crown Prince. The heavy artillery is very active tonight and keeps up an incessant bombardment. Fritz retaliates with big stuff screaming over. Chose a good old original 6 for English leave\n\n \n\nNeedle Tr\n B Camp\n","22":" Just before dawn the artillery activity which had been constant during the night developed to a very high pitch of intensity the 18 pounders and howitzers keeping up one intense drumming while the heavies shook the huts with their gigantic reports. This kept up until well after dawn and we expected orders any moment to turn out as it seemed as if some sort of attack was in progress. Fritz has been rather aggresive on this front lately. The morning was a very foggy and cold one and after breakfast I went to B. H.Q. and saw the Brigade Major (Eris Plant) regarding our future moves. Could not help noticing on the way how every square yard of the country is pitted with shell holes and reflecting on the enormous cost to the country. The men look great characters. Steel helmets, unshaven faces, sheepskin jackets, trousers, sandbags round the legs and mud over all. Transport drivers have a rough time and cling affectionately to the Australian felt hat usually well bedaubed with mud. Artillery men packing their shells on pack horses to the accompaniment of much hard swearing and talking\n\n \n\nB Camp 11\/1\/17 Had a cup of soup with Padre Durnford and after seeing Plant returned to Camp once more. Wrote out the necessary orders for tomorrows move. Snow in light powdery flakes and soon whitened the ground. The temperature is moderate – not so cold as one might expect for snowfall. Our cook goes to hospital today with a perianal abscess. He is always in trouble – suffers much from bad feet and physical weakness and lost by death his father wife and two children. Seeking consolation of a little French m’selle to whose mother he paid a franc as the price of her seduction, he caught the clap and consequently misses his English leave.! His cup is indeed full. Today he complained to the M.O. of a sore \"prostrate\"! In his place we are getting another cook who is a good man but just recovering from a love malady he caught at Armentieres. Our venereal friends!!. Stewart went to Albert today to return pay and to get our regimental funds squared. The men are busy doing \"tasks\", putting in tank guns among other things and do their 6 hours work per diem. These huts are good and warm and very homelike after\n\n \n\n11\/1\/17 \"B\" Camp\n\nwet dugout and muddy trench. At 2 pm held a conference of all those officers who were not on fatigue and discussed our next tour in the line and some tactical matters. Followed the doctor with a few remarks on trench feet and then we yarned round a glowing brazier for a while, the powdery snow still falling outside. Colonel Fitzgerald on a FSCM and spent some time in fierce argument with him on the duration of the war & kindred subjects. His usual argumentative powers were augmented by a couple of whiskies. Having eventually despatched them homewards we settled down to a frugal dinner of soup mutton with vegetables and sauce, and stewed fruit with Ideal milk, hot toast and honey topped off by liquers. Our doctor very funny with his arguments about barrages and Bosches &c &c. The guns roaring heavily again tonight. Rumours of a German attack at Thiepval but it lacks conformation. We are only 5 miles away but the first reliable news we shall have will be that gleaned from the London papers\n\n \n","23":" \"B\" Camp & Needle Tr\n\nRoused batman O.P. Hunt up for being late in awaking us. Sleet and a little snow after breakfast. Colonel Fitzgerald and others on a Court Martial so stayed in the other officer’s hut. In the evening at 4 pm left for Needle Tr and had an uneventful run up. The men plodding along loaded up to the eyes with ammunition rations &c. Some bombarding on the left. Relieved old Maj. whose pungent comments on things in general are very amusing. Dr. Sanbrook in trouble again. Both Pedler and he found this morning that they are lousy and entering this dugout tonight Doc. blackened his eye. He is quite changed, curses fluently &c. Braithwaite joined up tonight and at once accompanied us up here. At 7.40 one of our 18 pounders dudded a few hundred yards away making a noise in flight like a flare evidently a faulty gun. Usual rattle of machine guns from the front and whine of heavy shells passing overhead. Divided the night into watches shared with Stewart & Pedler\n\n \n\nNeedle Tr.\n","24":"\n\nAwakened and had breakfast before 9. The air in the dugout had become fetid & foul with so many sleeping below and the smells of cooking made the air so thick that one could almost cut it with a knife. Feeling ever so well coming in, one soon feels off colour again. Arising breakfast consisted of rank bacon, rank margarine smeared on with a dirty knife and plum jam. Tea tasting of a hundred nameless stinks and made of water collected from shell holes round about most of which have been used as depository for excreta. Sent all the company commanders up to the line where they found that things were not much altered. Rather a funny incident is vouched for by Bland. The English did a relief last night and vacated one trench before properly relieved. Fritz hopped in!. Macgregor vigorously stoked a strong post last night – about 50% duds and no kills. Fritz put over some pretty wooly bear shrapnels during the morning. At 12.40 all our heavies\n\n \n\nNeedle Tr\n\n13\/1\/17 and available howitzers started a heavy bombardment sounding like a deep bass drum. The afternoon was quiet and cold with a few snow flakes. Orders arrived for us to carry out a relief tomorrow night and our orders were issued in accordance. After tea it soon became pitch dark and going up aloft it was the devil’s own job to see six inches in front of you. Lights draw a shell at once and a false step off the duckboards means partial immersion in mud and water. Our carrying party arrived with the rations alright and also carried up 100 pairs of gumboots. A number of dead bodies (Huns) were weltering in a horrible mess near our support trenches so I ordered them to be covered with earth. This was duly done but a cross was also erected by the men bearing the inscription \"Finish Fritz\". Adjutant had this removed. At 8 p.m. our trench mortars blow out a strong post full of Germans and a patrol goes over to get papers &c off the dead if any. The bombardment succeeded but no dead seen\n\n \n","25":" Needle Tr Firing Line\n\nA quiet cold day. Our heavies put over quite a number of slowly whistling hurtling shells which followed on a pinging report from the gun. The men all well dug in in their trenches and fairly comfortable. Yarned a good deal during the day. At 5 pm commenced to move the Battalion up to the firing line and changed headquarters myself. In Indian file we plodded along among clayey shell holes striking cultivation plots at intervals. Nearing the firing line open country comes to view until it is easy to miss ones way. Bullets flick past often and odd shells drop close. Passing over two sunken roads we come to Battn H.Q. in among as ramshackle a collection of rubbish heaps as could be imagined. A warm spot as shells keep dropping with frequency. Had tea and talked with Duggan and relief was complete by 8 pm. Re-settled ourselves in the dugout and settled down to our four day firing line stunt. Settled down to sleep to the lullaby of 5.9’s crashing all around.\n\n \n","26":" Firing Line. Ginchy & Les Bouefs.\n\nAwakened at 4 a.m. to summarize intelligence and while getting up some men brought in Stretcher bearer Franz Brunn 3 Comp. 1 Battn 361 Egr. Regiment sometime a soldier in the Imperial German Army, now a prisoner of war. A young small man wearing the field gray and the cockaded cap and his red cross brassard. Gave him some bully beef and bread while went through the contents of his pockets which consisted of letters from and to home, some paper cuttings, maps of the front, paybooks and postcards and all the little hundred and one things a soldier gets in his pocket. He could speak no English and was quite a cool and casual customer. He had blood on him and we gathered that he had gone to the assistance of his officer hit out in No Mans Land by our snipers and that the officer had died. Taking his paybook off him, our friend mistook our trenches for his own and our Vickers gunners soon collared him. Sent him off to Brigade under escort and then carried on the good work of patrol reports &c. One of our Corporals winged while putting on his snipers. Our patrols met one of theirs which\n\n \n\n15\/1\/17 Firing Line. Ginchy & Les Bouefs.\n\nretired to avoid a brawl. Sent Pedler up the line at daylight to supervise work and to inquire into a proposed bombing stunt tonight. A m.g. is suspected in a rather detached post and it is proposed to raid the place tonight. Am forbidding this, to have a better reconnaissance made instead tonight and do the job tomorrow night with suitable covering support. Pedler went up the line after dawn and laid out some engineering tasks and improvements. The enemy showed a disposition to fraternize and waved hands & whistled this morning. It took a few drums of machine gun fire to start the War once again. Noticing some earth being dug up Barton and 3 others started to fire some rifle grenades over. They were faulty and one exploded in the rifle wounding them all slightly. Having dressed their wounds a drumhead court of inquiry assembled and took their evidence before they went to hospital. The rest of the day passed without incident of note the only visitor being F.O.O’s and other artillery officers and a few cases of sore \n\n \n\n15\/1\/17 Firing Line. Ginchy \n\nfeet. Little Jimmy O’Connor half witted and 16 years old was crying with shell fright and the doctor sent him off. Pitch dark at 5.30 and quite impossible to see hand before face then. Rations commenced arriving on pack horses and our old bushmen prove invaluable in finding their way in these places where no landmarks are and through an intense darkness. Evans came in. Our machine guns commenced a programme of indirect fire and some shelling was arranged for midnight as relief was expected but no indications were seen and no results obtained. Snipers and patrols out as usual. But beyond usual coughing & talking heard they did nothing of interest. Two cases have occurred lately of sheer collapse from physical exhaustion. Men just drop right down suddenly in middle of a job \"spent\". Great hearts. Outlook from here at night shows a dull plain line against skyline, part firing line part No Mans Land, with flares going up from it. Not a tree in sight just one undulating plain with here and there a sunken road filthy & debris strewn, once a pleasant French country lane. Bed 7.30 pm.\n\n \n","27":" Firing Line – Ginchy\n\nAroused at 2.30 am by heavy cannonade and sprang out to ‘phones at once and had an anxious Brigadier to pacify. Soon found it was well away from us and we only got some shoot-overs. The firing line stood to arms. Carried on at 3 am all being then normal. Back to bunk for a couple of hours. The Germans had put a spring (French) mattress in here and very comfortable it is but the warmth of one’s body brings out the hordes of lice which infest it and it is not easy to get to sleep. At the present time I am horribly lousy in the head in addition to the body. Up at 5 am and checked intelligence and found a wad of correspondence wanting attention and a complaint from 7.F.Co.E. that we had left our trenches in a dirty state at Needle. Damned annoyed. Had Hogarth up and put the acid on to some tune regarding the matter. Quiet afternoon and evening until 7.30 pm when we had a little stunt on a strong post firing 60 bombs. Fritz at once sent up orange clusters and put a barrage of 5.9 and 77 stuff across. Some one away\n\n \n\nFiring Line Grinchy\n\n16\/1\/17 on our left put up the S.O.S. and all our heavies and howitzers got to work and sent over heavy and intense curtains on to Fritz. Such a big stir does one little stunt create in this touchy spot. All was normal and retired to bunk at 8.30 but could not sleep. Patrols out as usual but elicited little information beyond hearing usual coughing &c in their lines. Our chaps shot 3 Germans in Finch and had the satisfaction seeing their stretcherbearers come out. Also claim to have killed another who was firing flares. He was seen to fall. A German carrying a Red Cross flag came out of Finch and collected some effects off their dead in front later returning to the rear carrying two small bundles. Our men have put in some good work today with pick and shovel digging a small new trench and a new T head. They have also done some new latrines and cleared out all the mud from 100 yards of trench, previously 3’ deep therein and made it habitable\n\n \n\nFiring Line Grinchy \n","28":" Up at 4 a.m. and did intelligence reports and going outside found the whole place four inches deep in snow and powdery flakes falling. The 31st Battn. advance parties commenced arrival and all machine gunners and others were under weigh by noon. Colonel Davis spent the morning going into things. The snow looked beautiful and the only things breaking the white vista were scattered. Sent Pedler back early and then dribbled the proportion of the carrying party back to camp. The day was very quiet and in the evening at 5 pm the relief started to move up and the snow threw every shape up in relief from the white background. Fritz put a number of shells right in on this place and made it a really warm quarter for a while. Sent Stewart down early. Hamilton has been our ration expert here and King our guide specialist. At 5 pm the relief started to come up and the chaps in the line to trickle away. The glaring whiteness of the snow meant that the new men had to crawl out to some places on their bellies. Sgt Robbins\n\n \n\nFiring Line Grinchy\n\n17\/1\/17 at 8 pm brought in a Fritz. Corporal Friedric Litterst 2 Batt 29 Ersatzby Reg a very smart little chap. He got lost and near our lines was hiding in a shell hole. The boys got him in by beckoning with one hand and holding a Mills grenade in the other. He gave us some fun in his comments acted on different notabilities and was duly fed and given drink. When questioned he said he would not answer being a loyal soldier of the German Army. Relief was complete at 9.30 pm and the return to camp was memorable. The snow was inches thick over everything and flares going up made a beautiful sight. All shellholes were frozen over and duckboards were coated with ice and so slippery that capsizes were frequent. The tracks were hard to find in the vast sea of snow and we plodded on like machines slipping and falling. Reached padres soup kitchen and had a good hot cup of cocoa and some cake and after seeing the Brigadier made for camp passing a few poor tired derelicts. Old Dooley crippled painfully hobbled in. had good hot meal in huts and felt dog tired\n\n \n","29":" \"B\" Camp Thoneswood & Ribemont\n\nHeavy snow had been falling during the night and everywhere there was a waste of white inches deep and a wonderful sight. Black figures of men and horses plodding along through it. Moved off from huts at 11.15 and reached Quarry siding and entrained in a train of familiar French wagons labelled. \"Hommes 40 Chevaux (en long) 8)\". Busy railway yard here and Billjim much to the fore turning his versatile hand to tuning engines &c &c. A slow journey through snow to Mericourt where we detrained, a dirty unshaven band of warriors and marched to the sound of kettledrums into billets in Ribemont. The old village crowded with troops as usual. The men’s billets are fair and mine was the same as before, but Madame has given us the use of a salle-a-manger. Entrance is via a cow shed in which the cows rest for the winter being snugly stalled. Madame prepared coffee and also brought some cakes in for us. Pedler here too. Expedition to big canteen resulted in a swell dinner oysters &c which sat heavy on one and made for a troubled sleep.\n\n \n","30":" Ribemont\n\nResting. Any amount of routine stuff and sent on recommendations for two commissions. Brigadier General Gellibrand and Brigade Major called in and later General Birdwood came along and had a talk. He is looking older and tired and asked how the men were and gave us a little information. Later he came inside to our mess and yarned for a while. In the evening Colonel Smith dropped in and Dr. Mollison came to mess. Went to a conference of battalion commanders at Brigade H.Q. in the evening and Mab Smith came down to our place and argued.\n","31":" The morning was devoted entirely to cleaning up and the men were busy with knives scraping the mud out of their clothes and trying to get a bit clean but the mud is ground right into the cloth. Kit inspection also took place. Went round all the Coys. and also had a look at the raiding party. Raw cold. After lunch rode to a wood the other side of La Houssaye and Frankvillers to a school nestling in the forest and saw some tactical work. Snow still inches deep.\n\n \n\nRibemont\n","32":" Church parade 10.30 on ground near Sucrerie. Men fairly smart in greatcoats and drill order. Afterwards marched past General Smyth V.C. who took the salute. Ground still frozen quite hard and deep in hard snow. Had a haircut and a hot bath during the afternoon. Vey cold and a great scarcity of coal so bed is the warmest place for one. Asked Madam if she had been to mass and she said no because her son was dead and she did not intend to enter Church again. Killed in action. The light has gone out of the lives of the two poor old folk. In the evening went to Bde HQ and had a talk with Plant on various topics. Dark streets with groups of soldiers talking and here and there a busy illuminated estaminet crowded to the doors. Trees bare of leaf and sombre in colour show up black against the snow and make a dreary scene. No wonder that Spring and its advent are so much welcomed by these old world people and their writers.\n\n \n\nRibemont \n","33":" Signs of a thaw which disappeared when some light snow fell. Parade at 9.30 marched out past German prisoners camp to a small paddock all frozen and white. Turnout still bad, unshaven and dirty men but all worked like bees with knife and brush getting mud out. Inspected a few platoons and went in early leaving Pedler to march the show back to Camp. After lunch repeated the performance and found them all correct or much improved. Left early to see Brigadier and got details for tomorrows inspection. At 4.30 let all orderly room cases off with a caution not having the heart to push it into them they looked so clean!. (Failing to shave was the charge). All officers came in then and we pow-wowed re inspection and other regimental matters. Talking to madam she volunteered much information about naughty girls both in Amiens and here. Doctor saw in a shop tonight a woman with the Crown of Venus on her forehead. 40 men on Amiens leave today.\n\n \n\nRibemont \n","34":" Morning parade devoted to still more brushing up and cleaning and a little drill. A bright day but the sun had no power and ground remained hard frozen and returned the show of a week ago. Formed up as a Battalion at 11.30 and did some ceremonial drill. After lunch moved out to parade ground on hillside and formed up in mass with transport in rear for inspection by General Smyth V.C. It was piercingly cold on the frozen and snow covered ground in spite of a futile sun’s feeble rays. Received him with the General Salute and Present and accompanied him round the ranks. The wind cut through one and little time was wasted on details but he soon skipped from one to another. Formed then a hollow square and the General made a most kind and complimentary speech. Took the salute on the road and the men marched well to the band. The little village looked pretty nestling in the hollow its white surrounding slopes forming a background. Very cold indoors and Madam wanted to give me a brick. Proudfoot to be our Pay Sergt came in for a yarn\n\n \n\nRibemont \n","35":" A sunny feeble day and one of the coldest ever experienced, the mercury was below freezing point all day and the snow is still white all over the fields. On morning parade kept the men moving briskly as much as was possible but the chill bit right into the joints. In the afternoon there was no parade all men being at the baths. With Maberly Smith & Ped. walked over to Heilly which is a pretty little place and then walked out past the Casualty Clearing Stations along the Corbie road. There is a belt of leafless forest running right along the Ancre and a church steeple peeps out of it. All the dwellings are clustered in the villages and the farm lands in neat patches have no one living on them. Returning to Heilly I met the others and we adjourned to a little buffet place for afternoon tea. There were 3 m’selles there, exquisitely dressed and all pretty. There were a good many officers there. Tonight for the first time in our billet we have a fire. The shortage of coal is serious and causes great discomfort and inconvenience. It is a saying that the men with sugar and coal can buy anything from the inhabitants\n\n \n\nRibemont\n","36":" Very small morning parade owing to so many men being detached. Had the officers up and chose some ground for afternoon’s work and then went in. Very cold and snow still on the ground. German prisoners camp is guarded by young \n\nTommies of fighting age and one Fritz seems to have one Tommy to look after him. In the afternoon put out a picture of new French attack system on a two company front (in all 260 ft) and by the time this was finished the hour was 3.30. At 6 went out to some high ground west of the village to see the new S.O.S. demonstrated but through some mess up it was not sent up. At our billet there were some visitors tonight a pretty little tot of 6 named Andette Vacette who was told by Madam to come and shake hands with Monsieur le Commandant and in the sweetest way, put up her small face to be kissed. The old man here and the farmhand are both very unwashed and dirty and their work in the midden heap does not tend to make them any better. Madam has many other elderly dames call in to console with her in her son’s death \"pour la France\" and say how sad it is\n\n \n\nRibemont \n","37":" The coldest morning yet although sunny. The nip of the air penetrated wraps and made ears feel as if falling off. Breath froze in moustache. Formed mass on the ground well out of the village and shook out into waves. Carried out an attack on two lines of trenches working under an imaginary barrage which lifted twice. It was cold for the men owing to so much standing about. In the afternoon turned them out again and it only took a quarter of an hour to shake the scheme out and we rapidly ran it through formed up and were back home before 3.30 pm. The bombers were wearing their protective apparatus of chain visor viels, armoured jackets and thick padded shoulder protectors. In the evening Bunning & Alderson reported back and joined us in the Mess. Both keen and glad to be back and full of disregard at the coldfooters there. Our padre’s fame has spread there. We miss his presence here as a refining influence on table talk. Speech becomes at times very coarse\n\n \n\nRibemont \n","38":" Bitter cold. Carried out a Battalion attack over a snowclad hill to the complete satisfaction apparently of General Smythe who was watching it. Then returned home stayed indoors all the afternoon, it was so cold and wrote letters all the evening\n","39":"\n\nHunt not turned up from his Amiens leave and I register vows of sacking him. Later in the day I notice an almost feminine touch about my room, fighting kit all neat and new laid out ready for tomorrow and such little things as new chains on my spurs. But he very carefully avoids meeting me face to face fearing the wrath to come. Our cook has contracted V.D. and has gone to hospital. Madame noticed his absence and asked the reason. The nearest my French would go was \"maladie d’amour\" which she quite understood and quite a lengthy discussion ensued on mademoiselles of easy virtue and their dangers. A good woman and a mother she sees no harm in unconventional discussion of these intimate matters. At 10.30 marched to church parade which was bitterly cold and almost painful standing\n\n \n\n28\/1\/17 Ribemont \n\nthere. Before lunch \ned\n drank some coffee with Madame and then afterwards with the Doctor walked down to see Col. Smith at Dernacourt. Cold and a chilly sun. The roads quiet being a Sunday. Buire and the other village both quiet and the walk rather devoid of interest. We walked over ponds which were solid ice as far down as one could see and where usually there was mud there is now ice. The central place of interest in each little village is the church. Those at Ribemont and Dernacourt have square towers, the Buire one has a Flemish aspect. The walls in each case are grey with age. The local church is 200 years old says Madame and at Buire they claim an age of 800 for the tower. On the outsides of the towers are some of those quaint grotesque little images the French seem to like to relieve the severity of their churches with. Discussed some topics & some whisky with Fighting Bob and returned home once more. All preparations under way for our shift tomorrow to Becourt.\n\n \n\nRibemont & Becourt Wood\n","40":" After breakfast work of cleaning up and getting ready to move commenced. Cold and sunny, a Taube over flying high with the \"archies\" potting at him. Rode down to Battalion to bring it on and on the way met our cooks and cookers – both filthy. Roused them all up and then roared at the Adjutant. On a move like this there is always a great tendency for men to turn out in sundowner rig if not checked. Today found men carrying capes and things over their arms and with things hanging all over them tied on. Roared again & caused great stir generally before moving off. Passed through all the villages as usual and after leaving Meaulte our old landmark the Falling Virgin comes into sight and signs of war damage appear. Beaucordel church is all blown away except the porch in which is a canteen. Turned up to the left past Fricourt camp and skirted the wood seemed with old trenches – scene of bloody fights. Row on rows of little crosses German and British – a legion of dead. Found our Camp to have plenty of room and before dark all were settled comfortably\n\n \n\nBecourt Wood\n","41":" The coldest night ever experienced. Breath condensed on blankets and formed lumps of ice. Hairbrush, sponge, bread all frozen hard as wood. Morning parade close order drill with plenty of doubling and an inspection of packs to see that contents are reduced within field service limits. Four huts full of Lewis gunners, bombers with Slater, and Cull and his raiders hard at work carrying out practice raids. Altogether a busy scene. Snow commenced to fall thick in large white flakes from an ink black sky and the frozen ground became powdered all over again with whiteness. In the afternoon put in some good work at gas drill and oiling the woodwork of the rifles. Having a couple of subalterns in every night for tea and am indeed lucky in having such a good lot of officers. All the men of two companies were closely examined by the doctor tonight. Arranged for dumping of packs tomorrow and also for foot inspection and rubbing. A bright night with the snow all over the scene. General Gellibrand returned today. A cosy hut and a pleasant quiet night.\n\n \n\nBecourt Wood\n","42":" Snow fell again during the night and covered the ground an extra inch deep. Court martialled 6 men on varying charges during the day – some good chaps and some very bad. Awarded stiff sentences in each case. In the huts company commanders gave lectures on attack methods from the interesting book received lately. At lunch time went over and saw General Gellibrand who is just back from hospital and it was good to see him again. Fixed up several matters regarding officers and heard his project regarding the command of the regiment. Had Cull & Cawthorne in to tea and afterwards walked out to an old German trench with strong wire around it. The snow was crisp under foot and movement showed up against it very distinctly. The raiders worked well and swiftly and all the men showed great keenness the stretcher bearers carrying away \"dead\" and others marching off the \"prisoners\". Noticed a few faults and criticised them before the men moved in. good fires in huts tonight. Cox, the little runner, had some good furphies. One he had gathered while washing his feet and the other was áll round the Tommies cookers\"\n\n \n\nBecourt Wood & Shelter Wood Camp\n","43":" Signs of a thaw today making the ground surface as slippery as glass. Coys. Had a short parade for gas drill and foot rubbing and then got on to general cleaning up. Went to Bde.H.Q. to a meeting of C.O.’s and General Smyth came in for a while. Discussed officers &c &c then possibilities of stunting and returned to camp for lunch found a Major of the Seaforth there and yarned to him – a pleasant chap. Kaffir labourers working round are big men and wear dead black coats and felt hats similar to ours. Finished off the Court Martial case and spent the rest of the time seeing that all were busy on the work of cleaning up the camp. This job was done thoroughly and the men piled arms in between the huts. Wearing battle order with two blankets rolled to belt they had a good swag for their half hour march to Shelter Wood Camp, out of which the 17th were just commencing to move. Settled down in new huts and sacked two batmen who were not doing their best work. Conference of officers at 7.30 pm and told them of new C.O. and proposed transfer of Pedler to 23rd.\n\n \n\nShelter Wood Camp\n","44":" A \nwarm\n sunny day at last and the thaw has commenced. We are rather tired of trying to spread frozen butter on bread that is hard as iron and thaws to a hard dough when one tries to toast it. All available men outside specialists moved off today to fatigues all round the area. The Lewis gunners unde \nSlater\n King and the bombers under Slater carried on busily and it is hoped to get them firing live stuff in a day or two. Signallers, scouts and observers are busy on their respective work. Notice a great improvement in the batmen’s department today owing to two of them having been sacked last night and marched out to do fatigue work this morning. Applied to visit the Rouen Records office at the same time as the Abbeville visit. The country round here presents a busy sight with troops and transport ever on the move and semicircular huts sprinkled in camps round the landscape. All officers are to attend a lecture on Bombing by Joe Slater tonight and one by King tomorrow on the Lewis gun and its use. An exam. to follow in a weeks time\n\n \n\nShelter Wood Camp \n\n2\/2\/17 General Gellibrand dropped in about 4 & stayed talking for a while. Quite flocks of birds were flying back towards Albert coming from the direction of the trenches. Sent on forms for Dooleys promotion to Major and for that of Alderson to Captain. Had Gorman and Massie to tea and had some legal memories from the former who is one of the heads of the Victorian junior Bar. Joe Slater lectured in the huts at 7.30 p.m. and was interesting on the subject of Hand and Rifle grenades. Pedler went over to a company command in the 23rd this morning. The gun flashes show up very vividly on the snow at present. Try and arrange for the phonograph to be nightly at the disposal of the men for their entertainment. Three new officers today – Griffen Bennett & Kohn all promoted from the ranks and likely to be good men too. Indeed our officers at present are an excellent set of chaps on whom it would be difficult to improve. The doctor and others visited Pozieres today and saw the graves of some of the poor lads including the runner Goyder. I shall never forget the look on this chap’s face when I sent him out to his death in ’16.\n\n \n\nShelter Wood Camp \n","45":" A fine day and snow started to melt a bit. King lectured on the Lewis gun to all officers and I told them that they would be expected to strip and assemble the gun in 15 minutes. Ball shooting was carried out in an old trench. In the afternoon received orders to go up and reconnoitre the front line system. Left at 4 pm with Bellaway and up to 5th Bde with Fitzgerald. Roads very slippery and had several falls. Martinpuich is in ruins and is to be avoided. Reached BdeHQ and there saw Smith & the General and after a little talk pushed on with runner over open ground to Colonel McKenzies H.Q. and had tea. Every officer present had a decoration of some sort. He had D.S.O. & a Russian order and all others M.C.’s. After getting particulars returned, as we came back flares were going up in the bright moonlight and showing big glare alround. Some strafe 1 killed 1 wounded on Ration dump. Returned to camp about 10 pm. At 11 a heavy bombardment started and seems to be continuing. Orders to go by car to Abbeville with Colonel Bridges G.S.O. 1. Ink frozen in fountain pen\n\n \n\nShelter Wood Camp\n","46":" Stayed in huts all day. In morning assembled all the O.C. Coys and despatched them up to see their sectors. Cull went to hospital today suspected diphtheria. Heavy cannonade close on our Left and rumour that the neighbouring Divisions hopped the bags last night. Miller Bde. Bomb officer says this Div. is also doing a stunt at 3 am on","47":" Worked out available men and chatted B.M. to get some of our fatigues released to join us up. A fine cold day with some tendency to thaw but evening was a real frost. Fuller came in to see me during the afternoon and recalled old times. Put the weights into two men for burning good floor boards in their brazier. Thought of letting them off as they were dinkum Billjims but one has to be hard and their punishment will be an example to their other 20 hut comrades. Owing to bad weather lack of razors and intense cold some men are letting themselves get very dirty and have to be checked. They like washing their feet in the warm water we provide under the supervision of our A.M.C. details Slang word \"sniping\" meaning to pinch\n\n \n\nShelter Wood, Beaucamps-le-Vieux, Amiens\n\n5\/2\/17 An interesting day. At 9.45 am proceeded to D.H.Q. and there met G.S.O.1. Col. Bridges and message came through giving Details of 4th Dvn. attack which succeeded. Walked down to Fricourt Circus and picked up Col. Leane D.S.O. M.C. and got into a fine motor car and picked up Col. Mullins in Albert. Albert was quiet and well strafed cemetery knocked about and one house flattened with one yesterday. Got on to the main Amiens road and the cold soon got almost unbearable and powdery snow falling forced us to put the hood up. We seemed to run into an area where more snow had been falling as it was much deeper there than elsewhere. Coming to Amiens and passing the usual barriers we spun round the town and struck out through bare snow covered country with roads flanked with guant trees, - stray partridges and other birds in the fields and the usual frequent villages with their tortuous streets and blank walls. Swung into one rather larger place and there ordered sardines (frozen) hot coffee and omelette and did well. Cheerful folk with warm stoves. They were much taken with \"Jolie casquette\" – evidently a novelty to them as this place is off the beaten track for troops\n\n \n\nBeaucamps. Le. Vieux, Amiens\n\n5\/2\/17 Leaving here we ran into the above rather long village where French soldiers were in billets and pulled up at the Mairie now a School of Instr. Here were a number of British officers some Brig Generals and a few staff birds. We were introduced to the French General commanding – a little sallow man with plain uniform and only a couple of small stars to denote his rank. He had the Legion d’Honneur & Croix de Guerre with 2 Palms. He spoke through two of his officers who spoke very good English. All went out by car to a ground about 2 miles out and were there introduced to the commander of the operation who had many medals. Legion of Honour, Madagascar, China, Annam &c. Like all the other officers taking part in the operation he carried a sword but otherwise could not be spotted out from the men at a distance as he was wearing steel helmet and greatcoat. Here we found an operation just about to start the troops were in full marching order and supposed to have been caught by shell fire on a road. They deployed into artillery formation and carried on until heavy machine gun fire forced them into skirmishing order. A real gun fired into a stop butt in front and\n\n \n\nBeaucamps. Le. Vieux, Amiens \n\n5\/2\/17 gave the necessary sound. Usual advance in rushes from here to where they eventually dug in. The 37 m. gun was carried up on a cart. A day of a week being presumed a new regiment took over clad in fighting order. In a fixed signal they opened an intense fire with rifle grenades and machine guns while the 37 mm gun fired as hard as its gunners could load. The whole place was soon a mass of smoke and the opposing trenches quite blotted out. Then at a fixed signal they advanced crying \"En Avant!\" their Lewis gunners slightly in front spraying the ground with bullets. All halted a short distance from the trench and poured a barrage of hand grenades into it cleaning it up. First wave went right on and tackled second line while second and third cleaned up. As soon as objective was gained an effective signal was put up consisting of a hanging parachute flare which remained burning suspended in mid air for a long time. At different stages the old General explained the situation to us with much gesture. We all went over then and examined their guns bombs &c. the rifle grenades are fired with ball cartridge. Bugles sounding all the men formed up. As we moved back to our cars\n\n \n\n5\/2\/17 Beaucamps. Le. Vieux, Amiens \n\nwe found a whole regiment drawn up en masse in our honour and standing like blue statues at the present, - the officers with sword hilts to lips. At a loud command they came down as one man to attention and remained rigid. Their steadiness under arms was admirable. Their officers told us they are untrained men equivalent to our Base Details. Back to the Mairie where we found tea and cake set out for us and the British & French flags intertwined. Returned to Amiens via Poix – a large village and we had a clear run right to Cape Godbert where we dined. After that I separated from the others as they were returning home and after going to Gare du Nord made for Gare St Roch. Must be making some progress in French as we managed (a French soldier & I) an animated conversation and he could speak no England. He had been called up from the Congo where he is a Civil servant, to join A.S.C. and has family &c here. A good chap and ready to give information. He showed me Gare St Roch and then returned to Hotel Belfort which was full. Same tale also at another but Hotel de Rhin came to rescue. Secured a bed and asked to be called at 4.30 a.m. to catch the early train to Rouen. Not quite so cold tonight. Practically no bed clothes but had blanket in pack\n\n \n\nAmiens to Rouen\n","48":" Awakened at 3 am and feared to got to sleep properly again. Called at 5 by concierge and got up & dressed. Ice thick in basin and waterjug. Paid bill at bureau and walked to Gare St Roch – quite dark on the boulevard, parties of French soldiers drifting by in full marching order. Station appeared deserted but opening an entrance door one came on a busy scene crowds of poilus and civilians waiting for trains buying tickets and porters handling luggage. Being a little early bought 2 rolls of bread from a poor tired out looking woman standing near the door and munched away at this for a breakfast. Bought some poor pastry patties for lunch, and also Le Rire and a couple of other papers. After getting movement order from an illiterate Tommy in the RMO; office went on to the platform and the train soon pulled in. it was quite dark and our compartment was one of the usual first class, light leather upholstered and more or less white anti-macassars along the back of the seats. Travelling companions were 2 French officers (one a doctor) and a factory owner an elderly man warmly dressed and wearing a All bearded. My blanket was the means of striking\n\n \n\nAmiens to Rouen \n\n6\/2\/17 up a conversation as it served to cover Monsieur le docteur as well. We carried on a talk in broken French (none of them spoke English) and soon became fast friends. They consider that at present rate of progress the Bosche will never be shifted out of France but that economic victory will result soon, and also that we treat prisoners too well. On a discussion re sanitation the doctor said that he knew the French method of a courtyard with close buildings, dung heap bad latrines and wells taking all fresh soakage was wrong in theory but says it does not affect health all the same in his opinion. This morning at Gare St Roch for 50 feet up from the main entrance the footpath was in a disgusting malodorous state owing the men easing themselves thereabouts. The smell of urinal at Cafe Godbert would sink a ship. It was impossible to see any scenery during the first part of the journey although the train crawled at snails pace. The windows were thick with frost and ice. Heavy snow covers all the fields. The train is the slowest imaginable and we are now at Longereux-Vieux-Manoir and have been here for over an hour and a half indeed over 2 hours merely standing idle on the track\n\n \n\n6\/2\/17 Amiens to Rouen\n\nThe train was due at Rouen at noon and here we are now still 40 miles away and have been on the road 9 hours already. The afternoon sun warmed the air a bit and cleared the windows. The country would be very pretty in spring but just now is everywhere deep in snow and the bare trees have a desolate appearance. Steamed into Rouen about 4.30 pm first passing through a typical old French suburb about 3 kilometres out. Arrived at the Station and took a tram to the Hotel d’Angleterre with a Canadian officer. A fine town something like Alexandria in places. Quays run along the town front and large boats seem to be there. Alloted a good room and the hotel and then went for an hour’s walk round the busy streets. Electric light, clanging trams, civilians, soldiers and pretty English and French girls. Had a glimpse of the exterior of the Cathedral in the dark. Lofty with irregular towers. Some of the stone work appears very airy and beautiful. A vivacious little mademoiselle sewed a new gold stripe on my tunic with much talk. Returned to hotel for dinner which was quiet and well served. Liquer kummell is like dill water.\n\n \n\n6\/2\/17 Amiens to Rouen\n\nWhile debating what to do the waiter put a bill of a play on the table and I walked round to Georges Hall Rue des Carmines a barn of a place with tawdry scenery. Paid 5 fr. for a \"box\", a little fenced off cretonne place. Quaint notice up beside stage \"Please Boys! Don’t send anything on the stage it could be very dangerous\". The show was varied dancing singing &c mostly in French but they sang some English songs. About 9 oc a fair audience was in the house. The average officer on Base job is not a very intellectual person. Some of them were exuding whisky at every pore and weak faced looking derelicts. Joy girls came in and sat in the audience and joined one on a nod and payment of the extra prix to the ticket collector. As one gentleman of the very gallantly put it \"handling them helps to pass the time\". The dances on the stage were quite respectable but rather more lingerie is shown than would be considered proper at home. Mostly small white frilled knickers were worn\n\n \n","49":" Rouen to Amiens\n\nOut and breakfasted by 8.30. the French breakfast of a large cup of coffee with milk and rolls and butter is very sensible. Set out for the Records office going along the Seine River front. The river was covered with ice which was coming down thick. Big steamers berth right alongside the street. Near Rue Jean D’arc is a very high Transportation bridge suspended from which is a cage hanging by steel ropes. Could not examine closely but it seemed as if this \"ferry\" ran across just above the water. The bridge is a steel structure and very high. Close by here there are enormous stacks of bully beef and biscuit higher than some of the adjoining warehouses. The trams are all electric and run entirely by women who wear a little forage cap. The men here much favour the hood and cape and draw the hood right over the hat making an odd picture. Through by ways to the Records office and there met Colonel Griffiths A.A.G. and went through our Battn records adjusting many little details. He kept me talking on Courts, Casualties &c &c for a long time which was galling as one wanted to do some\n\n \n\n7\/2\/17 Rouen to Amiens\n\nsightseeing. From here to Boulevard de Belges (fine wide streets these French boulevards) to Base Commandant’s office and found no one in attendance all being out at lunch. Then to Pay office Rue de Etoupe and drew some pay. Walked back to hotel via the street the Cathedral is in and went inside for a hurried look round. The outside is of stone like that in the Westminster Abbey and is turning white with age. It is beautifully carved and some of the stonework seems as delicate as lace. The towers are odd and the Tour de Beurre is fine. The tall spire rises from the centre of the church. A beggar woman opened the door and received a sou for her trouble. The interior is magnificent and excellently lighted and well kept. The pillars are massive and well carved – over the entrance end of the church is a fine rose window. The pulpit is of light wood cunningly carved. One big side door was evidently of the age of bad taste (St Pauls:) and like some of the wood work in the Church of St Vaast at Bailleul. The Sanctuary was closed and sacristan ready to show to show one round but time pressed. It\n\n \n\n 7\/2\/17 Rouen to Amiens\n\nwas hard luck indeed to have so little time to spare and not be able to do the Cathedral properly. Went into a very fine grocers shop to buy some biscuits but it was defendu being one of the days on which sale of pastry is forbidden. Back to the hotel. In Rue Jean d’Arc is the Tour St Andre the remains of an old church, a high narrow tower. Behind the Cathedral (?) is a fine old pile of Gothic buildings where boys were playing some ball game. The Great Clock is in a cross street above an archway and has an elaborate dial. Men were at work in all the streets breaking the ice in the drains with picks. Again to Base Commandant & after trouble received movement order. Then to hotel and got a taxi for Rue Rive Gauche where an impertinent young RSO was rather assertive until put in his place. After much ‘phoning &c got necessary ordre de transport – not an easy matter as there are dozens of officers here not allowed to travel owing to crise de transport. To Gare du Nord and secured necessary papers from an interpreter. Game of backgammon\n\n \n\nbeing played here. Adjourned to a café for some coffee (served in vase like glass) cheese &c. The people love to get together and yarn over their coffee. The liquors at the bar were rhum and a few other spirits and different liquers. Had a glass of Benedictine in a glass twice as large as our liquer glasses. Much struck with the great courtesy of these folk both to strangers & among themselves. Always bowing, exchanging good wishes and giving thanks. Left in a passenger train at 5 pm and had a cavalry Major and an Engineer for companions – both Eton men & good fellows. A slow journey travelling all night and reached Amiens about 3 a.m. Got a room at Hotel Belfort – a fine place and had some coffee and rolls before turning in. feet very sore and very fatigued. \n\nRouen is a pretty place and those who are stationed there like it very much. It has a background somewhat like Marseilles. Sanitation is weak. Streets full of fine looking girls and women. Saw a peasant girl with little white nun-like cap on her head. Quite happy on the arm of her bucolic lover\n\n \n","50":" Amiens & Albert\n\nSecured in Amiens what in Rouen is not possible – a delicious hot bath in a fine bath room and then had breakfast downstairs. Did a little shopping and left on a train at 10.30 to the Albert road barrier and rode in a motor car to Querrieu and Ribemont. Came on to Albert in a motor lorry and dumped pack at station. A tumbledown town of some size well bombarded. The Cathedral is an imposing modern building partly ruined and the enormous statue of the Virgin hangs head downwards over the street as if about to do a plunge. Many big guns parked here and passed a lot on the roads. Icicles hang thick on water carts and wherever there is any drip! The weather is sunny but the thaw seems still afar off and everything is frozen hard. At 4 pm to QM’s store and then to Villa Station on horseback. Took wrong track on Decauville and finished out to blazes. Retraced steps and plugged through snow to BdeHQ and had a talk with the General then walked on over the snow to BattHQ and took up the running again.\n\n \n","51":" Supports & Firing Line. Le Sars\n\nShaved in bunk in a messy fashion and once more feel unwell owing to this dugout life and the rotten feeling of nausea that the vitiated air in these places always gives me. What with smells of cooking and the concentrated carbonic breath of so many men sleeping down below it always makes me feel as if I want to be sick. Went over to Duggan at the line headquarters passing over snow covered ground, a clear sun shining but a wind that was below or at any rate little over zero. Men at work with pick and shovel filling sandbags with ice in order to use it for making tea. \"Getting a bag full of water\" as one put it. An excellent trench and a fine dugout as HQ .. Not far off is a good O.P. and artillery officers were doing a shoot. The village of Le Sars is the usual mass of ruins. From here we look right over Bosche lines and can see him moving about freely. The whole scene is dominated by the Butte de Warlencourt an old tumulus or burial place which is about 50 feet\n\n \n\n9\/2\/17 9\/2\/17 Supports & Firing Line. Le Sars\n\nhigh. Evidently of the prevailing chalky soil it is well torn about by shells and 6\" hows. were bursting on it while we watched. The 18 pounders were on to Warlencourt and the observer would get \"Gun fixed\" by phone before we heard report and then we would have plenty of time to wait for the shell to arrive and burst. Yesterday the same guns got right on to a party of Huns and blew one chaps arm off and others were evidently wounded as they all ran away some holding their limbs. Returned to own H.Q. for lunch and got busy on plans for raid. Relieved 23rd Battn in evening, quite uneventful except that our runners did not know the way too well and machine guns were flicking bullets well into our trenches. All complete by 9.30 p.m. rations came up alright. Our patrols went well over to hun lines and heard them coughing talking and working in their trenches. Left patrols reconnoitring ground for raid but have no reports from them. Turned in about 11 and slept sound.\n\n \n\nFiring Line Le Sars\n","52":" Some queer entries in the logbook here. Under \nsuggestions\n \"That a division made up of officers and other ranks who by reason of bribes ‘influence’ with people of the baser sort and other reasons, have although wearing uniform and going about disguised as soldiers managed to stay in England and avoid active service – be sent out from home at once and ordered to take over this bloodiest line in this most bloody country. There are more shirkers in khaki in England than shirkers in mufti.\"\n\nUnder signals. \"Enemy has a curious signal of raising both hands above his head. Result is generally \"Kamerad\".\n\nOne C.O. refers to condition of line in bad weather as \"perfectly poisonous\" \"ghastly\" \"ruinous\" etc etc\n\nTurned out at 6 a.m. to do intelligence and feel very off colour owing to dugout life. It was a sharp morning and what appeared to be smoke was pouring out of one entrance. It was the fetid hot breath of 27 sleeping men pouring out and condensing. After breakfast Taubes came over flying very low and our machine guns opened heavily on to him. Much rumble of artillery on the right\n\n \n\n10\/2\/17 Firing Line Le Sars\n\nChief excitement during the day was doing the Disposition Report. Four men wounded in front line. One of our sergeants has been missing for a few days was discovered blown to pieces. Out in No Mans Land is an old German hospital dugout full of dressings etc etc. Word arrived of raids by 1st Div. on Maze and our action. The bombardment opened up at 8 pm and was fast and furious. We had 6 wounded in the retaliation which followed. Our patrol was out in No Mans Land at the time and had an anxious few minutes. Went up to Bunnings dugout getting some m.g. bullets round the ears. Massie had wonderful escape today. Talking to 4 men when a shrapnel burst overhead and killed them all on the spot. His coat sleeve was torn, pipe chipped, respirator ruined and helmet punctured but he had no hurt. Digging the grave is hard work and Padre is to come up before dawn.\n\n \n\nFiring Line. Le Sars\n","53":" Stayed up all night and called Hamilton who is doing Intelligence at 4 a.m. Believe that 7 prisoners were taken by our raiders at the Maze. The day was quiet and before lunch Cull and I walked over to 19th H.Q. and reconnoitred area there. We went too far to the right first and pulled up in 18th. Going over the open gets a good birdseye view of the country. The snow gradually melting but everything is white still. In a hollow lies the strafed rectangle of Le Sars. Our guns got busy on working parties and other targets and the Butte got a fair amount of plastering as usual. Turned into bed about 4 and was not resting long until the relieving C.O. turned up and we yarned for a while. The evening was quiet and Bazeley came back and had plenty to tell us of his experiences. Quite a lot of parties passing on the communication trenches on ration and other fatigues. Slept on in bunk until after midnight\n\n \n\nFiring Line. Le Sars","54":"\n\nCalled at 1 am and went up to the left company headquarters with a runner. Save for the swish of an occasional bullet things were quiet. Leaving the communication trench we passed along a sunken road through the outskirts of Le Sars which is a mass of ruins, not a vestige of any building remaining standing. Ground very slippery underfoot as we turned our towards the firing line and passed 2 stretcher bearers carrying a man down to the A.M.C. Flares going up close we stood still going over any higher parts. Bazeley quartered in a German dugout under a rubbish heap. Constant practice makes us rather adept at getting in and out of these awkward places. Returned to Bunnings and saw them there and back to H.Q. Good deal of singing and other noise on his wire and some snipers out. One of our patrols went right into his wire and heard them talking &c. The \n\n \n\n12\/2\/17 Firing Line. Le Sars\n\nday was fairly quiet and nothing was doing until evening when we had a gas alarm which did not affect us much. He sent over a few gas shells. About 11 p.m. went up to both Coy. H.Q. without any incident. The thaw has set in and the duckboards are wet and slippery. Through Le Sars ruins up to within about 120 yards of the firing line remaining frozen to the spot when any flares went up. Found everything running smoothly and all looking forward to getting out tomorrow night. Issued the necessary orders. Fritz evidently holds his line in the same way as we do and no one quite knows where he is located. All round there are numerous old dugouts and they are a monument to his perseverance and plodding methods. Kruger D.C.M. was our guide tonight and is a character of high degree. Returned to dugout and sat up all night.\n\n \n\nFiring Line. Le Sars\n","55":" Wrote letters until 4 a.m. and then collated Intelligence reports. A very quiet night. Patrol heard some Huns having a heated argument among themselves. Turned in about 7 and had no breakfast and slept on until the early afternoon. Padre called in with his comical little salute. We are going to put up a cross to Bertie Curnow and the other good fellows. \"Dulce et decorum est pro patria mea mori!\" God: how I loved Bert. The place is getting muddy again with the thaw. A couple of heavy bombardments off our front. Arranged for our 18 pounders to fire on the Quarry and they dosed it well. Batmen hard at work cleaning up the dugout of accumulated rubbish and others at work on surrounding trenches. A very good new batman named Charlesworth late \nof\n a ship’s steward. Officers back in camp are to have all preparations in the way of blankets hot meals &c ready for chaps marching in from front line tonight.\n\n \n\nFiring Line. Le Sars\n\n13\/2\/17 Heavy bombardment on right during afternoon and some 5.9’s and shrapnel dropped hereabouts. Two Huns tackled one of our planes and brought it down with machine gun fire behind our lines. Lloyds excellent artillery covering us and does nice shooting. As some of his snipers come out early and hamper our patrols I arranged for a battery to shoot on No Mans Land and search it with a creeping barrage back on to his front line. The relief was late in arriving owing to congested traffic and slippery roads. Colonel Slahe came in about 7.30 p.m. and took over. Relief complete about 10.30 pm and we set off for the Camp. A long, long way through the ruins of Martinpuich and along duckboards until we reached the Villa Station . Got on our horses then and trotted back to camp. Stewart had a great fall owing to his horse stalling but was unhurt. It was 2.30 before I got to bed. Hot meal and blankets waiting for the men at the huts. Heavy dry cold\n\n \n\nShelter Wood Camp X21d7.4\n","56":" Slept in until after noon. Dressed and had lunch and spent rest of the day quietly. At 4 p.m. inspected our 110 new reinforcements and made a short speech to them. General was in for a talk later.\n","57":" Spent quietly in camp, the men all going down to the baths and cleaning up generally. Some Taubes over during the morning and from our anti-aircraft guns some dud shells fell close round the camp. In the evening walked up with the doctor to the baths. Noticed odd graves everywhere with their little wooden crosses. What a vast army of scattered dead.\n","58":" In camp. All men on parades drill and specialist training and I put the acid on quite a number of people from Coy. Commanders down. Big ammunition dump blew up at 5 a.m. and explosions kept occurring frequently. Otherwise a quiet day. To a man who failed to rub his feet properly & got bad feet I awarded 28 days F.P. No 2 and reduced his Corporal to the ranks. Concert in evening.\n\n \n\nShelter Wood Camp & Villa Camp (XIIc)\n","59":" X21d7.4 Breakfasted in bed and then arose to a foggy thick day with dripping clouds. All getting busy once more for our shift into supports. Men rolling and returning blankets, carrying officer’s valises, drawing rations and bombs, cleaning up &c. We get enough changing about in all conscience never remaining anywhere sufficiently long in one place for it to acquire any \"home\" characteristics for us. After lunch tried a sergeant for permitting flooring boards to be burnt and reverted him to Lance Corpl at his own request. Had another up on a charge of long hair & roused him up. Moved off for Villa Camp at 5 p.m. in thick fog, the roads being crowded with troops. Sanbrook going to","60":" and two other doctors reported in usual Army messup style. All the men looked very clean and fit as they marched out the roads very slushy and muddy. Took over from 19th in camp consisting of well scattered tents. Headquarters fairly well housed in huts. Big guns round here lit up the place with lurid flashes. Rain falling steadily.\n\n \n\nVilla Camp\n","61":" After breakfast set off for firing line headquarters going first along sloppy road and then via duckboards to Brigade H.Q. Martinpuich is a mass of tangled ruins and it was rather interesting to see all the German dumps and a great deal of their ammunition – S.A.A. and shells in wicker cases. Came across two human severed legs (Hun) in field grey trousers and field boots and covered with black dead maggots. Called at BdeHQ and there saw Bazeley and got a guide. Pushed on through the village noticing some guns blocked out and then along what has been a pleasant country road. The snow has caused green grass to sprout everywhere and the country is looking very well. Much shelled is this road and by no means a health resort. When we got to William Alley we hopped in and had a grand run right up and then pushed across country to the Battalion H.Q. Very muddy and dirty and the dugout one of the most villianous ever imaginable. Concentrated smell of cooking, foul breaths & stagnation smote one on entering. Found\n\n \n\nVilla Camp \n\n19\/2\/17 Pedler in charge and Duggan in bed with trench fever and a temperature. Things quiet on the front. Got all dispositions from them and returned about 1.30 taking a different course through the village and seeing much of interest among its debris. We took a wrong turning on the duckboards and passed right out near Mametz Wood and had to walk along Contalmaison road to camp. Rather busy from now on until the evening with routine work and committed a chap for trial by courtmartial for A.W.L. and breaking guard. Working out details for this tour in the line and hope to have about 150 specialists out this time able to put all their energy into training back in camp. Noticed today many trenches where fierce fights had taken place. One concrete m.g. emplacement quite undamaged in spite of heavy shellings. One German grave with shrubs planted on it. A big observation post right up a tree too. Everyone very cheerful and in good heart, - quite different to some of the entries made in my diary when we were in the fighting at Flers.\n\n \n\nVilla Camp X11c\n","62":" A wet dripping day. Assembled all officers at 11 am for consideration of tactical circulars and then a talk about procedure in the line this time. Some of the younger subalterns need prodding up often to a full sense of their responsibility. Decided to send the men in this time with gum boots, no blankets, capes and battle order. Put in the rest of the day almost entirely indoors and received Bde. Orders and then issued our own. What a variety of things there are to think of!. Washing of feet, changes of sox, issues of bombs, gumboots, sandbags, rations grenade rifles , organization of posts &c.\n","63":" Perhaps am getting a bit dopey of late having silly lapses of memory. Dugout life is responsible. In the morning there was much bustle seeing stores and rations drawn for men going into the line. 364 pairs of gumboots arrived and were issued. Heavy howitzer across road doing battery fire in the morning a great throat of fire leaping out each time and the report arriving after. Dense fog hung over the scene all the morning and remarks were made that\n\n \n\n21\/2\/17 Villa Camp X11c\n\nit would be a good time to relieve. About an hour afterwards the whole thing suddenly lifted and if relief had been attempted the whole show would have been well messed up. After lunch our transport service still continued to have a busy time and our observers, scouts and other advance details pushed off. During the afternoon Fritz put up a heavy strafe on our supports and against William Alley. Colonel R. Smith and his Brigade Major came along about 5 for a cup of tea and soon after Major Duggan arrived also. Orders laying down no move until 8.30p.m. necessitated all hands hanging about in camp. Restless feeling possesses one for the last few hours before going into the trenches – everything is packed up, the place comfortless and all anxious to be moving off. At 8.30 p.m. girded on steel and gas helmets, overcoats &c and set off in tow of guides through the darkness along the slushy Contalmaison road and had to keep very sharp lookout to avoid going past the duckboard track. Once on them it was a devilish job to remain on them\n\n \n\n21\/2\/17 Firing Line Le Sars M16b67-M16a08 \n\nas they are so narrow and slippery and it was so dark. A winding track and a fall into shellhole full of mud and water was the penalty of a false step. Continually meeting outward traffic caused us to sidestep with mingled curses from both sides. We were leading the battalion and those we met inquired anxiously \"How many of yers?\" Stewart quizzical \"Only a Battalion\"!. left them as a rule too dumbfounded for words. A few big shells from German guns went over our heads. Even this far back we found the light of his flares of much assistance to us. Skirting the village of Martinpuich for a while we at last plunged boldly through it and wondered by the lights there that they do not strafe it thoroughly and well. Once out of the village we got on to uneven boards with treacherous gaps in them and met many tired and muddy men coming out of the line, some cheerful, some depressed and nearly sobbing with fatigue. Soon we struck William Alley and had to pass nearly a whole Battalion coming out. Squeezing past was most awkward especially for the M.O.\n\n \n\nFiring Line Le Sars M16b67-M16a08\n\n21\/2\/17 (Strachan) who had, of all things, a much beloved enamel wash basin tied to the front of his overcoat. Reaching Line we had to climb out of the trench and doing so I had the agony of putting my knee out. The pain made me very faint and it took more than a couple of minutes to summon enough fortitude to limp the remaining 200 yards with the help of a stick. The track across was in an awful condition with mud and over the tops of field boots in it. Several times one fell full length in it and at last reached the BattH.Q. The trench was in a filthy state of mud. The relief was slow in coming along owing to exhaustion of men and a mix-up on the part of Main on the left company. One runner detailed to carry a message came down the steps in a pitiful condition, he had lost his boots and hat and was in a sweating played out condition. Ration parties had a hard task in taking up the rations and Wicks later came in covered with mud and about deadbeat. Pedler in charge and wearing his crown. Only a few odd shells landing.\n\n \n\nFiring Line Le Sars M16b67-M16a08 \n","64":" Hours dragged on and there was still no sign of the relief complete message coming through. Eventually at 3.15 it did arrive and the other people moved off. Whilst the situation summary was in transit a heavy shell landed right on top of the dugout and cut the main Brigade line. Except for scattered shells and some heavy rumbling on the flanks all was quiet. Our patrols under Massie early in the night found nothing of note but once got badly lost. Later one of them ran right on to a Hun post and they blew poor little Wittner to pieces with a bomb and riddled him with machine gun bullets. A fine little chap. The others got back safely. What a filthy business this is. Sat up all the rest of the night but towards dawn got dreadfully sleepy and once carried on a nonsensical conversation while fast asleep! Groves questioned me as to the location of an O.P. out in No Mans Land and I next became conscious of having my eyes shut and replying in a far off voice \"That it was essential that men of previous experience in the firing line in France be put on!\"\n\n \n\nFiring Line Le Sars M16b67-M16a08 \n\n22\/2\/17 Having done the intelligence report turned in and slept until after lunch. Woke up for a meal and then slept on until 6.30 p.m. at which time Stewart and Groves went forward. Not a healthy sleep – a doped poisonous foul air absolutely stagnant & vitiated by the light of candles and breath of many men. No words can describe how repulsive and sickening this constant dugout life becomes and how ill one feels. Our signallers are not as good as they were owing to lack of training. Most of the old boys are no more – little Locarnini died of pneumonia the other day. Left 10 out this time for training but must increase this number next time. Stewart & Groves returned from the front line after rough travels. Things fairly quiet. 2 men wounded by shell fire. Arranged preliminaries for cleaning out Hun post where Wittner was killed. Rifle fire was opened from there on them at that time & Massie found the boy dead. Pulled the body into a shellhole. We will clean them out of here with Stokes mortar and have the 18 pounders standing by to hand out the hurry up. Sigs jargon \"Beer-E-Beer\" B.E.B. & \"Don-E-Beer\" D.E.B. sounds funny.\n\n \n\nFiring Line M16 b6.7 – N16 a0.8\n","65":" From midnight on things were very quiet until 3 a.m. when he shelled this headquarters and smashed up our lines. As damage was not promptly repaired quite an amount of roaring was done by me. Our patrols had no excitement. Wittners body has probably been collared by the Germans but they are welcome to it, all marks of identification, in accordance with our custom, having been removed from every man before he went out. During shelling 2 men were wounded on the right. Work on the posts is progressing very slowly though Engineers are up there supervising. The system of map reference we have is quite unapproachable in its accuracy and utility, but turn any average chap loose and expect him to find out within 100 yards or so where he is in this country is impossible. V.D. is more common now than any other time in our regtl. History. Corpl. Claride (who owes me 40 fcs!) Is V.D.S.C. \n\nWent to bed after breakfast and slept until 1 p.m. when lunched and gave the ingoing company commanders their orders. Colonel Forbes in and wants fighting patrols to\n\n \n\nFiring Line Le Sars M16b67-M16a08 \n\n23\/2\/17 go out in search of trouble. Arranged this and then slept on until 6.30 p.m. awaking feeling far from refreshed owing the poisonous foul air of this unventilated place. During evening things were quiet except for a heavy shelling with big stuff of our left Co H.Q. in which a dugout was knocked in and Fulton slightly wounded but much shaken. Could not turn our heavies on as their action would have stirred up further strafe and interfered with our inter-coy relief which was just starting. Screeds re F.P. No 1 tonight. In this regiment we have disciplined the worst characters and tamed lions without resorting to the degrading punishment of tying men up – a thing repugnant to every Australian. The left Coy. was relieved in good time but, as usual, the right was late. Wood of \"B\" Coy got knocked right up, bogged in the mud, and eventually was too exhausted to come out and had to be left in the dugout up there. His first time in the trenches – a rough experience but never would one of our gritty old hands throw up the sponge\n\n \n\nFiring Line Le Sars M16b67-M16a08 \n","66":" Relief completed by 10 to 1 a.m. Fulton arrived much shaken and with blood covered face having been buried by the shell which wrecked his dugout. Doctor washed him and bandaged him up and Stewart tended him like a mother and we put him to bed. In the morning he goes to the Ambulance for anti-tetanus injection and then back to Camp for a rest. Our patrols found out nothing definite. Fighting patrol on left sighted an enemy one 20 strong and returned to our lines, our machine guns could not reach them owing to dead ground. Massie on the right was almost on top of a post when he started coughing and got a m.g. turned on him. He is having a rough passage this trip in and plenty of work. Two nasty shocks in being nearly killed last time and having young Wittner killed this time. Absence of flares and inactivity in No Mans Land makes us suspect that Fritz was also relieving tonight. German body found by Hamilton was too rotten to search for identifications. Right headquarter’s dugout stinks awfully and an attempt was made to clean up the floor. Rifles clothes &c were \n\n \n\nFiring Line Le Sars M16b67-M16a08 \n\n24\/2\/17 unearthed but operations had to be suspended owing to increasing smell and not wanting to disenter the dead men underneath. Yet we have to eat sleep and have our being right on top of this & try and keep healthy. Some cases of bad feet among the men coming out & our two batmen are also bad. Bunning’s tale of troubles going in would have been amusing were it not so tragic. His scorn for one chap was very deep. This chap got bogged and said he was f – d. Bunning extended a helping hand and the beggar let go precipitating him into deep mud. During the morning Colonel Davis reported and assumed command of operations. \n\nTurned in after lunch for a sleep but could get none owing to a form of restlessness. The C.O. with the Adjutant went up to the front line and while they were away the Brigadier came in and said that it was suspected that enemy were evacuating the trenches in front. Issued orders for our patrols to go over there but they simply disappeared from view and ken and at 11.30 p.m. we had still no news whatever. Orders soon arrived to prepare to advance and necessary orders\n\n \n\nFiring Line Le Sars M16b67-M16a08 \n\n24\/2\/17 for issue of bombs rations extra SAA &c were issued. Much excitement. Soon news arrived that Mavramont and Serres had been evacuated. Orders now for certain posts to move forward and take up positions in enemy Gallwitz Tr. Issued with C.O. the necessary operation order. Information now from Brigade Major that a prisoner left behind with trench feet that the Germans have left the trench for two days. Hamilton on his return reports trench very heavily manned and wired and flares going up in many places. At midnight definite orders arrived for an attack to be delivered by 1 a.m. by the men on the posts against the hostile lines. A manifest impossibility. I moved up to the left company headquarters and found scenes of great mix-up there. Cull having been reported as going over with only 6 men. No reports at all coming back. Things very quiet in front with few flares. Forbes was in a state of intense excitement and came up. Got C.O. to shift his headquarters up here and Groves arriving I set off in advance for the enemy line. The time was about 5.30 pm & night pitch black.\n\n \n\n25\/2\/17 Gallwitz Trench\n\nMud like glue and heartbreaking. Guides had great trouble in finding their way and soon we landed at S5, one of a collection of little posts, and from there to where there was a post 26 from which I spoke to the C.O. Sounds of bombing but still no news out in front so with runners and signallers pushed on across No Mans Land – all fog wreathed and muddy. Had a rough job getting through the wire but eventually did so and came on Gallwitz trench, little groups of our men were standing along its parapet. The trench was continuous but full of mud. Jumping in I took the signallers and established a headquarters in an old German dugout and managed to ring back to Battn. H.Q. Walked along and found we connected with the 21st near Little Wood and then got into touch with Bazeley on the right. Sent Cull out to post patrols the other side of Warlencourt and before he returned sent out a small patrol towards Malt trench. Germans tried to cut off our chaps – among them was Hunt. There was considerable sniping from Little Wood which\n\n \n\nGallwitz. Tr\n\n26\/2\/17 caused annoyance. As the day went on the sun came out and observation good. It was hard to tell where the Germans were and where our people started. Lt. Smythe 24th took a patrol out \nof\n to Gamp trench and got in without loss except two corporals killed. He was supposed to establish a strong point here but did not do so. German guns were active but most shells went over beyond the rear. We could see a lot of Germans moving about all day. At 4.30 urgent message arrived by ‘phone that we would attack Malt Tr. at 5.30pm and to come along for orders. Cull had already been out to reconnoitre and reported machine guns and a number of posts as well as very thick wire entanglements in front of this trench. He had a narrow escape of being made a prisoner. Orders arriving for this attack left us very little time so I anticipated orders by issuing others to have every one ready to go over the top. Went down to BattHQ under heavy fire across No Mans Land and there got detailed orders for this attack cooperating with the 5th Bde on right and the 21st on the left. Returned at once across No Mans Land\n\n \n","67":" Gallwitz Tr\n\nin a desperate race against time and ourselves and 40 men under Corne were heavily shelled. Arrived at trench and plugged along through mud under heavy fire towards Bazeley and was just in time to see his company go over the top in their artillery formations. Caught up to him and gave him his orders which were to get into the trench and having cleaned it out to form up on the other side and then come back. The attack looked very fine as it thus moved forward. No sign of \"DG leaving at all. Enemy sent up usual clusters and an intense barrage opened on Gallwitz trench. I was in a shell hole with a runner named Morton and we were nearly killed several times the nearest shell fortunately being a dud. The machine gun fire was very intense. Pushed back through bursting shells to H.Q. in the trench and awaited reports from the companies that had gone forward. The first was one from Cull saying he was held up, that it was madness to try and get through the wire but that he would go\n\n \n\n25\/2\/17 Gallwitz Tr\n\non if ordered. I ordered him on to his (?) death in a short note \"You must go on!\" The heavy fire continued and the next thing was a Corporal stumbling in with clothes ripped about and twitching face – one of the survivors. Attack had failed in front owing to the wire and Cull (?) and Corne were both killed. There were 57 other casualties out of the 120 men who went over. They came staggering back wounded and bloody. Those who got in did some killing but deep mud held them up. Poor Cull had his leg nearly blown off and had to be left on the wire where he most likely died. I sent him to his death. No word of Bazeley at all but it seems he had attacked earlier on the other flank with similar results. Called down again to Batt.H.Q. being by this time nearly dead with fatigue, having a sprained knee and having gone 5 days & 5 nights without sleep. Reached BattHQ and found orders for another attack to be led by myself at dawn to attempt to take the trench again\n\n \n\nGallwitz Tr 26\/2\/17\n\nThe same men who had done the first attack would have to be \ndone\n used again. Issued an operation order by Col Davis and we all knew we were going to certain death. I put in a report to that effect and got it endorsed by Sale. Stewart warned 24th to stand by and just before the time to hop over 3 a.m. orders arrived cancelling the attack and asking for guides for the incoming 24th. It was great relief to get this. Relief started to arrive and by dawn most were in. With a few others I left the cursed spot at 8 am and got down to the Batt HQ at 26 Avenue. \n\nAfter a little to eat there I slept for 10 hours, found the","68":" Batt relieving us and then walked back to Shelter Wood. Tales told of Gorman wandering through Warlincourt wearing a gumboot on one foot and a muffler on the other and brandishing a tomahawk. Got back to the huts and after a meal went to bed once again and slept heavily. Our losses 2 Off Missing believed Killed 9 Missing 5 W or M 42 . Never so nearly dead in my life\n\n \n\nShelter Wood \n","69":" Must be suffering from a form of shell shock as the brain seems numb. A day after I cannot remember the events of yesterday. I send for an officer to tell him something and when he arrives stand speechless not knowing what to tell him and only long for a little rest away from things military in a peaceful region.\n","70":" Much better. In camp all day and attended a lecture by Forbes on the need of better communication. Otherwise quiet in camp.\n\n"}}