{"Document Name":{"0":"Diary_0472","1":"Diary_0472","2":"Diary_0472","3":"Diary_0472","4":"Diary_0472","5":"Diary_0472","6":"Diary_0472","7":"Diary_0472","8":"Diary_0472","9":"Diary_0472","10":"Diary_0472","11":"Diary_0472","12":"Diary_0472","13":"Diary_0472","14":"Diary_0472","15":"Diary_0472","16":"Diary_0472","17":"Diary_0472","18":"Diary_0472","19":"Diary_0472","20":"Diary_0472","21":"Diary_0472","22":"Diary_0472","23":"Diary_0472","24":"Diary_0472","25":"Diary_0472","26":"Diary_0472","27":"Diary_0472","28":"Diary_0472","29":"Diary_0472","30":"Diary_0472","31":"Diary_0472","32":"Diary_0472","33":"Diary_0472","34":"Diary_0472","35":"Diary_0472","36":"Diary_0472","37":"Diary_0472","38":"Diary_0472","39":"Diary_0472","40":"Diary_0472","41":"Diary_0472","42":"Diary_0472","43":"Diary_0472","44":"Diary_0472","45":"Diary_0472","46":"Diary_0472","47":"Diary_0472","48":"Diary_0472","49":"Diary_0472","50":"Diary_0472","51":"Diary_0472","52":"Diary_0472","53":"Diary_0472","54":"Diary_0472","55":"Diary_0472","56":"Diary_0472","57":"Diary_0472","58":"Diary_0472","59":"Diary_0472","60":"Diary_0472","61":"Diary_0472","62":"Diary_0472","63":"Diary_0472","64":"Diary_0472","65":"Diary_0472","66":"Diary_0472","67":"Diary_0472","68":"Diary_0472","69":"Diary_0472","70":"Diary_0472","71":"Diary_0472","72":"Diary_0472","73":"Diary_0472","74":"Diary_0472","75":"Diary_0472","76":"Diary_0472","77":"Diary_0472","78":"Diary_0472","79":"Diary_0472","80":"Diary_0472","81":"Diary_0472","82":"Diary_0472","83":"Diary_0472","84":"Diary_0472","85":"Diary_0472","86":"Diary_0472","87":"Diary_0472","88":"Diary_0472","89":"Diary_0472","90":"Diary_0472","91":"Diary_0472","92":"Diary_0472","93":"Diary_0472","94":"Diary_0472","95":"Diary_0472","96":"Diary_0472","97":"Diary_0472","98":"Diary_0472"},"Date":{"0":"unknown","1":1556.0,"2":1557.0,"3":1558.0,"4":1559.0,"5":1560.0,"6":1561.0,"7":1562.0,"8":1563.0,"9":1564.0,"10":1565.0,"11":1566.0,"12":1567.0,"13":1568.0,"14":1569.0,"15":1570.0,"16":1571.0,"17":1572.0,"18":1573.0,"19":1574.0,"20":1575.0,"21":1576.0,"22":1577.0,"23":1578.0,"24":1579.0,"25":1580.0,"26":1581.0,"27":1582.0,"28":1583.0,"29":1584.0,"30":1585.0,"31":1586.0,"32":1587.0,"33":1588.0,"34":1589.0,"35":1590.0,"36":1591.0,"37":1592.0,"38":1593.0,"39":1594.0,"40":1595.0,"41":1596.0,"42":1597.0,"43":1598.0,"44":1599.0,"45":1600.0,"46":1601.0,"47":1602.0,"48":1603.0,"49":1604.0,"50":1605.0,"51":1606.0,"52":1607.0,"53":1608.0,"54":1609.0,"55":1610.0,"56":1612.0,"57":1613.0,"58":1614.0,"59":1615.0,"60":1616.0,"61":1617.0,"62":1618.0,"63":1619.0,"64":1620.0,"65":1621.0,"66":1622.0,"67":1623.0,"68":1624.0,"69":1625.0,"70":1626.0,"71":1627.0,"72":1628.0,"73":1629.0,"74":1630.0,"75":1631.0,"76":1632.0,"77":1633.0,"78":1634.0,"79":1635.0,"80":1636.0,"81":1637.0,"82":1638.0,"83":1639.0,"84":1640.0,"85":1641.0,"86":1643.0,"87":1644.0,"88":1645.0,"89":1646.0,"90":1649.0,"91":1650.0,"92":1651.0,"93":1652.0,"94":1653.0,"95":1654.0,"96":1655.0,"97":1656.0,"98":1657.0},"Entry":{"0":"\n","1":"\n\n1312 day of the war.\n\nI bought this book tonight at the U.C.A. tent in the village – Coulombes . \n\nI had a letter from my wife tonight written from Geelong dated Jan 4. 1918. No. 109. There is evidently a letter missing as there is no mention made of her trip or when she arrived. \n\nFour of us, Bil Kieley, A. Johns, Ferguson myself are camped in a little room near our stables. We are paying 2 Francs a week for it. & it has only an earthen floor, but it is better than sleeping in some of the billets & we have a good fire tonight.\n","2":" 1313\n\nA fine day, frosty last night. I was doing a little Blacksmithing this evening.\n\nI am on picquet tonight from 6 to 10 past 9. I had 5 stables to go round.\n","3":" 1314\n\nA beautiful day, frosty last night.\n\nI was again out drilling this morning from 9 to 11. First there was route march, then\n\nBayonet fighting and gas drill. The time soon went round, & it is more interesting than grooming.\n\nI received a letter from my wife today dated Jan 3 No 10 & one from Eric & his mother also one from Kathleen Miller.\n","4":" 1315\n\nA beautiful day. A heavy frost last night & bright sunshine & blue sky today. \n\nThe clocks were put forward one hour last night.\n","5":" 1316\n\nAnother beautiful day. I was blacksmithing most of the day, repairing and plating two broken shafts of the mess cart. I made some needle cases out of some German cartridge cases for my sister this evening.\n\nThe Transports were paid today. I did not draw any pay.\n\nThe Canteen was sold out early this evening. No condensed milk was to be had, except Ideal\n\nIdeal\n anchor brand milk. Lieut. Phillips refused it as he said it was comfort funds stuff & they did not want it. Pte. J.G. Ferguson heard him. If it really true that Comfort fund goods are being sold at the Canteen, it is a shame & should be stopped. It is robbery, & no wonder the Canteen pays.\n","6":" 1317\n\nA beautiful day. \n\nI was again out on parade this morning. The drill was bayonett fighting. In the afternoon I was blacksmithing. \n\nI received 5 francs from P.J. Regan for making him a souvenir.\n\nI received a copy of the Portland Observer from my Father and The Leader. Nov 24\/17 from K. Miller.\n","7":" 1318.\n\nA beautiful day, I was again working on the Mess cart.\n\nI made a fridge out of 9 shell case for E. Thomas this evening.\n\nI finished reading \"Modern Geography\" by Marion L. Newbigin a very interesting book of the home University Library.\n","8":" 1319.\n\nA fine day, a little rain last night.\n\nThe drill for the Transporters is cut out for the present. \n\nI finished the shafts today, and started making a tool for making matchbox covers. \n\nI received a letter from Willie written from Weymouth & dated March 8. Also a letter from Gavin Johnson of the 24 Batt. 2 division, also 2 papers \"Hamilton Spectator\" & \"The Age\".\n","9":" 1320\n\nA fine day but very frosty last night.\n\nI with others was paraded for a bath near the village of Senenghem this afternoon.\n\nI saw Charlie Cunningham tonight. He came back a few days ago, after being over 12 months in England. He went away with trench feet. I made a tool for making match box covers today.\n","10":" 1321\n\nA fine but frosty last\n\nnight. I was on picquet last night from 13.10 to 3.15. It was an easy picquet for I stayed in bed most of the time. \n\nThere was a Kit Inspection this morning and battalion sports in the afternoon, I did not go but stayed in the Smiths shop making souvenirs.\n","11":" 1322.\n\nSt Patricks day in Coulombes. I was chaffcutting this morning. There was the usual half holiday in the afternoon. which I spent polishing some souvenirs & writing letters. \n\nSome of the lads who are of Irish parentage put up a bit of green ribbon today. All in my hut had up a piece of green although not half are Catholics.\n","12":" 1323.\n\nA fine day.\n\nI was doing a little Blacksmithing today.\n\nJ.R. Matthews returned this afternoon & is looking well.\n\nToday I was informed by Maj Boyland that I am taken off the Pioneers and put on to C. Company and remain as an attached man to the Transports.\n\nI am going to Boulong tomorrow in a motor.\n","13":" 1324.\n\nA dull cloudy morning with light misty rain occasionally. About 11 a.m. we got away in the motor cars for Boulong but not without a long wait at the Orderly room to obtain our passes. We arrived at Boulong at 1.30. had dinner and a French coffee, and spent the afternoon looking over the town. We visited the old town first which is walled in and surrounded by the new town. There is a magnificent cathedral there which we visited. There is also a crypt but we had not time to go in. Then we had a walk around some of the principal parts of the new town, bought some Post cards, visited the docks and wharfs, went\n\nthrough the fish market. had a substantial tea at 7.30 which cost 2½ francs, caught our motor carry at 8.15 and was home at Coulombs at 10.15. The usual estaminet hours are observed in Boulong so we could not get a drink after 2 or before 6, and hard drinks are also cut out, but Paddy Ryan & I managed to get a drop of brandy before leaving.\n","14":" 1325 day of the war.\n\nShowery today. \n\nTonight we had an unexpected visit from enemy aeroplanes. There were large numbers of them and evidently frustrated in Bombing Boulong or some other town. They dropped bombs quite close to here in fields & neighbouring villages, the explosions shaking the houses here & bringing down plaster\n","15":" 1326\n\nA fine day.\n\nWe heard this morning that one of the bombs fell about\n\ntwo kilometres away, and at one place a child was killed.\n\nToday I received a letter from J. Douglas Jan 20, and 4 from my wife dated Jan 10, No 111. Jan 15, 112. Jan 20 No 113 written from Geelong Jan 25, written from Melbourne.\n","16":" 1327\n\nA fine day, foggy early in the morning. We are to move of to the front at any time perhaps tomorrow. This early shift puts an end to souvenir making for a while.\n\nYesterday I sent some 6 needle cases to Sis & 2 matchbox covers, also the same to my wife, with a brass stand extra.\n\nToday I gave a brass jug made out of an 18 pound shell case & several matchbox covers to Lieut N.G. McNicol.\n\nWe are to leave here early tomorrow 5 new men were added to the Transports today and some of the attached men made drivers also some are going on leave tomorrow.\n\nI am picquet tonight from 12.30 to 3.30, third picquet. Many of the lads & officers were up when I came on picquet expecting orders to move at any time.\n","17":" 1328\n\nRevellie at 6 a.m. The hack men I called when I came off picquet. We left Colombs at about 10 and travelled the usual route until we passed Lumbres when we took the main road to St Omer and camped for the night at an adjoining village St Martin au Laert arriving in good time at 3.30. I was brakeman for W.Kiley and rode by turns with him This little village adjoins St Omer which we visited after tea and saw the church which is a very handsome cathedral both inside and out, also the french barracks now used by the British & the town hall.\n","18":" 1329.\n\nCold last night but hot again today. Revellie 6 a.m. We left St Mark au Laert at 8.30 & passed through Arques and halted at Wardrecques for dinner, also tea.\n\nThe Germans have launched there offensive on a 50 mile front from the to the Oise. \"The attack is on a larger scale than any other that has been made at any stage of the war on any part of the front\". Some of our outposts have been withdrawn, but the attack has failed in its objectives.\n\nWe are staying at Wardrecques for the night awaiting orders. Some of the transport went for a swim in the canal. There are many rumours of a big reverse in the area of the enemy attack.\n\nThe Colonel came around and said we were too heavily loaded so we dumped a lot of extra clothes, blankets & other things we were carrying. They will go into salvage. I put in an overcoat, tunic & sheepskin jacket & gloves.\n","19":" 1330\n\nCold & cloudy all day.\n\nWe will be here all day also the Battalion & will move sometime tonight to the railway station at St Omer and then travel south to the scene of the big enemy push.\n\nAll sorts of wild rumours are afloat but it is certain that the British have met \n\nwith a big reverse but they have retreated in good order & probably it is to encourage the enemy into a trap.\n\nWe left Wardrecques at 8.15 tonight and arrived at St Omer about 10.30, then a long wait before we boarded the train. During the wait a few of us got a feed at one of the cookers & a cup of hot tea at the Church Army hut. At 2.a.m. the train started & travelled all night until we came to St. Pol at 6.30 were we stopped for breakfast.\n","20":" 1331\n\nWe stayed an hour at St Pol which is a fairly large station and the yard was packed with locomotives, many french, many had steam up and others were in a damaged condition. At 9.30 we stopped for a short time for the troops to get out if they wished. Later we had dinner and some hot tea which latter we bought at a canteen. About 1pm\n\nOne OClock we arrived at our destination a town called Mondicourt before we reached we had news of a retreat and we saw civilians in all kinds of vehicles & on foot hurrying to the rear. At Mondicourt Transports and soldiers were everywhere all retreating, and it was reported the enemy cavalry was only 5 Kilometers away. Children in perambulators, old men & women on foot carrying all kinds of bundles vehicles from wheel barrows to wagons all laden with household goods & bedding some on bikes others leading horses & cows and all fleeing before the enemy and wearing careworn & haggard looks. \n\nThe Battalion formed up, mules, horses & waggons were unloaded & quickly harnessed up and took their places awaiting instructions. Then we proceeded to the front, passing many Scottish & English Battalions with their transports until we reached Authie at 8.p.m. & halted for the night. Here\n\nwe heard that the enemy was held in check a considerable distance away & that two spies were shot in the town that day.\n","21":" 1332\n\nRevellie 2.20. Cold & frosty. \n\nAfter a scanty breakfast consisting of tea & bully beef we pulled out of Authie at 4.20 and reached a place called Leicester Square in a forest, just near a village. Here we halted for 3 hours and had some hot tea & bread & jam. At 9.20 we were on the move again & passed through several villages travelling mostly in a Southern direction, through Puchevillers, Herissart & Contay & halted on the roadside at 2.p.m for dinner staying there until after 4 for the road was blocked. \n\nSince we left Mondicourt in 9a we have been in the Somme area. We passed this morning streams of villagers in all manner of vehicles leaving their homes & taking some of their possessions with them. A great many were wheeling wheelbarrows and Prams & others were carrying\n\nbundles, & they were of all ages, but mostly women & children. Some were on the verge of exhaustion for the country is hilly & there loads were heavy.\n\nThe road was so congested with traffic that we only went a very short distance by 6.p.m. we passed through several villages, over ridges and wide undulating plains until we passed through Frainville and halted at 9 O’clock near Huilly which we passed through.\n\nMost of these villages were deserted by the civilians, only soldiers remaining.\n","22":" 1333\n\nWe slept under the limbers last night. Today is cloudy & looks like rain. The other transports halted further back and some of them were shelled last night the lost 16 mules killed & wounded & had several men injured .\n\nSince we left St Omer our provisions have been very scanty, but we had a good\n\nbreakfast this morning. Already some of our Batln were wounded yesterday. The enemy advance has been arrested but he has evidently got some of his guns up for he is shelling today.\n\nI heard that 35 animals were killed last night & that the 40 had a direct hit on a bomb waggon. I slept under our bomb waggon last night. Therefore we had orders to shift all ammunition waggons away from the others.\n","23":" 1334\n\nThere were frequent showers last night & a very heavy shower this morning. The weather always seems to favour the enemy. He had fine weather for his push now it is cloudy, & we cannot see what troops he is massing, & he has wet weather now that we are prepared to drive him back.\n\nLast night our guns came up & are in positions all around us. They bombarded the enemy last night & this morning. Our Battalion & the 45th were badly cut up yesterday through advancing in the daylight. Among the killed was Sgt. Davidson brother of our late Chaplain \n\nI had some buckshe wine this evening being from an abandoned store in the village, there was a cask of it. We\n\nhad poultry for tea which were caught this morning in the village. Poultry, pigs wine they can be obtained for the taking. I received two Weekly Times this evening. Dec. 8 & 15.\n","24":" 1335.\n\nVery quiet last night & no rain but cloudy. There is great enemy activity in the air this morning. & for several hours after day light our archies were in almost constant action on our right & the 6 in Howitchers on our left.\n\nThere is constant reciprocal activity all morning by the artillery. I had a good look at the Howitzers in action yesterday. The report behind the gun is ear splitting.\n\nI had half a bottle of cider before breakfast & some after. I was detailed for a pack sprint yesterday, but it did not come off.\n\nThe enemy is shelling Heilly this morning. I was in the village yesterday for a few hours on duty. During this past few days there are persistent rumours that Ostend & Zeebruggie has fallen to the Americans\n\nand Lens to the Australians. Also that we have advanced 12 miles at Passchandale. In the retreat here the Germans claim to have captured 45,000 prisoners.\n\nThere was a terrific bombardment at midday which lasted a few hours. The Germans attacked in ten waves, and were mowed down by machine guns and artillery at point blank range with two second fuses. There was light rain all the time which continued most of the evening. The bombardment was again resumed in the evening.\n\nWe had poultry for dinner & tea. I had some good cider this evening and when I was on second picquet I had half a bottle of champagne which was carried from a factory in a deserted village near the enemy. There is a distillery in no mans land said to contain @pound;5,000 worth of champagne wine etc. This part of France is a wine producing district.\n","25":" 1336.\n\nQuiet this morning. The horse lines are terribly cut up since the rain for we are camped in a ploughed field that had a young crop of\n\noats growing, but which is mostly all fenced off. We salvaged several bags of oats & barley & a kit of engineers tools yesterday.\n\nLast night I received a \"Weekly Times Dec. 22. Christmas number. It was very interesting. \n\nI heard from E . artillery that the German advance was on a front of 55 miles to a depth of 20 to 25 miles. 30 miles of the front being French. \n\nWe had roast pork for tea also a little champagne. Many of the men were drunk last night & have sore heads today.\n","26":" 1337.\n\nEaster Monday.\n\nThe horse lines are in a sea of mud, but this afternoon is fine, and the weather seems to have taken up a bit.\n\nThere was pronounced enemy aerial activity this morning , & one bomb fell not far from our lines early this morning.\n\nThe artillery around have also been pretty active in straffing the enemy.\n\nStarky Treginza was up before the major for being drunk & away from parade. He was admonished and given 7 days Royal Warrant.\n","27":" 1338\n\nThe weather has\n\nimproved a little.\n\nToday the enemy is shelling villages behind us and also on our left.\n\nI wrote to Cis today.\n","28":" 1339.\n\nA fine day but threatening rain in the afternoon.\n\nI was on cooks fatigue all day. It is not a bad job, but there is a lot to do.\n\nThere was great aerial activity by the enemy this morning & occasionally throughout the day.\n","29":" 1340.\n\nA wet showery day, with mud & slush everywhere.\n\nThere was a constant bombardment last night which grew in intensity towards daylight, and continued at intervals throughout the day.\n\nA. Holmes said in the cook house today, \"rather than be captured he would put a bullet through his head & was promptly counted out. I was on cooks fatigue today. \n\nThis morning an aeroplane with British markings on it , flew\n\nover our camp and the surrounding batteries. There is a battery on each side of us & one in front of us.\n\nAbout an hour & a half later the battery in front of us was repeatedly shelled. Evidently the plane was one of ours that was captured by the enemy.\n\nValentine, Ferguson & Cliff Thomson returned from leave this evening.\n","30":" 1341.\n\nA dull cloudy morning.\n\nAt breakfast time between 7.30 and 8.30 the enemy started to shell a brick wall & house on the side of a hill, a few chains away from us. Later he started searching and came very close to the cook house, when we thought it was time to go. The shells came over thick & fast mud & dirt & fragments scattering among us. But some did not get away fast enough, and Trevena who was going to have a shave was severely wounded, having one leg badly fractured and the other foot broken, also a head wound. Four others were also wounded the cook, Price, and Ferguson\n\nGillespie and an A.S.C. driver who was with us. Five in all. The wounded were carried & helped out of the line of fire & taken to the Hospital while \nwe got\n the rest of us took away the horses & mules further up the road. Later we returned and took away the limbers and later still our blankets & made a fresh camp half a mile away. We had no dinner & appreciated our tea. The enemy kept on shelling at intervals for several hours, and the batteries replied vigorously. One of the shells fell on the track from my tent to the cook house which I had travelled a few moments previous and \nanother\n two others equally as close to the tent riddling it with holes.\n\nOur camp is now situated in an old quarrie half way between Heilly and Corbie and some dg holes in the bank & others slept in the open.\n","31":" 1918.1342\n\nA fine day.\n\nBetween 11 & 12 o’clock the enemy droped bombs near us evidently in quest of the artillery & turned the machine gun on. The bombs fell in the swamp between us & the river & some near our old camp.\n\nThey also turned the machine gun on the various transports, but all got under cover. The 40th Transport had a machine gun & turned it upon the enemy.\n\nI received a letter from Kitty Martin today dated March 25.\n\nThis afternoon there was brisk aerial activity between our planes & the enemies. The machines were brought down & I saw one fall in flames, but dont know whose it was.\n\nI have been on cooks fatigue all day.\n\nA mail came in today.\n","32":" 1343.\n\nI was on picquet last night from 6 to 9.\n\nThere was a lot of rain last night and we were almost flooded out of bed as the rain came through the Tarpolen.\n\nFrom about 8 to 9.30 the artillery on our right bombarded the enemy with great intensity\n\nYesterday the enemy had up 3 baloons & today at least half a dozen and we have none but our numerous aeroplanes keep an effective watch. Presumably all ours have been captured in the recent disastrous retreat. \n\nI saw a paper tonight the first one since we have been on the Somme \n\nBy the way the name of the river that runs through this valley is the Ancre and there are high hills on each side with villages in the valley every few kilometers.\n","33":" April 8.1918. 1344.\n\nA wet miserable day, and it was a misery cooking at an open fire in the rain. After tea the lads collected some saplings & a bags & hessians and put up a cook house against the side of the quarrie. The fire is still in the open, but we have a dry place to do the cooking & to keep the food.\n","34":" 1345\n\nMisty but fine today, but started to rain again tonight. There was a constant bombardment of the enemy by our artillery this morning. \n\nToday all the Transports were marched into Heilly, and examined by the doctor. Several were picked out for further examination on account of lungs &heart.\n\nThis morning at Merricourt Hughie Gannon was gassed and Bil Gray wounded while camped there last night. They are both cooker drivers and were there with the cookers.\n\nThe enemy shelled Heilly & other villages early this morning.\n","35":" 1346\n\nA cloudy misty day.\n\nThere was a horrific bombardment last night which continued throughout the day at intervals.\n\nI received a parcel today containing 1 pair of socks, 1 tin of butter & 1 tin of cafe au lait from my wife.\n\nThis afternoon the enemy flew over Bonnay & around our camp in one of our aeroplanes and dropped a bomb on Bonnay.\n\nAs our position was wanted by the artillery to put in some more guns we had to shift after tea further up the hill & to the right. It was about 10.p.m. when we got finished & to bed.\n","36":" 1347.\n\nA misty morning but warm throughout the day.\n\nI built a cook house by digging a hole into the bank two posts in front, a few sticks for rafters & a tarpolian for a roof. I will sleep in it tonight pending making a dugout. Last night Cliff Thomson & I slept between two bales of hay & some sheets of iron on top.\n\nIt is very cloudy this afternoon & warm. There are numerous planes about including some of the enemies.\n\nMajor Storey has been reappointed Second in Command and reinstated.\n\nThere are many rumours afloat concerning big British losses\n\nin the neighbourhood of Armentieres, Plougsteert & Baileul.\n\nThere was brisk enemy aerial activity here tonight and in the direction of Amiens. Many bombs were dropped and numerous machine guns, archies & searchlights were engaged in the defence. Two Australians were brought down this afternoon by a Gotha both were wounded by machine gun fire.\n","37":" 1348\n\nA beautiful day with a warm bright sun shining.\n\nThe enemy has numerous observation baloons up today. We have a few on our right.\n\nThis afternoon one of the enemies observation baloons was brought down in flames by our airmen\n\nJust before dark the enemy landed two big shells on a heavy Battery to our right one shell landing in front & the other behind it. The gunners cleared in all directions. There was a lot of aerial activity by the enemy in the night. A heavy bombardment by our guns was kept up to night.\n\nFour men who left Columby on leave, Bil Wilson, Amos B.L. Dowden & Warde returned to night without getting any leave.\n\nThey got as far as Calais and were recalled to make trenches near Messines.\n\nI am on picquet to night. From this on the picquet starts at 9 o’clock instead of 6, there is only 3 shifts instead of 4. I am on second shift from 12.30 to 3.30. I am doing Holmes picquet for 5 francs.\n","38":" 1349\n\nCloudy & windy today, - a strong N.E. wind which is rather cold.\n\nThere has been intermittent artillery activity all day on this front, and to the S.W. of us with great intensity.\n","39":" 1350\n\nAn exceedingly cold & bleak day with a strong E.N.E wind.\n\nOur camp is high up on the side of a ridge and the wind sweeps along it. This ridge is facing the south, is cultivated to the top, the fields being in terraces like steps of a stairs. In the face of the terrace, the numerous Transports camped on the ridge have dug in to protect themselves from bursting shells. At the foot of the ridge there are numerous batteries, and lower down the river Ancre flows, another ridge arising on the other side, and also\n\nbristling with guns and Camps. On the top of our ridge and behind us, a line of trenches have been dug and wire entanglements erected.\n\nC. McGloughlan took a Limbre into Amiens today. The enemy was shelling the city & very few civilians were to be seen. Early in the war the people paid a large indemnity to the enemy to spare the city. Now he is constantly bombing it by night & shelling all the time.\n\nThe enemy now occupies Plougsteert wood. Neuve-Eglise, & there is heavy fighting around Baileul.\n\nMonday April 15. 1918. 1351.\n\nCloudy but much finer.\n\nThis front is fairly quiet today except occasional artillery activity from big guns.\n\nThis evening I received a packet containing 7 letters. 1 from Cis dated Feb. 15. No 11. & six from my wife No.114 Jan 27. 116 Feb.5 115. Feb.4. 117. Feb.10. 110. Feb 13 and 119.","40":"\n","41":" 1352.\n\nCloudy with light misty rain.\n\nAt midday the artillery severly straffed the enemy for several hours.\n\nI am on picquet tonight. I drew 2 picquet at 12.30 to 3.30.\n\nOne of the enemies floating baloons dropped alongside our camp. It was composed of paper (red) and was inflated with hot air. They use them for\n\naviation purposes to ascertain the strength and direction of the wind currents as a guide to the artillery and aeroplanes.\n","42":" 1353\n\nCloudy & misty with a few misty showers in the afternoon.\n\nThere was a very heavy bombardment during last night which lasted most of the night. There was only a feeble reply from the enemy.\n\nWe have orders this evening to have everything packed ready to move at short notice in case of a retreat. The heads have evidently the wind up.\n\nWe were paid today, but I did not draw any money.\n","43":" 1354.\n\ncloudy & misty.\n\nLast night was very quiet not much artillery work. A raid is daily expected from Fritz.\n\nAfter dinner today we packed up to leave here to go to a little village called Franvillers about kilometres away, and further to the rear. The Transports got away by 2.30 and the cook & I with several others remained behind to guard what was left until the Limbres returned.\n\nWe left about 4 and arrived an hour later at our destination in a dilapitaded old village consisting mostly of mud & plaster houses on brick foundations. We had to light a fire against a wet wall in a corner & it was 8 o’clock before it was ready, but we had comfortable billets to go into for the night.\n","44":" 1355.\n\nCloudy all day, light showers & a few flakes\n\nof snow in the evening.\n\nAfter dinner we transferred the cook home to an old shed near the horse lines, and we have now a dry place to keep the food in, the fire is outside as the sides of the shed consist of straw & thatch with a tile roof.\n\nThere was an issue of 2 green envelopes this evening, and yesterday an issue from the comfort funds of Cocoa au lait, and biscuits & cigarettes.\n","45":" 1356.\n\nCloudy but fine today. There was a heavy frost last night and it is again frosty tonight. \n\nToday was fairly quiet.\n","46":" 1357.\n\nA beautiful day.\n\nThere was some aeroplane activity by the enemy today, but over archie. Kept him high up, two duds fell close to our cook house one of them at dinner time. A few papers came to the town yesterday & today. They report that the enemy is held in check everywhere.\n","47":" 1358.\n\nA beautiful day\n\nEarly this morning the last picquet saw one of the enemy planes brought down near the trenches. It was surrounded by four of ours. \n\nSnowy Price is likely to be away for a few weeks longer on account of his teeth.\n\nI walked to Heilly this evening with Alick Holmes who wanted to see the Pay Sargeant. Franvillers is about 1½ miles from Heilly.\n","48":" 1359.\n\nA beautiful day.\n\nOur artillery severly bombarded the enemy last night for several hours and again this morning. There were several enemy aeroplanes over this village today, but our archies and machine gun barrage kept them from observing.\n\nI wrote to Tom Douglas \n","49":" 1360.\n\nCloudy all day & misty in the evening.\n\nThere was intense artillery activity last night, and frequently throughout the day. The enemy is using a larger number of gas shells and has been\n\nshelling Heilly Merricourt and other villages in the valley. On our right he partially succeeded in breaking through early this morning. \n\nToday orders were given to be ready to move, and the Brigade was to be relieved. Later it was cancelled & we are to remain here for the present. as the 4 division that was to relieve us has to go elsewhere.\n\nI am on 3rd picquet tonight.\n","50":" 1361\n\nA cloudy day, threatening rain in the evening.\n\nAn enemy plane was brought down this morning by machine gun fire.\n","51":" 1362.\n\nCloudy all day.\n\nThere was the usual artillery last night & at intervals throughout today.\n\nI received a letter from Willie today dated April 19 & written from Weymouth. He wants to go to a Scotch port & embark for Australia via the Panama. He is very jubilant at getting back.\n","52":" 1363.\n\nCloudy weather.\n\nThis front has been very quiet all day. The water here for the Horses has been condemned & all transports have taken their animals a distance of about 4½ kilometers to water.\n\nThere are no wells in this village, all the tanks are filled by rain. This is the \n\nfirst place in France where I have seen a scarsity of water.\n\nDuring the past few days some of the French farmers are showing their confidence in the Australian troops by starting farming operations, such as ploughing harrowing and sowing. It is a shame the way some of the growing crops have been trampled over and cut off by horses & mules. Battalions guilty of it should be made paid for it.\n","53":" 1364.\n\nCloudy all day & showery this evening also showery last night. Lately it has been exceedingly bad weather for observing.\n\nA few copies of the Paris edition now come to hand. The war news is now much more brighter for us. Concrete laden old transports have been sunk in the entrance to the channel at Zeebrugge & Ostend, and the Mole at the former partially destroyed & men were landed on it, the guns seized & turned upon the enemy. Elsewhere the enemy has been held in check.\n\n(The notes in this book have been written at all hours of the day and night, and in all sorts of places, in dugouts, at the cooks fire, in billets & while on picquet, & in all sorts of lights, but generally very poor, & mostly at night)\n","54":" 1365.\n\nThere was a very heavy bombardment of the enemy last night & early this morning. The French & Australians had a very successful raid taking 6 rows of trenches so it is reported.\n\nA section of American Engineers are now camped in this village. They came this afternoon and are a fine set of men. They gave me a clip of American cartridges for a souvenir. Their equipment is better than ours being lighter & their cooker can burn wood, coal or Kerosene.\n\nThis evening several of our planes surprised an enemy plane that had just emerged from a cloud & forced it to land behind our lines.\n","55":" 1366.\n\nShowery most of the day.\n\nThis is the first village that I have been in, in France where there was any difficulty in getting water. There is one well in the village & it is 250 ft to the water. Most of the water is carried 4 kilos & when the tanks are empty we have to fall back on the well.\n","56":" 1367.\n\nMay Day! What a contrast to May Day in Australia & especially in Melbourne. Here all is war & preparations for war. There war is unknown & its horrors unrealized except by the few\n\nCold & cloudy this morning.\n\nThis evening & tonight our artillery severely straffed the enemy.\n","57":" 1368.\n\nA fine day.\n\nI was up early this morning & got the breakfast ready. The artillery continues to bombard the enemy this morning. Yesterday 4 tins of cocoa & milk were issued to the Transports for 40 men, & today we had it for dinner. It was rather wishey washey.\n","58":" 1369.\n\nA fine day but rather cloudy.\n\nBefore breakfast 2 enemy planes were brought down this morning, near the \n\nTransport lines. \n\nI was on second picquet last night from 11.25 to 10 to 2.\n\nThis evening I went for a drive on the water cart with A. Valentine to Behencourt about 4½ kilometers away. While there I was able to get a paper and had to pay 3d for it.\n\nThe Americans are now in the thick of the fighting and are giving a good account of themselves.\n","59":" 1370.\n\nA fine but cloudy day.\n\nThere was the normal artillery duel last night and at intervals throughout the day. As I write it is being renewed for the night.\n\nSnowy Price our cook returned from the Base tonight. So my position as second in command in the Cook House finishes tonight.\n\nWe heard a few days ago that Trevena has had his leg taken off.\n\nWe had to remove from our billet (at least those who were in it, for most of the men slept in other billets & in tents) to make room for other troops. My mate Attenborough & I are sleeping under a cart in the cook shed.\n","60":" 1371\n\nA dirty drizzling morning.\n\nI am on my old job again doing odd repairs to Limbres, etc.\n\nTonight if required I am breaksman on C.C. McGlouchens Limbres for R.E. duties.\n\nThis evening I received another letter from my dear wife dated March 5. No 123.\n\nshe mentioned that she received my diary No. 6 & a letter from Ireland\n","61":" 1372.\n\nAt 7.p.m last night orders came through for 5 limbers for Engineers and we got away at once to the dump in this village but there was not enough material for us to load up so we picked up our load at Heilly and at Mericourt, and then passed on through Ribemont and Breur passing Treur on our right. At Breur a guide met us and we delivered our load near a cemetry not far from the front line. There was a company of men to carry the pickets which our loads consisted of to the required place for wiring. Then we turned and came back as far as Riebemont, and from there took another road which led us on to the main Albert-Amiens road & arrived back in Frainvilliers at 11.30. Our journey to our destination was about 6 miles and the short way back about 5 miles. This morning we lay in to 8.30 had breakfast & was on Parade again at 9.a.m nothing the worse for our journey. There were few enemy shells, but most of the time our artillery was blazing away & with the limber rattling over the cobbles & through the slush the noise was deafening. The only discomfort was the drizzling rain which continued most of the time going up.\n\nA large number of prisoners were brought in this morning about 200 by our Brigade.\n","62":" 1373.\n\nA wet miserable day with an opressive steamy heat. \n\nI am to go as brakesman to Mericourt after dinner with J. .\n\nAt Heilly we picked up 15 cases of S.A. ammunition& proceededed with it to Batln. HQuarters at Mericourt and returned before tea without any adventures.\n","63":" 1374.\n\nThere was a terrific bombardment of the enemy last night which continued throughout the night. During the past few days we have been expecting a shift at any time and it came this morning. We rolled up our kits loaded the limbres and left Franvillers about ten and camped in a wood about two kilometres away. Then W. Richy & I went to the D.A.C to exchange our bombs for new ones. We passed through Franvillers, La Houssoye and reached the D.A.C on the main road before we got to Pont Noyules and was back before 2.P.M.\n\nThere are over a dozen tanks camped in the wood and I had a good opportunity this evening of examining them at close quarters. They are armed with a 6 pounder gun on each side\n","64":" 1375.\n\nA fine morning.\n\nThere were persistent rumours during the past week and supposed to have come from enemy sourse that they\n\nwere to shell all back arears yesterday. It did not come off but last night he put a few shells into Franvillers, and one into a house where some of our men were camped & a few horses stabled. So we had just shifted in time.\n\nThis wood is now litterly packed with men. There are various Transports including some from the 2 Div, 24 Battalion which is releiving us, Tank men and two Battalions of the 3rd London Brigade which came this evening. I was at one of their concerts this evening & had a very good time. We are to move off in the morning for Allenville.\n","65":" 1376.\n\nAt about a quarter to 12 I was awakened by the picquet to go as brakesman on an ammunition Limbre. When I got up I found that it was to go to Allenville, so I rolled my blankets and was on the road soon after 12. We had to wait a while in Franvillers to load some ammunition and then we followed the battalion through La Housseye, Pont Noyulles and reached Allenville at 4.45. had breakfast did an hours picquet and the lay down on some straw in a shed for some rest & if possible some sleep. All the cookers & the S.A.A. waggons are here The others will follow today.\n\nWhen I woke up it it dinner time and all the other limbres had arrived, and some of the tents were up. But the Colonel gave orders that we were to sleep in the billets assigned to us, which was a comodious shed owned by Hennessy the Brandy distillers.\n\nWe slept upstairs along with the whole Battalion.\n","66":" 1377.\n\n A cloudy day but fine.\n\nThere was kit inspection today, and when it was on all the Farriers were called away, to undergo a test.\n\nI was at a concert given in the aerodrome this evening. There were two concerts going at the same time given by the and the Bandicoots.\n","67":" 1378.\n\nI paraded sick today because I had the influenza & was told to stay in bed all day which I did.\n","68":" 1379.\n\nA fine day. A hostile plane was over the village last night & was received with a hot fire from machine guns & archies. I again paraded sick this morning, & was given medicine, & am to stay in bed all day.\n","69":" 1380.\n\nMuch finer today but very muddy.\n\nI again paraded sick & was given no duties ordered to bed & a sleeping draught.\n\nAllonville is a fair village and the seat of Jean Hennessy the brandy & whisky distillers. It has the usual large church & spire but the building is in a better state of preservation than most village churches & it is built of bricks. Aimens which can be plainly seen, lies in a depression about 4 kilos away. Its magnificient cathedral stands out promently. Looked at through the glass its bears some shell scars, for Aimens is shelled both day & night, at irregular intervals & in the early morning it is bombed all this with the last few months. And from having a population of some 200,000 it has dwindled down to 200 who are living in cellars, & are there only by permit.\n\nWe are now a mobile Brigade, and are under 20 minutes notice to move at any time, but it cannot be done especially at night.\n\nI sent a whizbang to \n","70":" 1381.\n\nA beautiful day Nice warm Sun. I did not parade sick today, as the day was so fine and I felt a lot better. I am doing light duties, helping to clean a Limbre\n\nTonight a number of Aeroplanes came over & were subjected to a lot of fire from machine guns and archies. They could be plainly seen in the rays of the searchlights which made them look like big transparent crosses in the sky They are flying low.\n","71":" 1382.\n\nA hot day. I am taking things very easy today. There is not much to do and the heat is very trying.\n\nThe heat this afternoon was very intense, especially late in the evening, about 6.P.M.\n\nI was on picquet (4) \nthis morning\n today from 4.30 to 7. It is a \n","72":" 1918.1383.\n\na beautiful morning. I had a very easy picquet this morning. The horses being in a stable they required no attention, & the morning was an ideal one. It is going to be another hot day.\n\nThis morning at the aerodrome there was a march past by the whole battalion with the Transports before General Monish\n\n \n\ntaking things very easy today. There is not much to do and the heat is very trying.\n\nThe heat this afternoon was very intense, especially late in the evening, about 6.P.M.\n\nI was on picquet (4) \nthis morning\n today from 4.30 to 7. It is a \n\nFriday May 17. 1918.1383.\n\na beautiful morning. I had a very easy picquet this morning. The horses being in a stable they required no attention, & the morning was an ideal one. It is going to be another hot day.\n\nThis morning at the aerodrome there was a march past by the whole battalion with the Transports before General Monish and after dinner another before Sir Douglas Haig and party. It made a lot of extra work for the Transports all the other Battalions of the Brigade were present. There was a lot of adverse criticism by the Transports, some wishing that Monish was present as they considered it was only a waste of time & effort, in the hot sun, & delayed other & more useful work.\n","73":" 1384.\n\nAnother hot day but not so hot as yesterday, thunder & threatening rain in the evening. \n\nThere was a brigade show this morning being a competition between the Battalion Transports. The 38 Transports got 1st for everything, including the best Transport & the best cooker, the best Limber and pair etc. the 32nd running second in some classes. The show was held in the aerodrome which by the way is not now used as an aerodrome owing to it being so close to the new front. It was 1130 when we returned. There were seperate judges for Limbres, harness, mules & men.\n\nThese inspections and shows have been nic-named by the troops \"Winning the war\".\n","74":" 1385.\n\nAnother hot day.\n\nThere was an issue from the Comfort funds of Havelock cigarettes and also cocoa which we had for dinner. There was also an issue of green envelopes but not enough to go round. I posted to my wife today the flower vase which I made out of a French 75. The reason of the delay was the trouble I had getting it censored. Our dope spent a week considering it, & making enquiries while Mr Carey offered to do it for me.\n","75":" 1386.\n\nYesterday the enemy exploded some shells over the town & in the evening put in a lot of gas shells on our right. It is again hot today.\n\nI finished reading a book \"Manalive\" by C.K. Chesterton.\n\nThis evening hostile planes dropped bombs in the vicinity of our camp. They were driven off by machine gun fire.\n\nA.Johns who ran amock one night on picquet by firing 4 rounds rapid at an imaginary man in the stables, and Huie Gannon have received notice to hold themselves in readiness to go to the Base. They are both over 50 years of age.\n","76":" 1387.\n\nAnother hot day.\n\nThe bombs last night fell near the abandoned aerodrome and several of the A.U.C. were wounded also A.S.C men total 22. casualties. 3 killed 19 wounded.\n\nI received a letter yesterday from Kitty Martin dated May 13.\n\nWe are to shift tomorrow early, as the Battalion is going into the lines\n","77":" 1388.\n\nAnother hot day. The Transports & the Battalion left Allonville about 8.a.m. this morning. George Dodd & I stayed behind to tidy up the stable.\n\nThere was a heavy bombardment last night & this morning also the night before. \n\nLater they returned with the Limbers & removed 2.U. stoves worn fitting etc. & left about 1 a.m. and travelled about 6 kilometers & camped on the road along the river Somme half way between Lamotte and Came on . We missed our dinner & before tea I had a refreshing bath in the river for the day was very hot although a few drops of rain fell.\n\nOn Sunday night hostile aeroplanes in relays dropped bombs on London. Casualties nearly 200. 9 Gothas were brought down.\n","78":" 1388 \n\nI am 18 months in France today. I would not like to put in another 18 months.\n\nThere is a cool change in the weather. A cold wind is blowing from the West.\n","79":" 1389.\n\nA cold windy miserable day. Early this morning the enemy put over 5 big shells on the next ridge across the river evidently in search of guns. C.Charles was sent to the hospital today suffering from sciatica in the hip. The day we left Allonville Hughie Gannon was sent to the base on account of indisposition & being over 50.\n","80":" 1390.\n\nMuch finer today not so windy.\n\nJust before dinner W. Richy was kicked by a horse while watering his mules. He had it attended to at the dressing station & returned to the lines again. \n\nThe enemy bombed some of our largest hospitals behind the lines. 20 machines took part in the raid, & were in two squadrons. A lot of damage was done hundreds being killed & wounded. Great indignatiess is felt.\n\nLast night a horse disappeared from the line presumably stolen, as he was securely tied. Tonight the picquet is doubled. Two men on at at time. I am on last picquet with Ferguson.\n","81":" 1391.\n\nA fine morning.\n\nDuring all the time I was on picquet there was an intense bombardment which gradually died down after 7.a.m. No one molested the horses or mules. There were 31 horses & 23 mules total 54. The Sargeant & George McLoed salvaged some flour last night at Villers Bretneaux and were caught in the evening barrage and had to take shelter in shellholes.\n\nWe had a half holiday this evening.\n","82":" 1392\n\nA fine day. Windy in the afternoon. This morning General Birdwood presented medals to men from various units under his command. They were drawn up on a vacant piece of land in front of our Transports. He addressed the men & expressed his sorrow at leaving the Australians to take over another command. There was another heavy bombardment last night. I walked down to the 2’M. Stores at Lamotte this afternoon to post some whizbangs. At dinner time today the enemy sent over about a dozen large shells right over our camp towards Amiens.\n\nTuesday May 28. 1918. 1393.\n\nI am in the army 2 years and 3 months today. \n\nLast night there was again brisk artillery activity by the enemy in this sector. He shelled the adjoining village of Camon & did considerable damage. Among the casualties were Captain Drew of the A.S.C & a french newspaper girl. There was a direct hit on the A.S.C. stables. The Red Cross dressing station alongside of us had several calls made on them yesterday & today.\n\nThis afternoon I received 4 letters from my wife dated March 13 (124)","83":" (125) March 27.(126) March 28.(127) also one from Cis dated March 22(12). All my diaries up to the end of the year had been safely received also a parcel (through Cpt. Davidson & some letters & P.Cards from Ireland & England.\n","84":" 1394.\n\nThere was intense reciprocal artillery activity in this sector last night. Enemy big guns shelled back areas from the direction of Villers-\n\n-Bretonneaux. There is also a big battle going on in the Reims sector (vide Daily Mail ) The attack is on a wide front on the Aisne. The British have been forced to give ground on the Chemin des Dames. A big gun has also shelled the Paris district.\n","85":" 1395.\n\nA nice warm day.\n\nThere was considerable artillery activity by both sides last night & this morning. The enemy was ranging over the camp this morning, three shells burst high in the air forward of us, but done no damage. He was again ranging over the camp at dinner time & in the evening.\n\nI rigged a swing bar on the mess cart today. I am on picquet tonight.\n","86":" 1396\n\nA beautiful morning. It was breaking day at 3.30 when I got up to go on picquet with George McLeod. There are now 6 men on picquet instead of 8 & two on at a time for 3¼ hours.\n\nThere is 5 months of the year gone and the finish of the war seems as far off as ever. Both sides appear to be equally matched & a great deal depends on how quickly U.S.A. can put a large force in the field. Both sides are fighting for a decision this year, and it is very likely to be the final flutter of the enemy this Summer which is now upon us, & given fine weather there will be something doing about 10a.m. the enemy shelled the opposite ridge across the river with heavy H.E. & killed some horses and wounded men. Some of the shells fell in the flat on our side of the river where our horses were grazing but they all escaped. He was again ranging over the this evening.\n\nToday I was fitting water carriers on the limbers.\n\nI saw an enemy plane brought down this morning. I fell near the front line. It tumbled over & over as it fell. It was hit by a french archie\n\nI finished reading a book \"The Virginian\" by \n\nOwen Wister a tale of a horseman of the wild Western plains of America. It is interesting & thrilling story of a cow boy who made good & was not a tenderfoot.\n\nSaturday June 1. 1918. 1397.\n\na beautiful morning. There was heavy bombardment last night & this morning.\n\nThis evening we were issued with new & clean underclothing shirt, underpants & socks. I then had a bath in the river put on the new ones & handed in the dirty clothes.\n\nThis is the first of June. On Monday it will be two years since the battalion left Victoria.\n","87":" 1398.\n\nAnother beautiful morning. There was the usual intense artillery activity last night on both sides this morning the enemy is shelling roads railways & villages all around us, and again this afternoon.\n\nThe Sargeant is sick today. He was slightly gassed a few days ago.\n\nI wrote a long letter to my wife this evening 8 pages and enclosed a cutting from the Daily Mail about Transports \n","88":" 1399.\n\nA beautiful morning.\n\nIt is two years today since I left Victoria. When I left I had no idea that the war would last so long. I thought that I would have been back home long before this. But we all underestimated the strength of the enemy. He appears to be as strong as ever and there is a lot of fight in him yet. But the allies have also increased in strength. The collapse of Russia has greatly prolonged the\n\nwar, Lloyd George says that the entry of U.S.A. up to date is only equal to one fifth of the gains acquired by the enemy through the collapse of Russia, so there is a lot of fighting to be done yet. The allies have got the bulldog grip on the enemy and will never let go until victory crowns our efforts & possibly it may be this year or early in the next.\n\nLast night while in charge of a ration party L\/C Jim Lawless met with an accident through his horse stumbling in a shell hole and falling on him. He was considerably hurt and was taken to the hospital in a stretcher.\n\nThere was the usual bombardment last night & this morning. Some enemy shells falling dangerously close to us in the night. He is smashing up Amiens and Allonville, and other towns & villages within his range.\n\nL Johnson was sent to the hospital today with a carabuncle.\n\nToday has been fairly quiet here. During the past few days I have been fitting water carriers to the Limbers. I have done 5 and there are 4 more to do.\n\nThis evening I walked into Lamotte & bought at one of the Canteens a cake of Lucy Hinton tobacco for 17.20 centimes, & enjoyed a good smoke tonight.\n\nThe King is 53 today.\n","89":" 1400.\n\nThe war has been raging 1400 days today.\n\nThere is a cool change in the weather last night & today.\n\nA squadron of enemy aeroplanes were over last night, & were driven off by archies & machine gun fire. They flew right over our camp the hum of their machines being like a hive of bees in the air.\n\nLast Thursday, Corpus Christie Day, the allies by request did not bomb Cologne or the German towns but the enemy shelled French churches & on Friday they again bombed hospitals, to show how much they had been touched by granting their request.\n\nWednesday June 5.1918. 1401.\n\nA fine morning. I was on 1st picquet last night the night was cold & I had a sore eye & the cold made it worse.\n\nA squadron of enemy planes came over. Innumerable search lights were up & the archies & machine guns drove off the enemy.\n\nIt is reported that Dave McKean was killed within the first day or two, with several others. He was a machine gunner & came from Merrigum . The report is not yet confirmed.\n\nIn the big fight in the Reims sector the Germans have been forced to slow down. The enemy brought up fresh troops between the Oise and Ourcq & attacked with great violence. which are held in check by french counter attacks. Today I received the \"Weekly Times\" of Jan 12 & 4 copies of the \"age\" from my sister.\n\nThursday June 6. 1918. 1402\n\nA fine day but there is a cold wind bowing this evening. I have finished fitting water carriers to 9 Limbers Each carrier, which is fitted in front of the back limber carries 4 petrol tins 8 gls of water in all, which make both the carriers about 90 lbs additional weight when filled with water\n","90":" 1403\n\nA fine day but rather close & cloudy. \n\nThere was intense artillery activity this morning. There was the usual bombardment by the enemy of our back areas today.\n\nI have finished reading \"The Magpie Jacket\". a racing story by Nat Gould telling how an old English squire regained his fortunes of the turf with the aid of his nephew.\n","91":" 1404.\n\nA fine day, but dull & cloudy.\n\nThere was the usual artillery duels last night. The enemy is still shelling back areas & we can hear the retort of his guns the shells whizzing overhead & later the bursts of the explosions in some of the villages or in Amiens. All most every day he shells camon. The paper reports another air raid on Paris which makes the 39 since the war started. 14 American ships have been torpored & mined on the American coast by Submarines of a large type & capable of staying a month away from their bases.\n","92":" 1405.\n\nA fine day cloudy with a fresh breeze blowing.\n\nThere was intense artillery activity last night.\n\nI saw Mr Hunter last night. He came back yesterday, after being away for several months. He was wounded. He is now looking well & fit. He was our first Transport officer.\n\nToday finished reading \"The Confessions of Arsene Lupin\" by Maurice Le Blanc, a thrilling & & remarkable series of 10 short French detective stories showing Arsene Lupin to be a detective burglar of great skill & ingenuity.\n\nI am on No.2. picquet tonight. 12.15 to 3.30.\n\nThere is a very heavy bombardment this evening.\n","93":" 1406.\n\nShowery all morning. But it was fine when I was on picquet last night with Ferguson. Today with Matthews I put on tins new on two cookers & took the old ones. The cookers were in the village of Lamotte\n","94":" 1407\n\nCloudy with a cold wind from the West. Looks like rain. \n\nThere was a terrific bombardment last night & today East of our camp. The 2 Division went over the top last night & advanced 700 yards so it is reported.\n","95":" 1408.\n\nFine but cloudy\n\nThis evening Bil McCoon& I went into Camon and bought 4 bottles of french beer Two of which we had for supper. I received a Portland Observer yesterday\n","96":" 1409.\n\nA fine morning but cloudy.\n\nLast night was fairly quiet.\n\nSince we came to this camp we have been able to buy fresh cows milk from a Frenchman who passes every morning. He charges 6d a dixie & does a good trade with the troops. I often get some and thoroughly enjoy it. It makes good sap when the bread is steeped in it. We were issued with new shirts & underpants & socks in exchange for dirty ones. Yesterday I did some washing so I have now a clean rig out.\n","97":" 1410\n\nCold, cloudy & windy.\n\nI finished reading \"Chums of the Past Watch\" by Harry Campbell, a tale of cadets on board a training ship. \n\nThis evening I finished reading a detective story by William Le. Lucre entitled \"Inspector Whitlock\" Bothe these books are short stories, but very interesting & they fill in the long evenings.\n\nToday has been very quiet.\n","98":" 1411\n\nA dull cloudy morning but fine. Last night was again quiet.\n\nJack Boon came back a couple of days ago after being away at the Base in a V.D. hospital. It cost him 18 guineas in loss of pay.\n\n"}}