{"Document Name":{"0":"Diary_0352","1":"Diary_0352","2":"Diary_0352","3":"Diary_0352","4":"Diary_0352","5":"Diary_0352","6":"Diary_0352","7":"Diary_0352","8":"Diary_0352","9":"Diary_0352","10":"Diary_0352","11":"Diary_0352","12":"Diary_0352","13":"Diary_0352","14":"Diary_0352","15":"Diary_0352","16":"Diary_0352","17":"Diary_0352","18":"Diary_0352","19":"Diary_0352","20":"Diary_0352","21":"Diary_0352","22":"Diary_0352","23":"Diary_0352","24":"Diary_0352","25":"Diary_0352","26":"Diary_0352","27":"Diary_0352","28":"Diary_0352","29":"Diary_0352","30":"Diary_0352","31":"Diary_0352","32":"Diary_0352","33":"Diary_0352","34":"Diary_0352","35":"Diary_0352","36":"Diary_0352","37":"Diary_0352","38":"Diary_0352","39":"Diary_0352","40":"Diary_0352","41":"Diary_0352","42":"Diary_0352","43":"Diary_0352","44":"Diary_0352","45":"Diary_0352","46":"Diary_0352","47":"Diary_0352","48":"Diary_0352","49":"Diary_0352","50":"Diary_0352","51":"Diary_0352","52":"Diary_0352","53":"Diary_0352","54":"Diary_0352","55":"Diary_0352","56":"Diary_0352","57":"Diary_0352","58":"Diary_0352","59":"Diary_0352","60":"Diary_0352","61":"Diary_0352","62":"Diary_0352","63":"Diary_0352","64":"Diary_0352","65":"Diary_0352","66":"Diary_0352","67":"Diary_0352","68":"Diary_0352","69":"Diary_0352","70":"Diary_0352"},"Date":{"0":"unknown","1":758.0,"2":759.0,"3":760.0,"4":761.0,"5":762.0,"6":763.0,"7":764.0,"8":765.0,"9":766.0,"10":767.0,"11":770.0,"12":771.0,"13":772.0,"14":773.0,"15":774.0,"16":775.0,"17":776.0,"18":777.0,"19":778.0,"20":779.0,"21":780.0,"22":781.0,"23":782.0,"24":783.0,"25":784.0,"26":785.0,"27":786.0,"28":787.0,"29":788.0,"30":789.0,"31":790.0,"32":791.0,"33":792.0,"34":793.0,"35":794.0,"36":795.0,"37":796.0,"38":797.0,"39":798.0,"40":799.0,"41":800.0,"42":801.0,"43":802.0,"44":803.0,"45":806.0,"46":807.0,"47":808.0,"48":809.0,"49":810.0,"50":811.0,"51":812.0,"52":813.0,"53":814.0,"54":815.0,"55":816.0,"56":817.0,"57":818.0,"58":819.0,"59":820.0,"60":821.0,"61":822.0,"62":823.0,"63":824.0,"64":826.0,"65":827.0,"66":828.0,"67":829.0,"68":830.0,"69":831.0,"70":832.0},"Entry":{"0":"\n\n","1":"\n\nAlthough tired after the march thro’ the streets & heavy day got very little sleep: 2 or 3 of us took blankets outside the pavilion on to a platform erected for machinery, & taking boots putties off turned in about 1 am. \n\nThe men came in by 2s & 3s, most of them perfectly sober: perhaps half a dozen were the worse for liquor. It took some time for them to stop singing & settle down & as reveille was sounded at 4 am there was not much sleep. Coffee (at any rate they told us it was coffee tho’ from the taste it might have been anything) was issued to the men at 4.30, & by 5 they had their gear together & were fallen in inside the pavilion. We were kept standing there, - with numerous rollcalls between times, - until 6 o’clock, when the band struck up & the column commenced to move amidst cheers from the men camped at the Show Ground.\n\nTrams were waiting at the main entrance & the troops were saved the march with their kitbags by entramming & being taken right down to the Quay where crowds of people were waiting, & with much difficulty some sort of order was got & the men with friends hanging on to them moved down to the wharf where the troops were separated & taken inside the gate where the final roll call was made: our company (14th of 2nd) was 1 man overstrength, & with considerable heart-burning one had to be taken back to Liverpool; he will be sent with the next reinforcement for the 2nd that leaves.\n\n\"Mess leaders\", men from the units who had come down previously as \"Advance Party\" & so got to know the run of the vessel, led the way to the troop deck where there seemed to be a general state of bustle & confusion owing to one unit getting out of its place. \n\nThe atmosphere was very steamy\n\nand about ½ an hour trying to get the men settled & was glad to find where my cabin was & get my equipment off. The cabin is one of the 1st Class, & opens onto one of the decks: two-berth, Vine Hall being my travelling companion. At the time it was full up of gear, chiefly company stuff addressed to Vine Hall as O.C. but it was a relief to have some place to go to to unharness.\n\nMeantime the artillery unit, - reinforcements numbering abt. 400, & under Lieut Roche who was a contemporary at H.A.C. , - had reached the wharf & were having their roll called. \n\nWent below & again & found they were just commencing to pay the men; had to give a hand, in one lull running up on deck to find that Jocelyn was waiting on the wharf. The next time I came up the wharf gates had been opened & the wharf below was one seething mass of people, while the decks were similarly occupied by the men. Streamers were soon linking both parties up, making a very pretty sight. When at last I caught sight of Harry near the gangway, I at once went down to the entrance but found that the gangway was just about to be lowered & consequently could not get permission to go down & shake hands. It was nice to have one friend in the big crowd, & thanks to Father’s glasses & Harry’s somewhat unique helmet I was able to keep him in sight as the ship moved from the wharf & made down stream to the anchorage. \n\nFrom Fort Macquarie until 11.30 was busy seeing abt the arrangements for the men’s mess. It took another hour to see them properly fed, then came a wait of another hour before our lunch was ready: menu was excellent, but we were so hungry that anything would have done. While sitting down to it the ship began to move, & going up on deck we\n\nfound that we were opposite Watson’s Bay. Presently went below to commence straightening things in the cabin but was glad to get away for afternoon tea at 4, after which the men’s tea had to be drawn. They are being splendidly looked after.\n\nDinner was roast pork, roast potatoes & cabbage (preceded by soup) & sago. For tea stewed steak, pickles, bread, butter, jam, & tea (with milk in it). The men were all in very good spirits, especially when it was announced that they were to have the run of the whole of one of the decks to sleep on or do anything else: the only decks \"taboo\" to them are the boat deck & the one just below it, the 1st saloon deck, so that they are certainly faring very well.\n\nAt 4.30 Colonel Holland called an officers parade, telling us something abt the work he expects of us. He is rather elderly, has been on troopship duty before, & seems to be a very nice fellow indeed, especially interested in the welfare of the men. After seeing to the men’s tea there was time to have a bath before going along to mess, which was to have been at 6.30, the officers should mess together at the 2nd sitting, so we had to wait until 7.30. \n\nDinner was \"au fait\", but it was very late when we came out: the men by this time had scattered themselves all over the deck, & it was quite a work of art trying to get round amongst them to find the 14th of the 2nd men to be sure that they were fixed up properly. Glad to turn in abt 9.30, Vine Hall having been asleep since abt 6, & of necessity missing dinner.\n\nDropped off while reading, finding the Bible on the floor next morning.\n\nSunday, 16 January 1916\n\nA dull hazy morning which gave place to a beautifully clear, sunny afternoon. Was awakened at ¼ to 6 by the soldiers being moved off the deck outside to take their blankets on down below. Bath & coffee & apple were enjoyable before going on to the early morning parade, where physical exercises were carried out. The available deck space was not very large, but the men seemed to enjoy the exercise & went down at 7.30, hungry & ready for breakfast, which was attended to by one of the other officers, my week of orderly duty being up.\n\nOur breakfast was at 8.30 & parade fell in at 10 for Divine Service, held at 10.30. The chaplain is a Capt Holliday, C of E. I take it. His talk on \"It’s a long way\" was straight & good, & the men listened well. Afterwards the Colonel said a few words to the men, telling them that if they played the game he would do all he could for them in the way of shore leave at the various ports etc.\n\nThe passengers attended the service in full force. There are only 1st saloon on board, all the 2nd bookings being cancelled to make room for the troops: at present the 2nd saloon is the sergeants mess, & the 2nd cabins theirs. Of the","2":" saloon passengers there are abt 100, mostly ladies. I think the majority of them are short distance travellers only.\n\nAfter lunch spent the time writing & going amongst the men. Abt 6.30 passed land on both sides (Flinders Is?). There was a glorious sunset, but owing to the late hour for our dinner we missed most of the beauties of it.\n\nA general sing-song was being held when we came up on deck, passengers & men joining in. Turned in abt 10 o’clock, land being fairly close on the starboard side.\n","3":"\n\nOn waking at 6 o’clock we were well up the bay. Morning physical drill was held as usual, & just as the parade was dismissed at 7.15 we were nearing the wharf. Had planned to finish letters & go on shore, but was detailed for duty as officer of the guard & had to get 100 men to parade at 9 o’c & post them. \n\nGeneral shore leave was granted to all but the guard, & for a time there was a very big crowd on the gangway going on shore, needing some handling to be sure that each man had a pass. Was on duty at the gangway until relieved at 2 o’c for lunch, & after that on & off at the gangway until 11 o’clock at night when reliefs were arranged allowing me to sleep in until 6 next morning.\n\nThe men coming back were nearly all perfectly sober, & none of those who were under the influence of liquor were in any way troublesome. About 8 bottles were taken from men coming aboard, but 3 of these were on ship’s company, not soldiers: it was quite a pleasant sound to hear the splash as I dropped them overboard, - that is, to my ears: the owners demurred a good deal.\n\nLawry’s letter addressed C\/o Commander was brought on board during the morning & was very welcome.\n","4":"\n\nOn duty at the gangway again at 6 o’clock & there until 10, the relieving guard being late in mounting owing to congestion of the decks with troops & consequent difficulty in drawing it up. By the time I had got my 100 men away & fixed up with shore passes it was 11 o’clock with breakfast time too far past to have anything. Went ashore as soon as possible, going up by tram. I\n\nremember the city fairly well but was again amused by the cable trams when they came to corners & had to be helped round them. The conductors with their tickets decorating their jackets also caused a smile.\n\nThe day was perfect, sunny with a cool breeze, in which respect we we fortunate seeing that the men on shore the previous day had had a dull grey day, with a very sudden & rather severe rain squall during the afternoon.\n\nAttended to some business (the purchase of writing paper & comforts for men) & then called on Uncle Walter, staying with him about 10 min. After lunch walked out to the Botanic Gardens & greatly enjoyed the stroll through, part of the time being accompanied by one of the Directors’ assistants to whom I made myself known. The West Austn Red Gums (Eucalyptus calophylla & E. ficifolia) were specially interesting, being in full bloom. Flowers are about 1½ in in diameter, the clusters of stamens differing in colour in the varieties from cream to pink, scarlet, crimson, & red. The crimson one in the distance looked very much like the N.Z. Christmas Bush (Metrosideros tomentosa). The short time I had was spent among the eucalypts chiefly, tho’ a lagoon containing many very beautiful water-lilies in full bloom & very gorgeous, also attracted attention.\n\nAt 3 o’clock had to tram back to Flinders St to catch the train to Box Hill. The first part of the journey proved rather uninteresting, & as a result of the guard work I found myself constantly dropping off to sleep. Nearing Box Hill where glimpses of the Doncaster orchards were caught\n\nit was rather more interesting. Leaving the station I went a little astray, getting into the second street parallel to the railway line, instead of the one next to it, but soon found the Oakleys’, Mrs O. & Doris both being at home.\n\nIn the evening after tea went to Spencer Pictures, but thought them very poor: it reminded me, however, of the visits to the pictures taken with Oll at Paddington, & I thought it would be the last opportunity for many a long day of \"going to the pictures\". On reaching Port Melbourne (by tram) in company with a number of my old guard also returning, we found that owing to the disturbances that had taken place in the streets, - conflicts between returned soldiers & military police owing to the former wanting to \"deal it out\" to Germans & Australians carrying on business, - the vessel had left the wharf & was anchored right out in the bay. It meant waiting until after 12 midnight for the tender to leave, & by the time I turned in it was 1.30.\n\nForgot to mention that while that while I was up town, I poked my head into St Peters (R.C.) Cathedral, remembering that when I was in Melbourne last time I had been very much impressed by it & had then not looked inside our own St Marys in Sydney. There was a service being held however, consisting while I was there of a repetition in a very perfunctory way of a Latin prayer of which all I could distinguish was \"Ava Maria\". Altogether it was a most disappointing visit to the Cathedral, but a very enjoyable afternoon & evening, especially as it was commonly rumoured that there is to be no leave in Adelaide.\n","5":"\n\nIn spite of late hours previous night, woke early & got out to hurry up the men’s \"fall in\". A muster parade & roll call being held to ascertain whether any men had not returned from shore leave, there was no time for physical drill before breakfast.\n\nThe day was fine, but dull & grey throughout. At morning parade at 9.30 I was able to take abt 80 of the men up on to the boat deck & there went through some rather strenuous physical exercises, there being no motion of the vessel to interfere with exercises.\n\nThe afternoon parade was of a similar nature with the boat still at anchor in the bay. The tender with a full complement of 1st saloon passengers came alongside abt 4 o’clock, & abt 4.30 the anchor was weighed & we started to move, just as one of the ladies on behalf of the passengers presented to the men a fine lot of things purchased with money amounting to abt 7pound;35: 2 gramophones, boxing gloves, books, games, mouth organs, etc. there was great cheering by the men, & certainly it was very handsome of the passengers.\n\nA very welcome change was made at dinner in that instead of the officers waiting for the second sitting & so coming out of mess at abt ¼ to 9, we went down at 6.30 & after mess watched the men boxing etc.\n\nWe reached the heads abt 7.30 & dropped the pilot: there was slightly more motion outside with a fresh head wind blowing, & the night was decidedly cool, greatcoats being generally in use.\n","6":"\n\nA bright beautiful day. In the morning the low sandy coast of Western Victoria was in sight some distance off. There was a fresh breeze & a rather heavy roll increasing towards evening. The extra motion caused a diminished number of men to be present at parades ad an increased number to be seen in various attitudes scattered over the decks: none of our men were seriously sick as far as I could find.\n\nAt the early morning parade issued sandshoes purchased with comfort-money to the men, most of the time usually given to physical drill being taken up this way. Hard at it during the forenoon parade & again in the afternoon. \n\nThe men specially enjoyed the organised games which the medicine-balls were used: these are large round balls something like footballs but heavier, being stuffed with horse-hair or straw, & are not kicked, but passed from hand to hand in various games in various ways.\n\nThe sickness of so many men of different units meant that there was so much more space available for parade ground, & we took advantage of it to the full.\n\nIn the evening the men gave a concert lasting from 7.30 till nearly 9.30, some of the items being really first class. The passengers expressed great appreciation at the close.\n\nShip rolling fairly heavily at bed-time.\n\nA bright clear morning, later turning to a hot day. \n\nWhen we woke the ship was nearing the wharf at Port Adelaide, & about 6.30 she was alongside. I had been warned for guard, - rather hard luck after having had it at Melbourne too, - & instead of doing physical drill before breakfast had to see about getting the guard of artillerymen together. The sergeant-major in charge was a very good man named Verso: later on when talking to him at night when the day’s work was finished I found that he is an old S.H.S. boy who was at the school in Leo’s time. His father is Canon Verso of Berrigan.\n\nThere was not much of a view at Port Adelaide. Away from the wharf & break-water there stretches a level tract of sandy country for 3 or 4 miles, the only buildings close by being Railway Stn, Post Office, & Refreshment Rooms. Away in the distance could be seen some buildings which I believe represented Largs, & beyond these again were the mountains. As at Port Melbourne the railway line comes right down to the wharf so that goods can be shipped straight from the trucks to the vessels’ hold.\n\nThe colonel had arranged for the men to be marched ashore by the officers & to then have cricket, football, etc. there was some confusion, evidently, about these orders for men going ashore independently when I took over duty. Everyone was to be back on board by 12.30, the sailing notice stating that we were to sail at 1 p.m. My guard mounted at 9 o’c\n\nand from then until 5 o’clock in the afternoon I was on duty at the gangway.\n\nAmongst visitors who can I recognised Rev H Howard who came down to see Prescott; was able to show him to the cabin & made myself known to him.\n\nBy 1.30 most of the men were back, but one on the officers had taken a run up to Largs by car & reported that a number of our men were there at the hotel playing fast & loose, so a picket of 30 men under an officer was sent up to bring the offenders back. \n\nMeantime my duty on the gangway was most unpleasant, getting the names of men late turning up, searching them for liquor, of which I had the pleasure of smashing 10 or 12 bottles of beer & brandy, punctuated occasionally by the hoots of a section of the men who had come on board. It was a disgusting sight to see some of the men staggering back with difficulty, & one being carried back in an absolutely helpless condition. Abt 8 of them placed in the cells at once, leaving them until relieved at 5, when I placed them under open arrest pending court martial. \n\nWhile on the gangway my mail of 12 letters was handed to me, but they had to stay in my pocket until after dinner at night.\n\n By abt 3 o’c all the cargo & mails were on board but the picket was still out. It was a long wait for them, & just as the colonel was talking of sailing without them, they hove in sight bringing with them 1 prisoner! He was\n\nan artillery corporal, very drunk, but just able to walk. He was very soon in the cells & the gangway up, the boat moving off just a few minutes after 5 o’clock.\n\nAlthough the stay in Port Adelaide was not pleasant for me, though it some compensation to have the colonel the next morning send his adjutant to compliment me on my guard duty. As soon as we were away from the wharf the prisoners had to be fixed up & then came a very welcome wash & clean up.\n\nThe sea was very smooth & there was little motion, with a cool fresh breeze blowing.\n\nAfter dinner enjoyed my mail, & when the guard had been arranged for the night was glad to turn in abt 10 o’clock, when there was a distant light showing on the starboard bow.\n\nSaturday 22 January 1916\n\nAnother beautifully clear fresh day. Sea very smooth & hardly any motion of the vessel. No land in sight during the day.\n\nNew guard took over at 9 o’c so was not with our men for the physical drill before breakfast. Muster parades of the various units were held, & I understand that after all the full complement of men came on board at Port Adelaide. It was quite expected that some of the units would be short one or several men.\n\nThe forenoon parade was held as usual, but the afternoon one was dismissed at 4 instead of 4.30. the men were then sent down below to put\n\ntheir lifebelts on & wait for the fire-alarm to be given at 4.30. The ship’s bell was rung & the siren sounded & the men streamed up on deck & fell in on their parades as quietly & quickly as possible. At the stairway leading up on deck I found a good deal of confusion owing to the men having no one to control their exit on the main deck, so took station there. When all were in position they were kept standing for abt 5 minutes & then dismissed.\n\nIn the evening a short concert was given by some of the passengers & the men, the various items being well applauded by the men on the deck below.\n\nSunday 23 January 1916\n\nUp as usual at 6 o’clock & ready for the physical drill. Found that Holy Communion was to be held at 6.30, all being invited. There were abt 60 men & half a dozen officers present, & the service was helpful, though with drilling & shouting going on just outside the 2nd saloon, it was rather distracting.\n\nAt 9.30 a church parade was held, the chaplain speaking on Rev 11:15, dealing with problems & difficulties caused by the war. Being with the men in order to keep them orderly I was not able to hear very much of the address or the service. Immediately after this service, Divine Service was held in the 1st saloon by the Commander & was to me a very helpful service: no address, but just the service on the prayer book, the purser reading the Scripture lessons.\n\nA choir of stewards under the Purser led the singing, which was hearty: one of our sergeants resided at the organ & carried his job through very well. As many of the troops as there was room for in the saloon were allowed to attend, & seemed to enjoy the service.\n\nAbt 11 o’clock passed a small steamer on the port side, towing 2 barges in the same direction that we are going. \n\nDuring the rest of the morning & in the afternoon busy writing, but gave up to attend the sing-song of hymns by passengers & men. A perfect day, bright & clear, with a mild breeze: sea exceedingly calm in the earlier part, but with a head wind & some pitching as night approached.\n\nMonday, 24 January 1916\n\nAnother fine day, but with a good deal of motion. Land was in sight throughout the day, the coastline appearing rough & rugged, with bare patches of sand here & there, & occasionally rocky islets against which the waves dashed, raising masses of foam.\n\nAt dinner at night we had fiddles on the tables, & even then there were several smashes. Parades held as usual: at the forenoon one had rifles & bayonets & taught my platoon how to Fix & Unfix, work they had not had before.\n\nRounded Cape Leeuwin abt 9 pm, its flashing light being clearly visible on the horizon.\n\nTuesday 25 January 1916\n\nAnother perfect morning, giving place to a rather warm day ashore. When we got up at 6 o’clock there was land showing on the horizon ahead. The sea was smooth & the early morning physical drill was carried on as usual, though the men in my platoon were rather sore from their inoculation yesterday & had to be taken gently at first with the arm exercises.\n\nPay half past seven were were running along what I took to be Rocknest Is., low-lying, with a number of sandy beaches, stretching back from which were green slopes, though nowhere did the island appear more than about 100 ft above sea-level.\n\nWe passed 2 or 3 lighthouses, & presently the pilot-boat came out with our pilot: it was a very small steam launch & was considerably tossed about as it came alongside, & then there was very little sea running. It was rather a ticklish job for him to come on board, but he managed with only one ducking from a wave surging up between the ship & the launch.\n\nAs we again got going we passed a large buoy fitted with a heavy bell which tolled as the swell tossed the buoy to & fro.\n\nBreakfast was at 8 instead of 8.30 so I was disappointed in not being able to see things as we came alongside: we were at the wharf when we came up from breakfast & looking back could see the breakwaters which form the harbour at Freemantle. Out to sea is Rocknest Is acting as a break to the rollers of the Indian Ocean. Inside the breakwaters were 2 wharves, on one of which were stacked huge\n\nhuge piles of wheat bags, quite reminding me of the sights I saw at some of the stations near Gunnedah: there must have been tens of thousands of bags.\n\nThere were a number of steamers at this wharf loading wheat, & at the \n\nother where we were berthed. As at Pt Melbourne & Pt Adelaide the railway runs right down on to the wharf, but here it was a very narrow gauge in contradistinction to the broadgauge at S.A. & Vict. There was a coal train waiting for us, & I thought their coaling arrangement was rather good. Each truck consists of a framework on which are carried 3 large box-like bodies, strongly bound with iron, & there is a travelling crane which runs right over the railway, & bodily lifts up each of the bodies containing coal & dumps it in the shoot leading to the bunkers. Coaling from a lighter was also in progress on the other side of the boat, so there was soon a good deal of noise & coal-dust.\n\nAt 9.30 the men \"fell in\" as usual for the forenoon parade & were then addressed by the Colonel who granted shore leave until 3 o’clock: he advised those who were not going to the swimming carnival to go up to Perth. It was stated that Freemantle was full of pubs which were full of very vile liquor, & I suppose this accounted for his advice. \n\nThe men were marched onto the wharf & dismissed, I believe about a\n\ndozen all told went to the swimming carnival, & this in spite of the fact that abt £30 for prize money was subscribed by the passengers; most of the others went to Perth.\n\nThe N.S.W. men had a very bad name at both places, the men from the \"Medic\" abt a fortnight previously having got out of hand & smashed things up badly. I think they expected something of the same kind of thing to happen with our men.\n\nAs soon as the men were fixed up & away I went ashore & made my way over to the Railway Stn, situated perhaps 100 yds from the wharf where we were berthed. A train was waiting & was due to leave in a few minutes for Perth: there was scarcely any standing room, even in the 1st class, troops crowding everywhere. Owing to the narrow gauge the carriages seemed very small, particularly as the roofs were very low: the first class was, however, well upholstered & furnished with looking-glasses & interesting topical photographs, reminding me of the Box Hill train.\n\nA comparison of the types of engine in the 3 states was rather interesting. At Port Melbourne the type was uniform, but the weight & power varying: they were painted a dull red. At Port Adelaide the engine was black, & of a slender type – if the term maybe used. In W.A. there seemed to be a very large number of types, some the same as our N.S.W., others with an ugly funnel thus:- others again approaching more nearly the S.A. type; cow-catcher, & I should have\n\nliked to get a snapshot of one. \n\nBefore going ashore, however, I had been warned not to take the camera as the W.A. people were very much \"down\" on people taking snaps. Since leaving Sydney I have not taken a single photo!\n\nAs in Melbourne the trains seemed to go very slowly, & after each stop started off with a big jerk. Our train started from Freemantle at 10.30 & took 50 minutes to reach Perth. The intervening country is flat & rather low-lying, that is to say not more than about 150 ft above sea level. The soil seemed sandy & of poor quality. In places there were stretchers of bush, eucalypts up to perhaps 50 ft high, banksias sat 20 ft., a few acacias & fewer casuarinas (she-oaks) being the chief members. Of grass there was little, Mesembreantheums (pig-faces) & a kind of salt-bush locally known as \"smoke bush\" from the greyish appearance which from a distance causes a mass of it to look a good deal like hanging smoke, being most plentiful.\n\nIn places the line ran thro’ cuttings perhaps 15 ft high: the country rock(?) seemed to be of very recent origin, a more or less consolidated grit appearing to be the common type. In other places they were cutting thro’ sand which was kept back by sleepers (old railway) being laid on there sides. Leaving Freemantle there were one or two pretty peeps of the shore-line, beach, & water, & at one spot I noticed a fort, apparently old & out of repair.\n\nA number of various old field-pieces & Cannon of various kinds about Perth was quite noticeable.\n\nThere were perhaps 6 or 8 stations en route to Perth, & of course we stopped at all. We ran past 3 or 4 schools, from the playgrounds of which the children heartily cheered the train & waved to the troops. Passing the place where the W.A. troops encamp we got a good reception from the few men in camp at the time: our men responded well.\n\nA specially pretty spot was the cemetery, \"Karrakatta\", which we were told is the aboriginal name for \"Burial Ground\": there were few if any foreign ornamental trees, but the native vegetation made a pretty setting for the well-kept burial place where several gardeners could be seen at work.\n\nSoon the scattered settlements gave place to the suburbs of Perth, composed principally of small cottages, & after a 50 minute run we ran into Perth station; a fairly old building & not at all imposing. The city seemed to be all on one side of the station, that is it was on the outskirts of the business part of the city. In a very short time the station was a seething mass of kharki, & I followed the crowd up to the main part where I had one or two purchases to make.\n\nThe city seemed a quiet places, the streets seeming to be very narrow after the Melbourne ones, & having electric trams running in different directions: they were all single cars, a good feal like the style running along\n\nPitt St to central Station at home. The sides could, however, be left open, the small seats facing in the direction in which the tram was going. There seemed to be hardly any traffic other than the trams; just an occasional motor-car, & plenty of pedestrians; pubs were plentiful & doing a good trade with our men. \n\nThe policemen wore a broad-brimmed white helmet & a band on the left arm like the Melbourne police: on the whole they seemed very much smaller & slighter than our N.S.W. men.\n\nAt the Post Office there was a big crowd of men, the Telegraph Office being overfull, & it was with some difficulty that I got up to the counter & sent off my wire home. Coming out I asked the driver of a motor-car which way to go to see the sights & as he directed me the lady sitting behind joined in advising me to be sure & see King’s Park. I had moved away about 100 yds when I suddenly became aware of the lady hurrying after me: she apologised & said she was sorry not to have thought before of asking me to go round with her as she took 2 of the other passengers round for a run. She proved to be a Mrs Keenan (?) a lady with 2 brothers at the front, one of whom (Capt Parker) is D.A.A.G , & A.D.C. to General Walker.\n\nLeaving the Post Office we drove up past the Public Works Dept., an old building that was formerly a military barracks, en route passing quickly from the business to the\n\nresidential part of the city, the latter being represented in the street we went along chiefly by doctor’s residences, thus corresponding with our Macquarie St. Close to the Works Dept is Parliament House, a large brick building with red tiled roof & in only a partially completed state. \n\nBy this time we had risen a good deal above the city level, & turning sharply round ran thro’ the entrance to Kin’s Park. This is more a reserve than anything else. Along the main drive, which was a gravelled road in a perfect state of repair, trees of the Flowering Gum, a W.A. native that is without compeer among our Eucalypts for gorgeous flowers which are mainly red to scarlet & crimson, & have the typical eucalypt shape only the crown of stamens measures up to 1¾ inches in diameter, - have been planted on each side. They were about 10 to 20 ft high & had been kept low & bushy. At the time they were passed there prime, Xmas being the time when they are really rest, but there were plenty of them out to represent the shades & to give some impression of what that Xmas scene must be, - simply gorgeous.\n\nI hope to post a few pressed flowers of the type, but it must be remembered that they grow in dense clusters. The fruits are the size of a fairly large walnut, of the usual eucalypt shape.\n\nIn addition to planting this renowned grove of trees, very little apart from clearing the vegetation somewhat obscuring the scenery on the harbour side has been done by the authorities, so that the park is practically in its natural state, the forest flora being rather stunted gums (rough bark) banksias (2 distinct kinds) & a few acacias & she oaks. There was a rough undergrowth of coarse rushes, smoke-bush & a wiry grass, but in the spring they say the wild flowers are simply glorious.\n\nThe park must contain some couple of hundred acres: on the harbour side the slope is steep, but it slopes gradually away northwards. The road we followed was in perfect order & well graded. At the \"Kiosk\" we stopped & got to admire the view, which at this point was simply glorious. We were facing south. Away on the left below us was the city of Perth with its irregular streets (unlike Melbourne) & varied buildings.\n\nAlong the waterfront were dozens of yachts & sailing boats at anchor, the shore-line further round being indented by the Swan R. which runs into the miniature Sydney Harbour at this point. Between this & South Perth was a stretch of wooded land, all this country being flat delta country apparently. South Perth seemed closely populated, & is reached by a ferry from the city: it extended round to the right as far as the Gunning R. which runs in at this spot, winding among what looked like a mangrove swamp. Right away\n\nin the distance were the ranges or mountains south of Perth (I have not an atlas to turn up their names) which at the time we partially obscured by the smoke from bush fires which at one spot in particular seemed to be blazing furiously.\n\nFurther round to the E the Swan, quite salt & very shallow & shoaly except for a winding channel followed by the small craft which occasionally ply between Perth & Fremantle, disappeared in the low-lying country. Below us, to the right was a point which is known as University Point by reason of its having been chosen as the site of the future university: the buildings are to be on the low point & the professor’s residences etc on the rising ground which merges into King’s Park.\n\nThe whole made a beautiful scene, largely owing to the perfect day we were having, bright & sunny, with just a faint breeze to temper the heat. \n\nThe hostess stated that it was a cooler day than they are accustomed to have at the time of year. After spending 5 minutes at the Kiosk to take in the view we got into the car again & continued our way along the beautiful road of the park, running out on the Perth-Fremantle Rd. (asphalted all the way) below University Pt. & following it back into the city, running along the narrow strip of shoreline between the King’s Park heights & the blue water. \n\nIn one sheltered cove of\n\nperhaps 3 or 4 acres extent I noticed a flowering banana plantation, showing the tropical nature of the climate. Going back into the city this way one was reminded a little of Sydney, - only on a small scale.\n\nBy the time we got back to the heart it was 12.30 & after thanking the hostess I found a place where I got some lunch, - after a long wait, due probably to the extra rush of soldiers. There was then just time to take a run out to Queen’s Park by car, taking perhaps 10 or 12 minutes. It was a matter of straightway changing over into a car about to return to the city, but from the roadway the gardens seemed very beautiful, artificial beds with rockeries & grottoes filling up the space between lagoons covered with lovely water-lilies in full bloom. \n\nIt looked a pretty & inviting spot, but there was no time to go in, the return tram landing me at the station just a few minutes before the special train at 5 to 2 left for Freemantle. There was a tremendous lot of cock-a-doodle-doo-ing from all the engines we passed, & they were not a few: our boys cheered lustily in reply, occasionally pelting them with water-melon rinds.\n\nThe run back to Freemantle was quite a fast one, landing us there about 2.30. Even then a number of the troops were in a drunken state, 2 or 3 having to be carried on board by their mates: it was scarcely a pleasant\n\nscene but was nothing to what was to follow. A large number of the men were not content to go on board but must needs to go up town to call at more Freemantle pubs, & just therein lay our later trouble.\n\nWent on board at once with Chaplain Holliday, intending to get 2 or 3 hurried letters written, but was almost immediately pounced upon by the Orderly Officer & detailed for duty to take out a picket of 20 men to round up drunks. While getting the picket together, taking their names etc numbers of dead drunk men were coming aboard as well as many of the crew.\n\nWith some difficulty I got the picket down onto the wharf & away thro’ the big crowd waiting there, & then commenced the disgusting task of going into bar after bar to haul out drunken men & push them along to the boat. The picket worked well, but as we had strict orders to be back at 10 min to 4 for embarkation, it was not possible to visit more than about half a dozen of the numerous pubs, & I was not much surprised the next day to find that some 10 or 12 men missed the ship; they are posted as deserters, of course, & will be dealt with as such by the W.A. authorities.\n\nWe got back, with some difficulty driving in front of us the captives, & then came a wait until 4.30 on the wharf, telling off 2 men to go to a certain spot where it was reported that a man was lying: 4 to go somewhere else, & so on. When I did go up on board it was to find a real state\n\nbedlam, drunks in various stage of intoxication were everywhere: some were completely unconscious, many others being in a dangerous fighting mood.\n\nAltho’ not actually on duty I stayed about doing what I could to straighten matters, getting men to carry some down to the troopdeck, others to induce mates to go down with them, & so on. Several times I had to interfere in fights, none of the other officers being about, & tho’ my face had splatters of blood on it when I afterwards looked, I was not at all touched or even hustled. \n\nThis work kept me going until after we had cast off at 5 o’clock: when we were several yards out there was a rush on the wharf (so I heard afterwards) & a N.S.W. soldier, who turned out to be one of the 14th Rfts of the 2nd Battn burst thro’: he was thrown a rope, & swinging out against the ship’s side was hauled up on deck a bruised & I hope a sadder man. \n\nBy the time something like order was restored on the","7":" saloon deck & I was able to go up on the","8":" deck, Australia was 4 or 5 miles distant, & I watched it until abt 6.45 it was no longer visible: it was a thoughtful time.\n\nI forgot to mention that while going out on picket the \"Cairnleith\" telegram with good wishes was handed to me but I had to put it in my pocket at the time, suddenly remembering it about mess time, which is now altered to 7 pm.\n\nowing to the largely diminished number of passengers: there are perhaps 60 left. \n\nAfter mess did a little writing up but was quite ready to turn in by 10 o’clock. There was quite a lot of motion, chiefly pitching.\n","9":"\n\nAnniversary day at home but not with us. A fine day with a fair northerly breeze & rather rough sea: plenty of white horses everywhere. Before breakfast a muster parade of the various units was held in order to find out whether any were short of men: 10 or 12 manes had to struck off the ship’s strength.\n\nForenoon & afternoon parades were held as usual: at the former I took a party with rifles & bayonets for rifle exercises & in the afternoon after they had had a little exercise gave them a lecture on the advantages of sobriety (this is the title set down, but it was really a straight talk on the bad effects of alcohol) not mincing matters in any way. The platoon listened well, & I think took in what was said: they will be sober until the next port is reached. \n\nThen read to them the","10":" dream in \"The Defence of Buffer’s Drift\", drawing on the deck a map of the country dealt with. The men were very interested, & I purpose reading one of the 6 dreams each day until they are finished.\n\nAfter mess at night spent the time writing up notes. Much less motion than in the \n\nmorning. The ship’s run up to noon was 291 miles.\n","11":"\n\nAir appreciably warmer. Day fine & clear & sea a good deal calmer. Numerous flying-fish seen. Ordinary routine of work, enlivened by an inoculation for typhoid in the morning which gave me a sore arm in the afternoon & evening, & also by a hunt for officers with long hair, my clippers being many times called into play.\n\nPrescott resisted nobly but eventually had a big junk removed from the front & then submitted: he was left with a nice round tuft on his crown. Several of the others also fought, but were subdued & left with lighter heads, two of them having a strip of long hair left from the forehead to the crown. I had taken the precaution of getting my orderly to run over mine – front & all – the previous afternoon, but was persuaded to have my moustache attended to by one of the sufferers, with what are declared to be excellent results – so it is said – 10 yrs younger!\n\n When we turned up at mess there was quite a commotion, & I hope tomorrow to get one or two snaps to illustrate the causes.\n\nShip’s run to noon was 384 miles.\n","12":"\n\nAnother fine day with smooth sea. Approach to the tropics indicated by all stewards being in white when we went down to breakfast. Routine not varied during the day.\n\nDuring the lunch interval there was a final chase after the officers whose hair had not been attended to: fight was shown in one or two cases, but it was quite noticeable that as soon as one man was fixed up, he in turn became most eager to join in fixing up someone else. These converts did excellent service.\n\nAt night time Commander Jenks gave a lantern lecture on the poop deck, arranged so that both passengers & troops could see everything, & thanks to the voice (I nearly wrote bellow) of the Captain, hear also. He started off by speaking of the necessity for the strictest discipline & then got on to temperance, tho’ not a teetotaller himself. His views were photos of different parts of N.S.W. & were also well received. A promise to give another talk about the work of the mercantile marine in the war was greatly cheered.\n\nShips run for the day, 385 miles.\n","13":"\n\nA hot muggy day with calm sea & little or no breeze. Work carried on as usual at the three parades, excepting that in the afternoon the men were dismissed at 4 instead of 4.30, & at the latter time the alarm was sounded & the men supposed to get their life-belts on & be up on their parade as quickly & quietly as\n\npossible. Is was spoilt, however by one of the officers telling his men that the alarm was to be given, & as a consequence men with their belts on were lolling all over the deck before the whistle sounded, thus spoiling completely the surprise it should have been.\n\nThe boxing contest continued before & after dinner, a stadium being rigged up on the after hatchway where passengers & men could watch the bouts. I stayed for a time, some of the contests being very good, but not feeling quite A1 went to bed early, but the night was exceedingly hot.\n\nShips run for the day 369 mls. Apparently they are limiting the speed so as to arrive at Colombo at the set time. Passed the Cocos Is (not within sight) somewhere in the early part of the day.\n","14":"\n\nA fine morning & got up as usual for the 6.15 parade, but feeling quite off colour.\n\nWas sorry to miss the Communion Service with the men. Attended the Church Parade at which the Chaplain took as his text, \"So fight I not as one that beateth the air\", suggested, of course, by boxing of the previous evening. On account of the great heat of the sun, - many of the men\n\nwere standing out in it, - the address was cut very short & really amounted to an appeal to the men to be confirmed when they landed in Egypt & before they were sent to the front.\n\nAfter Church parade went to Divine Service conducted by the Commander in the saloon, & as last Sunday, again enjoyed it very much. Jackson’s \"Te Deum\" was specially good.\n\nSaw the doctor afterwards & got some medicine, & for the rest of the day took things easy, not feeling equal to letter-writing. In the evening we ran into a rain squall which cooled the air considerably. After dinner a sing-song was held, passengers & troops joining in it. Went to bed early.\n\nShip’s run to noon was 360 miles.\n","15":"\n\nA dull cloudy day with very frequent rain squalls, which, as we are only abt 5° south of the equator are to be expected. A fairly cool N breeze blowing but sea wonderfully smooth. Last night was struck with the rapidity with which daylight gave place to darkness: no sign of any twilight. Same thing tonight.\n\nFeeling right again & out on parade as usual. Spent all spare time in getting mail ready.\n\nShip’s run to noon was 363 miles.\n","16":"\n\nFairly rough when we woke; a very strong wind had been blowing in the early hours of the morning, & there was still quite a fresh breeze. During the day the sea moderated & the sun came out again.\n\nI was Orderly Officer next for-duty, but as we were running company sports, I did not worry about the duties, spending the time with the company. There were running, relay, 3-legged, carry-your-chum, potato, egg & spoon races, etc, besides team events such as rifle-exercises, medicine ball, tug-of-war etc. from the Comforts Fund a sum of £12 was devoted to prizes which were arranged so as to amount to 5\/- for 1st & 2\/6 for 2nd prize. We kept going during the day but even so were not able to get thro’ all the events.\n\nAt night the passengers & officers gave a concert on a specially erected stage. There were the usual songs & recitations, the comic song proving to be the popular item to judge from the applause. In addition there were one or two small amateur theatr4icals which were very well received. It was quite a picture to see the men crowded everywhere doing their best to watch the performance, & one wished for a flashlight view of the scene.\n\nShip’s run to noon was 332 mls. We crossed the line during the afternoon.\n","17":"\n\nA beautiful bright sunny day with a cool breeze blowing from the N. Sea wonderfully smooth & very little motion noticeable, not as much as one usually gets when going to Manly.\n\nOrderly officer of the day & up at 5.30. Kept going during the day attending to the various duties, getting the men off the decks & their hammocks & blankets below, cleaning up the troop-decks & getting the ship ready for the inspection which is made by the Commander, Colonel, & various other officials each day at 11 am. \n\nAt 2 o’clock a special meeting for officers & sergeants was called by the colonel & instructions issued about the method to be adopted in case of submarine attack. A practice with ball ammunition was given in the afternoon but could scarcely be called a success. With further practice we can look for some improvement.\n\nAt night the boxing contest was continued.\n\nShip’s run to noon was 362 mls, with 281 mls still to go before reaching Colombo.\n","18":"\n\nAfter writing a final note last night to enclose with p. 34 I went down to the chaplain to have it censored, - merely a case of having the censor’s stamp & initials put on the envelope, - & found him with a group of 4 or 5 officers in the saloon up to his eyes in work, & stayed for some time lending a hand. \n\nOn going up on deck at about 11 o’clock found that the reflection of Cape Odonda (most Southern point of Ceylon) lighthouse in the sky could be seen on the starboard bow. By midnight, when I turned in, we were passing a light abt 3 mls abeam, & from then on we were passing them until 5.30 in the morning, when one of the sentries woke me as instructed. \n\nThe sea was very smooth & there was just a suspicion of dawn in the E. We were approaching Colombo, the lights of which could be clearly seen. Had a bath & dressed & then went up on the boat-deck to find that we were still heading north & seemed just opposite Colombo: soon we swung round & headed E for the lights, the main Colombo lighthouse showing a series of 3 flashes abt every ½ minute. \n\nOne or two catamarans (native craft with out-rigger & square sail) were to be seen some distance away in the dim light. The land stretched away on either beam, the twinkling lights marking the position\n\nof the northern point of the bay. All this time we were moving at less than ½ speed, & presently it was \"dead slow\": the view as we lay about a mile off the breakwater was glorious, & the picture of the sun rising right in front of us one that we wished to make permanent. \n\nAway to the left (the N) stretched the low-lying northerly cape of Colombo Bay, apparently covered with cocoanuts & other vegetation, but fading away to blue ocean in the distance. \n\nCloser in, lying stranded on the beach with a big list to starboard was a fair-sized steamer (2 masts & 1 funnel) which we afterwards heard had been wrecked last monsoon. At first we thought she had the cut of a warship, but we were wrong. Close by her were 2 or 3 native craft, & later several of them came close to the ship when it could be seen that they were rather roughly constructed, the neat workmanship of Fijian canoe being awanting: the oars were poles with a flat roundish blade attached to the end, but were well-wielded by the natives. In one case they paddled past they kept time to a native song or chant reminding me very much of a Fijian \"meke\".\n\nFollowing round to the right past the stranded steamer, the cocoanuts growing down to the water’s edge could be seen. The ground here was slightly undulating & in the crest the palm leaves against the sky line looked very pretty. A little further round the dome of a mosque against the sky\n\nbroke into the line of cocoanuts. Away beyond in the far distance (70 mls away I believe) was a very rugged range of mountains in which the outstanding feature was Adam’s Peak, somewhat dome-shaped but coming to a sharp peak. During the day the peak can not be seen: only when the light is behind it is it visible from Colombo.\n\nOn the shore opposite this point was a large workshop, an extensive engineering place: its red roof contrasted against the graceful cocoanuts behind & around it. It was situated just outside the breakwater which is different to the other two already noted, two walls jutting out from opposite shores with a smaller wall between them. It seemed to me that one channel was for entrance & the other for exit. Inside the breakwater were quite a large number of vessels moored to buoys in several rows: the shipping gave the impression that Colombo was a very busy port.\n\nFurther round to the right was the town (or city?) in which one or two spires stood out plainly, & beyond it the low-lying land faded away to the S cape of the bay which is very much nearer the city than the N cape.\n\nTo all this must be added the beautiful sunrise with its exquisite colouring, the variously tinted clouds standing out against the opalescent sky. It was not a\n\ngorgeous sky such as we saw 2 or 3 times afterward: the delicate tinting & contrast with the tropical coast gave the chief beauty I think.\n\nWe had not long to wait outside the breakwaters before a steam launch, towing a sampan (rowing-boat with an awning) with 2 pilots for us came alongside, & when they were on board we went thro’ the N entrance of the breakwater with its red & green light on either side, & made for the buoy where we were to be moored.\n\nA boat with a native crew took our line & with much jabbering & scolding from the boss who sat at the stern guiding affairs, made us fast. The ship was then warped round bow on to the breakwater exit, & the anchor dropped. The yellow flag was run up until presently a motor-boar brought out the doctor, after whose inspection (I suppose he made some such thing) it was dropped.\n\nA police boat manned by native police in jack tar uniforms & all wearing one or more stripes on either the right or left arm or both, came out next & brought 2 or 3 constables (native) who remained on board during the day & occasionally hunted off natives wanting to come on board. \n\nWithin a very short time 8 or 10 barges loaded with bags of coal were on each side of the ship & made fast by ropes dropped over the side, up which jabbering natives clambered, some with shovels tied round their necks, which, had they dropped as their owners climbed aboard, would have wrought havoc amongst the struggling mass at the lower end of the rope. \n\nI hope 1 or 2 snapshots of this scene will come out well & show what this coaling preparation\n\nlooked like. When the coaling started, rough platforms were lowered to the outside of the openings leading to the bunkers, & on this a man & a boy stood. Two men in the barge then hoisted the coarse bag cont’g coal on to the woodwork, the man then emptied it & passed the bag to the boy who threw it down into the barge. \n\nA number of other boys roamed about the barges & came alongside in boats & with cries of \"all right\" tried to attract the notice of the troops whose parades had now been dismissed & who were lining the sides, & induce them to throw over coins to be dived for: pennies were not considered worth the trouble. Once when 2 of them were treading water waiting, a coin was thrown midway between, resulting in a dash to the spot, & after they had dived a struggle at depth which could be clearly seen from our height.\n\nSeveral other little boys in various barges tried a different way. One would sit right up in the bow & plaintively sing \"Tipperaray\" with numerous variations & then looking up would appealingly hold out his hand for a coin to be thrown him. In this case a penny was eagerly snapped up. \n\nA still further amusement adopted by some of the men was to change English money into the lower (copper) Ceylon coinage: amongst the men who clambered up the ropes were several who in their dress had money for exchange, & until noticed & hunted off by the native police did business with the men. 8 or 10 copper coins would be thrown down into one of the barges & immediately result in a cessation of work & an excited\n\nrough-and-tumble for the money.\n\nThe adjutant ( only a 2nd Lieut) of the Royal Garrison Artillery came on board with instructions from the authorities regarding shore-leave & had breakfast with us, coming up from which we were met by numerous enquiries for washing, for light suits etc: I got a uniform jacket & trousers, getting his price from 35\/- down to 25\/-. \n\nFor about ¾ of an hour I was on guard on the gangway while the officer of the guard went down for breakfast & while there had an opportunity of seeing the antics of the natives on the barges & in the water.\n\nSoon the Colonel called the officers together & announced that only 500 men would be allowed ashore at a time & that they would simply be taken for a route march by their officers thro’ the town, going to the barracks before returning so that they might have a beer at the wet canteen. This was slightly varied, the 3 infantry units (600 men) going in the morning & the remainder in the afternoon.\n\nAt first there was a good deal of disappointment that free shore-leave was not to be granted, but we told the men that we were lucky to see anything of the place at all. Soon after 10 o’clock 4 empty lighters were towed alongside & the men embarked on them. By this time the cool breeze that had been blowing had dropped & it became rather warm, - not a really trying heat however.\n\nAs we were towed to the wharf we passed one of our hospital ships (?Kyarra) with wounded on board, & there was a great exchange of cooees & cheers. At the wharf the men were drawn\n\n \n\nup in their companies & marched off in column of route, a native policeman on a bike leading as guide. All along the route we were besieged by \"niggers\" wanting to sell silk belts, handkerchiefs, jewellery, fruit etc & we made no attempt to maintain any march discipline. \n\nThe native means of conveyance of course attracted attention immediately, & it was rather tantalising to see one of the passengers go bowling past in a rickshaw with a laughing wave of the hand. The rickshaws were all built by European coachbuilders; I expected to see some native built. Then again they were lighter than I had pictured.\n\nThe waggons drawn by 1 or 2 Indian cattle of diminutive size & thatched with leaves also created a good deal of interest: some of them were very heavily loaded up, the driver either walking at the head or else sitting on the pole where it joined the body. The natives reminded me considerably of the Indians in Fiji, excepting the Cingalese with their peculiar comb. \n\nOur march took us up the city past the Post Office, the Lighthouse & other rather handsome buildings out to the walk along the beach for a short distance, & then back into the city & along to the barracks. Here a number of natives with cocoanuts, bananas, pineapples & mangoes were waiting, & when the men were allowed to break off while awaiting their turn to go the canteen, they did a good trade with small pineapples at 3d., drinking cocoanuts 3d., mangoes 1d., & bananas (really a plantain, very small & with a slightly acid flavour) at varying prices usually abt 3d. per hand.\n\nWhen the men had all had their turn at the canteen we were taken to the sergeant’s mess where drinks were served, & at about 1.30 the men were formed up & marched down to the wharf where, with a little trouble over some who would break back, most were got on board & towed out to the \"Osterley\". 1 officer per unit had to go back, the remainder being allowed to remain on shore until the second batch arrived, which was to be about 2.15. \n\nIt was my good fortune to remain ashore, & in this time I had a ride in a rickshaw up to the Post Office where I sent off the cable, & then down to the native quarter for a hurried look round. I made very few purchases, prices being much higher than I thought reasonable, & similar chances offering, than say, in Egypt.\n\nHurried down to the wharf to find no sign of the barges being ready to leave the ship & that all the other officers but one had gone to one of the swell places for lunch. The 2 of us had an ice-cream, meantime being shown fans & silk goods by pressing salesmen, & then went back to find the barges approaching. Some of the officers did not turn up, & when the artillery, light-horse, etc had disembarked, we got them in their units preparatory to marching off.\n\nThere was a lot of bungling about the moving off, no one knowing who was supposed to be in charge, & it was with some difficulty that I prevented the body breaking away off the wharf & scattering. As it turned out they might just as well have been allowed to go at once, for as we moved up the street\n\nthere was no allotment of officers to units & no control so that the men broke off as they pleased: the artillery officer simply said \"What is the use of trying to hold them?\" It could easily have been managed as well at it had in the morning, but actually the men straggled & got quite out of hand.\n\nI stayed with 2 of the officers to see if anything could be done, & abt 5 o’c went down to the wharf trying to get the men together for the barges which were to go off at 6 o’c. A number of the men came along in time, & then instructions came from the colonel that 3 officers were to take separate pickets out & round up stragglers.\n\nIt took some time to get the pickets together, & by 7 o’clock we were ready & took the men to the canteen at the barracks where for 6d. they were able to get biscuits & cheese & a pint of beer: a meal at one of the eating houses would have cost 3\/- to 4\/-. Thence I took the picket from pub to pub getting stragglers away. There were a few cases of rather bad drunks, but nothing like the state of affairs at Freemantle, which rather surprised me as I had heard that most of the liquor sold was very vile stuff.\n\nIn the native quarter it was pretty dark, & I was rather sorry I had not my automatic as the picket was quite unarmed: in the morning I had put it with my camera on my belt, but when the orders about marching thro’, & not breaking off came out, considered it quite unnecessary and\n\n \n\nleft it behind. However nothing happened to my picket, tho’ one of the other officers had his stones at one place; it was not serious, just a few rocks flying & no one being damaged.\n\nWe were back at the wharf at 9 o’c as instructed & between then & 9.30 when the last tender left for the ship, had numerous excursions after men who had broken back after having been brought down to the wharf. \n\nAgain I expected to find the next day that several men had been left behind, but all were present when roll was called. We go on board by abt 10 o’clock but I did not turn in till abt 11.30. The sailing notice was for 10 o’c but she really got away abt ½ an hour after midnight.\n","19":"\n\nA beautifully clear sunny day, with a cool breeze making it very pleasant. The sea was wonderfully smooth: the breeze prevented anything like a \"glassy\" sea, but there was hardly any motion, & when one was down in the bathroom the ship might well have been in the harbour for all the difference the sea made. \n\nThe daily routine was not varied, excepting that the colonel held a court & dealt with some dozens of men whose names had been taken for overstaying leave, - not coming back on the lighters at the proper time. In many cases his fine of 5\/- seems to me to be very inadequate. \n\nDuring the day we passed 5 vessels. One was a vessel we had seen in Colombo & had left some hours before us; the name \"Legazpri-Barcelona\" was painted in large letters on the\n\nside, & towards the bows were alternate horizontal red & yellow bands. Another of the vessels was the \"Orsova\" going in the opposite direction & passing quite close to us. She is now painted the neutral leaden colour being adopted by the Orient Co now that there is the submarine menace in the Mediterranean. At the same time that the Orsova was passing us another large vessel was to be seen abt 3 mls away & it made one realise that if an enemy submarine or two could get on to this ocean path, a great deal of damage could easily be done: any one of the 3 of us would have made a decent prize, - from their point of view.\n\nDuring the day flying fish (smaller than those seen further south) were very numerous, & I saw a number of dolphins as well.\n\nShip’s run to noon was 151 mls.\n","20":"\n\nAnother day with perfect weather & a similar sea. Two vessels’ lights were seen in the small hours of the morning two more passed during the day, showing that we are still on the regular ocean track.\n\nAfter the parade the usual Saturday aftern. alarm was given & the men sent off for their life-belts. After coming up to their parade grounds nothing further was done – they were just dismissed. In the evening a concert was given by passengers & men.\n\nShip’s run to noon 355 miles.\n","21":"\n\nAnother beautiful morning. In the afternoon the breeze freshened a little & the sky was overcast. There was a small amount of motion & a shower of rain.\n\nAttended Holy Communion in the morning instead of doing physical drill: it was a fine service, the last, I expect, before landing, & there was a splendid attendance of about 120 soldiers. \n\nAfter breakfast the usual Church Parade & Commander’s Divine Service were held together at 10.15, the organ being taken along to the end of the 2nd deck where all the concerts etc are held. The Commander & chaplain read parts of the service between them, the Purser read the Scripture lessons & the chaplain gave a short address on 1 Sam. IV? \"Be strong, quit you like men, & fight\", & was well listened to by all. \n\nThe spare time during the day I spent in letter-writing. Towards evening the wind blew rather strongly from the N & there was a good deal of motion, - sufficient to send some of the passengers down.\n\nShip’s run to noon 360 mls.\n","22":"\n\nA clear fine day with a smooth sea. Passed a fairly large steamer in the distance during the morning.\n\nParades held as usual. In the evening the finals of the boxing tournament were fought & attracted much interest. Several rounds of the chess tournament were also played & proved interesting games.\n\nShip’s run was 364 mls.\n","23":"\n\nA fine day in general, tho’ we ran into 2 or 3 rail squalls. When we woke land was in sight on the starboard (right) side & proved to be the island of Socotra. It was not very clearly visible, but appeared to be rather level country with a steep line of cliffs in our direction.\n\nBy the time the sun was up we were nearly past the island. However we had a magnificent view of the 3 islands lying to the N of Socotra, know as \"The Brothers\". The first 2 were very similar in outline & showed clearly why they get the name. the 3rd was much larger & very different.\n\nAfter breakfast I went on to parade but was sent for to help mark the essays on \"Life on a Troopship\" handed in by the men. It meant staying off parade & gave a good opportunity of seeing the islands as we passed them. I have tried to sketch the outlines. They were all very rough & rugged & without any sign of life on them. In one case the bold outcrop of stratified rocks, the bedding of which could clearly be seen with the glasses, was striking. The sea-face was deeply scarred by numerous valleys giving the impression that rain, & heavy at that, must be frequent. \n\nAs we passed 2 squalls passed over the islands & came out to meet us.\n\nBy midday we were clear of the islands, & about 3 o’clock Cape Gardafui showed \n\nup on the opposite bow. Here again the country was very rugged, & behind the coastline heavy ranges of mountain could be seen. It was our first sight of Africa, & one wondered what the continent had in store for us. At one place the high cliffs gave place to a sandy beach on which a settlement comprising 3 large white buildings in the midst of a native village could be easily made out with the glasses. Numerous stories about the savage nature of the inhabitants of these parts were going round & made me wish I knew something about their history. \n\nWe were skirting along the coastline making diagonally across the Gulf of Aden until darkness fell with its usual suddenness. The evening was glorious with a cloudless starry sky & a ¼ moon, the sea being wonderfully calm & a cool pleasant breeze blowing from the N. Very beautiful phosphorescent patches of water added to the beauty of the night, flashes made by the fish darting about the surface showing up some distance from the vessel.\n\nDuring the afternoon the inter-unit competitions in rifle exercises were carried out, & the final of the tug-of-war won by the artillery. In the evening the commander gave a lantern lecture showing views of the various capitals of our states, & telling yarns about his experiences at sea.\n\nShip’s run was 381 mls.\n","24":"\n\nA beautiful clear day such as we had wished for yesterday to show up the islands we passed. In the sun it was hot, but between decks on the parade ground quite pleasant. The sea continues to be wonderfully smooth giving practically no motion to the ship. \n\nParades were held as usual; during the morning I took the semi-finals & finals in bayonet fighting & singlesticks, the contests being very good. \n\nBy midday Aden was in sight, & as we passed it some 25 miles(?) away during the early afternoon it was a very pretty sight, looking for all the world like an island: there was not a sign of the mainland. The faint smoke of a steamer between it & what looked like another island but was probably another cape or promontory, added to the beauty of the picture. \n\nAnd yet this was far excelled by a portion of the Arabian coast passed just before sunset. Tall rugged cliffs in which the lights & shadows were in sharp relief, with range after range of dim mountains which seemed to be several thousand feet high rising in the background, & 2 Arab dhows sailing in the direction of Aden made a scene that I tried feebly to sketch. It was simply beautiful.\n\nDuring the afternoon we passed about 7 vessels going towards Aden, one of them a 4 master without funnels – an oil vessel. There was a very fine sunset in which the hazy\n\n \n\noutline of the African coast could just be distinguished, showing that we were approaching the exit from the Gulf of Aden to the Red Sea. \n\nAbout 8 o’clock we were going through the straits, the lights of Perim showing clearly on the starboard bow: in the daytime land is also visible on the opposite side, but we could see no sign of it. Four vessels passed us, 2 of them being quite close & calling forth great cheering & cooeeing from the men. A third was a long way off & the fourth was a British cruiser said to be the \"Minerva\"(?) which is detailed to patrol these waters. I saw her flashlight going & she asked us our name, refusing to reply to our query as to who she was. Afterwards I learned that a warship at night can always be distinguished by the fact that her head-lights are immediately above her side-lights.\n\nA glorious night, Venus & Jupiter being especially bright, & the moonlight shimmer on the waves very beautiful. Phosphorescent patches still abundant. \n\nShip’s run to noon 388 miles.\n\nThursday 10 February 1916\n\nA clear sunny day, the heat of the sun being tempered by a cool N breeze. A fair roll during the morning but very little motion later in the day. \n\nWhen we woke a small island with a lighthouse on it was in sight a couple of miles to the N, & the sentry told me that we had passed 2 other island lighthouses during the early hours of the morning. About 8 o’clock we were abreast of another small island\n\n \n\nwith a lighthouse on it; it appeared to be about 200ft high, rocky & fearfully desolate looking land. The eastern end, lighted up clearly by the rising sun was very interesting, a heavy landslip having taken place & left a fresh face of the cliffs in which highly contoured sedimentaries showed minor folds & faults when examined thro’ Father’s glasses. Near the lighthouse was a dwelling house, but there was no sign of life, the whole place looking fearfully dreary. \n\nParades held as usual, but during the later part of the morning & during the afternoon parade I was up on the boat-deck with the other officers attending a gymkana or sports meeting of 1st saloon & A.I.F. officers. These included a march, blindfolded & guided by a lady holding the reins, thro’ a mazework of empty bottles, pillow-fight sitting astride a spar, a drawing & whistling race in which the men had to run to their partners & respectively draw a picture of an animal & whistle a tune, the ladies writing down what they recognised & returning it by their men to the winning post: an animal medley, hanging monkey, placing eye in a pig while blind-folded & similar ship-board sports filled up the programme, from which, solely as an onlooker & non-partaker in any, I got a lot of amusement.\n\nDuring the day we passed a large number of steamers chiefly outward bound: one of the ship’s officers told me that in peace time instead of the 8 or 10 we should\n\nhave passed 20 or 30.\n\nIn the afternoon a very serious case of pneumonia died: every effort was made by doctors & the 2 Army Nurses on board. He was one of the Remount Unit, bound merely for duty at Base in Egypt, & was well on in years. \n\nThe Burial Service with military honours was most impressive. All the men were in full uniform in their places for Church Parade when the Chaplain came along at ¼ to 6, & there was a most marked silence right thro’ the ranks as he commenced to read the service. The hush also extended over the passengers who had congregated at the end of the 1st saloon deck, & it must have been a memorable thing for them to look down on the uncovered heads of the 1200 men. \n\nAt abt 5 to 6 the engines were stopped, adding further to the impressiveness of the scene, & in dead silence the body was committed to the deep from the stern. A firing party from the Light Horse fired 3 volleys & our","25":" of 2nd bugler blew the \"Last Post\", then the engines were started & the parade dismissed.\n\nA concert was to have been given by the stewards &: ship’s company but was postponed for 24 hrs. During the evening after dinner was with half a dozen other officers helping the censor get thro’ his big job. The previous night it was 11 o’c, an tonight 10.30 when we finished.\n\nShip’s run to noon 395 miles, the best we have done.\n","26":"\n\nA clear fine day with a very pleasant cool breeze. \n\nParades held as usual, but in the morning, with the orderly’s help I did most of the packing. During the day we passed several vessels going in both directions: in the morning a large boat going in the same direction was in sight, &: it took us until 6 o’c in the evening to overhaul &: pass her. She was quite close &: proved to be the French mail steamer \"Athos\" plying between Marseilles &: China. She seemed to be carrying a few troops, probably French reservists.\n\nIn the evening the prizes donated by the passengers for the various competitions were presented. A sum of £45 was subscribed for prizes by the passengers, in addition to the £30 given for gramophones, games etc early in the voyage.\n\nAfter dinner the Steward’s Concert was given on the well deck where the troops &: passengers could see, &: proved to be simply splendid. It lasted 2½ hours, there being 6 items before &: 6 after the interval, including one or two comedy sketches in addition to songs etc. as a climax a \"Foo-Foo Band\" of abt 20 members very variously &: curiously arrayed &: supplied with instruments (?) caused roars of laughter.\n\nA collection in aid of the fund for supplying tobacco to our soldiers &: sailors was taken up at the interval &: realised £:30, the major part, of course, coming from the passengers. I don’t think the men will ever forget the entertainment. During it there was no motion at all perceptible. A clear starry night again.\n\nShip’s run 344 miles.\n\nSaturday 12 February 1916\n\nA bright clear day, hot in the sun but with a fairly cool breeze blowing from the N most of the time. The sea was most wonderfully calm, quite glassy , with not even a swell on. The waves made by the ship were the only ones visible &: it was very hard to realise that we were out at sea &: not moored alongside a wharf in a harbour.\n\nParades were held &: were chiefly devoted to checking over &: fitting equipment etc so as to be ready for disembarkment tomorrow. No drill was done in our company.\n\nAbout 10 o’clock low rugged ranges of eastern Egypt came in sight on the port side &: we kept them in sight during the day. About half a dozen vessels were in sight at the time &: during the day several more were seen, in one case only funnel &: 2 masts being visible, floating on the horizon.\n\nIn the afternoon the mountains of Sinai Peninsula came in sight on the other side. Forgot to mention that abt 10 o’c in the morning 2 flat sandstone (?) tables of rock rising perhaps 20 ft above sea-level, one of which had a lighthouse on it, were passed on the starboard bow: they are known as \"The Brothers\".\n\nAs the afternoon wore on the beauty of the scene increased. Away on the left was the rugged outline of the African coast, a hazy blue in the distance, standing out against the clear sky: it must have been about 20 miles away. On the opposite side, &: lighted up more by the western\n\nsun was the more lofty but equally rugged range of the Sinai Peninsula, close against the coast of which a fair-sized cargo steamer could be clearly seen, like us making her way to Suez at diminished speed, \"cutting out the time\".\n\nBehind us, across the glassy ocean were several steamers following in our wake, one of them on the horizon appearing to be floating in the sky, owing to the mirage. Right in front of us were several islands, one of which we passed within abt 800 yds on the western side. The sun was behind it but tried 2 or 3 snaps. It was composed of sedimentaries of which the bedding showed up clearly: a band of white ? limestone stood out in one place. On every side it was seamed &: furrowed to an extraordinary extent, &: seemed a most desolate place for even a lighthouse keeper to stay at. The weathering was a most marked feature, on or two examples of aerial denudation being clearly visible. The surface in every direction seemed to be covered with rubble &: detritus: no vegetation was to be seen, tho’ there was distant evidence of a rush of water down some of the steep gullies.\n\nThe sunset behind these rugged hills was glorious, the tinting of the cloudless sky being exquisite. At night numerous lights were passed, showing that land was close by &: that the captain would probably spend the night on the bridge. More breeze at night.\n\nShip’s run to noon 355 mls, with 248 to go to Suez.\n\nSunday 13 February 1916\n\nAwakened at 4.30 by the orderly sergeant &: had a bath &: got properly fixed up before commencing duty as orderly officer. It was still dark when I got up on deck, to find that the lights of Suez were visible ahead in the distance, &: that there was just a flush of light in the east, followed, however, by the customary flood of light of the rapid dawn.\n\nKnowing the work that lay ahead it was hard to realise that it was Sunday, &: much more difficult during the day to remember it. When it was light we could see away on the right the distant mountains of Sinai Peninsula, the intervening country being low-lying. Jutting out was the break-water behind which, when we had entered I counted 28 vessels, most of them being transports; there was one small cruiser among them, &: on the right were 3 larger British men-of-war, one of them apparently a battleship: they seemed to be surrounded by a floating boom of some description.\n\nIn addition there were a large number of native dhows, looking very picturesque &: in every way similar to the pictures of them I had seen: a fairly large, heavy hull &: tall mast with its long spar crossing it obliquely &: carrying a large sail. The Arab boatmen were dressed in flowing robes for the most part, &: seemed much for stolid than the boatmen we saw in Colombo.\n\nIn the town were very distinct signs of the East. Square white buildings, slender minarets &: scattered mosques were all reminders that at last we had arrived in Egypt. Over on the left\n\n \n\nat the water’s edge were a number of large white tanks or reservoirs, I expect for oil.\n\nSoon the ship was anchored &: after waiting for some time the doctor’s launch came out, followed by another boat bringing about ½ a dozen soldiers to act as guards at the gangway. After practique was granted there came another wait before we moved up alongside the stone jetty which led to the breakwater. The train line came right down the jetty which was stacked here &: there with large heaps of coal which was being taken on board by the steamer on one side of us, while on the other side mules &: soldiers were being loaded for the Persian Gulf operations.\n\nVery soon two or three officers came on board to hand over to the Colonel instructions about disembarking. A batch of about 20 natives also came on &: set to work carrying bundles of the blankets &: hammocks used by the men down on to the wharf where they were stacked &: left with a guard to be taken away the next day. Bales on new blankets for issue to the troops, biscuits, &: bully-beef were also landed.\n\nArrangements were made for the troops to land &: be taken to one of the Cairo camps by 2 trains, the 1st of which was to take the artillery &: light horse &: was to leave at 4 o’clock, but when twelve, then one, then two o’clock passed, our chance of getting away until very late looked decidedly blue. While waiting rations were issued to the troops, &: the time spent by them (my orderly officer’s duties kept me\n\nfairly busy all day) watching the various scenes on the jetty. 2 or 3 Egyptian policemen dressed in a neat navy uniform with the red fez &: black tassel, &: armed with a long 3-cornered bayonet in addition to a cane at once attracted attention by the vigorous way they wielded their canes when one of the \"niggers\" on the wharf went to near the piles of gear or got in their way.\n\nMuch amusement was caused by a native acrobat turning somersaults, walking on his hands, etc, &: at the conclusion holding out his cap for bucksheeh. This was fairly freely given by the men who were very wild when a rush by other loiterers was made to grab some of the coins: this changed to delight when one of the policemen pounced on one or two of them &: lustily laid his cane round their shoulders.\n\nThe unloading of the bales of blankets etc was interesting. They were brought up on deck from the hold by the winches &: then to the monotonous chant taken up by all the coolies, - quite timeless to my ears, - four men lifted the bale on the back of the coolies doing the carrying. These men had over their shoulders a coarse bagging &: horse-hair pack coming down to the small of the back: this acted as a buffer between the load &: the back &: by friction, also kept the load in place.\n\nThe bales contd 50 blankets each, but were carried with ease once they were placed in position on the back. Wherever a gang of Arabs was working there was a boss who always carried a stick or piece of board. A flourish from which very\n\nSpeedily ended any argument that his coolies may have been engaged in.\n\nAbout 2 o’clock the troop-train came along comprising several baggage vans, 3rd class vans more or less like our cattle trucks at home, 2nd class carriages fitted with seats somewhat like our suburban carriages but much smaller & one","27":" class carriage for the officers, a corridor car well finished & upholstered. The wheels were solid, there being one pair at each end & one pair in the centre of the carriage: the gauge is narrower than ours at home. \n\nThe troops entrained & moved off at abt. 2.30 & I was able to get a snap of the train as it moved out. Soon afterwards the infantry units disembarked, but not until abt. 3.30, the time the boat was timed to leave. As a matter of fact our train moved out from the jetty just as the \"Osterley\", amid much cheering & waving from the train commenced to move out from the jetty: I got a snap of her from the train, where as soon as I entered an obsequious native took my pack & equipment & put it on the rack & then proceeded to dust my boots! His backsheen was not forthcoming.\n\n The train moved off rather slowly, taking us thro’ the town of Suez where English & Indian soldiers were much in evidence. Of the latter we saw squat, Japanese – like Ghurkas, small looking Bengal Lancers, Punjaubis of normal height, & big, bearded Sikhs\n\nwith the ample turban. Various regiments of Kitchener’s Army were represented among the British tommies & the Navy was represented by jack-tars & men of various ratings in the \"square rig\" & peaked cap.\n\nEnglish residents were not uncommon, & natives in different costumes from an immaculately dressed gentleman in sac suit & fez & silk umbrella to the filthiest of filthy beggars in nothing but rags, - rag-shops one of the men called them. Scores of girls & boys of various ages ran along the road at the side of the railways holding out hands or robes with cries of \"Backsheeh, master\": a coin thrown was at once pounced on & unhesitatingly thrust into the purse of natives, - the mouth, - quite regardless of dust etc that might be adhering. Their robes were of all kinds of gaudy colours, merry faces generally, with eyes bunged up with sandy blight in many cases.\n\nFrom the town the line led out to the canal, which it followed, distant from it about a mile, for half the length of the canal. Ahead the smoke of several ships going thro’ showed the direction it took, & behind was the French mail steamer \"Athos\" mentioned in page 53, followed shortly afterward by the \"Osterley\".\n\nThere were numerous stops, at one of which I was able to take several snaps, & before darkness fell we had some very pretty scenes that I wished you could all have seen & enjoyed.\n\nNumerous encampments of British\n\nand Indian troops, in the former case largely composed of Royal Field Artillery, were passed thro’, the typical scene being scattered sentries smartly pacing their beat, with the main body playing football or looking on: here & there were groups sitting round fires in the open. Between encampments we passed 2 or 3 groups of 3 or 4 horsemen running a race over the level country, much to the delight of the troops on the train.\n\nOut in the direction of the canal were some most delightful scenes. A faint streak of blue was all that could be seen of the water. Here & there were plantations in which graceful date-palms were most conspicuous; patches of green showed that some crop was being grown under irrigation but what it was could not be made out: some looked like a cereal, other like Egyptian clover, & once or twice could distinguish sugar-cane. \n\nThe houses were either square white places with stone steps outside, or else low squat mud huts only abt. 4 ft high, with several openings to them in these a fire could occasionally be seen. Along the road here & there were natives riding on donkeys, sitting right back on the rump, & in one place there were 2 or 3 servants (?) running behind a rider who was clearly their master. Not only were the donkeys used as mounts, but harnessed to vehicles they were common & looked quaint, sometimes there was only the one, at other times two to the waggon. \n\nThe railway line was single with sidings at intervals. The stations were generally just huts, - in every case protected by sandbags, - & the station platform only 10 to 20 yds long.\n\nAltogether the journey was most interesting & I was quite sorry when darkness came, altho’ similar scenes in the soft moonlight were lovely. The chief steward had put up some tea for us, ham & chicken, bread & butter etc & we had quite a merry time over it with only pocket-knives to aid us. When it was finished we stretched out on the seats – there were any amount, abt 12 os us having the carriage to ourselves, - & as best we could in the cold, tried to get some sleep.\n","28":"\n\nAbout half past one in the morning the train pulled up with a jerk at a fairly large station that was our destination, Helmeah by name, where we were met by 2 detraining officers. With some difficulty the men were rooted out & fallen in, & then came a march of a couple of miles past Feitoun to Aerodrome Camp, situated on the outskirts of Heliopolis Camp. Very little could be seen in the pale moonlight, but we were told that we were 5 or 6 miles east of Cairo, Aerodrome being practically the oldest of the Australian camps.\n\nAll of us were very cold & tired by the time we arrived, finding the Adjutant & Quartermaster awaiting us\n\nto us into huts for the night. These huts are long sheds in pairs as at Liverpool, but here made of reeds tied together as used to be done in Fiji & attached to a wooden framework of the house. Roof is of similar material but we had heard that they only get rain once in 7 years in Egypt. Floor simply bare ground, here quite solid & gravelly, in places shingly, the water-worn pebbles as far as yet noted being quartz or quartzite.\n\nA cup of tea & biscuits were ready for the officers, but for none of us were there blankets & we had to spend the rest of the night as best we could: I had taken the precaution to bring my sleeping bag, but as the orderly had nothing I gave him the rug, waterproof sheet & air-cushion & managed with greatcoat in the sleeping-bag but with little success. A good deal of time was first spent in trying to get the men settled down, & very soon after dropping off myself reveille went at 4 am for a part of the battalion that was moving down to Tel el Kebir, & when daylight came none of us had had much sleep: one of the officers was so chilled to the bone that he was confined to his bed for 3 or 4 days afterwards: \"influenza\" was the doctor’s verdict.\n\nWe had breakfast in the mess & very hungry we were. The morning was clear & sunny, & we were quite glad to get in the sun. at 10 o’clock a parade was held & the units inspected by the C.O. of the battalion, (known as the","29":" (N.S.W.) Training Battn) who is Major Hurcombe V.D., one of\n\nthe officers in the landing at Anzac. The inspection lasted for sometime & then came a medical examination running on to lunch time. The officers were then allotted to tents, large square ones about 22’ X 16’ in which 6 are quartered. \n\nIn the afternoon the time was spent in fitting & rearranging the men’s equipment & in shaking down into our quarters. A number of things are very different to what we had been led to expect: for instance at Liverpool we were told that here only a private’s jacket would be worn, whereas at Aerodrome Camp at least it is almost frowned upon. Officers are expected to wear a distinctive uniform to the privates, & while there may be something in it in a smart place like Egypt I certainly do not intend to wear anything but a private’s uniform into action.\n\nIn the evening after mess the adjutant gave a lecture on some points in the battalion routine, & after it I was glad to turn in early.\n","30":"\n\nSlept better than the previous night, altho’ the bed seemed much harder than the shipboard bunk. My orderly had managed to annex from somewhere a native bed on which my bunk was made up: these are made of what look like split midribs of palm leaves, the longitudinal ones being bored & having uprights inserted in them every 3 inches or so, making merely a skeleton box\n\non top of which the bunk is made.\n\nEarly morning parade is from 7 till 8.30 & seemed rather long: we get a cup of tea, but the men get nothing before their breakfast at 8.30. forenoon parade is from 9.45 till 12.30 & the afternoon on from 2 till 4.30. \n\nThe morning was dull with a light sprinkle of rain: we were inspected on the forenoon parade by Brigadier General Spencer Brown commanding the brigade, this taking all the morning. After lunch a smart shower of rain fell & as we were about to fall in the \"no parade\" sounded, so that we had the afternoon off. The rain came thro the thatch (?) roof of the huts in all directions & the men had to rig up their waterproof sheets to keep the rain off their gear, for there was a steady fall during the afternoon. \n\nJust before dinner Lloyd Jones came along: he was about to leave with another detachment for Tel el Kebir, a further batch from our battalion also leaving very early the next morning. Another lecture by the adjutant at night.\n","31":"\n\nA bright clear day but rather cool: I found the breeze cold at times. Our Company was for duty & had to supply guard & all duties & fatigues so that there were no men for parade & I spent the day in chasing round looking after fatigue parties, & in writing.\n","32":"\n\nA beautiful day, cold in the morning & evening but nicely warm during the day.\n\nEarly morning parade as usual, & there was plenty of doubling & movement to keep the men warm. Marching in at the head of the column from the forenoon parade I got a great shock to find Ollie standing near our orderly room: Rid was inside enquiring where I was & as soon as parade was dismissed I joined them. Ol was looking fairly well but Rid had evidently not recovered altogether from his tonsillitis. At once went to the Adjutant & got leave for the afternoon. \n\nAt once changed & went out with them, getting a \"garry\" (carriage) close by in which we drove up to Heliopolis. The garry is really a low phaeton usually drawn by 2 horses, two natives generally sitting on a box seat. To a large extent it takes the place of the Ceylon rickshaw in that officers almost invariably ride in one instead of walking. The fare is set down as 3 piastres (2½.) per kilometre when reckoned by the distance & 5 P.T. (I think) 10p.c. per hour when taken by the time. Most of the horses are miserable weedy animals but the vehicle rides very smoothly.\n\nTo the town of Heliopolis the road took us through the camp on the outskirts of which were numerous canteens that seemed to be well patronised by our troops: some of the legends were rather amusing, e.g. \"The Meeting Place of Brave Soldiers\", \"Where friends meet\" & so on. \n\nThe camp gave place to the town of Heliopolis, said to be only about 10 yrs old, & rather a decent place. Streets in first class condition & buildings of stone or plastered material\n\nrather imposing from a distance with their domes, small balconies & other characteristics of Eastern Architecture: when examined closely, however, it seemed that the workmanship was shoddy, or at any rate not what the distant view had led one to expect.\n\nOur garry took us to the tram line near No 1 General Hospital at Heliopolis, whence two lines go into Cairo, the one a round-about route going thro’ the native quarters, the other being a suburb of Cairo perhaps 4 miles out in an easterly direction. The trams are electric & have 3 classes in any of which soldiers in uniform go for half fare which first class into Cairo cost 1 piastre, the journey taking abt 20 minutes. There was not much to be seen in the Cairo streets when we arrived, the universal custom being to lie down wherever you may be & sleep until 3 o’clock or there abouts.\n\nThe sight of a squatting \"nigger\" by a luggage cart, fast asleep, & of a number of others sitting against walls in a similar state first called my attention to the custom.\n\nFrom the tram we had a walk of abt a couple of hundred yards to the pension where Ol & Rid were staying, a quiet place centrally situated, & comfortable. We had lunch there & then decided to go out to the pyramids, but they first showed me where the A.I.F. Headquarters, the Anglo-Egyptian bank & one or two other interesting places were.\n\nWhile waiting for the pyramids trams I espied the son of Mr Watts, the Station Master at Chatswood, & from him (a corporal in the A.M.C.) tried to\n\nfind out where Leo is stationed.\n\nThe wait for a tram was long & tiring & we were about to go somewhere else when one tram came along. Ol got a seat but we had to stand thro’ the hour’s run, practically all the passengers being in uniform, that is the 1st class passengers. \n\nIt was a very interesting ride, the first part being thro’ the city to one of the bridges across the Nile. In the streets were scores of interesting scenes, cafes with the tables & seats extending out on to the footpath, dozens of donkeys with the rider perched over the rump or else harnessed to carts or waggons, in other cases loaded with huge piles of Egyptian lucerne, one on each side, one on each side, vendors of native food made up into rings about the size & shape of an iron quoit or of lemonade etc carried in a large earthenware or brass vessel with a dozen pr more brass drinking flagons attached to it, & so on.\n\nThe Nile is spanned by a very fine steel bridge, the stream being abt 100 yds wide at the point: the centre of the bridge is pivoted & can be raised somewhat like the Pyrmont Bridge to allow of vessels passing through. A number of dhows moored against the bank or slowly moving in the stream looked very picturesque with date palms & Egyptian flat or domed houses along the banks. Two fairly large boats with paddle wheels, exactly like the pictures commonly seen, were also noticed.\n\nArrived at the opposite bank we found ourselves on an island made by the branching of the river at this point, the island being under cultivation for the most part, & seemingly being very fertile.\n\nThe second bridge from the island to the western bank of the river was not so elaborate, the stream being slightly narrower than on the other side. The line led through fertile fields thence almost up to the pyramids: lucerne was the commonest crop & was growing luxuriantly, stray charlock (wild mustard) plants with their yellow flowers standing out prominently.\n\nThe irrigation water was applied when the crop was abt 6 inches high in one place. I could not see how the natives cut it, but when cut it was piled on to donkeys’ back, a huge bundle hanging on each side in place of panniers, & a native perching himself in between the two on the rump, & seemingly guiding the animal by flicking one ear or the other with a switch.\n\nOnly one plough was seen, drawn by 2 Indian oxen or buffaloes, the distance being too great to distinguish which. A cylinder fitted with a kind of Archimedes screw was seen in operation raising water from a canal over the embankment of the field, & in another a buffalo was lazily lying in a lucerne patch recently cut, & scampering over its back were two black & white kids!\n\nI saw 2 sheep, most peculiar animals, lean & large-boned with big brown lop-ears & long tails. A cereal (probably wheat) about 8 inches high & sown very thickly was also abundant, sugar-cane being about the only other crop noted: the latter was poor compared with what I had been accustomed to in Fiji: one small patch of cotton was seen, but only abt ¼ acre.\n\nAbout ½ way out to the Pyramids are the Zoological Gardens, - said to be good, - & near them, as at several spots along the route was an encampment.\n\nFor the latter part of the journey the tram line runs between an avenue of (I think) flame trees, distinguished by their pinnate leaves & large pods. Away in the distance was the Mena Camp on the right & the Pyramids on the left, & round to the south, following the low ridge skirting the fertile flats was another large pyramid abt 15 mls away, the edges appearing coarsely serviate due to large steps apparently.\n\nThe final stretch of the avenue was perfectly straight & was done in fine style by the tram with scarcely a stopping place.\n\nAt the terminus was a fair-sized refreshment room & close by it a large building of several stories height known as Mena House. At present it is being used as a hospital, inmates in the light blue woollen dressing gowns being seen all over the grounds. \n\nClose to the refreshment room on the other side was a small Bedouin encampment that looked quite interesting, - from a distance. Tiny squallid tents of rough horse-hair material that had once been striped & gaudy-coloured but now are frayed & torn & muddy were occupied by dirty looking women & children sharing their space with mangy dogs & shaggy goats. Fires emitting plenty of smoke were smouldering in some of them, & for a very good reason since the fuel is simply manure puddled & made into thin round pancakes by the women who then spread it in the sun to dry: numerous parties of women engaged in this work were seen along the route as we came out. \n\nThe menfolk were\n\napparently the numerous camel-drivers congregated under the trees at the head of the avenue with their picturesquely draped nonchalant beasts waiting for fares at 1\/- per head to the sphinx & back. Only when a fare engaged an animal & the owner pulled on its single rein to bring the head down & induce the animal to kneel down did he seem to care, & then his protestations were loud & vile: Ol insisted that it was swearing in camel language.\n\nWe did not ride but strolled along the road past Mena House (abt 200 yds only from Cheops) where a turn in the path brought us face to face with the Pyramid of Cheops with the 2 Pyramids of Khephren & Mycerinos on its S.W. flank, the 3 being in line abt 700 yds apart. Khephren seemed slightly smaller than Cheops & was easily distinguished by having its point smoothed off, Rid told us that originally all 3 were \"plastered\" over so, but that the Mohammedans had spoiled all but that tip: Mycerimos is by far the smallest of the 3.\n\nOn the top of Cheops a flagpole with 4 struts is erected to show the height the pyramid was originally before the point was spoilt, & on the Mena House aspect (facing us) & about 1\/8th of the distance up from the ground was the opening to the interior: from this platform it was easy to see the track worn up the edge to the summit, & we were sorry the time was so limited that an ascent was out of the question: several pigmies on the summit were soldiers & Arabs in flowing robes.\n\nAt the base of Cheops to the N & W was the buried village that has been unearthed & which Rid said is very interesting: we had\n\nno time to even glance at it but went straight along past Cheops to see the Sphinx which is abt 800 yds to the S.E. of Cheops, stopping to take one or two photos on the way.\n\nIn the lose stones & rocks lying about, - sandstones, mudstones etc – were numerous organisms which I could not with the hurried glance place at all.\n\nComing to the Sphinx the first feeling was that of a great disappointment. Pictures had given the impression that it was a huge affair comparable to the pyramids in size, whereas it is really a small affair carved out of stratified rock. The photos I took will I think show how the false impression is created by taking the photo with the Sphinx in the foreground & pyramids in background. Round the base of the Sphinx is a fair sized excavation so that at ground level one stands on a level with about the chin of the face: from the base to the crown the height is perhaps 40 or 50 feet.\n\nJust beyond the Sphinx are the remains of a temple built of huge granite blocks, the whole having been excavated from the sand: some of the blocks of red Assouan granite were 15 ft long by 4 ft by perhaps 5 ft thick & one wondered how they were brought by the old Egyptians.\n\nOne wished for plenty of time to investigate the whole surroundings but it was a matter of getting one or two snaps & them hurrying back to the tram terminus. Passing Cheops it was incongruous to turn your back on the pyramid & find a \"White Horse Whisky\" advt facing you!\n\nOur tram did not move off until 6 o’clock, having then a full complement of officers including a general: in Cairo generals are said to be as common as gooseberries on a bush, whereas if one appeared in Pitt St people would run to look\n\nat him. Although it was after 7 o’clock when we got into town Ol was sure that we ought to have afternoon tea seeing that the \"correct\" time for dinner in Cairo is 9 pm. Accordingly we went to Groppi’s, the Cairo Sargent’s & had a good time, then a short stroll through the streets & back to Pension Wales for 8 o’clock dinner, after which we had a short yarn before I caught the Heliopolis tram back to camp, arriving just after \"lights out\".\n\n It had been a most enjoyable afternoon with Ol & Rid.\n","33":"\n\nA fine day with parades as usual. Our company was one of the 4 detailed as inlying picquet, a body of 500 men ready at 10 minutes notice to be on the march in the case of an alarm being given at any time. It means no leave at all from camp & parading in full order 3 times a day besides sleeping in clothes at night-time.\n\nI had intended to try & get leave again so as to be with Ol & Rid, but of course had to give up the idea. The night was a glorious moonlight & starlight one.\n","34":"\n\nAgain a fine day. Physical drill in morning before breakfast, afterwards the company being at our disposal to correct the fitting of equipment & attend to other details. Spent the afternoon letter-writing & attending to small jobs. Same thing at night.\n","35":"\n\nA bleak raw day said by our Chaplain to be unusually cold for the time of the year. Attended Holy Communion, by Capt Maxted in the early morning, no parade being held, & at 9.00 went to the adjoining battalion\n\nwhere a parade for \"Other Denominations\" (than C of E) was held by a Presbyterian chaplain who took as his text \"What is man that Thou art mindful of him?\" & gave a simple talk on man’s place in the universe. The Brigadier General was present, came back to camp just in time for the big C of E parade here led by Chaplain who gave an address on \"Manliness\". \n\nThe midday meal was a formal dinner at which the toast of \"The King\" was honoured, 3 Canadian nurses being present as guests of 3 of the officers: it was a very drawn-out meal. \n\nSpent the afternoon letter-writing & reading, Len Hazelwood of the 11\/13th coming along for a yarn. At it again after tea.\n","36":"\n\nParades as usual, the day being clear & fine. Was not sorry to complete our duty as inlying picket necessitating our parading in full marching order at reveille, sundown & tattoo. Lecture at night.\n","37":"\n\nA fog in the early morning. The company was detailed for guard duty at Abassieh barracks which are the quarters of the Egyptian Army. Some weeks ago a portion of the army marched to the Sultan’s palace & demanded a rise in pay. Troops were called out & only dispersed the rising after firing on them.\n\nSince then the battalion chiefly concerned has been confined to barracks with a guard over it & this was to be our job. A day’s rations & 100 rounds of ball ammunition per man were issued overnight & at 5.30 the company fell in: this meant that\n\nwe had to be up earlier to get breakfast over. Officers were in full marching order with 2 blankets etc carrying loaded pistols (no service revolvers available yet). We moved off a little after 6 o’clock & marched towards Cairo. At Abassieh we found that there are nearly a score of barracks & no one could tell us which were our correct destination: sentries, native police, & strangers were interrogated in vain.\n\nWe were to report at 7.30, but at 8.30 we were still going, then Mr Vine Hall found the Commandant’s house & reported to him, only to find that 2 days previously he had written to our Headquarters to say that the picket should be discontinued since it was now unnecessary. It was after 10 o’clock when we started off on our return march & all of us were very glad when at last we landed up at home about noon. \n\nThe C.O. granted the company the afternoon off, & while most of the men took things easy in camp I went into Cairo (with leave) to look up Ol & Rid. It was a bright afternoon, & we decided to go to the native quarters to look at their bazaars. These proved very interesting though distinctly offensive to the sense of smell in many parts.\n\nA system of grouping is adopted, the fruit bazaars being together, also the brass-ware, books, jewellery etc. in places the \"streets\" were no more than 8 ft apart & then there were tailors & other workmen sitting out on the\n\n\"footpath\" plying their trade!\n\nOccasionally a donkey with a huge pack would be led along, carefully treading its way through the crowd. The surprising thing was that so many traders could keep going, for while we were about very few customers were to be seen. We ourselves were merely onlookers: I propose making my purchases of curios etc later so as not to have a big accumulation of stuff now: when I do it will probably pay to send my orderly to make them since most of the dealers have one set price for privates & a very different set for officers.\n\nWe passed 3 or 4 mosques & had a peep into them to see the worshippers devoutly at prayer. It was rather amusing to see men come to the door & have to take off a pair of heavy canoe-like boots & slip their feet into a pair of slippers dropped outside the doorway by the warden or whatever he was.\n\nThe afternoon was full of interesting scenes but we were not altogether sorry to get away to the European quarters for afternoon tea which we made bulky enough to answer for dinner as well. Went back to the pension & afterwards trotted round to one or two shops with Rid looking at cameras.\n\nGot home about 9.30.\n","38":"\n\nA nice fine day with parades as usual. No lecture at night so ran into Cairo & had a short time at the pension with Ol & Rid.\n","39":"\n\nFine clear with cool breeze. Work as usual.\n","40":"\n\nNot feeling to good but went out on early morning parade. After breakfast decided to rake the day off & turned into bed. Sore throat & general aches & pains.\n","41":"\n\nDid not get up, the doctor, who was a contemporary of mine at the Uni, coming from time to time to swab the throat & have a yarn.\n","42":"\n\nA nasty blowy day & stayed in bed again.\n\nTwo church parades, the C of E at 9.15 & Other denominations (taken by Rev Finigan, Meth.) at 10.15 were held on the parade ground just outside the tent, & it was nice to hear the hymns played by the band.\n\nIn the afternoon Ol & Rid came up & stayed for a couple of hours.\n","43":"\n\nA fairly fine day, & got up about 10.30, taking things quietly during the day.\n\nJust after tea my first Egyptian letter – from Lawry – was handed in, & later 2 more from C. South came along. Mail id wonderfully welcome.\n","44":"\n\nA bright sunny day, & after breakfast I got up for the day, spending the time waiting (when not yarning to the doctor) & strolling round quietly.\n\nAfter dinner at night Major Haircombe (our C.O.) lectured about the Anzac landing, tonight being the anniversary of the departure of the Australians from Mena for the famous campaign.\n\nLetters from Father & Evelyn recd.\n","45":"\n\nA nice bright day. Got up after breakfast & spent the morning letter-writing, going to Cairo in the afternoon to try & find the Ross More Pension where Ollie was to stay. Was unsuccessful & returned to camp about 5 o’clock with Capt Minty, our M.O., meeting in the tram an old H.S. boy & University contemporary in the person of","46":" Lieut Marcel Arousseau. He is with the 28th (?) Battn & was about to leave for Tel el Kebir.\n\nLetter-writing again after tea.\n\nThursday 2 March 1916\n\nFeeling right but stayed inside on a\/c of the weather. Hot & windy, clouds of dust & sand blowing everywhere, so much so that the C.O. ordered the afternoon parade to be cut out.\n\nSpent the time in the tent, censoring letters, reading up latest methods etc.\n","47":"\n\nFather’s birthday & many happy returns duly wished & a birthday party held with Ollie later.\n\nAnother hot day & the men were marched out into the desert with midday meal for a full day’s work the doctor would not let me go on duty with them.\n\nInstead went into Cairo, found that Oll was not at Ross More House & so went to Pension Wales to enquire. Very much surprised to find her in her old room in bed with tonsillitis. Went to a chemist & got some gargle & swabbing mixture & at intervals attended to her throat.\n\nIn the afternoon left her for awhile & went out to get some snaps of street scenes, bringing her back some icecream etc, with which we celebrated Daddy’s birthday. Had to return to Aerodrome for 6 o’c mess but afterwards ran in again for a short time. Her throat much better.\n","48":"\n\nA rather cloudy day not so summery as last 2 days. Helping with company work during the morning, & after lunch went in to Pension Wales to find Oll up & ever so much better. Went out for a stroll together & got a few more street snaps afterwards having afternoon tea at Groppi’s.\n\nHome for 6 o’c mess & afterwards developed 4 rolls of films that I had on hand.\n","49":"\n\nA beautiful day. No parade before breakfast.\n\nAt 9.15 church parade for \"Other Denominations\" conducted by Rev Finigan who spoke on \"Christian Soldiers\". There was quite a fair-sized parade making one wonder whether some of the men did not to this, the 1st parade so as to get away the earlier into Cairo: attendance at one of the parades is compulsory for all.\n\nAt 10 o’c the C. of E. parade was held & I went to this as well & was very glad afterwards for it was a splendid service. Capt Maxxed spoke about the significance of Lent & was fine, carrying the men with him all the time. There was a good spiritual tone about his talk & he seemed much more manly than the previous speaker, & more powerful.\n\nOver & over I have longed to be in the unit Rid is attached to, & feel sure that he will do great work with the Artillery. \n\nAfter midday dinner went straight to Pension Wales & found Oll practically herself. Together we went out for a stroll thro’ some of the Cairo streets, Oll taking me to see where the Museum is situated, & then had afternoon tea.\n\nReturned to camp for 6 o’c mess & spent evening at letters.\n","50":"\n\nA fine bright day throughout. \n\nOur company was detailed for a fortnight’s duty as Cairo piquet, practically all the able-bodied men & officers with the exception of myself going. We were up early getting ready for the departure by 8 o’clock. \n\nDuring the day was kept busy getting the mess left by the men properly straightened up, seeing abt the transfer of abt a dozen men to us from another company, censoring letters etc.\n","51":"\n\nA fine day, hot in the sun. before breakfast was kept going looking after company matters, there being only 4 men for parade.\n\nAt the forenoon parade lunch was carried & we all marched out into the desert 2 or 3 miles, spending the day at certain manoeuvres with a break for lunch, marching back to camp abt 3 o’clock, being quite hot & tired by the time we reached it.\n\nA new company, the 14th Rfls of 4th Battn., arrived just abt \"Lights Out\", 3 of the officers coming to our tent.\n","52":"\n\nA fine sunny day but a pleasant northerly breeze blowing all day.\n\nJust as I abt to go out on parade I was wanted & on going out found Jocelyn who had arrived with the reinforcements by night. He is back again at B Details, Feitoun. Was delighted to see him & only sorry time was so limited. \n\nTook lunch & spent the day out in the desert as yesterday. \n\nOne of the 3 officers taken to hospital with mumps.\n","53":"\n\nMother’s Birthday.\n\nA bright sunny day with a cool breeze making it very pleasant.\n\nContinued the training for the week, the battalion again marched out into the desert (taking lunch) & spent the day at battle work. During the morning went off some distance with Prescott & 1 or 2 others & had some revolver practice with my Colt automatic, in the end being quite satisfied up to 75 paces although there is a distinct throw to the left (2 ft at 75 paces). Prescott also did some good shooting with his.\n\nWe marched back to camp about 3 o’clock & after a bath & a change I walked off to look for Jocelyn at B Details, Feitoun. After some trouble I found the place & from the orderly room learned that he with the 2 friends who had come away together again as they had done last year before Gallipoli had only that morning been sent down to Ismailia.\n\nHad a lo9ng tramp back & after dinner ran into Cairo to tell Oll that it was my intention to try & get the next day off so as to have a run round with her.\n\nBack in camp by 9 o’c.\n","54":"\n\nAgain a beautiful day.\n\nAfter breakfast obtained leave for the day from the adjutant & abt 9.30 left for Cairo to meet Oll. Found she had lunch packed & after getting one or two more necessities we had just time to get to the Sultan’s palace in order to see his guard mount. We took a garry, not knowing exactly where it was, & after driving for some time thro’ fearfully squallid & dirty streets suddenly swept out on to a spacious courtyard of perhaps 3 to 4 acres in extent, in front of the\n\npalace. It is a large roomy house standing back some distance from the high iron railing, at the gateway of which were 2 arches, one on each side & in each archway was posted a mounted sentry.\n\nThe general arrangement reminded me of what I had heard or read of the Guards at Home, although the uniforms were not as showy as those of the Life Guards. The 2 sentries on horseback were in this case lancers dressed in a navy blue uniform having a white breastplate, large white gloves, high jack-boots, & neat red fez; the pennon on the lance was green & red & gave quite a gay touch. Tho’ not motionless & statue-like as the Life Guards as said to be, the 2 sentries were very steady.\n\nFloating over the flat roofed palace was the Egyptian flag, red with white star & crescent in the centre, & at various posts were infantry sentries.\n\nDismissing the garry we took in what was to be seen, & almost immediately were attracted by a military band marching towards us; meantime quite a fair-sized crowd had collected to see the guard-mounting, altho’ it is of daily occurrence. Espying a body of soldiers fallen in on the barrack square on the opposite side of the spacious courtyard, we went over & found that it was the new guard & that the band had gone over to march them out to the courtyard in front of the guardroom.\n\nIt was a pretty sight to see them march out. First the brass band of abt 50 instruments, the uniform being a navy jacket with brass buttons, blue breeches with a double red stripe down each side, navy putties & black boots, with of course the typical red fez having a black tassel. The instruments were in\n\ngeneral the same as our band instruments & of course there was a drummer & 2 or 3 kettle-drummers. The band-master wore 2 stars, & in place of the blue breeches, blue trousers having the double red stripe down to the boots, & spurs. He wielded his baton very vigorously & obtained good music which I cannot describe, the general impression it gave me being that it was shriller than ours.\n\nThe guard marching after the band had fixed bayonets, - the old long triangular pattern, - the rifles (Martini pattern of either Heuri or Enfield make) being carried at the old \"Shoulder Arms\". They wore the customary red fez, navy jacket with brass buttons & navy knee-trousers having a thin red stripe. These junctioned with white gaiters worn over black boots, the whole giving a neat & smart appearance. The two lieutenants wore long trousers having a broad red stripe instead of the knee breeches, were spurred & carried swords.\n\nMarching in fours the guard looked very well & I tried a snap to try & show you what it looked like. Meantime 3 or 4 \"gypsy\" policemen on duty were getting plenty of exercise in keeping the crowd of Arabs back from the courtyard: a number of Europeans, officers, nurses, & ? tourists, in lordly fashion stalked out in front of the crowd to the open space whence we had a perfect view of the operations.\n\nAs the new guard marched up the old guard fell in outside the guardroom, the new guard marching up at right angles to it. Then came the usual passage of compliments between guards & the telling off of reliefs for the sentries of the old guard on duty, the band meantime playing selections. At the same time a sergeant & 2 new lancers rode up, passed thro’ the main gate-way, wheeled, the\n\nsergeant returning thro’ the central gate-way, the 2 sentries moving up in rear of the old ones who, as they approached from the rear, moved forward to join the sergeant & move off with him, leaving the reliefs standing in their original place.\n\nWhen all the new guard reliefs had gone out & the old sentries returned came further compliments after which the old guard marched off after the band. Altogether the performance was quite spectacular & we both enjoyed it.\n\nAfter morning tea, we decided that it would be a good opportunity of going up the Nile by native boat (\"veluka\" so called) to a place called Barrage where some of the highest class live, a place noted for its beautiful gardens & scenery, so \"garry’d\" back to Cairo to find out from Thos Cook & Son what the fare should be if we engaged on to take us up, our idea being to return by train. \n\n20 piastres (abt 4\/3) they said at most. We took tram down to Boulak Bridge & hunted about for a waterman. After crossing the bridge to Gezireh Is we found a merry-faced young man who owned a boat & at first asked 50 P.T. for the trip. Offered 25, but he wanted 6\/- (30 P.T.) & after a lot of haggling we left him to try & find some other boat owner.\n\nThe road we followed led along the bank of the Nile (abt ¼ ml wide here) thro’ the well-kept gardens of Gezireh. Moored along the bank were scores of house-boats, regularly occupied by French & Egyptian people, some of them being quite large & containing perhaps 100 to 200 apartments. Across the Nile were the buildings of Cairo with a clump of date palms here & there : house boats & dhows of varying size were moored to the opposite bank.\n\nWe wandered on & on till we came to Kasr-el-Nil bridge which we crossed & on the Cairo side found a number of watermen, the first of whom agreed to\n\ntake us for the 20 P.T. We went down the steps from the stone-wall to the water’s edge, & were immediately surrounded by a jabbering crowd of watermen each declaring that his boat was \"very nice, very clean, very good\". We chose one, & just before going on board I said \"Remember, 20 P.T.\" & was immediately informed that 50 P.T. was wanted. The youth who had agreed to the 20 P.T. was an irresponsible who, if we had engaged a \"veluka\", would have come & demanded backsheesh for getting it for us.\n\nThoroughly disgusted we started to go away: imagine our surprise when, apparently the merry-faced youth with whom we first came in contact at Boulak, who smilingly suggested that he was right in saying that 50 P.T. was the fare, but was now willing to take us for the 20. After a good deal of hesitation we got a garry & drove back to Boulak, went on board the \"velouka\" when again we met a rebuff in the form of a demand for the 20 P.T. at once.\n\nUtterly disgusted we refused, went ashore & decided to go up by train to Barrage. Having trammed to Cairo Station we found at 1.50, when we arrived, that a train had left at 1.30 & that there was not another until 4 pm! It was quite evident that we were not to go to Barrage that day, so garryed back to Pension Wales lest Rid had unexpectedly put in an appearance, but finding no sign of him unpacked our eatables & had lunch, deciding that we should spend the afternoon at the Citadel.\n\nA tram ride of perhaps 25 min. to the south of the city brought us there, & after passing thro’ the usual filth & squalor it was good to get out into the open space in front of the Citadel. This is a large fort built abt 100 yrs ago on an eminence from which it commands Cairo. \n\nIt is quite a landmark round Cairo, being distinguished by the large mosque of (?)Mohammet Ali\n\ncommonly called \"The Alabaster Mosque\". On either side of the dome are 2 very slender minarets, the 3 together constituting the landmark. In the open space were several flower-beds, kept in very good order. Passing thro’ these we came to the main entrance facing the city. This is an archway in the high wall, having towers on either side of it & large massive gates which were pierced in a dozen or more places by cannon shot holes, probably the result of Napoleon’s siege.\n\nA sentry was on guard at the entrance the whole being Ordinance Store, Barracks, Arsenal & Hospital for our forces. Passing thro’ the road wound slowly upwards past stores & barracks until we came to the courtyard outside the large mosque. (Photos of some of these places I took & am sending, other places figure on the postcards sent.)\n\nA marble wall surrounds the mosque, & at the entrance were several Arabs who tied canvas overshoes on the feet of whites desirous of entering, receiving as backsheeh a piaster or so on departure. Outside the mosque & surrounded by the marble wall is a large courtyard abt 50 yds by 50 yds having in the centre a fountain supplied with a number of taps at which we saw natives washing their feet as if the water were holy or something of the sort.\n\nIn the wall were recesses (arched) from which a glorious panoramic view of Cairo is obtained, but unfortunately only one of these was open: I took a photo from this tho’ the camera was rather pointing towards the sun. away to the left in the distance were the 2 pyramids dimly outlined beyond the green strip bordering the Nile, which with one or two canals running in the same direction could be clearly distinguished.\n\nFor the rest it was simply a mass of buildings, flat roofs, domes, & minarets being the outstanding features. Previously I had had no conception of the enormous size \n\nof Cairo; squalor & filth had been the predominant features previously. \n\nOn the opposite side of the courtyard to the recess from which we had this view was the entrance to the mosque. It was a magnificent place, quite a reverent hush seeming to pervade it. The walls are of marble with coloured lights high up which reminded me of St Peter’s R.C. in Melbourne. From the roof were hung hundreds of lamps, some arranged in huge chandeliers, others hanging singly: the oil lamps of old are now replaced by electric bulbs, & the splendour of the scene on one of the few (5 I believe) occasions during the year when the place is lighted up must be indescribable. One the floor was a beautiful carpet, but the furniture there was none. I tried 3 or 4 photos inside but now know that they are utter failures, underexposed. They could not, however, conveyed anything like an adequate conception of the interior.\n\nAs we were about to leave a number of worshippers came in & were most reverent in bowing, placing their hands on their heart, bowing till their forehead touched the ground, & so on. At 4 o’clock all whites were cleared out for ½ an hour, this being one of their times of prayer, & it was very noticeable as we went out that a number of wounded Indians (Punjaubis & Sikhs) were going up to pray.\n\nFrom the Mosque we wandered round to one or two places on the battlements whence we got a splendid view across a gully southwards to a sheer face of cliffs of the hills abutting Cairo, on the top of which the fort built by Napoleon which dominated the Citadel & brought about its surrender, could be seen. The steep white face of (?) sandstone recalled at once the Pyramids, making me think that in all probability their stones came from this spot.\n\nThe sheer face of the flat-roofed village on a lower level & castle on top made me think of Jerusalem from some aspects must look similar. At one place we saw a deep well called \"Jospeh’s Well\",\n\ntho’ for what reason I cannot imagine. Prescott tells me that it is supposed to be supplied with water from the rock struck by Moses!\n\nClose by were a number of tents occupied by Indians troops, Sikhs as far as I could see. In another place were a number of cows tied up close to the Mosque, making me wonder if they were sacred; the manure & rubbish was being shoved down a deep well which shows in one of my photos: it is fenced in & Ol is standing in the foreground.\n\nFrom the Citadel we took the tram back to Cairo, had afternoon tea at Groppis & then returned to Pension Wales, which I left for camp abt 8 o’clock. In spite of the disappointment over the velouka it had been a very enjoyable day.\n","55":"\n\nAnother cool day, but much more overcast & cloudy than yesterday. On early morning parade & in forenoon in company lines, the 150 men of the company having been recalled from Cairo picquet the previous evening.\n\nAfter midday dinner went to Pension Wales & decided to take a run out to the Zoo. This meant taking the tram going out to the Pyramids, a ride that I had previously described. The Zoo is abt ½ way out, & is fairly good. The outstanding impressions were the almost unbelievable lankiness of a beautiful male giraffe whose picture I tried to take, the great size & strength of a large number of vultures, & an intolerably restless hyaena which was in perpetual motion trotting round its cage. \n\nThe hippopotamus would not come out of the water while we were there but continued to swim round its pond, the swirl thus caused occasionally giving place to the massive head & piggish eyes. There were other things worth describing, but these are the chief. Anna would have enjoyed herself immensely.\n\nAltogether we only had about ½ an hour there, the returned to Cairo & after tea I came back to camp in time for 6 o’c mess. After tea developed the 3 rolls of Citadel etc films.\n","56":"\n\nA glorious day, bright & sunshiny with a pleasant cool breeze.\n\nChurch Parade for \"Other Denominations\" was again taken by Chaplain Finigan, & coming after the C of E parade this week was sparsely attended. Officer’s parade called immediately afterwards, then letter-writing until midday dinner, after which I went into Cairo & spent the afternoon with Oll at Pension Wales, returning home by 6 o’c.\n\nSpent the evening writing & reading.\n","57":"\n\nA similar day to yesterday. Physical drill before breakfast & on forenoon parade use of entrenching tool out in the desert.\n\nThe afternoon was devoted to a battalion route march which took us along the Feitoun road to Helmiah Station which we had come along on the night of our arrival. Crossing the railway line we passed the encampment of the Camel Corps where some hundreds of camels were tethered under a big clump of eucalyptus trees, through a township comprising some fine buildings, past fertile fields where the wheat (bearded) was just in head & looking lovely & the Egyptian clover with its sprinkling of yellow flowered wild mustard equally healthy, thanks to irrigation, & back thro’ Heliopolis. After the desert route marches this one was a delightful change. \n\nJust before dinner two letters, Father’s & Mother’s of Feb 6th & one from Millie Jones came to hand. Great excitement everywhere over the arrival of the mail.\n","58":"\n\nA fairly hot day & I felt the desert work during the morning a good deal.\n\nIn the afternoon just as I had started on the morrow’s mail a wire came from \"Oakley\" stating that Leo was being brought out that evening. This upset correspondence especially as there was a big bundle of letters to be censored.\n\nAfter tea waited & waited & abt 8.30 Ol & Leo came out: latter was looking well tho’ a moustache considerably altered his appearance. Went back into Cairo with them, had supper, & the Leo & I came back, Leo sleeping here with me in a make-up bunk on the floor.\n","59":"\n\nAgain a warm day. Leo left abt 7.30 to report in Cairo. \n\nParades as usual, & as soon as the afternoon’s work was over changed & went in to Pension Wales. Had tea with Ol & Leo & then went to Pictures starting at 6 o’clock: all explanations were in French but the show was a very clean one. Took Ol back to her pension & the Leo & I came home, getting here abt 9.30.\n","60":"\n\nA hot day. On duty as orderly officer & kept going during the day.\n\nLeo left abt 6.30 & in the evening turned up again. There was no parade in the afternoon, a night route march taking its place, but of course I had to stay in camp on duty.\n","61":"\n\nAs orderly officer until the \"reveille\" had to get up at 3.30 to inspect the guard & the get away 400 men who were detailed for Tel el Kebir, leaving here at 5.30 am. Kept going hard rooting them out, seeing to their breakfast etc, & as soon as they were\n\noff got back to into bed until 8.30, Leo meantime leaving to report to the Overseas Base.\n\nForenoon parade as usual altho’ there was a very disagreeable wind. In the afternoon the C.O. (who is a R.C.) granted half holiday & after changing I went to Pension Wales & had afternoon tea with Ol & Leo, the latter having to go at 4.15. Stayed a little longer with Oll returning to camp for 6 o’c dinner.\n","62":"\n\nParades as usual before & after breakfast, the day again being windy.\n\nLong mess meeting before lunch making it very late when I got in to Pension Wales where I discovered Rid who was up on business. We had afternoon tea together & then went to make purchases that it was Rid’s lot to attend to. Came home in time for 6 o’c mess, leaving Ol & Rid at the tram terminus.\n\nDid a little developing after tea.\n","63":"\n\nAfter midnight last night there was a very heavy fall of rain & on waking I found that the men had been drenched in most cases. There was water lying about in pools everywhere & presently blankets & other gear was spread out in all directions. On account of the wetting the Church parades were cut out.\n\nAbout 10 o’c I was instructed to get ready to proceed to Cairo for 14 day’s picquet duty & had to spend a good deal of time getting things packed up for early morning departure tomorrow.\n\nAfter midday dinner went in to Pension Wales for afternoon tea, coming home for mess, afterwards going over to the Y.M.C.A. where a simple address was given & the usual old-time hymns sung. There was a very fair attendance.\n\nUp fairly early to complete my packing & after early breakfast fell in with the picquet of 150 men & moved off at 8 o’c on our 9 mile march to Kasr-el-Nil barracks, the headquarters of the Cairo Town Picquets, arriving a little before 12 o’clock.\n\nThey are very extensive barracks on the very bank of the Nile, & cover some 4 or 5 acres, this area being subdivided into squares by the barracks which are 3 stories high. Parts are occupied by the British tommies, Devons as far as I have seen, the remainder by the 500 to 600 men doing picquet. The outer barrack square is used as a dumping ground for army goods & is visited daily by A.S.C. people who take out tents, nose-bags, blankets, etc, etc.\n\nAfter lunch had to take a picquet of 20 men & start duty at once, my beat being in one of the worst parts of Cairo, but only from 2 till 7, not nearly as bad as the 7 till 11 beat. Although broad daylight some of the most degrading sights imaginable came under notice, but made no arrests. An Egyptian woman murdered bu another on my beat but the whole case attended to by the \"gyppy\" police. \n\nToo tired after tea to do anything but turn in, the orderly having everything very comfortably arranged. \n","64":"\n\nA beautiful day like yesterday. \n\nGot up abt 8 o’clock & after breakfast went round to Pension Wales for a while & then trotted round to one or two of the native quarters to obtain some snaps that I wanted, including 2 or 3 more of the Sultan’s guard. \n\nOn coming in at lunch time was delighted to receive 9 letters, 1 from Father, 1 from Anna & 7 from C. South people, & 1 from Lawry. \n\nDuring the afternoon on duty at the same spot & made 1 arrest. Stayed in chatting after tea.\n","65":"\n\nA hot day.\n\nAfter breakfast went round to Pension Wales & found that Oll had left for Alexandria leaving on her table the wire from Rid stating that he was abt to embark at Alexandria.\n\nAfter making some necessary purchases went to \"Old Cairo\" & spent the morning there, getting some fairly good photos of scenes there, altho’ no photo nor any description convey a correct idea of the filth & squalor prevailing. The buildings were old tumbledown places of stone & muddy concrete thrown together anyhow. At one place I saw the \"concrete\" being mixed for a new building, stone lime being slaked & then mixed with Nile mud in place of sand, so it is hardly to be wondered abt that the places are falling to pieces.\n\nOn the flat roofs were drying ground for clothes, stacks of rough forage for camels, firewood, & all sorts of odds & ends, not forgetting filthy rubbish. In the buildings were sheep & goats, fowla & chickens, dogs etc.\n\nAt one spot near the main street was a blacksmith’s shop where fowls were seen on the anvil & on a chair in the shop, quite in possession, reminding me a good deal of some of the things I saw in Indian huts in Fiji.\n\nAn open air sale, of, all sorts of stuff bore a striking resemblance to the Indian bazaars, excepting that, as far as I can remember, there were only men present. Going thro’ the barrow streets, - only 6 ft wide in places & yet traversed by donkeys & camels, - one had to\n\npick one’s steps very carefully: the dirt & filth were beyond description. \n\nThe heavy fall of rain last Sunday did a fair amount of damage, pools of water everywhere showing that no provision whatever is made for surface run-off. Such a place must be a real hot-bed for disease as I hear it is also for crime. \n\nAt one spot I came upon a square room where school was going on, the teacher sitting cross-legged on a high chair & having round him a group of perhaps 20 boys (no girls) more or less dressed in the usual style of loin cloth, jacket & red fez & having tin sheets from which they were being taught to read in Arabic. Some of them had such bright eyes & merry faces & one could not help wishing that their environment could be improved.\n\nHere & there groups of women sitting down gossiping, all talking together in shrill tones. The men kept markedly to themselves, sometimes in groups of twos & threes, at others sitting in solitary state outside their hovels smoking their \"hookah\".\n\nIn spite of all the offending odours it was an interesting morning. During the afternoon was on duty in the same low locality, but did not have any very exciting experiences.\n\nAfter tea at night developed the photos. A mail of 9 letters was brought to me from Heliopolis, letters mainly from C South dated up to 7th Feb.\n","66":"\n\nAnother warm sunny day.\n\n Spent the greater part of the morning with Oll who had come back from Alexandria the previous night & was looking rather\n\nwashed out. Had morning tea at Groppi’s before returning to the barracks. Nothing very special happened during the afternoon’s tour of duty.\n","67":"\n\nA cloudy day, much cooler than yesterday.\n\nWent to Pension Wales & induced Oll to come out with me for a while. We went down to the Kasr-el-Nil bridge, got a native boat at 10 P.T. per hour from amid a host of boats rigourously offered to us by very noisy boatmen each assuring us that there boats were \"Very good, very nice, very clean\". Ours was named \"Victoria\" & was manned by a Nubian whom we named \"Sambo\": he told us that he came from Wady Halifa. He knew very little English, merely answering \"Yes\" to anything we said to him.\n\nWe got him to pull us to the southern end of Glezireh Island where we were interested in the native boats being taken up the branch of the Nile on the other side of Shezireh. I hope some photos will show what we saw. Along the bank of the island were some very pretty views, date palms standing out prominently above masses of bright bougainvillea amid the varied greens of the shrubs.\n\nA few Arabs at work here & there along the bank added a touch of life. Moored to the banks were house-boats some of which belonged to T. Cook & Sons, & before the war used to run trips down & up the Nile. It seems\n\nthat the house-boats are largely occupied by Europeans, - French & British, - but I do not envy them being cooped up quarters. \n\nI have noticed that 2 of the officers of the Devons (who are at present quartered here) row over each morning from one of the house-boats where their wives live.\n\nWe were interested in a rather small Nile boat out fishing. It has the usual flattened & upward curving bow, short mast & long cross spar & was manned by 2 rowers sitting abreast while a third stood in the stern casting the net & drawing it in. from 3 casts he did not get anything.\n\nOll read her mail (up to Feb 20th) in between times & I think enjoyed the outing. We were back by 12 o’clock & after an ice-cream at Groppi’s I left Oll & came back to barracks.\n\nDuring the afternoon had a little excitement, one man who had been \"wanted\" for 9 months resisting arrest but finally being captured & landed in the guard room\n\nStayed quietly in after tea.\n","68":"\n\nA bright sunny day, rather warm about noon but with a pleasant breeze blowing most of the time. Went to Pension Miles during the morning to see Oll & had morning tea at Groppi’s.\n\nOn duty as usual during the afternoon & kept fairly busy with police work owing to the large number of men in Cairo on week-end leave.\n\nAfter tea developed the films of Nile views.\n","69":"\n\nHarry’s birthday not forgotten. \n\nA beautiful Sunday, sunny, but with a nice breeze most of the time.\n\nDuring the morning Mearus, who has been on picquet duty here the same time that I have, was recalled in order to join up with troops from his battalion who are ordered to embark for at present an unknown destination.\n\nWalked up to pension Wales about 10.30 & found Oll all ready for church. In the Cairo streets everything was going on just as if there was no Sunday here & it was good to mentally run over \"O day of rest & gladness\". The Methodist church is on the opposite corner to the Pension Wales & is really a long room on the first storey over some shops. When we got there about 20 people were present of whom all but 5 or 6 were in uniform, & 2 or 3 came in later. A small party of abt 7 Devons from Kasr-el-Nil barracks formed part of the congregation. \n\nIt was good to be once more in church even tho’ the sharp calls of the Egyptian sellers of various wares, together\n\nwith the interminable chatter of garrys & other street noises kept us in constant rememberance of the city life.\n\nPresently the organist came in, Capt Phillpot, the resident chaplain in Cairo, so both the organist & preacher were in uniform. The organ was only a common sort, but it was fine to be using the Meth. hymn book once again. The preacher took as his text Gen. 30: 27, \"Learned by experience\", & gave a simple but good talk showing that he knew what he was talking about. I am sending home a \"Form of Service\". Altogether it was a splendid little service. \n\nWalked home & after lunch had to go out on duty but had a quiet afternoon: the crowds behaved surprisingly well. Immediately after tea had to tram out to Aerodrome Camp to fix up about my orderly Davies who had been detailed to go on to the front, & did not get back until midnight.\n","70":"\n\nAnother lovely day.\n\nUntil 11.30 was busy sorting out my gear & packing up in anticipation of a move, then went to Pension Wales & took Oll out for morning tea.\n\nBack to barracks for lunch, & during afternoon had rather a busy time looking for a suspicious man, supposed to be a Turkish spy.\n\nAfter tea busy writing when word came that I was amongst those detailed to report back to Aerodrome in order to embark on the \"Transylvania\" tomorrow night.\n\nOne letter (from C. South) dated Feb 14th to hand.\n\n"}}