{"Document Name":{"0":"Diary_0290","1":"Diary_0290","2":"Diary_0290","3":"Diary_0290","4":"Diary_0290","5":"Diary_0290","6":"Diary_0290","7":"Diary_0290","8":"Diary_0290","9":"Diary_0290","10":"Diary_0290","11":"Diary_0290","12":"Diary_0290","13":"Diary_0290","14":"Diary_0290","15":"Diary_0290","16":"Diary_0290","17":"Diary_0290","18":"Diary_0290","19":"Diary_0290","20":"Diary_0290","21":"Diary_0290","22":"Diary_0290","23":"Diary_0290","24":"Diary_0290","25":"Diary_0290","26":"Diary_0290","27":"Diary_0290","28":"Diary_0290","29":"Diary_0290","30":"Diary_0290","31":"Diary_0290","32":"Diary_0290","33":"Diary_0290","34":"Diary_0290","35":"Diary_0290","36":"Diary_0290","37":"Diary_0290","38":"Diary_0290","39":"Diary_0290","40":"Diary_0290","41":"Diary_0290","42":"Diary_0290","43":"Diary_0290","44":"Diary_0290","45":"Diary_0290","46":"Diary_0290","47":"Diary_0290","48":"Diary_0290","49":"Diary_0290","50":"Diary_0290","51":"Diary_0290","52":"Diary_0290","53":"Diary_0290","54":"Diary_0290","55":"Diary_0290","56":"Diary_0290","57":"Diary_0290","58":"Diary_0290","59":"Diary_0290","60":"Diary_0290","61":"Diary_0290","62":"Diary_0290","63":"Diary_0290"},"Date":{"0":"unknown","1":877.0,"2":879.0,"3":880.0,"4":881.0,"5":882.0,"6":883.0,"7":885.0,"8":886.0,"9":888.0,"10":889.0,"11":890.0,"12":891.0,"13":892.0,"14":893.0,"15":894.0,"16":895.0,"17":899.0,"18":905.0,"19":906.0,"20":907.0,"21":909.0,"22":910.0,"23":911.0,"24":912.0,"25":913.0,"26":914.0,"27":915.0,"28":927.0,"29":928.0,"30":930.0,"31":934.0,"32":935.0,"33":936.0,"34":937.0,"35":938.0,"36":943.0,"37":952.0,"38":953.0,"39":954.0,"40":955.0,"41":956.0,"42":957.0,"43":971.0,"44":972.0,"45":973.0,"46":974.0,"47":986.0,"48":1007.0,"49":1008.0,"50":1009.0,"51":1010.0,"52":1016.0,"53":1017.0,"54":1018.0,"55":1019.0,"56":1021.0,"57":1025.0,"58":1026.0,"59":1031.0,"60":1032.0,"61":1033.0,"62":1034.0,"63":1056.0},"Entry":{"0":"\n\n","1":" 10 pm. Arrived back in camp for last time. Have just been watching the men return, bursting thro' the gates in defiance of the marmalade gate guard who would allow them in one by one. All the men are quiet and orderly, a little excited perhaps but seemingly quite contented and happy. Received pay to date & retired about midnight for a short sleep.\n\n11-5-16 Reveille 3-30 am. Rose, washed & proceeded to canteen for breakfast which we obtained after a 1\/2 hrs struggle.\n\n5 am: Parade falls in & we\n\nmarch to Dulwich Hill trams which convey us thro' the sleeping suburbs & city to our wharf at Wooloomooloo where I meet Edd with parcel &Mrs McLean & Walter about \n6 am\n. How good of Mrs M. She thought Mother would be there.\n\n7 am\n I say good-bye & march on to wharf. Poor Edd is very cut up. We parade on wharf and then go aboard.\n\n8 am\n The crowds are allowed on the wharf. They pour on to wharf like a torrent. I see them from my perch in the bow where I had secreted myself. Then the men are allowed on deck & streamers are woven from ship to shore. The wharf is a mass of dazzling colour. Sorrow is confused\n\nwith joyfulness. Then the A8 moves. Gradually one by one the streamers break till one is left unbroken. After a while she breaks also and we can be said to have left our native shores. Slowly we pass Garden Island and anchor out in the stream, presently to be surrounded by motor launches overcrowded and seemingly sinking with the numbers on board. The fair sex overanxious to say a last farewell to their dear ones.\n\n3 pm\n We move off & pass the Heads leaving behind our gay escort of launches and passing the cheering forts of South Head, steam out into the far blue sea - alone.\n","2":" Fair weather, pleasant sailing & little seasickness.\n","3":" Nearing noon we picked up the pilot outside the Rip of Hobsons Bay. He took us safely just inside where a destroyer of our navy took our first mail for home. We then turned about and once more settled down to stern sea voyaging.\n","4":" Is slightly rough & finds many others &myself hopelessly seasick.\n","5":" The weather is rough & cold, but we mostly overcome our sickness but yet feel rather \"doubtful\".\n","6":" 17-5-16 The weather continues the same. We settle down to our sea life, which however, we do not consider the most enjoyable way of living.\n","7":" Expect to pass Albany tomorrow & may post mail till 6 pm. I have posted a letter to Mother & pc's to Father and Mary.\n","8":" Our letters have not been posted & we all regret not touching land in Australia after our old Sydney town. We look forward, or rather expect, I had better say, a long sea trip. We passed a ship today. Quite an event. The first since Melb.\n","9":" Church Parade. Uniting. Collection£17-2-0 to Ancient Merchant Seamen &Widows.\n","10":"","11":" FAB Concert. We now know we are going to Durban.\n","12":" Very heavy sideways swell on causing much rolling of ship & consequently much fun & merriment. It is rather amusing watching\n\nthe tug of war while the ship is rolling strongly.\n","13":" ","14":" F Ambulance Concert.\n","15":" First Boxing Tournament on Shelter deck. Much fun due to ship rolling & rolling the combatants over. \"Any scraps can be decided \"in the ring\"\".\n","16":" This is our second Sunday at sea. Again the polishing & cleaning for church parade. We are told next Sunday the parade will probably be to the churches in Durban. We will probably be given leave, but will be expected to promise to post no letters in Durban. Tonight I will attend the (optional) church service on deck. Since leaving Sydney the weather has been moderate, the ship\n\nsometimes pitching, sometimes rolling, but never standing on her beam ends. Since passing Melbourne we have not been favoured with an absolutely rainless day. Each day it sprinkles more or less. The sky is always overcast, the air cool but not cold, the nights no colder than the day. The night before last my hammock was torn so I slept on the floor but lengthways with the ship with the result that I was rolled from side to side obtaining no sleep. Naturally I obtained somebody else's hammock for last night. As I am writing, altho' it is Sunday, I am playing chess for there\n\nis nothing to do. Otherwise Sunday is a holy day for me. We play a lot of chess & draughts, & sometimes 500. The games being supplied by our Comforts Fund.\n","17":" We have seen the old month out at sea. Yesterday we were paid£1 only on a\/c of our pay. The 9th Brigade held a boxing tournament yesterday. Last night I developed two films for self & one for Jim. At some boxing during the week the side of my camera became unlatched and fell overboard in my hurry to \"snap\" an extra funny bit. Today is mail day. I am busy writing some letters.\n\n2-6-16 The sea is very rough but the weather is not stormy. We\n\nexpect to arrive in Durban tomorrow.\n","18":" We arose rather more expectant than usual, & were pleasantly surprised when the strengthening light revealed the long wished for land ahead. After breakfast we find ourselves in a large open bay, but protected from the wind prevailing. Through the bay we were piloted to the narrow entrance to the harbour proper formed by the Bluff on the one side & the Point on the other with concrete breakwaters on either side.\n\nArrived in harbour we berthed at Tiberia; that is the Bluff side and unpopulated. We were soon conveyed across to the\n\n\"Point\" or City side & given leave from 2 till 10.30 pm. Thus nearly 2000 soldiers proceeded to tour the town. This was aided by the generosity of the Durban City Corporation who had made the trams and all institutions under their control free to all soldiers. The South African Railways were also available gratis for the soldier tourists. During that first afternoon my mate & I visited the city & suburbs, appreciating the fine public buildings, especially the new Town Hall. We soon found our way down to The Beach, a beautifully laid out and grassed watering place almost alongside the city.\n\nHere we saw the fine hotels and the baths and swimming basin. The Baths are formed by a semicircular pier enclosing part of the beach and surf. We had tea and returned to town by rickshaw. We next made a beautiful round trip in the tram onto the hills encircling the city which by this time was lit up for the night and looked very pretty. On returning to town we were just in time for a Red Cross Concert to which we were admitted free & which we enjoyed very much. Here we had supper and then proceeded for a\n\nrickshaw spin round the town in the cool night air. Soon we returned to our floating home & the next morning were mustered for church parade to the city, but our detail being put on medical picket stationed at the police station. Nevertheless we found time to further explore the place, doing again our tram trip of the night before revealing most magnificent views of the city and harbour. We also visited the zoo and Umgeni, a native village (Hindu) and Sunday beer garden about 4 miles from town. Our meals in the city proved expensive\n\nrather than enjoyable owing to the unexpected demand made on the hotels and cafés by the sudden influx of khaki-clad men all of healthy appetite whetted by three weeks of ships fare. The hotels being barred by the civic authorities from selling liquors to our soldiers, there was no disorder among them from that cause, nor, in fact, from any other. The people of Durban proved themselves to be a most generous hospitable and patriotic community. A large number of our men were met by residents in the streets,\n\ninvited to their homes, and treated most excellently. Wherever we went we were well treated and respected. I could not help remarking the large number of chemist shops and of high class hotels, the place of the ordinary hotel of Sydney seemingly totally taken by the chemist shops. The class distinction here is very noticeable, I mean between native and European. The European does not associate in any way with the native, looking upon him as a cowardly inferior. The natives treat the whites with the utmost deference. They will always step aside\n\nto make way for a European in the street. The tramcars are always double deckers the natives being excluded from the lower decker but the whites occupy any part. The natives are largely employed by the whites, the girls for instance as nursegirls and housemaids at 25\/- to 30\/- a month. The rickshaw boys are all of a separatetype. The types represented include Zulus, Basutos, Kaffirs, Coolies and Hindoos. The latter give one the impression of gypsies from the gaudy trappings, the women wearing an abundance of real gold ornaments with face, ears\n\narms, hands, ankles, toes etcetera. Durban impressed us as a small city well laid out with fine wide streets & being up to date. The civic administration seems to be very good, but on the other hand there seems to be little commercial activity. On the whole Durban is a very pleasant place and an exceedingpretty place in which to spend a few days as we did. On returning to ship on the Sunday night we expected to have leave again on the morrow, but in this we received a diagreeable surprise for the vessel had\n\nfinished coaling and we sailed first thing in the morning of\n\n5\/6\/16 (Mon) when we encountered choppy seas as soon as we were once more on the high seas. These seas proved rather troublesome, waves breaking on board and washing down some of the vessel's railings.\n\n6\/6\/16 Choppy again. The weather has grown colder and it is much darker, so much so that on arriving for my usual morning shower I found the place quite dark but nevertheless proceeded with the blind man's holiday. We are all\n\nexpecting to arrive Capetown tomorrow.\n\n7\/6\/16 (Thurs) Early morning - land plainly visible. We soon reach it and are on shore by 11.30 with 5 hours leave only. Dinner time finds us in Capetown sampling of their best. Capetown is a far larger and very evidently an older town than Durban. It is not nearly so pretty but seems to be much greater commercially. Nevertheless there are many beautiful buildings and the botanical gardens beside the city and showing off the Museum Art Gallery Public Library and Houses of Parliament\n\nare very beautiful. They are approached by a fine avenue of oak trees which trees are very prevalent here. We made a tram trip onto the mountain behind the city and a beautiful walk under the pine trees along the slops brought us to another tram terminus where we boarded a tram returning to the city. About Capetown I had for a mate a young Queenslander I struck at the Warren, and we went about together all the while. We visited the Town Hall, a very fine building and\n\nalso the Drill Hall where we were provided by the ladies of Capetown with afternoon tea at the nominal charge 1d all round. On purchasing a tin of throat lozenges the chemist said,\"That's all right,\" and would take no money. The same with a tube of toothpaste which the Queensland wanted. We dropped in at an Auction room where the auctioneer gave about 10 of us a cushion each. We gave him 3 Australian Cheers and cleared out. The cushions will be softer than our usual pillows of breeches etc. My air cushion being leaky.\n\nWe all returned to ship by about 5pm. Before landing at Durban we heard of a big battle in the North Sea. Before landing at Capetown we heard of Lord Kitchener's death. Can this be a fabrication and a ruse by the British? Last night we were not allowed ashore for fear the men should become too merry.\n","19":" Instead of getting leave again today the ship was moved away from the wharf and anchored in the harbour where we remained aboard all day also on\n","20":" when we repeated our delightful programme of yesterday. At 11am we or\n\nrather the OC, was visited by General Thomson of the British Troops in S.A.\n","21":" We have been lying idle in Table Bay since the","22":" instant. Life thus proves a bit monotonous but we have a fine but everchanging view of the mountains surrounding the bay, notablyTable Mountain, Devil's Peak, Lions Head with Signal Hill on the right. These mountains are generally partly obscured by clouds or mists giving them a different aspect every day.\n","23":" The monotonous routine has at last been broken and our hearts are gladdened by the news of a route march ashore today. At 10am we parade\n\nand are conveyed ashore in a tug & coal lighter. The poor fellows down on the lighter can see nothing. Arrived ashore at Victoria Basin the units fall in & march off in column of route. The trip chosen is out to Green Point where we break off for lunch in a parade ground in rear of one of the forts, Shortly after 1 o'clock, when we have all finished lunch, we parade again and are dismissed till 3-45. We make tracks for the city, and my pal and I go out to Rhodes' famous residence at Rhonderbeach - Groote Schur over which we are shown by the butler whom we don't of course\n\nleave disappointed. The house is now occupied by the Prime Minister of the Union - General Botha. Yet Rhodes own room is kept unused and exactly as he is supposed to have left it. The residence is very beautiful & we were glad we had made the visit. On the way back we saw the Rhodes memorial on the slope of Devil's Peak. We went out by train but on returning were invited to share a taxi which we gladly did, arriving in town in time for another look round, when we proceeded to the wharf & embarked; and a very pleasant day was nearly over.\n\nThe colour question which so obtruded itself on our notice in Durban, here presented an entirely different aspect. Here in Capetown one notices a predominance of olive coloured people called Cape men and women. They are the descendants of the early settlers and the local native races all mixed. In no way do they pay any deference to the white man. These people manage to hold there own, but not so the pure native races who are represented, for the Europeans still look down upon these as inferior although not in so marked a degree\n\n\n\nas in Durban \nCapetown \nwhere, further, there is not the same distinction made as, say, in Johannesburg.\n","24":" &","25":" We resume our idle tactics.\n","26":" HMS Kent arrive, a middy comes aboard with despatches and presently things begin to happen. The last stores are taken aboard and the last letters given overboard to be posted. Presently one ship and then another begins to weigh anchor & move off following our protectorthe light cruiser HMS Kent. First the Beltana , then the Benalla & the Marathon followed by our own Argyllshire last but not least, in fact biggest and best.\n\n \n\n\n\n\n\nIt is about 11 am as we stand out to sea in a square formation following thecruiser thus \n Ben \" \" Beltana\n Mar \" \" Argyll\nThe Marathon is a beautiful ship and rides the waves very neatly but the other two, and the cruiser worse than all, roll and toss in the smooth sea enough to make one very thankful he will not be aboard them for some \nrough\n weather.\n","27":" No longer can we discern the friendly shore. Being one of a small convoy we have a feeling of companionship unlike the feeling of loneliness prevailing while the Argyllshire travelled alone.\n","28":" After an uneventful voyage we have followed our guardian Kent for two weeks and make tracks for the land now visible ahead. A rocky point &even more rocky island appear with white houses red-tiled upon the mainland. The place is Dakar, the capital of the French colony of Senegal. We anchored in the bay for a moment & then proceeded between two concrete breakwaters into the harbour proper. Dakar is evidently a French naval base, being obviously heavily fortified. On the following page I will\n\nendeavour to give a rough sketch\n \nDakar is a very lowly lying place, the only elevated part being the headland at top (north) of sketch. The island off the headland is a remarkable mass of precipitous cliffs rising straight from the sea without sign of vegetation or life. The other island is a bit similar but carrying a considerable population. Only owing to the red and white houses did Dakar appear to us to\n\n\n\n\n\n\n\nbe a pretty place. The aspect inland was most forbidding. The heat was very severe and I hope I will never have to carry on existence in such a place. We coaled here and took water and provisions aboard. The other boats did likewise but the Kent remained in the bay close beside the battle cruiser Swiftsure. A French cruiser was anchored in the harbour. The following night\n","29":" we observed the Kent make out to sea, and after a while just as the light was fading, out steamed the Swiftsure followed by the 4 transports.\n","30":" After leaving Dakar we soon lost sight of the lights\n\nof Senegal. Our ships travel without lights except front, starboard, and stern lights, no lights being allowed on deck, although smoking is still allowed. The men smoke, they must light matches yet they are not allowed to do so on deck, and not between decks for that is a most serious offence for safety's sake.\n\nThe climate being now cooler, the awnings are taken down again. Two or three times a day the alarm blows and we all rush to our appointed stations on lifebelt parade.\n\nFor the past 3 days we have been enforced to wear lifebelts and carry water\n\nbottles in case of accident. Up till the present, the ship takes 4 minutes for everyman to reach his appointed station on the alarm sounding. For the alarm the vessels siren blows, the bells ring, & the bugles sound the alarm. We have just about resigned ourselves to this dreary sea life and incidentally to wearing lifebelts & rushing up on deck for alarms. If we practice much more perhaps it will be a case of the \"Boy and the Wolf\".\n","31":" Today about midday the Swiftsure sighted a derelict sailing ship on our star-\n\nboard bow. We could see the cruiser approach & board her & soon a series of flashes from our warships side announced her doom, but apparently she was carrying timber for she still kept an even keel when we passed out of sight but the cruiser with her great speed soon rejoined and passed us as we were watching one of the numerous boxing matches we were entertained by at the time.\n","32":" Early before breakfast we were met by four small torpedo boats of some kind. These tiny tots posted themselves each one at the bow of one of the transports, and the cruiser taking her departure\n\nwe were thus escorted for the remainder of our journey.\n","33":" -","34":" We begin to feel that our long voyage is at an end. We have ample evidence that those in charge are taking every precaution against the deadly German \"tin-fish\". Passing shipping becomes more frequent, the number of sailing vessels striking the attention of us Australians.\n\n9\/7\/16 Soon after our morning meal is over we are able to discern land ahead. It grows gradually plainer till at last we can clearly see the green hills of old England & how sweet they look too, after our long spell afloat. About 4 pm we enter Devonport Harbour and passing in thro'\n\nthe breakwaters, drop anchor in the bay nearby the Beltana & Benalla. But of the Marathon we can see nothing. In the last two days race to port she beat us all & our vessel the Argyllshire came a glorious last. We see the Beltana disgorge her human freight into the tenders alongside but our turn does not come till the morning of 10\/7\/16 (Monday), when we are disembarked into tenders, each man carrying all his equipment and personal belongings & conveyed across the harbour, past the beautiful water front hotels of Devonport to the railway station where we entrain immediately and\n\n\n\nare soon whirling away thro the houses leaving behind the ports and hills of Plymouth. Our journey soon takes us out into the open country where we all marvel at and appreciate the beautiful foliage of the trees & also the pretty, beautifully grassed meadows so neatly divided by hedges of a darker green. These meadows of such small acreage (mostly about 1\/2 or 1\/4 acre) afford much amusement to our lads who have seen \"outback\" life among the sheep & cattle.\n\nThese richly verdured, gently undulating hills succeed in occupying our attention till we come to Exeter where the Lady Mayoresses' Committee\n\nfollowing their admirable custom had provided hot tea & buns for our troops. Our journey recommenced the country gradually opened out till at last just after leaving Salisbury with its beautiful cathedral we turned off on a branch line for about six miles to Amesbury, where we detrained. Having piled our kit bags onto waiting motor lorries we marching past the village of Amesbury, past many quaint old houses (one dated 1706) surrounded by beautiful trees, then thro' the whole length of Canada Lines to Lark Hill to Camp 17 which we now occupy.\n\n11\/7\/16-17\/7\/16 Since our arrival we have been well housed & cared for, and feel quite established in our new surroundings, in fact it seems months since we came. We occupy well built huts to hold 30 men very comfortably, wooden lined & furnished with stoves, while all conveniences in camp are luxurious in comparison to the Australian hut. The bathrooms have hot, as well as cold water laid on, & dining rooms are provided. We have boards on trestles & ticks of straw to sleep on. The sick are well cared for, firstly by our (AMC) detail & also, if necessary by the various hospitals. Fargo Hospital about a mile distant is very well\n\nlaid out and equipped.\n\nLast Sunday I was there with a patient & met Fred Davies there in bed with a cold. Yesterday I also met young Kline. Harold Watts is camped just down the road & the","35":" Field Ambulance are in Camp 21. Within walking distance of this camp are many beautiful villages. George Prentice and myself have been in the habit of going for a long walk each evening after tea as it is not sunset till 9.30 at present & not dark till bedtime 10.15pm or in military parlance 22.15. When we first arrived in this camp, it was not dark till about 11.00pm.\n\nThere is an aviation school not very distant from here\n\nconsequently a close scrutiny of the sky will usually reveal a biplane, while sometimes they come very close to us. One evening I went with a patient in the motor ambulance to Perin Downs. The distance is about 12 miles each way thro picturesque little villages & I thoroughly enjoyed the trip. On","36":" we received our first mail since leaving sunny NSW. How glad we were! My portion of the mail consisted of 16 letters in all. Shortly following we received the newspapers belonging to the mail. Many hours work is involved in answering these letters, & one misses the existence of real news for subject matter.\n","37":" Before last writing & since I have been for many charming walks with our friend George Prentice. These trips we usually take after tea till about 9.30 pm and would average about 6 to 8 miles. One evening while walking to Rollestone, a neighbouring camp a gentleman passing in a car gave me a lift into the lovely village of Shrewton, distant about 5 miles from our camp. I was able to purchase a pretty set of post cards of the village. These I sent to my sister Con as I felt sure she would like them as the(y) did moderate justice to the scenes of old English beauty formed by the quaint, homely\n\nhouses set amidst foliage of the most beautiful green. On returning I was obliged to foot it alone & made the pace a \"stinger\". Another trip which we did together was to Amesbury, hardly as pretty as Shrewton but possessing an extremely interesting church, part of which dates back almost one thousand years. Another evening we walked to a small village called Durrington,and,I am ashamed to relate went in to the service in the old Church of England there when it was nearly over, mainly to see the inside of the church. I remember that neither of us had change for the collection and that\n\nthe plate contained one threepenny and two pennies after passing an English officer, his wife or sweetheart, and several other people. No wonder the preacher wore a worried look. Bulford is a neighbouring village & reveals some very pretty scenes of English rural life. About one mile and a half from our camp, across the open fields, on one of the many hills on this undulating plain stand the famous ancient stones of Stonehenge. Of course we made these the object of a visit & have since obtained pictures of this well-known structure, for structure it really is for it is still\n\nevident that these immense stones about 20 to 30 feet long by 4 x 5 have been placed according to a certain plan apparently three elipses one inside the other first small about 12 feet high, then large nearly 30 feet high, & inside small again say 6 feet high. It would appear that formerly these stones supported other flat stones placed as a roof from the top of one stone to the top of the next, as some very large & heavy ones still remain. As to whether the whole was roofed by these stones I cannot venture an opinion.\n\nEveryone will remember \"The Spreading of Chestnut Tree\" of Longfellows \"Village Blacksmith\". Well George & I walked over about 2 or 3 miles to see the Tree or rather the supposed Tree for the site is disputed & very doubtful. Anyhow we saw a chestnut tree also the pretty village of Fighledean with its old churchyard, while further on stood an aerodome of the Royal Flying Corps. From our position on the hill by the church we could see probably a dozen aeroplanes flying about, some high, some low, some far away & some very close. It was very interesting to observe\n\nthe different types. Our return journey was a walking Marathon to be in by 10pm or in military parlance 2200. \n\nIt was now 101\/2 weeks since we sailed from Sydney, & during this time we had had only about 48 hours leave. But now one half of our brigade was already on four days leave returning tomorrow night and tomorrow morning we the remainder should go for our four days leave.\n","38":" The dawn of a long looked for day. For today's the day and we go to London with great expectations in our hearts, and all our available cash in our pockets.\n\nAt 8-15 we fall in on parade, and soon march off to Amesbury Station & entrain. A couple of hours in the special train bring us to our destination - Waterloo Station. On the way in we passed a train of wounded at Basingstoke. Our boys hearts were softened and many a cake of chocolate & cigarette passed from train to train. From Waterloo we marched across Westminster Bridge, past Parliament House, round to Horseferry Road where are the Australian Military Hqrs. Here we were dismissed & many of us availed ourselves of the Anzac Buffet there\n\nto have a light lunch before proceeding on our ways thro' London. This Buffet is maintained by the Ana is free of charge or compliment, and is a model of efficiency. Everything is as nice as the most fastidious could desire, and the buffet is a credit to the organization, and incidentally an inspiration to the Australian soldier unused to such liberal treatment \nin his own country\n.\n From here I made my way by means of a map and sundry constables etc to Mrs Milligans flat at 313 Clapham Road SE. Here I was most cordially received by Mrs M and later by Miss M also.\n\nI spent the afternoon with Mrs M, then took my leave for a few hours to view the city, & secure accommodation which I did most satisfactorily at the Campbell Hotel (Private Hotel) Bedford Place WC. I then returned for dinner to Mrs M's & there spent the evening with her and her entertaining daughter. Arriving back at my hotel I was soon asleep & \nso ended my first day in London.\n\n","39":" Having overslept myself I partook of a belated breakfast & proceeded to Horseferry Road to meet a mate who didn't arrive, however. Then via the Bank of England I proceeded to the Tower Bridge\n\nhaving crossed which, I made a circuit of the rather poorer dwelling in that portion of the city environs, returning again to the Tower Bridge. The Bridge is most impressive by reason of its two immense towers for raising and lowering the hinged span between them. I was sorry not to have the pleasure of seeing these gateways operate. My next object of interest was the Tower of London situate right at the city end of the Tower Bge. To civilians there is a charge of about 2\/6 to visit the whole of the Tower but again soldiers & sailors free. I was able to visit the Bloody Tower where the two\n\nprinces so well known in our schoolhood days were foully murdered, the prisoners walk & traitors gate, the armouries of mediaeval and antiquated weapons, the prisoner chamber of Sir Walter Raleigh, the block & place of execution, instruments of torture etc of a cruel past. But this terrible war shows us that the present can be cruel too! I also saw \nall\nthe regalia and treasures of the royal families. These could not but strike one with wonder at the obvious value and magnificence, but what person of our station in life would not\n\nwonder at the luxury, extravagance and useless waste of such lavish expenditure on such articles, largely designed as presents,and, to satisfy the whims of sovereigns of whom we have had so many foolish and lacking altogether of wisdom, nay, even common sense. I can make no effort at describing these jewels or the contents of the Tower save to mention that here is kept the \npres\ncrowns of the present king & queen, their Majesties \nM\nGeorge V and Mary. All I can do is to refer a friend to a small shilling publication\n\nwhich I sent home. It is beautifully descriptive & illustrative of the Tower and I hope will be preserved. The Tower itself is a circular mass of stone walls & towered, within which is placed a structure, also circular, originally designed for a palace as well as defence and it itself surrounding a small green hill known as Tower Hill, on which Mary, Queen of Scots was executed. The Tower of London has served many purposes in its time and still has its usefulness today. After leaving the Tower I purchased for 4d a China pear\n\nI couldn't eat & set off for London Bridge which I eventually found & noted. From here three electric tube trains brought me within walking distance of my hotel where I had dinner and set off to the Theatre Royal, Drury Lane. Here, in company with two South African infantrymen, I viewed a splendid revue Razzle Dazzle. Then bed claimed me once again & so ended this child's second day in the big smoke.\n","40":" After breakfast I walked round to the British Museum, which I found however had\n\nbeen closed to the public for the last five months. I was very disappointed to hear this. The building is very imposing and \nhas\ncovers I believe twelve acres of ground so one can form some idea of its magnitude. The dome, although not visible from the street is almost as high as that of St Paul's Cathedral. I might delay to mention that all the public buildings of London are built of a sort of white sandstone, and owing to this light colour being visible only where the stone is exposed to the weather (mainly coming from the South) owing to the accumulation in time of a deposit of soot and dirt\n\nupon the exterior walls, they have a peculiar & disappointing appearance to the unaccustomed visitor. This morning I next proceeded to the Bank of England, surrounded by countless other banks like so many satellites. What was my surprise & almost stupefaction to find that the great Bank of England was a one storeyed building although occupying a whole block in one of the most valuable positions in London. Admission is gained by two doors only & I wandered in & noticed inter alia, labourers carting silver bullion about the courtyard. From the Bank of England I found my way to Broad Street\n\nStation & the Commonwealth Bank in New Broad Street. Here I found a state of chaos practically, & having seen my account adjusted correctly, I was given a receipt for£4 & allowed to leave the bank, without having paid£4 at all. But being one of that stupid conscientious class I returned as soon as I discovered the fact, & gave the horrified cashier the£4 he might have lost so foolishly. These transactions were enough to drive anyone's appetite away, but nevertheless, I met Mrs and Miss Milligan & together we had lunch & went out to Richmond and Hampton Court Palace where we spent\n\na pleasant time viewing the beautiful canvas and wall paintings in the gallery of the palace. The grounds are also very beautiful. We had tea, returned by tram to Clapham Rd, had supper & \ndeparted \nand a pleasant chat, and after having thanked Mrs M for her hospitality and kindness towards me I took my departure about dusk for my hotel in Bedford Place.\n","41":" This is my last day in London & I still have much of interest to see. Firstly I make my way to St Paul's and view the beautiful interior & windows, & the pillars all interspaced with memorial tablets of Britain's best & bravest dead. This cathedral strikes one as\n\n\n\nbeing built for utility, for altho' very magnificent it could hardly be styled beautiful like Westminster. There is \nwing\nevidently seating accommodation for many thousand, while at Westminster the narrowness of the cross on the plan of which it is designed renders a clear view for any distance a matter of difficulty to find. At St Paul's the public are allowed for a charge of 6dto civilians to mount a circular staircase to the foot of the dome. From here a magnificent view of the city is obtained. We regretted not being allowed to mount a further 300 steps to the top of\n\nthe dome. Around the inside of the foot of the dome is the Whispering Gallery where a person whispering on one side of the dome can be heard very loudly on the opposite side about (say) 50 yards away. From St Paul's my sightseeing took me to the National Gallery at Trafalgar Square, where the monument to Nelson stands sheer into the sky from the centre of the square. Although the most valuable pictures \nare\nhave been removed from the walls for safety I was able to see many beautiful pictures by old masters. There were a large number of students copying the masterpieces. From Trafalgar Square I\n\nmade my way through the Mall under the Admiralty Arch to St James Park where a rather amusing incident occurred. Noting the great number of poor children playing about on the grass, I prepared to take a snap, but the children immediately sighting the camera ranged themselves in a row to be taken. This done, they rushed up to me for the photo. Poor kids, I suppose that was all they knew about photographs, and they were very disappointed when I explained they would not be ready for some time.\nAt the extremity of the park, facing it stands Buckingham\n\nPalace with the Queen Victoria Memorial in front of it. The Prince Albert Memorial I also had seen. It is situated in Hyde Park. From Buckingham Palace I walked across Constitution Hill to Hyde Park & through the park past Rotten Row to the Marble Arch. From thence by buses to Regents Park & the Zoo. London Zoo is rather fine, and of course, very representative, but beyond that it did not fulfil my expectations with the exception of one feature - the artificial concrete mountain on which are housed \nthe\n some antelopes and the bears. This was a very clever and ingenious arrangement. For beauty of cultivation the London Zoological\n\nGardens cannot be compared with the present Sydney Zoo, which I prefer in almost every respect. After returning to the hotel for dinner & my few belongings I took the underground train to the Embankment & gained admission (free) to see the new German mine laying submarine U.C.5 recently captured. By this time it was almost 9 pm & I crossed Westminster Bridge once more to Waterloo Station & was soon back in camp in a taxi from Amesbury Station about 2.30 am after four days seeming like four weeks by reason of the amount I had seen and learnt. London is a big city, but\n\ngive me Sydney Town and I'll be well satisfied for there's no place like Home. By night London has a very peculiar appearance - All windows have blinds drawn, all street and most car lamps are half painted over, black toward the sky & white towards the pavement. One evening we noticed the searchlights in operation. The prices of foodstuffs were something appalling. I must give a few examples - Fresh eggs 5 for 1\/-. Long loin chops 10½d. Scraps & flanks of mutton such as we use for catsmeat 8da lb, meat pies 4deach, cakes 1½ & 2d & 2½ ea, cup of tea 2½d, capstan cigarettes 4d otherwise tobaccos slightly\n\ndearer than Sydney, cakes of chocolate about the same but some chocolates very expensive. \nTea is","42":" a lb\n& sugar 5½d,with golden syrup 11½d. Presently we will realize by various indications like these that this is really a moderately war-stricken country. Anyhow the Australian finds \nhis\nthe buying capacity of his few shillings a day sadly curtailed, & we are hardly the millionaires at large we expected to be.\n","43":" Since the date of my last entry we have all had a quiet and uneventful time and in our own detail I must admit to a lazy one too. Our daily routine consists of reveille at 6.30 am, dress fully - in uniform & be ready for\n\nsick parade at 6.45 am. The men usually have colds only but there are also always a certain number of dressings to be done also mainly for cuts, bruises, boils, sore feet, earaches etc. Parade is usually over about 7.30, and soon after we go to breakfast, which over, we come back and tidy up the surgery by 9.00 am, when the doctor pops in. During the day there are medicines to be given & sundry dressings to be done. During the evening we go out if we feel inclined always leaving one or two in charge. Sometimes we have accidents to attend & sometimes lectures, but as a rule our work is fairly routine. Needless to say\n\nwe have gradually established ourselves rather well and our surgery is replete with everything necessary for the brigade's requirements. During the evening I usually go for a walk, mainly with George Prentice, but I think I have already mentioned all the walks which, unfortunately are rather limited in number.\n","44":" On Saturday 12th Aug I again obtained leave, this time for the week end, & went to London to enjoy myself with Roy Martin of the 9th Field Artlly Detail. The train did not leave Amesbury till 2 pm being an hour late and we arrived in Waterloo just\n\non 5 pm. We had tea at the splendid Union Jack Club opposite the station & went round the Commonwealth Head Quarters where all we got was a couple of books on Aust. \nwhich\nThe one I had I promptly sent back to Austr. The limited complimentary theatre tickets usually available to soldiers were not available on Saturday evenings, much to our regret. Then we proceeded to obtain accommodation. We tried at the YMCA buildings such as Tottenham Court Rd, but were obliged to put up at a private hotel. \nIn the evening we went to the Garrick Teatre to see that very poor play, \"The Rotters\", A Tale\n\nof a \nDisgraceful\n Disreputable Family.\n","45":" We rose at a very early hour (about 9 am), & after breakfast walked down Oxford St to Marble Arch & Hyde Park, then on to the Serpentine and Rotten Row where all the nuts ride. However we didn't see many. A light rain must have deterred many from their Sunday morning walk. After dinner nearby we visited the Victoria & Albert Museum South Kensington. It is really a beautiful museum and is very extensive. We did not visit the Natural History Museum, and had to skip the Inventions department which I believe is very good.\n\nThe museum is a very handsome building and much more extensive than one would expect. From the V & A museum we made our way up to the Albert Memorial & the Albert Memorial Hall, a circular hall of amazing size & very peculiar structure. Here we took a bus out to Kew Gardens. There we had tea in one of the peculiar river \ngarden\nterrace tea-gardens, & visited the beautiful Kew Royal Botanical Gardens. We were impressed by the gigantic oval glasshouses in which great palms grew in their own tropical climes. An interesting feature was the\n\nJapanese Pagoda which is visible for many miles. There are also models of Chinese Joss Houses in the Gardens& other interesting features. A former royal palace stands in the Gardens & exhibits many fine paintings. We returned from Kew Gardens in an old time horse bus perched upon the box seat. We found it a fine way to travel if you wish to study your route, but not if you are only on week-end, or even a week's leave. From Piccadilly we returned to Waterloo by underground and caught the 9 pm back to Amesbury and our 3 mile walk brought us\n\nback to camp about 1 am. Sad to relate by that time I was not feeling too well having dined in London \"not wisely but too well\".\n","46":" Once more back to the old routine. We hear we are to leave for front in the beginning of October next. But who knows? And I suppose truth would answer \"No one\". We jog along peacefully, our tucker is pretty good, our walks continue and sometimes we refresh our selves with YMCA concerts not to mention YMCA tea etc.\n","47":" At 12.30 pm George P & myself started out for Amesbury &, arrived there, caught the motor bus arriving\n\n\n\nin Salisbury shortly after two. The trip is one of about 8 miles occupying nearly one hour & is made through undulating, agricultural land along one of the well laid roads so prevalent here in England. On our way we passed Old Salem. New Salem is incorporated in the city of Salisbury, which I compare to Bathurst in size & importance being also a City of the Plains, but such small plains of course to our Australian ideas. Our walks around Salisbury revealed many a quaint old shop & other interesting features to our inspection. We are impressed by the\n\nnarrow \nbut\nness of the streets altho apparently well laid out. The market-place with its long row of stalls attracted our attention. But of course the great feature of Salisbury is its very beautiful cathedral. We visited it and were delighted with its beautiful exterior & lofty spire towering over the glorious green square in which the cathedral is placed. The interior of the cathedral is very imposing indeed. In the chancels one may inspect memorials & memorial tablets to many of Englands \nnoted\ndistinguished soldiers & sailors. The choir and chancel were very beautiful and nearby was placed the\n\nprivate sitting places of several families of the nobility. Some of the glass windows were very beautiful & impressed themselves on our attention. Meanwhile the fine pipe organ filled the cathedral with trembling music. The bishops new staff, a very ornate shepherd's crook was on view but under glass. For tea we returned to a quaint old restaurant & afterwards proceeded to the \nCourt House\nTown Hall facing the Market Square where a \"Soldiers free & Easy\" is established. Here we were delightfully entertained with musical items and then shown over the law courts inside. Our return journey we\n\nmade by another motor bus to Larks Hill and a short walk brought us \"home\" at a respectable hour. We agreed that the afternoon &evening could be counted among the most enjoyable we had spent in this country. Later we hope to visit other centres further afield, but not being our own masters we cannot be sure of our opportunities.\n","48":" Till today our \nlives\nroutine has remained unbroken since our last trip to Salisbury. By now, most of the men have returned from the training camps at Swansea, Winchester & Fairham and horses & guns are gradually arriving for their\n\ncomplete equipment. On this day Saturday five of us including two stretcherbearers hired a car about 2.30 & went over to Wilton House the Earl of Pembrokes fine place 3 miles outside of Salisbury. Here we spent a very pleasant afternoon at a Red Cross Fête. The house is used as a red cross convalescent home for wounded soldiers. The house itself is a large & rather imposing stone building with the Earls coat of arms standing out on the front of the house in bold relief. But it was not the house but the beautiful grounds, or park rather that forced\n\nour admiration. We wandered over lovely extensive lawns planted with beautiful trees, planted in many cases by the earls themselves in commemoration of certain events. Through the park ran a tributary of \nour\n Avon & boating & punting was one of the orders of the fête. Unfortunately we were unable to secure a boat, but enjoyed ourselves at tennis, bowls, & target-shooting. There were also many side shows to interest one. We enjoyed our game of bowls very much. After tea we returned to the Soldiers Free & Easy at Salisbury & spent the evening there till returning to camp by car again before \"Lights out\".\n","49":" For the next morning, (Sunday) not content with my Saturdays pleasant trip, I had arranged to go to Bournemouth in a car. The cost was£5 for the car for the day. I went with four others of our headquarters staff namely Cpt Patrick (Signaller), Bombadier McManus (in charge of our Maltese cart) and Signallers Whiting and Smith. We started out about 8.30 am & travelling through Lark Hill, Amesbury, Salisbury & the quaint old villages of Downton & Fordingbridge along a perfect road reached our destination about 11 o'clock. We were once delayed for a short time by a blowout & I took the opportunity to take a photo of that part of the road which\n\nis rendered very beautiful by an avenue of dense oak trees. We were landed in the centre of the city but a walk of 10 minutes of so brought us to the fine pier & beaches. We strolled along the fine new promenade to the Boscombe Pier & back again & made several walks round the pier itself. The admission to pier is 2dbut for us 1d. Bournemouth is a place of about 80,000 inhabitants, & takes premier place among the more select watering-places of Great Britain. There is a truly amazing number of very large private hotels there capable of accommodating a great number of holiday makers. The beach is only narrow, \n\n& runs along the base of steep and unsightly cliffs. The city & hotels are situate on the top of the cliffs & so have no view of the beach. This really as a great pity. Bourrnemouth is quite unlike our Manly for this reason & would compare better but still unfavourably with Cronulla. There are no buildings of particular interest in Bournemouth & during the afternoon we made the tram trip out to Christchurch which is situated 5 miles up the coast nearly to the mouth of the Avon. It is a very pretty place & is well known for its fine old Priory. There are also ruins there of a very\n\nold Norman fortress & the whole would yield a pleasant afternoons inspection, but unfortunately our time was limited. We returned to Bournemouth for tea & during the evening I went down by tram to Poole, a shipping port 5 miles down the coast. But by this time it had grown quite dark & this in conjunction with the darkening of all exterior lights gave the town a very gloomy aspect. However I persisted in taking a walk through the town & onto the Quay, but didn't care much about wandering through the dark & narrow streets of an English shipping town on my own so managed to find\n\nmy way back to more open streets & felt relieved withal as I was beginning to realize I might easily get lost. In this I think one with a poorer sense of direction might never have extricated himself from the maze. Then returning to the tram I was soon back in Bournemouth. This time I really did get lost a bit finding the garage, in the absolute darkness of a strange city. However once put right we were soon together again speeding homeward arriving in camp about midnight. The next morning I was up as early as usual again & was able to look back upon\n\na most enjoyable trip & one well worth while. Despite the stringent coastal restrictions I was able to secure one or two snaps & have sent prints home together with a few pc's I was able to obtain.\n","50":" The last few days I have been busy writing up the mail for home and, as usual, am just a wee bit relieved to see it all despatched OK. Today a couple of the others are just going in to London on weekend leave, but the weather is most unpromising.Last week-end saw another Zepp raid & 2 more brought down, much to the Londoners' delight. On Saturday (this is Thursday) we are holding\n\nsports among the","51":" Australian Division & have been granted a holiday in consequence. Many of our men are competing. The following Saturday we are to hold brigade sports & to that end next Monday night will see us holding a concert in the canteen to produce funds.\n","52":"\n","53":" As may be guessed this diary is written up everymonth or so & back dates inserted. Thus I nearly omitted one of the most important events in the lives of our Australian soldiers as soldiers on these Plains. I mean the inspection of them by HM the King. This the above day 26 Sept saw the men of the different units wearing faces of very poor\n\ngrace as they were marched in the drizzling rain to Bulford & there inspected by Major General Monash commanding the 3rd Division. The inspection by the King was not till the next day.\n","54":" 4 am was the artillery men's reveille time & great activity in harness & vehicle preparation prevailed. Before 9 am all units were well on their way to Bulford Camp the sight of the coming inspection. Better weather prevailed at first. Then at 10 am the King rode down the flanks of the massed troops & expressed himself as very pleased with their smart appearance. Then the march past began &\n\nfor the next 2 hours a continuous column of Australian","55":" Divisional men & reinforcements of all units, as well as New Zealand troops, passed the King. By this time the weather had become worse & soon a steady downpour began giving most troops a wetting as they wended their way campwards. Very complimentary reports appeared in the papers based on the King's remarks. Our detail was not included in the review, & I did not go down to look on so my accounts were from others who had. The review took place on a Wednesday & the following Saty.\n","56":" During the past week,\n\nnotwithstanding the review, preparations had been in swing for holding sports among the 3rd Div'n in rear of Camp 10. On the Saty morning massed bands announced the commencement of the Sports & I went down for the morning & returned again in the afternoon. A very interesting programme was arranged and keenly competed events fully occupied the spectators till during the afternoon three aeroplanes appeared & one landing the airman descended & visited the sports while needless to say, the men rushed from the sports & surrounded his machine in eager curiosity. I took a few snaps but they were not too clever.\n","57":" Tonight we held a concert mainly arranged by Pte Walters in aid of our own sports next Saty. It was held in the camp dining room & 6dadmission charged. The proceeds amounted to over£6. Otherwise the concert was only a limited success.\n\n7\/10\/16 (Saty) We held our 7th F A Brigade sports on the hollow west of our Camp 17. The programme included many interesting competitions between teams from the various batteries. A few showers damped the ardour of all a little & naturally the spectators were very limited for such a large ground. Otherwise\n\nthe enterprise was a great success.\n","58":" Another fortnight of routine camp life & I have another break. This morning I left camp with a pass in my pocket immediately after breakfast, & taking a taxi, was soon in the train at Amesbury on the way to Salisbury where I changed for a Bristol bound train. At first the train travelled through flat and then through hilly wooded country past Codford & then grass clad country opening out to more distant hills. Soon we passed a hill about a mile away, which attracted our interest. On the steeply sloping grass clad slope of it\n\n\n\nwe observed a huge white horse outlined by trenches cut into the chalky soil. This phenomenon is supposed to mark the sportwhere King Alfred & the English won a victory over the Danes. Soon our journey took us by the course of the River Avon & presently we arrived at Bath. Then on once more for about twenty minutes and we arrived at our destination - Bristol. I mention our by that I mean my destination & that of a mate whom I had picked up at Amesbury. He was going to visit his parents there & took me with him. His mother and father lived at Redland, Bristol\n\n& here I was made quite at home by his kind parents. After lunch we went for a walk through the city & observed the Tramways Centre, Bristol Bridge, St Mary's Redland & also saw the factories of Wills & Frys both of immense extent. After returning for tea we went to the Bristol Hippodrome & then for a short walk thru' the darkened city & so home to bed & rest. The next morning (Sunday) we went for a walk past the Victoria Convalescent Home to Durdham Downs, the immense park along side the city, & so on along\n\nthe bank of the Avon to Clifton Suspension Bridge which spans the great chasm that river has carved for itself through the soft soil & rock. The Clifton Bge is a fine sight, being about as long as our own bridge at North Sydney, & crossing at a height of at least 300 feet. It was built as far back as 1836-1854. From here we returned by Taxi to Bristol Cathedral & then saw the Art Gallery Cabôt Tower & University Buildings, also the Victoria Rooms. Then another taxi brought us home to dinner. After dinner & an after\n\ndinner chat we took our departure & caught the 3.30 trainfor Bath. At Bath we saw the Abbey, Royal Baths & Markets also some very fine hotels. The gardens lying alongside the river (Avon) were very pretty. Darkness then coming on we turned into the soldiers club for tea & then caught the trainhome arriving at Salisbury in the rain. Here we caught a taxi back to camp arriving about 1 am on Mon morning.\n\n30\/10\/16 Tonight I betook myself & my belongings by taxi for 2\/6 down to camp 3 as from tomorrow I have\n\nbeen transferred to the","59":" Field Ambulance in exchange for a man of the","60":" who has been with our detail for 6 weeks or so. This transfer was not solicited although approved of by myself, but arranged by my former O.C. His reason given was that he knew I disagreed with a certain other member of the detail & that he thought it would be for my own good to be away from him & that that was what he was thinking of. In my opinion he did it to oblige the corporal by introducing his mate into the unit permanently bearing the other matter in mind. Needless to say\n\nthe member with whom I could not agree was a particularly vile character.\n","61":" On this date I commenced duty with the","62":" Field Ambulance. I am posted to C Section but sleep in one of A Section's huts. All the men are very good fellows, particularly A Sect & I was given a hearty reception. Many of the men I had met at Liverpool & many on the \"Argyllshire\". Our daily work is not hard as the ambulance is classed as efficient.\n","63":" On this long wished for day I proceeded on my long waited for 4 days leave.\n\n"}}