{"Document Name":{"0":"Diary_0448","1":"Diary_0448","2":"Diary_0448","3":"Diary_0448","4":"Diary_0448","5":"Diary_0448","6":"Diary_0448","7":"Diary_0448","8":"Diary_0448","9":"Diary_0448","10":"Diary_0448","11":"Diary_0448","12":"Diary_0448","13":"Diary_0448","14":"Diary_0448","15":"Diary_0448","16":"Diary_0448","17":"Diary_0448","18":"Diary_0448","19":"Diary_0448","20":"Diary_0448","21":"Diary_0448","22":"Diary_0448","23":"Diary_0448","24":"Diary_0448","25":"Diary_0448","26":"Diary_0448","27":"Diary_0448","28":"Diary_0448","29":"Diary_0448","30":"Diary_0448","31":"Diary_0448","32":"Diary_0448","33":"Diary_0448","34":"Diary_0448","35":"Diary_0448","36":"Diary_0448","37":"Diary_0448","38":"Diary_0448","39":"Diary_0448","40":"Diary_0448","41":"Diary_0448","42":"Diary_0448","43":"Diary_0448","44":"Diary_0448","45":"Diary_0448","46":"Diary_0448","47":"Diary_0448","48":"Diary_0448","49":"Diary_0448","50":"Diary_0448","51":"Diary_0448","52":"Diary_0448","53":"Diary_0448","54":"Diary_0448","55":"Diary_0448","56":"Diary_0448","57":"Diary_0448","58":"Diary_0448","59":"Diary_0448","60":"Diary_0448","61":"Diary_0448","62":"Diary_0448","63":"Diary_0448","64":"Diary_0448","65":"Diary_0448","66":"Diary_0448","67":"Diary_0448","68":"Diary_0448","69":"Diary_0448","70":"Diary_0448","71":"Diary_0448","72":"Diary_0448","73":"Diary_0448","74":"Diary_0448","75":"Diary_0448"},"Date":{"0":"unknown","1":1424.0,"2":1425.0,"3":1426.0,"4":1427.0,"5":1428.0,"6":1429.0,"7":1430.0,"8":1431.0,"9":1432.0,"10":1433.0,"11":1434.0,"12":1435.0,"13":1436.0,"14":1437.0,"15":1438.0,"16":1439.0,"17":1440.0,"18":1441.0,"19":1442.0,"20":1443.0,"21":1444.0,"22":1445.0,"23":1446.0,"24":1447.0,"25":1448.0,"26":1449.0,"27":1450.0,"28":1451.0,"29":1452.0,"30":1453.0,"31":1454.0,"32":1455.0,"33":1457.0,"34":1458.0,"35":1459.0,"36":1460.0,"37":1461.0,"38":1462.0,"39":1463.0,"40":1464.0,"41":1465.0,"42":1466.0,"43":1468.0,"44":1469.0,"45":1470.0,"46":1471.0,"47":1472.0,"48":1473.0,"49":1474.0,"50":1475.0,"51":1476.0,"52":1477.0,"53":1478.0,"54":1479.0,"55":1480.0,"56":1481.0,"57":1482.0,"58":1483.0,"59":1484.0,"60":1485.0,"61":1486.0,"62":1487.0,"63":1488.0,"64":1489.0,"65":1493.0,"66":1494.0,"67":1495.0,"68":1496.0,"69":1497.0,"70":1498.0,"71":1499.0,"72":1500.0,"73":1501.0,"74":1502.0,"75":1503.0},"Entry":{"0":"\n\n1917\n\n","1":"\n\nLeft canal huts for dugouts near Menin Gate. Repairing dugout.\n","2":"\n\nFritz planes over. One bomb blew out one end of Padre’s mud hut, but otherwise no damage. Fixed up a minature range for Lewis gun practice.\n","3":"\n\nLeft for Westhoek Ridge & built dugout for 6 at rear of pill box. Gas guard 2400 to 0200.\n","4":"\n\nImproved dugout a.m. Gas shells falling in profusion to leeward. Fatigue party to Hooge for duck boards but there were none.\n","5":"\n\nUnderstand that left flank of 9th Battalion pushed back. Deluge of shrapnel kept us in dugout all day, except unlucky devils like myself who were on gas guard; my shift 1600 to 1800. Fritz plane overhead at 1650, quite low, driven off by machine gun fire.\n","6":"\n\nShelling all night. Laying duck boards a.m., two killed. Hail of shrapnel. Carrying party p.m. under heavy fire. Stretcher bearers dugout blown up. Our candle blown out by concussion twice in\n\n1917\n\nfive minutes – wonder we pleasant Sunday afternoon!\n","7":"\n\nUp Zonnebeke ‘B’ track to close supports – only a few isolated posts constituted front line, a continuous trench being a thing of the past. Wiring party in No Mans land 2000 to 2300. Gas Guard 0100 to 0300. “Stand to\" 0500.\n","8":"\n\nHid in hole all day. At nightfall made a little overhead cover. At 2200 went out & dug a strong post in rear of outposts. Fritz was wise to our proceedings & sent over barrage of gas shells & we were glad to get back at 0330. The sergeant major, platoon sgt. & 3 corporals who were not on fatigue with us were blind drunk, having soaked the whole rum issue, so we had to turn in wet through & chilled to the marrow. Lts. Hawke & Balcombe & L\/Cpl. Thompson wounded by shrapnel. Hawke killed later on whilst being carried to the rear. A real white man.\n","9":"\n\nGas guard 1600 to 1700. Fatigue improving strong post 2300 to 0230.\n\n1917\n","10":"\n\nRelieved at 1400 & took up position in trench near Routers Railway. Ration fatigue to Anzac Ridge but no rations arrived. Raining.\n","11":"\n\nTwo trips to Hooge for rations & again for dixies a.m. Duckboard fatigue p.m. Gas guard 0500 to 0600.\n","12":"\n\nDuckboard track laying in pouring rain a.m. Fritz was blowing the track out almost as soon as we laid it down.\n","13":"\n\nRelieved at 0900 by Lancashire fusiliers. Hell for leather back to Ypres & then on to Vancouver Camp nr. Ouderdam. Free beer on issue! Pay available.\n","14":"\n\nBath p.m. Clean shirts, pants & socks – no singlets.\n","15":"\n\nLeft per boat for Mont des Cats. Camped in tents nr. Berthen. Nail in boat harmed me.\n","16":"\n\nLeft for Zuytpeene per motor lorry as foot sore.\n","17":"\n\nBn. left a.m. for Wardrecque. I remained behind guarding ammunition & packs with 3 other men. Lorry did not arrive & we had no rations.\n\n1917\n\nRaided Signal school cookhouse & secured four tins M & V rations. Bought two loaves of bread, I alone having any money – 7 francs! Slept in barn.\n","18":"\n\nLeft p.m. per lorry for Ramillies-Werquin where we rejoined battalion.\n","19":"\n\nSpell at Ramillies-Werquin. I left after tea per lorry for Blequin. Slept in empty house. No rations or money to buy food.\n","20":"\n\nBattalion arrd. p.m.\n","21":"\n\nMess orderly. Left per boat for Tingry nr. Samer, a distance of 22½ kilometres. Billetted in large empty house with fire-places – tres bon. Hope to stay several days.\n","22":"\n\nKit inspection a.m. Pay p.m.\n","23":"\n\nFormal parade for 5 minutes.\n","24":"\n\nDitto. Settling down, Samer.\n","25":"\n\nOn billeting scheme as interpreter with Lt. Marr.\n","26":"\n\nStill engaged on scheme.\n","27":"\n\nCommunion.\n","28":"\n\nParade.\n","29":"\n\nEscort to Heningen for court martial prisoners.\n","30":"\n\nParade a.m. Borrowed 100 frs.\n\n1917\n\nfrom Capt. Judge.\n","31":"\n\nOn leave in Boulogne. Good food & bad drink.\n","32":"\n\nPay a.m. Repaid loan 100 frs. Bn. guard at 1400. Arranged with a Frenchwoman to buy 8 pork chops for the guard, \nnot\n & to cook them for supper. Made me bilious.\n","33":"\n\nGuard dismounted at 1430. My digestion badly disarranged.\n","34":"\n\nCommunion. Capt. Judge left as O.C. Brigade school, worse luck. Ackerman to Corps Gas school.\n","35":"\n\nMotor lorries to Etappes for Turkish bath. Unwashed underclothing issued in return for our semi clean things. Caught a chill on return journey.\n","36":"\n\nVoted ‘YES’ on conscription referendum. Temperature 99.8.\n","37":"\n\nVery queer. On picquet in Tingry wood. Sun shining & quite warm.\n","38":"\n\nMusketry practise. Shooting very bad as my cold & eyes are bad.\n","39":"\n\nOn sick parade. Light duty.\n","40":"\n\nBn. Sports. A Coy won all events.\n\n1917\n","41":"\n\nCommunion. Have lost my voice.\n","42":" & 11\n\nOff parade – light duty.\n","43":"\n\nGetting better but quality of rations nauseating.\n","44":"\n\nLeft Tingry with Lt. Mackenzie as advance party to Courset. H.Q. at Courset, Companies at Sacriquier. Not feeling too well so hired room – clean sheets & plenty of eiderdown quilts. Oh for peace!\n","45":"\n\nBn. arrd. at 11.30. We had provided billets for everyone but the guard & I soon fixed ‘em up. The Colonel was billetted at a Chateau owned by the Baron de Givenchy & has to take his boots off before going upstairs to his room! I have lived on the best for two days but the issue rations were awful.\n","46":"\n\nMde. Fournier provided a fine breakfast this morning & I then adjusted the billetting claims. Started off to catch the battalion which had left earlier & was lucky enough to get a lift in a car to Blequin via Senleques. Walked to Ledeghem where I dined & then on to Vaudeghem, arriving half an hour before battalion. Chip potatoes for\n\nsupper with Ackerman. One loaf of bread issued for four men – 24 hrs. rations!\n","47":"\n\nLeft Vaudeghem with battalion for Wavran. Billetted in a ruined mud barn. Nothing but ¼ loaf of bread & ½ tin of ‘bully’ & two drinks of tea without milk or sugar all day. The margarine issue was too rancid for consumption. We raided a cache of potatoes & a hen roost, securing ½ sack of potatoes & three fowls. The broth was excellent but the birds were very ancient – may have been with Noah on his maritime expedition. Plucking & drawing a fowl in a meadow, pitch dark, & a snow storm quite an experience. Over 20 men had a good supper without a qualm of conscience – a starving man marching 12 to 15 miles a day & carrying a load of over 90 lbs. knows no conscience.\n","48":"\n\nLeft Wavran at 0330 in a blinding snowstorm – ten of us formed a rear guard. One poor devil fell out just at daybreak & we had a job to revive him. Secured an officer’s horse & held him on until we\n\nWizernes. Entrained there for Kemmel. The train journey was awful – no windows in the train & not even a drink of tea on arrival at the camp of bow huts.\n","49":"\n\nA bitterly cold night. Rations issued before breakfast – 4 to a loaf, 5 figs each, a spoonful of jam, a small bottle of pickles for 40 men! Raw tea twice today, a square inch of cheese for breakfast & a good quality but minimum quantity of stew midday. The artillery is regular but not much volume & we expect the sector will be a quiet one. Foot & sock inspection.\n","50":"\n\nNothing doing but gas respirator & rifle inspection. Parcels from the pater & Mai. Pay.\n","51":"\n\nVolunteered for a raid but drew a blank – very disgusting.\n","52":"\n\n‘A’ & ‘R’ Coys ordered up the line. Left at midday for position S.S.W. of Wytchaete (0.9 & 8.2). Good dugout. Gas guard 2000 to 2200 & 0200 to 0400.\n","53":"\n\nFreezing hard. On fatigue 1600 to 2200 digging trenches. I doubt if people realise the meaning of fatigue. Since Fritz broke through at Cambrai the ‘heads’ have\n\ngot the ‘wind up’, even traffic police must carry rifles & ammunition. Up the line at Passchendaele I was on a wiring party in No Man’s Land & the only protection we had was one pair of wire cutters between 20 men! Now we fall in with rifle & bayonet, 120 rounds, a tin of bully & two biscuits. We then move to a dump for picks & shovels, thence to the allotted task. If digging a trench you will inevitably be up to your knees in water before you are deep enough. The ground is frozen hard for 8 or 9 inches, & of course shell holes several feet deep are full of water & drain into the trenches. One wonders how so few go down with pneumonia etc. We have to work from 1600 to 2200 so that Fritz cannot observe our movements & when we finish for the night we throw snow over the freshly turned earth.\n","54":"\n\nIdem ejusdem. \n","55":"\n\nToday it thawed & ‘on fatigue’ was hellish.\n","56":"\n\nWeather unsettled – the less said about Xmas the better. On fatigue!!\n","57":"\n\nMills, Thorpe & I sneaked off to Dranoutre for a feed – eggs, chips & sausages – returning in time for fatigue & we had not been missed.\n","58":"\n\nCook’s fatigue a.m. Fatigue at night.\n","59":"\n\nOn fatigue.\n","60":"\n\nCarrying party.\n","61":"\n\nMoved up the line at dusk. Put on guard – 2 hrs. on & 6 hrs. off. During ‘off’ hours from dusk until daybreak we were digging in. Freezing hard.\n","62":"\n\nSlept from daylight until dark except from \nmidda\n ten a.m. until midday when I was observing. Fatigue all night.\n\n1917 \n","63":"\n\nPay at 3 a.m. Wiring party until dawn.\n","64":" to 6\n\nGuard from 2 a.m. to 4 a.m., 10 a.m. to 12, 6 p.m. to 8 p.m. Wiring 8 p.m. to 2 a.m.!\n","65":"\n\nSent to bn. hq. to translate some papers taken off a Fritz corpse.\n","66":"\n\nNearly sent ‘West’ by machine gun fire whilst wiring – tin hat saved me. Thawing & raining.\n","67":"\n\nMoved into outpost.\n","68":"\n\nListening post.\n","69":"\n\nRelieved at night.\n\n1918\n","70":"\n\nClose supports.\n","71":"\n\nAt night moved to \nmy\n outpost.\n","72":"\n\nWorking listening post.\n","73":"\n\nRelieved at night, morning into close supports.\n","74":"\n\nMoved to distant supports at night – detailed for a special guard two miles off. Raining hard & I fell into a lagoon with full pack, bag of rations for 48 hours, extra blanket, rifle, etc. Saved my life but lost blanket & rations. Had to dive for my rifle. No change of clothes – a – miserable.\n","75":"\n\nRecalled from guard & rejoined battalion at Findenhoek.\n\n"}}