{"Document Name":{"0":"Diary_0223","1":"Diary_0223","2":"Diary_0223","3":"Diary_0223","4":"Diary_0223","5":"Diary_0223","6":"Diary_0223","7":"Diary_0223","8":"Diary_0223","9":"Diary_0223","10":"Diary_0223","11":"Diary_0223","12":"Diary_0223","13":"Diary_0223","14":"Diary_0223","15":"Diary_0223","16":"Diary_0223","17":"Diary_0223","18":"Diary_0223","19":"Diary_0223","20":"Diary_0223","21":"Diary_0223","22":"Diary_0223","23":"Diary_0223","24":"Diary_0223","25":"Diary_0223","26":"Diary_0223","27":"Diary_0223","28":"Diary_0223","29":"Diary_0223","30":"Diary_0223","31":"Diary_0223","32":"Diary_0223","33":"Diary_0223","34":"Diary_0223","35":"Diary_0223","36":"Diary_0223","37":"Diary_0223","38":"Diary_0223","39":"Diary_0223","40":"Diary_0223","41":"Diary_0223","42":"Diary_0223","43":"Diary_0223","44":"Diary_0223","45":"Diary_0223","46":"Diary_0223","47":"Diary_0223","48":"Diary_0223","49":"Diary_0223","50":"Diary_0223","51":"Diary_0223","52":"Diary_0223","53":"Diary_0223","54":"Diary_0223","55":"Diary_0223","56":"Diary_0223","57":"Diary_0223","58":"Diary_0223","59":"Diary_0223","60":"Diary_0223","61":"Diary_0223","62":"Diary_0223","63":"Diary_0223","64":"Diary_0223","65":"Diary_0223","66":"Diary_0223","67":"Diary_0223","68":"Diary_0223","69":"Diary_0223","70":"Diary_0223","71":"Diary_0223","72":"Diary_0223","73":"Diary_0223","74":"Diary_0223","75":"Diary_0223","76":"Diary_0223","77":"Diary_0223","78":"Diary_0223","79":"Diary_0223","80":"Diary_0223","81":"Diary_0223","82":"Diary_0223","83":"Diary_0223","84":"Diary_0223","85":"Diary_0223","86":"Diary_0223","87":"Diary_0223","88":"Diary_0223","89":"Diary_0223","90":"Diary_0223","91":"Diary_0223","92":"Diary_0223","93":"Diary_0223","94":"Diary_0223","95":"Diary_0223"},"Date":{"0":"unknown","1":744.0,"2":745.0,"3":748.0,"4":749.0,"5":751.0,"6":752.0,"7":753.0,"8":767.0,"9":768.0,"10":769.0,"11":770.0,"12":774.0,"13":775.0,"14":776.0,"15":777.0,"16":778.0,"17":779.0,"18":780.0,"19":791.0,"20":792.0,"21":793.0,"22":807.0,"23":808.0,"24":809.0,"25":814.0,"26":815.0,"27":816.0,"28":817.0,"29":818.0,"30":819.0,"31":825.0,"32":826.0,"33":832.0,"34":833.0,"35":836.0,"36":837.0,"37":838.0,"38":839.0,"39":840.0,"40":842.0,"41":856.0,"42":857.0,"43":861.0,"44":862.0,"45":866.0,"46":872.0,"47":873.0,"48":874.0,"49":875.0,"50":891.0,"51":892.0,"52":905.0,"53":906.0,"54":907.0,"55":908.0,"56":909.0,"57":910.0,"58":911.0,"59":912.0,"60":913.0,"61":914.0,"62":915.0,"63":917.0,"64":918.0,"65":919.0,"66":926.0,"67":930.0,"68":931.0,"69":932.0,"70":935.0,"71":936.0,"72":937.0,"73":947.0,"74":954.0,"75":955.0,"76":956.0,"77":957.0,"78":958.0,"79":959.0,"80":960.0,"81":961.0,"82":962.0,"83":963.0,"84":964.0,"85":965.0,"86":966.0,"87":967.0,"88":968.0,"89":969.0,"90":970.0,"91":971.0,"92":972.0,"93":973.0,"94":982.0,"95":983.0},"Entry":{"0":"\n\n","1":" in hospital. Both Xmas & N.Y. were very enjoyable days in hospital. Saw optician who advised me very strongly not to go to the front again, but saw also Capt. , & after chat with him thought I would like to go to the boys again. Told optician so & he put no impediment in my way but told me I was unwise.\n\nDischarged from Hosp. to Base Camp at Giza on","2":"\n\nMet Land there the first night in peculiar circumstances.\n\nHad just settled down to sleep\n\non the mess table (very hard after bed in hospital) when I heard a shot fired. This was shortly followed by another & then the guard was called out.\n\nJust as I was getting out to investigate, the \"assembly\" blew & we all rushed on to the parade ground where rumours were rampant about a native rising.\n\nRush to armoury to get arms which were few, & ammunition, which was scarce.\n\nRan up against Land in the parade ground & he informed me that Jeffries, Shoobridge, Duncan, Kelsall & others were in camp, & others, including Logan\n\nwere expected.\n\nSaw them in the morning & had a great \nat\n old yarn.\n\nThey were all in A (fit for active service) class, & I was in B, but I speedily transferred.\n\nThe native rising turned out to be a mob of niggers, infuriated by the dastardly conduct of Australian soldier; \nwho\n they were after his blood. The first shot came from a blank fired by native policeman at the mob, & the second was an accident.\n\nAn A.M.C. man on guard fired accidentally while loading. This affair brought to a head the sub-conscious thoughts I had had since returning\n\nfrom Anzac, in regard to feeling in Egypt.\n\nUndoubtedly the country, especially Cairo is in a more unsettled state than it was a few months ago.\n\nThere are 11 million Mahommedans in the country & a great percent of them \nare\n is Turkish or of Turkish descent, & they are absolutely against England in thought, while professing patriotism for her.\n\nThis state of affairs is not improved by the carryings-on of a rough section of the Aust. soldiers.\n\nThey get drunk & insult not only the Arabs, but educated\n\nEgyptians, both in the street & in vehicles.\n\nThey ill-treat street vendors, (mostly Arab boys) who, although undoubtedly a nuisance, have no power against the soldiers, & certainly do not deserve such absolutely tyrannical behaviour as is meted out to them.\n\nThen the great number of soldiers about Cairo, prevents any retaliation from the natives, even when they become so hot blooded that they are capable of anything for which a mob of drunken soldiers is capable of, has been demonstrated in the two Wazza riots. On both of\n\nthose occasions there was a great amount of damage done to \nlife & limb\n natives & also property.\n\nThere is news of a Turkish attack which is premeditated, on the Canal, & popular opinion among Europeans in Cairo is that if they (Turks) make any show at all, the natives will immediately rise to help them. Already there have been skirmishes on the Western border against Bedouins, all of them urged on by German intrigues.\n\nAt the Base Details Camp, after delay in sending us away, rumours came that Units had been sent up to full strength\n\nby reinforcements, & consequently we were to be made into composite units. That was a disappointment for we had all been anxious to regain our old pals of Gallipoli.\n\nHowever, on the Sunday which made our stay in Base Details three weeks, the A.M.C. were paraded at the Orderly Room by the doctor.\n\n\"Any man wounded?\" I was the only one. \"Any one with any physical troubles?\" Another one – Bill Malloy stepped out.\n\n\"You will be sent to the Prisoners of War Camp at Maadi.\"\n\nAnd so we were, at once.\n\nWe reached Maadi after dinner & found nothing could be done\n\nabout us until after breakfast next morning.\n\nThe camp is an erstwhile pottery surrounded by a high stone wall, which is patrolled by sentries. The garrison ","3":"\n consists of a composite regiment of Devons, Lancs. Fusiliers, Manchesters.\n\nI thought I had run cousin Herbert to earth when I saw","4":" Lancs. Fus. on a man’s epaulette, but he was a detached member. He knew Herbert & said he must be at Mena but I subsequently found he had left for Suez C with the Regiment.\n\nThe following morning we were introduced to the doctor who\n\nquestioned us as to our abilitie. I, of course, said I could dispense, so he wrote me out a prescription which, luckily, I could read, & I made it up.\n\nBill Molloy was detailed to the disinfection depart., i.e., the supervision of washing & disinfecting of all prisoners.\n\nI was appointed dispenser & compounder with a period of probation \nas\n with Doctor Boutazy.\n\nThis period did not last long for I quickly grasped what I had not known before of the indispensable knowledge.\n\nSpoke to Doctor Scrimgeour, the Senior doctor, about promotion & \n\nhe promised to see about it for me.\n\nThe third doctor (the other assistant) is Dr. Cockinos who speaks English poorly & is consequently a good subject for French conversation. He is in fact helping me with my French idioms.\n\nThere are four R.A.M.C. men besides Molloy & myself A.A.M.C. men, & two of the former are working No. 2 Prison Hospital. They are both rather dull. Luckily the remaining two R.A.M.C. men who work with us at No. 1 are bright.\n\nArnger is a very cheerful & companionable fellow; Graysmarsh the other, bright etc., but a little\n\npushing, & not too refined. We all work very well together & there is no reason to doubt we shall continue to do so, I hope so at any rate.\n\nHead = 9 lbs.\n\nBody = 9 lbs. + ½ tail\n\nTail = ½ Body\n\nLet x lbs. = tail\n","5":" lbs. + ½ x lbs. body\n","6":" lbs. head\n\n2 x = 9 + ½ x\n","7":" x - ½ x = 9\n\n1½ x = 9\n\nx = 6\n\ntail = 6\n\nbody = 12\n\nhead = 9 = 27\n\nLetters\n\nP.C. to: Vi, Greta M. Lily, Rita, & Esb. Gard","8":"\n\nRita – Maadi","9":"\n","10":"\n\nDispensing on & off all day. The first field rations have been served today, & although we had a good dinner, tea was not splendid.\n\nMost miraculous coincidence this morning. Met Buckle again, driving mule team into camp ground (barrack yard).\n\nHe is still with the 6th A.S.C. & is now camped at Maadi. Then Sellars, whom I did not expect to meet for some time again (since I lost touch with him after leaving","11":" at A.G.H.) is also camped at Maadi.\n\nIt seems as if I am fated to meet Jack Buckle.\n\nIn the evening Jack came to see me in the Dispensary & he & his friend with Graysmarsh & I, adjourned to the canteen, where to my amazement I disposed of three shandies.\n","12":"\n\nWeather very much better to-day. Cold nights still.\n\nPrisoner brought in this afternoon from the Citadel, who had been a jeweller in town.\n\nArrested & sent to Citadel where he fell sick. Now in our hospital. \n\nGiven Turkish rations today of olives & meat cake which he would not eat (of course).\n\nPoor fellow is very thin & looks ill & being hours without food\n\nhas not improved him.\n\nHave promised him biscuits & milk, against regulations.\n\nImpossible to let him go hungry, because of some error in the rations.\n","13":"\n\nStarting on Turkish & improving French by conversation with Dr. Cockinos.\n\nBusy dispensing special prescriptions during morning.\n\nAft. off. Went to Maadi Camp & found Sellars who accompanied me back to the Camp (or Prison rather) where I was just showing him round when a messenger arrived telling of accident nearly by. Went at once & found\n\nthat Australian had had a nasty accident with a byke. Rendered first aid & fixed him up & Sellars & I helped carry him to Hosp. at Maadi.\n\nFound","14":" L.H.F.A. in charge & saw Palmier & others that I knew on Peninsula.\n","15":"\n\nPaid on Friday last at Intermediate Base & met Land in evening, & spent happy time at pictures. Saw others of","16":" Field Ambulance & had good chat with Kennedy who is coming out to see me.\n\nLast \nmight\n night Jack Buckle came to see me & we had a cup of tea in the hospital.\n\nThe dispensary is now reorganised\n\nand I am fairly used to the drugs.\n\nIt took late hours to get things as they are, but all should now be plain sailing.\n\nNo word through yet about stripes. I cannot understand why I got a letter from Vi since \nd\n she received news of my wound, but none from home at all.\n\nLast Sunday the Egyptian Reserve which was recently called out, went in a body to the Sultan’s Palace at Bab-El-Lok, to protest against something or other (either the proposed flying of Union Jack from his Palace or something similar). The result was that the\n\nDevons were called out & half a dozen Egyptians were killed & a number wounded. A sign of the times.\n\nC. arrived home dead drunk to-night & caused trouble.\n","17":"\n\nAm making headway with French under tuition of Dr. Cochenos.\n\nLatin I am also going on with in order to get up to matriculation standard as soon as possible. Dr. Boutazy thinks I should stay in Egypt after the war & go to Brerut College to take medical degree. He is giving me all the practice he can here.\n\nLast Sunday I vaccinated about 40 prisoners & every day I pull\n\nout teeth; all in addition to the dispensing & compounding.\n\nIf the","18":" Field Amb. are again sent on active service I shall be faced with a \ndillem\n dilemma, for it will be hard to stay behind & leave the boys to go ahead & face the old dangers.\n\nOn the other hand it would not be right for me to go on desert fighting with my eyes as they are. In addition I might be altering the whole course of my life for the better, by staying here.\n\nTonight Molloy & myself start to sleep in the hospital.\n\nIt will be a change for the better because the Lancashire boys in the barrack room we occupied\n\nare rather childish, & talk at the top of their voices long after lights out.\n\nGenerally, however, we are rubbing along with the Tommies very well.\n\nTomorrow afternoon I meet Dr. Cockinos in town & he is to introduce me to a friend of his who can give me information about the medical prospects in Egypt.\n","19":" ","20":"\n","21":"\n\nI met Dr. C. & he introduced to M. Georgiades at his \nof\n laboratory near the New Bar Café.\n\nOn his advice I have written to Dr. Keatings Dir. of School of Medicine at Cairo.\n\nOn the same evening Land met me & gave me a load of papers\n\n& a few letters.\n\nLetters from home but none from Rita, although I received a nice parcel of cigarettes from her.\n\nNow we shant be long.\n","22":"\n\nNow reply from Dr. Keatings yet Capt. Scrimgeour told me a few days ago when I spoke to him \nof\n about promotion, that a new hosp. is going to be erected here & I shall have a good position in it.\n\nWhat about the \"bird in the hand\" proverb?\n\nThe\n Teaching English to Dr. Cockinos in exchange for\n\nsundry French lessons; all working well.\n\nDispensing work increasing, but getting more adept every day.\n\nTo day received \na\n 10 letters, 4 of which were from Rita.\n\nFeel like a new man altogether. There are quite a lot of parcels on the way, so I ought to receive some of them.\n\nMr. Bowers & Alex Lea of Whiporie, have both been killed.\n\nCairo is getting quieter & quieter now for greater numbers of soldiers are being sent to Tel-el-Kebir or the Canal.\n\nAlso the authorities are very strict now.\n\nThe general opinion seems to be\n\nthat the Germans will be well on the way to defeat in a month or two & the war over before Christmas.\n\nCertainly things are looking up with the Verdun repulse & the Russian success in Persia.\n","23":"\n\nReceived a second bundle of letters, making about 17 in all. Work in dispensary is going along fairly well.\n\nCapt. Scrimgeour found fault (quite rightly) with some ointment yesterday & gave some praise for the new labels I have put on the bottles.\n\nAltogether however, he is rather a hard man to get on with because\n\nhe apparently takes no interests in our welfare & leaves us alone in all things \nwhich\n where he should not & putting in his part where it is not always welcome.\n\nHad a little affair on Sunday which does not improve my comfort in the \"Imperial\" surroundings.\n\nTaff Jones of the","24":" came to see me & was brought in to me by Jones of the \"Mil. Police\". I volunteered to be responsible for him.\n\nWhen ready to go I took him out & on the way show him the cells in which was a Turkish \"Major\", telling him his history, how he escaped from the Citadel & had masqueraded previously as a Major, being only a Lieutenant. While talking, some prisoners came\n\nup and offered us beads for sale. We had barely got them in our hands when an M.P. came up & ordered us abruptly to move on. That of course led to words & when he threatened to report me to the guard room, I invited him to do so by all means.\n\nThis was not very good for my friend, but it was not to be avoided & I certainly gave the officious customer my opinion of him.\n\nThe following morning I expected to be paraded at Orderly Room, but I was soon informed that it had been hushed up ostensibly on my account. Really the fellow thought he had a chance of scoring off an Australia, but found his mistake when he\n\nwas\n heard of the implication of the Policeman who brought my friend round.\n\nLately the way the authorities have been treating the prisoners & especially the cadets, strikes me as too lenient altogether.\n\nSome time ago there appears to have been trouble amongst the cadets; they fought amongst themselves & most of them were consequently put in prison.\n\nOne of them being consumptive, has been put in \nprison\n hospital & some others followed him later. These being under better treatment than their friends in prison have repeatedly refused to eat on that account, & caused \n\na great deal of trouble.\n\nAli Ibrahim, the consumptive, has been court martialled for plotting, & the result is not yet out, but both he & the other two have been treated exceedingly leniently.\n\nEggs & delicacies have been forced on them, to be received with surliness.\n\nNow Enver Pasha’s brother Jaffa Pasha has been captured on the Western frontier & there was a tremendous excitement when he arrived.\n\nAll the officers were dressed in their best & they waited at the entrance as if for a visitor of high rank.\n\nThe first I saw of him was near our hospital & he was leaning on Major Simpson’s (O.C.) arm. Soon after he was established in the room next to the hospital, containing a bed, \n&\n table & chair, with mats on the floor, I was sent in with a bottle of Vichy water, so I was able to speak French.\n\nHe (the General) is an exceedingly polite fellow.\n\nDressed in khaki from head to foot excepting the fanciful tarbush with embroidery which gave a touch of distinction to him.\n\nHis leggings were worn & clothes slightly war-stained, & his right arm was in a sling.\n\nIn a conversation he had with Dr. Scrimgeour I gathered that in a skirmish between the English & Turks in which things were so complicated that they were unable to pick each other out; he received a sabre thrust.\n","25":"\n\nYesterday afternoon Molloy, Dr. Cockinos & I went to the Pyramids.\n\nThe Dr. insisted on paying all expenses.\n\nArrived at the face of Cheops, we elected to go inside, but when we started Dr. Cockinos drew back, for it looked like being very strenuous for such a hot afternoon.\n\nAfter a steep ascent along a dark gallery with a slippery floor of \n\nlimestone in which crude footsteps were cut, we arrived in the great gallery.\n\nThis led straight up at an angle of 45 % to the Kings Chamber, which is an oblong room in the centre of the Pyramid.\n\nIt is built of large blocks of limestone, & at one end is a large granite tomb which originally contained the mummy of Cheops. It is a few feet away from the further short wall, & is the only thing to see in the bare, dark & mysterious chamber.\n\nThe face of the guides seen by candle light in here give it an atmosphere of eastern mystery.\n\nRetracing our footsteps down the \nto\n great gallery, which is about 40 feet\n\nhigh & 10 ft. wide, with a ledge on either side leaving a narrow groove for walking in the centre, after passing the place outside the Kings Chamber where an American climbed up a hitherto unexplored shaft (his name Covington is cut out of the wall); retracing our footsteps I say, we reached the bottom of the great gallery & then taking a corridor leading back into the heart of the Pyramid underneath the great gallery, we came to the Queens Chamber, which is exactly a quarter of the way up the Pyramid in the centre.\n\nThis Chamber similar in shape & construction to the other, is equally sombre & mysterious.\n\nThat ended the sightseeing in Cheops & we quickly got out of the humid interior & left less some 10 piastres, mulcted by the guides.\n","26":"\n\nDr. Scrimgeour has gone away for the week-end.\n\nMy ankle was sprained last Sunday & now is giving me trouble for I got about on it too much. This afternoon the General (Gafrah Bashir) came into the hospital to have his arm dressed & Dr. Boutazy, he & I had quite an interesting conversation about Anglo-Turks-German affairs. He is a perfect gentleman, & has been wounded in all 8 times, 4 by\n\nmachine guns, one sabre, one bayonet & twice against the Italians by \npres\n rifle bullets.\n\nHis face which is long & fringed by a Turkish beard, is rather handsome; he looks like a gentleman fighter.\n\nNo news has \nyet\n come to hand from Dr. Keatings, so I am going to call at his Hospital when in town some day.\n\nHave received a parcel from Vi containing cigarettes sweets, soap powders etc., & one from Rita cont. 100 cigarettes.\n\nAlso I have received another batch of letters containing one from Cousin Herbert.\n","27":"\n\nGeneral \nG\n Djafer left for Sultan’s palace to-day.\n\nHe gave me his address & I gave him mine; we are to correspond. My last conversation when I took him in a sleeping draught the night before last was rather long. He has great faith in Turkey’s power to carry on, & in Bulgaria’s. The discipline of the Germans is, he says, immense.\n\nMen & officers are perpetually in the trenches for months at a time.\n","28":"\n\nReceived a fine parcel from Lily this afternoon containing all kinds of eatables & also a photo of dad & Lily.\n\nThe sight of the photograph has brought to a head the longings to go back to England.\n\nRumours have been rife among the Australians of a shift to France.\n\nThe","29":" A.G.H. is said to be ready to sail for France & some regiments are even supposed to be on the way now.\n\nNo sign of promotion has come, although the doctor seems to be satisfied with me, therefore I think my\n\nplan is to get back to the","30":" by any means at all, fair or foul, & have the chance of going England again, & active service in France. Unless promotion comes here, the job, although very easy & delightful, is not worth keeping on with. More hardships & more to gain would be better.\n\nNews arrives tonight of a visit tomorrow from Sir A. Murray the G.I.C. & as H.R.H. the P. of W. is on his staff, he will probably come too.\n\nToday a band","31":" R.B.) visited us & gave selections at this prison in the morning & evening. \n\nIt was delightful to listen to.\n\nIt is now some 17 days since\n\nI visited Cairo & I am getting rather stale.\n\nLand of course has lost touch with me & also Taff Jones, but I must try to rake them out again. My right foot which was poisoned is getting better now & the left one which sprained is also well. Rita’s photo which she told me to expect in a short time, in one of her letters, is about due now.\n\nI am very very anxious to get it.\n\nIn regard to relations \nwith\n between all the orderlies, we have had\n\na few rows or arguments, & I have lost my temper with one or two of them occasionally, but it was silly of me, for the English ones are typically cockney; saying more than they mean, & shouting & carrying on seemingly angrily, when simply arguing.\n\nLike everybody they want understanding, & in future I shall keep cooler.\n\nGraysmarsh has not been really drunk since that last time, but talkative several times.\n\nIn regard to the war, the news seems to be getting brighter & brighter.\n\nInternal dissension in Germany\n\nthough not yet serious, is becoming more marked, & things are said in the Reichstag now that would not have been dreamt of months ago.\n\nAfter a desperate effort the Germans have failed to reach Verdun & that is a very serious blow ","32":"\n to them. Undoubtedly they are trying to score a lucky victory or two to bring an end to affairs quickly.\n\nA Russian advance has now commenced & everybody is talking of a great offensive in the west soon, which seems likely.\n\nIt would be idle to speculate on the probable termination of the\n\nWar now, for there are no signs except economical ones (unreliable) of even the beginning of the end. If our offensive in Spring is really successful in the true meaning of the word & not the press meaning, & Russia is also successful on her part, a new situation will be formed & then, I think, we should see signs of a break in the clouds. The ‘invasion-of-Egypt’ bubble is burst & there is no fighting on either side now, for Sollum the enemy’s headquarters is now occupied.\n\nWhere will the troops go now but France, for I don’t think will shall try for a conclusive\n\nvictory in the Balkans; - that will be settled politically I think.\n","33":"\n\nInspection by Sir Archibald Murray, who has taken Sir John Maxwell’s place as G.I.C. of the forces in Egypt.\n\nThis is the third important inspection, since I have been here. First we had Sir John Maxwell, - then Sur. Gen. Ford of R.A.M.C.\n\nEvery one was hoping the Prince of Wales would be on Murray’s retinue, for he is one of his staff officers; but he never came. \n\nThe German attack on Verdun seems to have spent itself & the Russians\n\nare advancing in the Dvinsk region as well as in the Caucasus.\n\nNothing has turned up in regard to my promotion, & although the doctor seems satisfied with me, I get absolutely no privileges in respect of my work.\n\nI hear that several Aust. units have left Egypt, & taken with them a couple of hospitals. I want to get back to them now: for there seems no hope of promotion here.\n\nI am sadly disappointed in my progress since I became a soldier.\n\nI have worked hard & intelligently here on responsible work, but nothing seems to come of it,\n\nalthough I have been here 3 months almost.\n\nWith the unit it was comprehensible with so many old men, but here, not even acting rank has been given me.\n","34":"\n\nMolloy seems inclined for a transfer back to the Australians. If only we could get to France how pleased I should be, for then home would be in sight. I have written out an application to be be sent back to my unit, & shall sleep on it.\n","35":"\n\nIn regard to the application we \"slept on it\" & came to the conclusion that it would be wiser to wait for a time. Both Molloy & I however, are hanking to get back to the Australians.\n\nNeither of us is in love with the disciplinary methods as practised here, although, the job being to my liking, I could put up with quite easily.\n\nThe promotion I am in need of, however, added to the other makes me feel like taking a change. Mentioned it to Dr. Scrimgeour last night, & he did not think\n\nthat the Australians are likely to go to Salonika or Alexandretta; rather to Mesopamea, where I should be doing my eyes an injury on going.\n\nHe promised to speak to the Commandant about it.\n","36":"\n\nNo mention made by Capt. Scrimgeour, yet, of the transfer.\n\nHave made no further mention of it.\n\nFoot which became poisoned about a month ago is not cured yet.\n\nThe dispensary work has increased with the great number of new\n\nprisoners recently sent to Prisn No. 2. Average number of 40 oz. bottles sent there daily is 8, & that is quite apart from our own use, ointments, eye & ear drops, special prescriptions & Citadel medicines. It is not easy for me to keep pace with the rush sometimes, having a very painful foot.\n","37":"\n\nThis afternoon was my holiday, but although the foot is mending, it is not nearly well enough for me to go out.\n\nStudied Latin, with which I am improving, & French, with which I am not.\n\nNo further mention made about a transfer & relations between Dr. Scrimgeour & myself continue in the same state. X\n\nFeel fit, but for the foot, which is extremely painful.\n\nWe ordelies \nsee\n rub along fairly well with not more than one brush a day, which is not bad considering.\n\nLetters slow in turning up again. Am anxiously waiting for Rita’s photograph.\n\nIn regard to the war it seems from the news in the papers that we are in for a long stay before finally going home.\n\nThe homers will be lucky.\n","38":"\n\nDr. Scrimgeour \nsop\n spoke about our transfer last night.\n\nHe said that I was not wise in thinking of going because promotion is not always possible, & I am not taking the Army up as a profession. However I must have an assistant to teach the rudiments of dispensing to & he mentioned Ainger (sic). Graysmarsh is to go to No. 2 Prison & I am to teach Ainger, who will take his place, & \nrun\n work in the dispensary. After a time, I gather, if I wish to go I can.\n\nBoth Dr. Boutazy & Dr. Wikins expressed sorrow at the prospect & advised me to stay & be patient.\n\nAinger has arrived & of course things are not in harmony yet.\n\nI gather that the Corporal\n\nI have not mentioned that some weeks ago an R.A.M.C. Corporal arrived from Imbros about Feb. 16th & assumed charge of the hospital.\n\nContrary to expectations there was not a great deal of unpleasantness for he has left me to myself a great deal.\n\nThat is\n\nThe reason I have not been\n\npromoted is that the Dr. cannot make another N.C.O. out of so few.\n\nOn the strength of all that has happened I feel inclined to stay, but we must wait & see & as Dr. Boutazy says \"be patient\".\n\nMonday 17th April\n\nWent to town last Thursday for pay, \nwith\n by means of a .\n\nFoot rapidly getting well.\n\nMet Nobes of 3rd F.A. who has had Enteric Fever.\n\nAll other 3rd boys that were at Giza with me, now attached\n\nto 2nd F. Amb.\n\nTold that both 1st &","39":" Divis. are in France now & a casualty list is out.\n\nAinger has been understudying me for a week & has a good grasp of the work. Tolson is now to understudy Molloy & I understand that when they can carry on, we shall be able to rejoin the Australians.\n\nTown is now deserted for most Australians have left for unknown destinations (France ?), while Tommies are on Canal. \n\nHave heard from cousin Herbert at Suez & he wants me to visit him.\n\nA","40":" L. Fus. man here told me\n\nSergt. Horrocks was up here last week, but I can’t imagine it to be true, or not Herbert at any rate, for he would have found me easily.\n\nLetters are again slack; have not had any for some time.\n\nWent to town again yesterday & met Nobes (I with Molloy).\n\nSpent nearly 100 piastres in the afternoon & evening & nothing to show for it.\n\nBut it was a long time to be at Maadi without going in, so it can’t be helped.\n","41":"\n\nNews in paper of fall of Trebizond & today I hear that America has declared war on Germany.\n\nIf so things are indeed brighter.\n\nNo letters yet.\n\nHope to be on the way to France soon.\n\nFoot is – like I imagined for weeks – nearly better.\n","42":" & Sat.\n\nNothing happened to get excited about.\n","43":"\n\nAnzac Day\n\nWent to the Anzac Hostel for the memorial service which commenced at 9 a.m.\n\nA beautiful ceremony.\n\nThe noble feeling displayed by all there especially in the messages sent in response to cables, contrasted very forcibly in my mind with the attitude of the married men in the old country.\n\nChopin’s beautiful \"Marche Funebre\"","44":" movement) was played at the commencement & followed by the dead march in Saul.\n\nThen all sang a verse of \"God Save The King\".\n\nKiplings good old Recessional was one of the hymns & recalled to my mind the old hall at St. Olaves. The Senior Chaplain of the forces gave a short & pointed address, emphasizing the supreme sacrifice & bravery of those men who made the historic landing.\n\nAt the close of the service all the wreathes that had been profusely decorating the auditorium were taken by ambulances to the cemetery at Old Cairo where all soldiers who have died in Egypt lie buried.\n\nI must not forget the impressive sounding of the last post at the conclusion of the service.\n\nHave been reading Wells, \"The New Machiavelli\" a book on the lines of \"Ann Veronica\" but much more ambitious, & a complete exposition of his sexual problems with the addition of a broader social improvement treatise.\n","45":"\n\nYesterday morning 2 prisoners escaped from here & such a hullabaloo was never heard.\n\nAll leave stopped & search parties armed to the teeth & with fixed bayonets patrolled the locality without success.\n\nIt seems that the prisoners who were probably on one of the many working\n\nparties without escorts changed into Arab clothes got from one of the Arabs employed on repairs about the place, & calmly walked out. An enquiry was held by General Watson, & one of the witnesses says that he (the General) accused Major Simpson of neglect of duty. Anyhow the sentries cannot be blamed.\n\nOne aspect of the case was the appearance of Capt. Scrimgeour with a huge revolver at his waist. He, speaking in Arabic, made one of a search party.\n","46":"\n\nHad a letter form Rita today & it has cheered me up wonderfully. \n\nScrimgeour tonight promised to give me a recommendation when I leave, but no news of the result of the applications I put in a few days ago.\n\nAm progressing slowly with the Latin.\n\nHave come to the conclusion after a great deal of thought on the subject of late, that if I get back safely it will be urgently necessary for me to strike out in some new line & specialise in order to progress a little more quickly than I did.\n\nA little more application & diligence\n\nwill be required too.\n\nAt present I am wavering between being a doctor, journalist or keeping to the teaching. At all events I shall not be stuck out in a small bush town again if I can help it.\n\nTwo new orderlies have arrived. One is of Hitchcocks style & rather a quiet chap the other is short, dark & young – oppressively so although in some respects he is superficiously old.\n\nMay 19th\n\nI write this in Nasrich Hosp. I kept going with the bad foot, & apparently it was healing nicely when, this week, without apparent reason it grew inflamed again & more painful. The following morning I thought it was better, so I kept going resting, as I had always done, in the afternoon (when possible). \nThe\n It was worse on the following day however, so in the afternoon I decided to speak to Capt. Scrimgeour about it & when I did he advised me to go into hospital.\n\nThe doctor here in charge of my\n\nward is an Australian & so is one of the sisters.\n\nThey have started putting hot fomentations on it, which have, of course increased the size of the wound, making it doubtful if it will be well in a week as I had hoped.\n\nBilly Molloy came in to see me tonight & he tells me our application for removal has gone through & answered favourably.\n\nIt is to be hoped I get back before Billy goes away.\n\nDrs. Cockness & Boutazy are going to visit me here if they can get in.\n\nThe food here is splendid\n\n& the whole of the people, patients doctors nurses & all, exceedingly nice.\n\nSome of the patients are from Mesopotamia, some from the Suez trenches & some from other parts of Egypt.\n\nBefore coming in here, I received a batch of old letters, but the mail which should have reached me between","47":" & the present is still missing.\n\nI \nseem\n have been fortunate in my fellow patients for they are not only decent companions but interesting too.\n\nSome hail from Mesopotamia where they have had a bad time, while others are from the Suez trenches.\n\nOne of these is a sturdy & fat fellow in with dysentery whose main trouble seems to be a dislike for his medicine, & who presents a healthy appearance quite out of temper with his position.\n\nAnother, equally healthy & like the abovementioned, one of the old Suvla boys, is troubled with cynovitis of the knees. \nThis\n His cure is to rest in bed\n\nalways, & he carries it into effect by shunning his bed completely except when the doctor is on his rounds, when nothing could be more invalid like, than his attitude on the bed. When the warning comes he generally rushes across the room & bounces on to the bed as if he were taking a header into the water. He is a very nice & clean looking young fellow.\n\nThen we have another whose complaint I do not know, but who presents a problem to his friends inasmuch as, harking from Newcastle he is as English as English can be, but he talks\n\nbroad Scotch.\n\nAs our friend of the cynovitis remarked \"That chap there gives me the packet. He’s the only Englishman I ever met who can speak broad Scotch.\"\n\nThere is one youngster here who sleeps the other side of the fat chap next to me, & is","48":" & last on our side from the door, who is just back from Mesopotamia.\n\nHe is a Kitchener’s man & our friend of the goodly proportions a Territorial, so needless to say there are arguments on the respective merits of the two armies.\n\nThey also argue on whether R.A.M.C. men carry arms or\n\nnot, & the youngster seems to be one of those people who argue general facts from isolated & exceptional incidents they have seen.\n\nFor instance, he has evidently seen stretcher bearers carrying the arms of their patient, & loudly gives this as a conclusive fact.\n\nWhile I have been writing, the restless cynovitis patient has been alternating periods of being sprawled down in the bed with legs stretched out at apparently impossible angles, with hasty visits to the door to see if the doctor is near.\n\nIn fact the whole attitude\n\nof the patients is remarkable for where normally only about 3 of us keep to our beds, the rest roaming about at will, now the whole ward is at rest, & trying to look as if that was the rule.\n\nAll is now perfectly peaceful, the seven beds on either side presenting a neat appearance with their nice blue covers, the small table at the end with its blue cover & plants on top, setting it off.\n\nJust as a ward should be in fact, but why?\n\nOur Kitchener’s man has after a hasty visit to the door, proclaimed the approach\n\nof the doctor.\n\nxxxxxx\n\nWhen the doctor came to me, he inspected the foot & pronounced it not yet healthy; then by way of talking of Australia (he is an Australian) he asked me if I knew Southport.\n\nThat is a town I have never visited. I have passed through it by train, nay more, for the train changes its direction there & there is a halt for refreshments.\n\nA nice clean bushy seaside town, with the beautiful Pacific washing its shores & health giving tonic in its air.\n\nOf course I knew.\n\nThen Toowoomba, did I know that town.\n\nOnly in a similar way to Southport with the addition that I have friends from there. When he mentioned the name of doctors he knew I was more fortunate. Most of the","49":" Amb. doctors he knows, & I know of several that he mentioned in Brisbane.\n\nIt was a pleasant conversation and, like all such, \nas\n it recalled the \npleasant memories\n many happy times in beautiful places in Australia, that seem so far off & unattainable now.\n","50":"\n\nFoot healthy & nearly healed now.\n\nYesterday afternoon Dr. Cockinos paid the second visit & Mrs. Nyland also visited me.\n\nShe is very kind to me & it was good of her.\n\nI can’t really understand her. I never feel perfectly at ease when talking to her & always have an irresistible tendency to smile, & she seems to half smile now & again.\n\nUnfortunately she has lost her brother lately in France, & the lady whom I met on the train so long ago & who was\n\nresponsible for my meeting Mrs. Nyland, has also lost a brother.\n\nYesterday what I have been waiting for for so long arrived.\n\nDr. Cockinos brought letter No. 3 from Rita & the photograph. How eagerly have I been expecting the photograph.\n\nIt is a splendid one & I like it immensely, but it is not perfect. It does not show her at her very best which is how I would naturally like it, but then what photograph could. A photograph is at the best only a help to memory.\n\nIt shows the person in one mood or position & leaves the mind to conjure up the hundreds\n\nof others.\n\nThat is why the \"flattering\" photograph appears to me to be ridiculous. Why people should desire their photographs to flatter them I can’t tell, for it then fails in its only duty, & is a photograph of somebody entirely different.\n\nEveryone if natural genuine & honest, needs no flattering photograph. The most homely face is beautiful under the influence of beautiful thoughts.\n\nTo return to Rita’s photograph however, it really is good & it will be a treasured gift \nthing\n for me.\n\nThe letter gives news of the downfall of the Grafton Council & consequent\n\ndownfall thro’ embezzlement of Phillips the Clerk, & Harlow amongst others. It beats me how intelligent men can allow such harpies as those to oil themselves into their good books by pleasing ways all for their evil purposes.\n","51":"\n\nThe doctor has pronounced the foot healed.\n\nI am to depart on Monday.\n","52":"\n\nLeft for Maadi on the Monday following & found a man from Citadel had arrived to learn dispensing so that he could take my place. Has rather a good general knowledge of drugs, but not so well versed in practical work.\n\nWent to Base & put in a second & more emphatic application so that Molloy & I should soon leave.\n\nYesterday I went with Molloy to Base again & was told that application\n\nwas successful & orders had gone through for us to be sent to Base.\n\nLearnt later that Aust. Base was in Weymouth.\n\nWent to Bases Stores at Heliopolis in response to a telephone message from Taff Jones & there found them preparing to leave for England.\n\nTaff tried to see Major Buchanan so that Molloy & I could be attached to them & then get to England.\n\nTaff missed the Major so matter is in abeyance.\n","53":"\n\nLast night Dr. Shahbender & I had a very interesting discussion, lasting till far into the night, & embracing Sociology, Ethics, Religion & diseases.\n\nIt was a perfect brain stimulant. His adventures on the way from Bierut to Egypt via Mesopotamia & India were of a exciting nature & there are several points about them that make vivid description.\n\nHe had powerful friends in Bierut but powerful only on the Turkish side.\n\nOnce he was invited to see the execution of a brigand.\n\nA certain brigand outlawed to the mountains presented a problem on capturing that the authorities could not solve.\n","54":" they accordingly sent him a message offering him his \nfreedom\n life if he would go to the nearest township & give himself up.\n\nHe did so & was promptly put in prison to await trial. \"This,\" said Dr. Shahbender shows the utter baseness of those Turkish authorities in Syria. Secretly the man was \ninformed\n sentenced to death, but he himself was informed that he was to be exiled to Acre.\n\nTherefore, when he was secretly.\n\nconveyed from the prison in a closed carriage one night he was not alarmed, thinking that he was going into exile. The party which included other prisoners, & Dr. Shahbender alighted in a field away from town & the brigand was called upon to make his will.\n\n\"But that is unnecessary\" he exclaimed \"for I can do so at Acre\".\n\n\"Do so now\" they ordered him thrusting a paper into his hands – holding a lantern close.\n\n\"You make me frightened\" he exclaimed\" why should I make my will here, when I can\n\neasily arrange it when I am exiled & send it to my wife. \n& it\n. Am I not going into exile?\" \"Yes you are they answered. \"Well I can leave it\" he answered handing back the paper.\n\nSeeing that further parley was useless they shortly informed thereupon that he was going to be hanged. It proved to be but too true, for in a few minutes the ropes were ready & the brigand was blindfolded.\n\nHe was stood on a chair, being supported by his warders for his knees absolutely refused to support his body.\n\nHe was trembling violently in every limb & his face was awful.\n\nAt a signal the chair was kicked away & -- the rope broke.\n\nBy all human laws & by the Turkish criminal law he should have been released then, but no.\n\nThe next attempt was successful & in a short time the others shared his ghastly fate.\n\nAt last our news of \ndeparture\n transfer has arrived.\n\nWe shall probably leave here tomorrow morning.\n\nMajor Harvey thinks we shall most certainly go to England to the Base Details & then leave from there for France. If only we get to England it will be splendid.\n","55":"\n\nI am writing this on my kit bag in a tent at the Miscellaneous Details Camp, Tel-El Kebir. We left Maadi yesterday morning, had breakfast at Mrs. Nyland’s, catching the 11 oclock train for here, which arrived at 1.15 p.m. They took our medical history & also informed me that I stood a good chance of getting dispensery job, for there were plenty wanted. Rumours are circulated that 2 days should see us embarked for England.\n\nThe advance guard is to be picked to-day I understand.\n\nToday I have struck the \n\ncook house wood chopping fatigue, but so far I have not over-worked, although after soft work for 4 ½ mths., the slightest exertion is hard.\n\nSome say Lewes near Brighton is our objective, & some Weymouth. Those of purely guesswork I consider, but a French chap in our tent, who is rather a smart man intellectually was told by the D.M.S. that those not detailed will most certainly go to England & wait for orders to proceed to France. At no time since leaving Aust. have the chances of a trip to England been more bright.\n\nThe French chap referred to is a French barrister at law & learned in economics. We have had a long talk & it seems that should I be lucky enough to keep with him, I shall not miss the intellectual conversations I had at Maadi.\n","56":"\n\nYesterday we were told to prepare to march off at 11.\n\nWe marched off – 100 yds or so to the 2nd Stationary Hosp. to which we are attached for rations now.\n\nHow we are going to fare now I can’t imagine.\n\nThere is no sign of going away.\n\nSchoeheuner Highton, Marr & numerous other tent mates of mine in old are here & yesterday I gave them a little music in return for a good dinner.\n\nWe are in tents – about 60 of us – isolated, & doing nothing.\n\nVery few troops are left here. The heat is intense & we are right in the desert with very little shade.\n\nThere is a refreshment booth run by N.Zealand ladies the other side of the railway lines.\n","57":"\n\nToday a Captain has arrived to take charge of us.\n\nAn orderly room tent has been erected & we seem to be here for some time.\n\nEvery day rumours come thro’ of intended \"movings off\", in fact several times a day.\n\nThere will not be any mail for me for a considerable time I imagine for when I do move off, it will probably be in a new unit. \n\n\"Sniper\" Welchman of the","58":" is here & also Brokhoff of the Queensland mob. He transferred to Base detail from No. 2 Stationary.\n\nToday we have had a bad sandstorm (or \"bad\" to us). The hot wind blows the sand all over one & the flies are simply cruel.\n\nAt night one is plagued by mosquitoes.\n\nIts all in the game however.\n","59":"\n\nTo\n Yesterday we were paraded in front of a clothing board & there a note was made of any kit required.\n\nThis morning early we went on the usual route march into the desert, & were inspected there by the camp commandant. He told us that we should be moving off this week.\n\nLast Sunday a row occurred in a gambling school on account of the use of a double headed penny. The result was 2 men killed with bottles, the \n\nsecond man’s death being assisted by Ricks.\n","60":"\n\nYesterday I was appointed dispenser for A.M.C. details. Took sick parade & fixed up medicines.\n\nLater in the day we moved back & pitched tents in Miscellaneous Details again.\n\nTook sick parade again this morning.\n\nTold about a dispenser wanted in the","61":" Light Horse, & am debating on it now.\n\nMoved back to Miscell. Details.\n","62":"\n\nWe drew lots (3 of us) for the dispensing position in L. Horse & I lost. \n\nOn account of the good friends in this tent I was not sorry; also it would probably mean a life in the desert for ever, & as for the details, we expect to leave soon.\n\nIn our tent are widely different characters.\n\nThere is Molloy with whom I have been for four or five months, a very agreeable rather youngish fellow, Ridgeway taller & bigger than I, from the Queensland\n\nRailways is very good to get on with.\n\nHe is a splendid worker & always doing more than his share of work to avoid under doing it.\n\nThe two smallest men are of a size & consequently called the twins; one is a Scotch man rather quiet & slow & the other is a typical bushman, with very red brown face & hard voice & a good heart.\n\nLastly excepting myself is Monsieur Mony a Frenchman. He had a French University education & passed his barrister’s degree, but, being too young to practice\n\nhe went travelling, stayed in West Aust., worked in the bush for experience, got some land & made a farm of it, then got married.\n\nHe speaks good English with an accent & argues well. We discuss all subjects in which we are interested & thus pass many a pleasant hour.\n\nThe whole tent is a goodly company, & I feel lucky to have struck such good fellows.\n\nI hope we stick together, for if we do we shall be able to have a good time, wherever we may\n\nbe detailed.\n","63":"\n","64":"\n\nYesterday \nafter noo\n evening when it was cool we went for a walk over to the old trenches used in the battle of Tel-El-Kebir.\n\nWe walked 8 miles altogether, but we could have done it in 2 miles.\n\nThat was the result of having a fool with us.\n\nThe individual in question knew everything there was to be known, but still we left the battlefield with absolutely no idea of the direction in \n\nwhich it was fought, how long it lasted or anything at all in fact.\n\nThe trenches that we viewed were of the old breastwork fashion; a long narrow & shallow trench with a big breastwork in front.\n\nAt intervals there were gaps with artillery screens in the rear of them & corresponding.\n\nThe fool, - a fat chap with a loud husky voice, was one of those \nkind of\n people, who stand with legs apart & wave a walking stick about (to the great danger of their companions)\n\nthe while holding forth in a loud voice.\n\nThere has been a great deal of talk lately about going away today, but there is no sign of the accomplishment of it. There are signs, however, of stretcher drill in the near future.\n\nThe dispenser who took the position offered the other day has given in to the heat, & he recommended me to the A.D.M.S. this morning.\n\nHe says that there is a chance of Sgt. afterwards, but only a corporal’s stripes will be given at first.\n","65":"\n\nAfter having thought over the Light Horse job I don’t feel like accepting it, involving as it does an indefinite stay in this murderous climate.\n\nWe are now confined to camp. That is to say, if we wish to leave it we must report to an N.C.O. As I am writing this in the New Zealand canteen, I have accomplished this, it follows. The reason is supposed to be that we are under orders to be prepared to leave at short notice.\n\nThis Canteen is a great credit to the four or so ladies who run it.\n\nIt appears that a great number of N.Z. ladies volunteered for \ncate\n canteen duties.\n\nThe headquarters so to speak & by far the best of canteens run by them under the Y.M.C.A. is in Esbekieh Gardens.\n\nHere is a large marquee tent affair where one can get tea, cake, sandwiches or lemonade, & here in this heat & godforsaken place the ladies love to do good for the soldiers.\n","66":"\n\nAfter fooling about a great deal all thoughts have been put out of our head of leaving for England, & although I have heard from good authority that in ten days time we shall go to England, the general opinion seems to be that we shall not go at all.\n\nThey have been picking out groups of men for various jobs in Egypt, such as details to the Light Horse.\n\nThis will probably go on till we leave, so that if only we are not picked for such jobs, we stand a good chance\n\nof getting to England.\n\nIt is rather miserable waiting here in the terrific heat & doing practically nothing. We get drill & route marches early morning & late evening, but during the heat of the day one just lays down & tries to sleep.\n","67":" days ago we rose at 4 & went on a five mile route march, were inspected by a General & then came back. It was ten miles of hard work for the heat was very great even at that early hour.\n\nSqueezed my finger a day or two ago & doctor took off the nail; it is now doing well.\n\nMet Harold Clarence in the N.Z. Canteen two nights ago.\n\nHe has not been away from here since landing 3 months ago.\n\nHis brother is a Serakim a few miles desert wards from here.\n\nIt was very pleasant to spend a few hours with the man who was a good friend to me in the stormy days of Whiporie. \n\nWe had an evening at a scratch Cinema show that has been erected here.\n\nWithin a mile of the Cinema is the graveyard where many heroes of that battle of Tel El-Kebir (the site of which is about 3 miles away) which was fought when this place was just desert & oases, \nby\n lie buried.\n\nThere seems to be a great movement of troops.\n\nTrain after train goes by every evening, with Australians, Tommies, guns, horses & waggons.\n","68":"\n\nWhile at the N.Zealand Canteen the other night Cpl. Foulkes – Medical Student friend of Mony’s – came to Jack Molloy & I with the information that 3 Corporals each with four men were wanted as regimental details.\n\nHe had been chosen & of his four men 3 had been chosen. Mony of course was the best as fourth for I decided not to leave Molloy. There remained the chance with the other Corporals. Molloy & I dashed back & found Corpl. Weir.\n\nHe, by a curious chance, had chosen me as dispenser. The difficulty of Molloy remained for he had 3 men in view.\n\nAt last however he consented to take Molloy too so we felt glad.\n\nIt seems we are to be attached to the","69":" Div. as far as England.\n\nWe may not leave here with them, but as we have been put on the strength it seems likely.\n\nOur Dispensary has been started but we could only extract a very few drugs to start with, for, says the\n\nMedical Stores man, you will be gone in 2 or 3 days.\n\nOur group is composed of Cpl. Weir, an easy going good fellow apparently & Molloy, Stewart & Nunan. The latter is a cousin of the Nunan of","70":" F.A. with whom I travelled to Gallipoli. The Doctor – a newcomer – is Dr. Voss, & I spent some time with him today making out a requisition for drugs – all in vain. He seems good too.\n\nThe question of the moment is \"Will next week be our last at Tel-el-Kebir?\" I hope so, although things\n\nare not nearly solved in our new position as of yore.\n\nThe infantry fellows here are a pretty rough mob. There is plenty of gambling & on two successive days, a native who foolishly ventured through the line with a trolley of water melons was relieved of most of them – the same man on each occasion.\n","71":"\n\nTonight is one of the nights on which we were supposed to move off, but orders were cancelled. At present we have no idea when we shall leave but we are to be paid on Tuesday so going on Sunday is knocked on the head.\n\nThe dispensing is doing well; growing every day & is more neat & orderly.\n\nBroke lense of spectacles last night & am now having a fresh one procured.\n\nHave not written at all for over a week, so must really settle down to do some tomorrow.\n\nDr Voss was relieved & Dr. Van Epen of Lismore sent in his place a couple of days ago. As he has to attend another dispensary at No. 2 Stationary Hospital we don’t see much of him.\n\nWe have two big marquees & a bell tent.\n\nThe latter is for our accommodation, one of the former for dispensary & the other for observation cases.\n\nThe heat is still terrible. I feel sick of Egypt & when we move off I shall be heartily glad.\n","72":"\n\nNo more \"dinkum \noh\n oil\" yet. It is absolutely ridiculous, the way we are being fooled about here.\n\nEven now all the men have not got their equipment yet, & they are supposed to have that before embarking.\n\nInoculated 100 against \nCl\n Cholera this afternoon.\n\nSince coming here there have been about 800 inoculations. I had a second dose of Paratyphoid myself & \nChlor\n & Cholera.\n","73":"\n\nSince last date written up I have received an order to get a supply of drugs to last six weeks, as the medical stores are moving.\n\nThese arrived last night, but we have instructions from the C.O. to pack up as much as we can spare as, when we get moving orders (probably this week, he says) we shall only have 3 hours to get ready in.\n\nTo day a full dress parade & inspection is to be held, preparatory to moving off.\n\nShall start packing up today. \n\nTreated a man successfully for ptomaine poisoning the other night, & last night had a similar\n\ncase, but owing to excessive weakness from vomiting, I sent him to No. 2 A.S. Hospital.\n\nThe British \"Push\" is still going forward methodically according to the papers.\n","74":"\n\nSince last entry the Turks have attacked on the Canal at Katia, but it was not an action of any great consequence.\n\nThe Light Horse reinforcements are moving off in consequence, & rumours did flow along that we were to go too, but they have dropped now, for new ones are afloat.\n\nEmbarkation is now supposed to commence on Wednesday, & our day is to be Friday. I think this is nearer truth this time.\n\nI am doing more packing on the strength of it anyhow.\n\nHave discovered Hanna (George) of Whiporie in the bell tent nearest the Hospital.\n\nOne day he came up sick & with a temperature.\n\nI was called to have a look at him & a mutual recognition took place.\n\nHe has been here some 5 weeks.\n\nHarold Clarence dropped in yesterday afternoon & I am to meet him at the Pictures\n\ntomorrow.\n\nIt was remarkable to have Hanna & Clarence in the tent chatting so far from Whiporie, yesterday. They were both met so coincidentally too.\n\nThe Push seems to be going on but not particularly fast. Every day or some good news from either east or west comes along, however, so we cant grumble.\n","75":"\n\nThis morning the news arrived by phone that we were to leave in half an hour (which we did not know of till later). As it was impossible to go at such short notice, it was cancelled & other orders issued.\n\n180 were to leave on Friday or even tomorrow for Alexandria & the rest are to follow on Saturday.\n\nAs the same \ntale\n news applied to all battalions along the line, & as the New Zealanders left last night, I believe this is \"dinkum\".\n\nIt may yet be cancelled however. The 180 were put thro’ an embarkation medical parade this afternoon & most of my staff is packed up, so all we can do is hang on & see what happens.\n\nIt is no use writing letters for they will not be sent, but I would like to let Rita have the news.\n\nI am thinking of her more & more every day, & wishing I could only be back again.\n","76":"\n\nThe news still holds good. 1st Div. have orders to pack up but we have none yet. The general opinion seems to be that we will go on Saturday.\n\nThe heat is very trying still, & any hopes of getting away from here at all, are sufficient to cheer a man up.\n\nThe nights are getting cool but treachourously moist just now, & one has to guard against getting a chill & one has to keep clothes over one at night even if it is close.\n","77":"\n\nCapt. Earle Page of Grafton came here & took charge this morning.\n\nHe is a good sort & had quite a long chat with us.\n\nHe has gone to Alexandria on a few hours leave so Dr. Van Epen has not left us altogether yet.\n\nToday we had a big riot in the Camp.\n\nAll the","78":" Division,","79":" T.B. & some of ours & A.M.C. details are leaving & there was a lot of pay about. The trouble started in the Beer Canteen run by\n\nthe Greeks.\n\nThey were charging 7 P.T. a bottle for beer I believe & after a number of men were drunk, it was an easy matter for a riot to start. A man took the sentry’s rifle & fired a shot into the air. This started them.\n\nSomeone lit some straw & the Canteen tent caught fire. The ropes were cut & \nThe\n the affair fell down with the Greeks inside.\n\nThey were rescued with difficulty.\n\nOfficers were pelted with broken bottles & stones & isolated mobs smashed\n\nup all they could lay their hands on.\n\nThis was all within 100 yds. of our tent, & bottles came all round it.\n\nA squadron of mounted police, at one part of the proceedings, charged clean through the mob, & by a freak nobody was killed.\n\nIt was not till dark however & after a Colonel had come up to address them, that things quietened. Now things are fairly smooth but guards are everywhere & sentries are posted at intervals along the line.\n","80":"\n\nSaw A.D.M.S. yesterday. Still expecting to leave tomorrow, but no news has arrived yet.\n\nHarold Clarence came up last night with news that they leave for Salisbury Plain tonight.\n\nDeveloped some photographs for Nunan last night, including one of two in which I figure. We are going to print some today.\n\nMarching orders for Tuesday night arrived at 6 p.m. General excitement.\n","81":"\n\nPacked up remainder of stores in the morning & held an embarkation parade of whole of 2nd Division, before dinner.\n\nBy 2.20 our dispensary marquee was struck & all in readiness.\n\nMarched to Station at 6 & left at 10.\n\nRotten night in train packed like sardines.\n","82":"\n\nArrived Alexandria at 4 in morning & on board by reveille.\n\nFound 5th Div. & Luna Pk. crowd already settled down. Stuffy cabin in aft of lower deck, but lucky to get cabin instead of hammock. \"Franconia\" is a big boat a Cunard I believe & by the time we sail (in an hours time I believe – i.e. 6 p.m.), there will be 5,000 troops on board – a nice haul for a submarine.\n\nLt. Col. Ramsey Webb is the P.M.O. I believe, so\n\nwe shall take a back seat.\n","83":"\n\nEverything in regard to arrangements for comfort of troops in order.\n\nEverything going like clockwork. I must admit that there is no room for an accusation of slackness or wilful neglect such as \nI have had to make\n could have been made in regard to other troopships I have been on.\n\nLifeboat drill yesterday afternoon. Met Sgt. Hodge one of our reinforcements at Anzac & Orderly Sergeant for 3rd F.A. for some time.\n\nHad a good yarn.\n\nHe gave me a photo of our\n\ncamp at Anzac.\n\n5th Div. (Sgt Derbyshire’s – late of 1st A.G.H.) have taken over hospital, but I fancy it will not be for long, as we are leaving the boat at Marseilles.\n\nWe may go overland to England or just stay in France.\n\nAm getting rather excited at the prospect of seeing Dad & Lily soon. Not nearly as excited as the occasion warrants however; my capacity is much smaller now.\n\nLeaving Egypt I feel that my stay on there has not been at all to my benefit.\n\nI am weaker constitutionally then when I arrived. \nunless\n I could not stand nearly as much now as I could before the Peninsula days. I hope I pull round in England.\n\nLeft the wharf last night amid the shouts & cheers of a few yachting parties in the harbour.\n\nAnchored near the breakwater for the night just as the Havanford did when I was leaving for the Peninsula. Swimming party went on last night but it was too dark for my short sight.\n\nIt is still very hot & I am looking forward to a colder climate.\n\nOn board we have Headquarters 150 A Details 5002, 5th 1500 Division, 2nd 600 Division & 1st Aux. 300 Hosp. & a few Tommies who have been on Anti Aircraft duty at Imbros, Ternnados , Lemnos & other islands.\n\nLeft Alexandria at 11 – a.m. today with escort of one destroyer in front & one behind. The \"Franconia\" is a very fast boat of about 24 Knots per hr. capacity.\n\nIt is the best boat I have yet travelled on & even as a Troopship is very comfortable.\n\nThe Sergeants have splendid quarters in the 2nd Class &\n\nofficers have the luxuriously appointed 1st Class.\n\nThe Tommy part on board is composed solely of the R. Naval D. with Naval officers. Then there are the Staff Officers of Headquarters on board & a few sailors for working the 4.7 gun we have aft.\n\nThe headquarters band plays on deck for an hour or two each day. I don’t know if it will continue to when we get into the danger zone.\n\nSaturday\n","84":"\n\nCommencing the 3rd year of the war.\n\nService on board today on that account.\n\nIn the afternoon a band concert including some gems from Sullivan’s operas.\n\nPassing Crete for the best part of the day.\n\nDestroyers all round us. One in front & one behind. Whale at times two ran parallel with us & others hovered on the horizon. Passed an oil ship & a small wind jammer. Lifeboat drill as usual, but\n","85":"\n\nfor the second time our A.M.C. details changed for another boat.\n\nNow we are 18 D boat with B Company of the 2nd Div. Had a passage of arms with Lt. Kerr over the fooling about from boat to boat. Our own Sgt. (Cpl. Weir has been given an extra acting stripe for some obscure reason) lost himself as usual & turned up when parade was nearly over.\n","86":"\n\nReached Malta at breakfast time this morning & put in at one of the harbours while the destroyer went for oil.\n\nMade a couple of rough sketches of the harbour, which is rather pretty but not interesting. There seem to be terraces running along the hills, which, sand yellow in color, would be as glary as the desert but for splashes of green here & there.\n\nThere seem to be some fine buildings on the island, isolated – away on the tops of hills.\n\nA large factory is discernable on the left branch of this harbour\n\n& at the heads, a lighthouse & two other Naval buildings. \n\nAlso, there is a least one big gun.\n\nWatched Maltese boys diving for money by the side of the ship.\n\nLeft Malta at 1 p.m. exactly & picked up destroyer off the island.\n","87":"\n\nHugging the coast of Africa. At 10 oclock passed quite close to an island on the north of us, still following the African coast.\n\nThe rumor is about that \n\nwe are not going to England at all, but that we shall all be split up at Marseilles.\n","88":" August\n","89":"\n\nTouched the islands off the French Coast at breakfast time & soon the South of France came in view.\n\nAfter dinner we picked up our pilot & entered a strait at the outer part of the harbour.\n\nIn the centre of this strait is an island fortified strongly, & on either side are forts & barracks.\n\nRounding a bend on the right\n\nthe whole town of Marseilles came into view fronting a wide bay.\n\nWe followed our destroyer very slowly, & that was lead in turn by a submarine.\n\nA building noticeable at first was an R.C. Cathedral at the top of a high hill on our right.\n\nAfter a week of the clear Mediterranean air, the smoke of the city was in contrast.\n\nWe slowly steamed into the harbour about 6 p.m., past a French destroyer & our own escort 69, now anchored, amid the cheering of all the\n\nFrenchmen on wharves & boats.\n\nThere was a general interchange of pleasantness, the Australians trying their Arabic on the French, & the latter essaying into such English as they knew. Berthed & disembarked into a yard at the back of the wharf.\n\nThere we formed up & marched out through the dock gates. From there to our camp, a distance of about 2 miles we were cheered by men women & children all along.\n\nWater was handed to us, our hands were shaken, & cakes & chocolates sold all along the\n\nranks, a great deal being given as well.\n\nOur camp is at the end of a lane on \nthe\n a hill over looking the harbour & surrounded by orchards & fine houses.\n\nWe reached there at about 10 p.m. & shook ourselves down for the night.\n\nThe tents were already pitched & well managed.\n\nYesterday morning the dispensary was opened & the Lunar Pk. A.M.C. men appointed to look after it.\n\nBeyond opening our cases to give them some drugs we have done nothing.\n","90":" % leave was granted\n\nyesterday, but as usual the thing was spoiled by a lot of the remainder breaking camp.\n\nWe were supposed to have had leave today, but as about 200 men are missing we have not been granted it yet.\n\nWe hope to get out at 2 p.m.\n\nI hear that a German submarine was chasing us not far out of Marseilles; a French merchantman had a brush with one & a transport following us.\n","91":"\n\nToday\n Yesterday at 2 p.m. the five of us went to Marseilles.\n\nIt is about 6 miles from here (Santé) to the centre of the town.\n\nThe most remarkable thing about the town is that nearly every other woman is in deep mourning.\n\nSoldiers there are in plenty & among them one sees a great number of decorations. Some have four or five medals & the majority have the strip of gold braid on the sleeve, denoting a wound received in action. (? service)\n\nI saw some soldiers who had 3 strips of gold braid.\n\nAnother outstanding feature is the number of women doing men’s work, - sweeping streets, driving carts etc. etc.\n\nThe town is splendid.\n\nHigh up on a hill to the East of it is Notre Dame Cathedral which I noticed when we were steaming in.\n\nSurmounting the steeple is a beautiful gilt statue of great size.\n\nOn the lowland east of the town & I think on a branch of the Rhone delta is a large construction resembling a suspension bridge. Its use is\n\nto transport vehicles over a stretch of water, but I do not know.\n\nIn the town proper there is L\/Arc de Triomphe similar but of course much smaller than the Parisian one. It was created to commemorate the first Repubique . Two of the main boulevards which cross each other at Right angles are lined with high trees, in fact the northern end of one, running up a hill towards the back of the town is quite dark on account of the abundance of foliage overhead.\n\nIn that boulevard is\n\nthe Cours de Chapitre (Chapter Court) containing a beautiful fountain of statuary. Opposite this is a noble piece of statuary erected to the dead soldiers of 1870 (I fancy).\n\nTwo other features which are worth visiting, but which I had no time to see, are the Palais de Justice (Law Courts) & the Cathedral.\n\nI must also mention the Palais de Longchamps, a fine palace in beautiful grounds.\n\nEverywhere the Australians are welcomed & treated warmly. I hope they will behave themselves. They are all struck by the\n\ndirect effect the war has had on these people, which strikes one so forcibly.\n\nThe sentiment among us generally is of disgust that we should have been kept in Egypt so long, while the poor fellows here have been carrying on so well & a feeling that in the presence of the courage & bravery displayed not only in the French Army but by the home people, a man should play the game to the finish. I have heard rough fellows who did not scruple to \"play up\" in Egypt, express regret that they had not\n\na chance before, of seeing the effect of the war on these fine people.\n\nHad they come here first, they would have played the game all the while.\n\nTruly the war is doing good in an indirect way.\n\nSunday 13th Aug.\n\nWent to Marseilles again yesterday & visited Notre Dame de la Grande, the fine Roman Catholic Cathedral on a hill to the \nwest\n east of the town.\n\nTravelled by tram part of way & then walked up hill\n\nto a garden at one end of which a cliff lift ascends to the grounds of Notre Dame. Looked through the Cathedral & was greatly struck by its immense beauty & solemnity.\n\nHelped a Sacristan put the forms in order for a service, the while white clad nuns moved quietly about the pillared quietness.\n\nOther nuns were seated at prayer.\n\nFor our service, rendered willingly enough, we were rewarded with some ale.\n\nMade some more strides\n\n& reached camp safely.\n\nEngaged in conversation with several French people since being in Marseilles. One lady, the \nwife\n sister of two doctors, spent 2½ months in the trenches with an ambulance, doing good work at the time of the stiff fighting.\n\nShe gave me her address & promised to \nhelp\n introduce me to her brothers if I wanted assistance in doing a medical course.\n\nThe stamp of her experience in the trenches was on her.\n\nThursday 17th Aug.\n\nWent on duty at dispensary alternate days with a Warrant Officer dispenser & although he had the rank I did most of the . Visited town on Wednesday the day the 5th Div. left.\n\nWe left this morning. Reveille at 5 a.m. left camp at 9 a.m. (some of the hawkers of fruit cried as we left) & entrained after 2 mile march at 10.\n\nLeft at 10.30.\n\nTrain proceeded to \nAreles\n Arles, a beautiful old town where we caught our first sight of the Rhone.\n\nRain from there onwards, but the charming scenery just as good to us sand weary men.\n\nGreen green everywhere:- beautiful trees, fine old cottages, villages with century old church. On our right proceeding up the Rhone Valley to Avignon we saw the outhills of the Alps & on our left the Rhone with the in\n\nthe distance.\n\nHere the scenery is flat relieved by beautiful groupings of trees, cottages & avenues, while again it is hilly with an old stone bridge here & there & lichen covered rocks & boulders strewn everywhere. What a relief after Egypt. After Avignon we stopped at Orange for tea – one hour.\n\nCheers, hand waves & smiles wherever we pass, either station or lonely country crossing.\n\n6 p.m.\n\nStopped at Montelimar & had a yarn with 2 French soldiers, wounded at Verdun.\n\nOne was at the Peninsula & helped at the Australian evacuation.\n\nHe thinks highly of the Australians.\n","92":"\n\nPassed Lyons in the night & breakfasted at Maçon. Very cool in morning but as we neared Dijon the sun came out & it became warmer. Rain finished.\n\nArrived at Dijon at 11.30 where some ladies gave us cold tea to drink. Dijon is a large & busy town, mainly remarkable for its beautiful Notre Dame Church & Cathedral.\n\nThe fine black spire can be seen miles away.\n\nLeaving Dijon the country changes from flat to hilly & wooded slopes.\n\nTea at Les Laumes. During night passed Paris & arrived at Mantes Gissecourt for breakfast.\n\nFrom there onwards the scenery was of an agricultural description, rather drab\n\nat parts till we came to the hilly region near Rouen. Stayed at Rouen a short time, then were through a succession of tunnels & on to Le Havre.\n\nDisembarked at Le Havre at the wharf but no boat was ready for us, so we marched 6 miles through the town up to a camp on a hill at the back of the town.\n\nIt was a well managed camp & a drink of tea was very welcome after the long march with full pack up.\n\nNext morning helped in sick parage & at 2 p.m.\n\nfell in to march out.\n\nEmbarked after about 7 miles march, on the \"King Edward\", a small Channel boat.\n\nSome wounded Tommies & Australians on the wharf. They say that a man does not last long on the Somme without getting wounded.\n\nSlept as best I could on deck & in the early hours got up to see the lights of the Guard ships outside Portsmouth. As the light got better we slowly steamed up the Solent & passing Netley Hospital & finally berthed in Southampton Docks.\n\nlanded & waited in the Shed for some time.\n\nGot a carpenter to send a note to Dad for me.\n\n3 Trains for our crowd & I was in the 2nd train.\n\nFelt delighted to once again behold the green fields & lovely landscapes of England.\n\nAfter a splendid journey arrived at Amesbury where we disembarked & marched 6 miles to Rollestone Camp, passing near Stonehenge. Most of the march was over a road I cycled on over four years ago.\n\nWe found at Rollestone\n\nCamp that the Australians & Tommies were practically identical as far as discipline goes.\n\nThe loose methods of Egypt are at an end now, & one must smarten up. A very good thing it is too. All that has been lacking in the Australians is discipline & one feels the better for some of it.\n\nThe following morning we left the","93":" Div. & with the Machine Gun section, marched 10 or 12 miles to Parkhouse Camp where we joined up with the A.M.C. & got a hut to\n\nsleep in.\n\nFound that Cpl. Foulkes & Mony whom we left in Egypt are now in France.\n\nA man may be sent away any day & so miss leave.\n\nShall get 4 days leave in time if I stay here long enough.\n\nWired to dad to come here to see me.\n\nSent Rita letter I wrote on the journey & another long one; sent letters all over England.\n\nWrote out a long application for leave & now I am\n\nawaiting the result of the application, which will be known on Friday – today is","94":"\n\nX X X X X \n","95":" ends my now second diary at a critical point, for any day I may be sent to France & - things are far from healthy out there I believe.\n\nIf I could look into the future what would I see? Well here’s for a dip into Diary No. 3 & let’s hope it will be the last one.\n\n"}}