{"Document Name":{"0":"Diary_0120","1":"Diary_0120","2":"Diary_0120","3":"Diary_0120","4":"Diary_0120","5":"Diary_0120","6":"Diary_0120","7":"Diary_0120","8":"Diary_0120","9":"Diary_0120","10":"Diary_0120","11":"Diary_0120","12":"Diary_0120","13":"Diary_0120","14":"Diary_0120","15":"Diary_0120","16":"Diary_0120","17":"Diary_0120","18":"Diary_0120","19":"Diary_0120","20":"Diary_0120","21":"Diary_0120","22":"Diary_0120","23":"Diary_0120","24":"Diary_0120","25":"Diary_0120","26":"Diary_0120","27":"Diary_0120","28":"Diary_0120","29":"Diary_0120","30":"Diary_0120","31":"Diary_0120","32":"Diary_0120","33":"Diary_0120","34":"Diary_0120","35":"Diary_0120"},"Date":{"0":"unknown","1":1477.0,"2":1478.0,"3":1479.0,"4":1481.0,"5":1482.0,"6":1483.0,"7":1484.0,"8":1485.0,"9":1486.0,"10":1487.0,"11":1488.0,"12":1489.0,"13":1490.0,"14":1491.0,"15":1493.0,"16":1494.0,"17":1495.0,"18":1496.0,"19":1497.0,"20":1498.0,"21":1499.0,"22":1500.0,"23":1501.0,"24":1502.0,"25":1503.0,"26":1504.0,"27":1505.0,"28":1506.0,"29":1507.0,"30":1508.0,"31":1509.0,"32":1510.0,"33":1511.0,"34":1513.0,"35":1514.0},"Entry":{"0":"\n\n","1":"\nA cold night spent on Kantara station which we left at 6 30 am in a train made up of all sorts of army stores and niggers. Almost immediately after leaving Kantara which by the way is an important railhead being used as a depot for ships coming up by 'way of' the Suez Canal! The line runs through dismal desert covered with a sparse short shrub. The outlook however across the desert of Sinia was remarkably beautiful on account of the fine sunrise and although the night was extremely\n\ncold it began to warm up almost immediately with the rising sun. The road to El-Arish is monotonous and uninteresting being practically desert the entire way. The railroad across the desert is a great achievement, being constructed under great difficulties and is the sole channel of supply for the fighting forces which is over 300,000. The water problem has been solved by the laying down of pipes which bring the supply from the Nile up to the present railhead a distance of over 230 miles. At El-Arish we had to change over our goods to a troop train on account of congestion delays. This was the most exciting part of the journey as we\n\nhad to shift out two truck load of niggers which was only accomplished by the aid of the boot and sticks, we arrived at Kelab at about 6.30 pm.\n","2":"\nWent to Gaza by car and had a look over the ruins of the town which has been practically demolished by shell fire and by the turks looting every scrap of timber. The country is such as to form a defensive campaign especially as the country occupied by the enemy is all on high hills and ridges. Roads are in a frightful condition beyond Gaza on account of recent rains, by an ingenious idea of laying down wire netting on the desert sands,\n\nexcellent roadways have been made as far as Gaza, beyond here the nature of the ground changes to a clay which has made the wire road impracticable so G.H.Q. are now more than 50 miles behind the lines.\n","3":" - 24.\nStarted on our journey once again had a very unpleasant ride last night on the goods train as we were compelled to camp under a number of water carts, and the weather blew up very cold and windy. We had alternate snatches of sleep and nightmares owing to the innumerable bumpings buffetings and stoppages. We finally succeeded in reaching Dier Sienade about 2 am and were\n\nbumped into a siding to await the pleasure of theinteracting gangs, this enabled us to get a little sleep but it was bitterly cold and windy\n\nI more often laid awake dreaming of home and dear ones I had left behind me in Australia and tried to feel content. Daylight was thankfully welcomed. Capt Hurley & myself then went to the R.T.O. to find out how to get our equipment moved to a place of safety.\n\nDier Sienade is an important railhead and distributing point, and there are immense stores of rations, fodder and army requirements.\n\nEgyptian labour is employed extensively in fact it would be\n\nimpossible to do without it. They are very poor workers but the work goes on though sheere excess of numbers there each man earning½ PT per day and rations. The goods train in which we were to entrain for Esdud 20 miles distant was timed to leave Dier Sienade at 9 am but after making countless false starts left at 7 pm. We with our equipment were camped in an open troop truck and I thought what a curious place to be spending Xmas Eve in.\nIt was very cold and windy and the arrival at Esdud was welcomed heartily by all. Esdud at the present is the existing railhead. We put our stores and equipment\n\nin the R.T.Os tent under shelter when we had a heavy downpour of rain, as we could not get a train on again. We had to find shelter in the Y.M.C.A. tent for the night.\n","4":"\nAnother Xmas day has passed, another filled with curious happenings. I had only been snugly asleep on the floor of the Y.M.C.A. tent for a few hours when the rain again began to come down in torrents. I awoke with the din of falling rain and was thankful for the shelter above us, but putting my hand out I discovered that the water had overflowed the\n\ntrench and was coming inside. I gathered up my ground sheet and blankets and awakened my mate, lighting up we found the water rapidly rising so we made the best of a bad job and pitched our camp on the table for the remainder of the night where we slept interruptedly the \nremainder of the night\n on account of the highwind which threatened to demolish the tent. At daybreak pent up water on the other side of the railway embankment broke through and added to the flooded surroundings, it came down towards the tents and rose to about two feet, from the table I had an amusing\n\nlookout over \nflooded\n floating objects on a great lake and a line of straggling soaked men making for the high sand hills and this I reflected was Xmas Eve in the Holy Land, it was decidedly miserable plodding through the deep water and mud to a sandy slope where we erected a small bivouac and transferred our belongings. A look into the big Y.M.C.A. tent disclosed a number of men drawn up on boxes and crates surrounded by the flood, and a wag at the piano was playing, their is a happy land far far away.\n\nIn the store tent things\n\nwere more serious as the water had damaged a large quantity of perishable goods. Still there was nothing to be done. The rest of the day we spent in the bivouac looking out over the flooded waters and to the far Judean Hills reasonably dry and comfortable and consoling ourselves that it might be worse.\n\nThe waters have swept away considerable sections of the railroad so that all rail traffic is suspended, the roads are also practically impassable being deep in mud and flooded.\n","5":"\nWeather improved and the glorious sun set about drying\n\nup our soaked garments etc and cheered things up again. The waters on the plains subsided but left a horribly sticky mud behind. During the afternoon Capt. Hurley and myself went for a ramble over the sand hills and to the Camel Transport Camp, the boundless stretchs of great rolling sand dunes dotted here and there with white tents and rows of camels tethered out in lines impressed me greatly with its uniqueness. On a hill close by sands the native village commanding a glorious expansive view over the desert and the lowlands away to the Judean Hills. The colors are\n\nwonderful, the whole country is a blaze of beautiful tints, the distant delicate blue mists that veils the hills the brilliant blue of the sky, the emerald of the prickly pear hedges, the brown sands and the gorgeous colors in which the natives are dressed.\n","6":"\nThis morning we had a walk to the beach to try and get a few pictures and were lucky enough to find hundreds of natives at work unloading a cargo boat which lay about half a mile from the beach, scores of surf boats were plying to and fro, it was a scene of indescribable bustle and noise.\n\nHundreds of natives were there unloading the boats and packing the camels or stowing the cargo in great dumps. It is a great boon that we have the ocean so close as the line is held up and communication with supply souses would otherwise be severed, returned across the desert in the evening there being a wonderful sunset of which Capt. Hurley took a number of color plate pictures.\n","7":"\nA limber from Hdq \"now at Dieran\" came down to convey us and our equipment from Esdud to Dieran last night and at 10 am this morning we\n\nwere enroute. The road is frightfully cut up and muddy from the recent rains through which the springless limbers bumped and ploughed a foot deep in mud. Coming towards us are numerous groups of the tiniest donkeys imaginable laden with great sacks of oranges.There bedouin owners are dressed in wonderous colors and look far more capable of conveying the loads than the donkeys.\n\nIt is astounding what these donkeys will carry. Here comes a fine example of indolent laziness typical of these tribes, a great bearded object that must weigh at least fifteen stone if an ounce sitting on the haunches of a tiny white animal so small\n\nthat the gipo trails his feet on the ground. The wadies have been running bankers during the recent rains and our limbers bumped into their slimy beds axels deep, still it was all so very interesting to me that I forgot the discomfort. The juicy oranges and bully beef gave it the air of a picnic, here and there are great dumps left by the Turks during his retreat. We passed through the interesting village of Yebna built on the top of a lofty rise its mud huts and walls looking from the plain like a swallows rookery. The prickly pear bounded roadway that leaves the village is alive\n\nwith the inhabitants, women bearing the water beakers on there heads as they did from the time of history, the men with their asses carrying immense loads and the noisy children crying \"baksheesh\" \"money\". About five miles from Yebna we drew into Dieran where the desert Mnt Corps at present have there Hdq . There is an extraordinary contrast between this pretty village and the native villages through which we have passed. Its inhabitants are principally jews and there well built and clean houses at once transported me to the outlaying areas of\n\nMosmans Bay. The outlaying walls are of stone generally painted white and the houses are roofed with red tiles, the streets are well kept, and avenued with Australian gum trees, we camped that night in the town hall Dieran.\n","8":"\nAt 10 am we started out with a Mjr Love to pay a visit to the 10th L.H. Reg which are in a rest camp close at hand, we had a delightful ride through avenues of prickly pear and by pictorial villages and visited the battlefield of Mughar. Here the Yeomanry made a famous charge and carried an apparently impregnable position but with\n\ngreat sacrifice, over forty horses lay here in a small group and one may still trace the path of that glorious charge by the littered plain of dead horses etc.\n","9":"\nWe proceeded by motor to Latron and from there by a ford car to our front line position Khurbetha-Ibn-Harith. We stayed with the 3rd L.H. Bdge Hdq , now and again the chatter of a Mch Gun echoed down the valley and an occasional snipers rifle rang out but this was all. We called in at various outposts but all was quiet. After dinner that\n\nnight Capt Hurley gave the boys a treat by giving a lecture on his Antarctic experiences which was greatly appreciated by all.\n","10":"\nAnd so on the last day of the year I find myself way out on the hills of Judea taking part in the campaign against the Turks. It is a time when all past memories crowd on me, thoughts of home and dear ones and of when I shall see them all once again. Have been out most of the day climbing over the rocky hills and taking pictures and as I am very tired am now going to turn in and try to get a few\n\nhours sleep.\n","11":"\nThe new year broke with heavy rolling clouds and stormy winds and in a very short time the rain was coming down in torrents, we were washed out of our bivouac and Johnson, Capt Hurleys batman saved the situation by discovering a limestone cave but not before we were once again wet through and so another miserable day passed. We move off tomorrow with the 3rd Reg.\n","12":"\nnd\n 1918\nThe camel transport arrived in camp at 7.30 am and all our equipment was packed up for the\n\ntrack once again. The roads are quagmires and extremely bad for camels there padded feet slipping and sliding so that with the regulation load of 300 lbs up, the poor beasts are absolutely helpless.\n\nScarcely better off are there native drivers, these destitute beings have little or no shelter during the rains with the result that numbers perish through cold and exposure.\n\nThe entire Bdge left El-Burj at noon and moved off in section column the long column winding its way like a great serpent over rocky defiles and plain made a very impressive spectacle, the distance travelled to our present camp was twelve\n\nmiles, a long trail of slipping slimy mud. The Bdge drew into camp just before dark and are to move again tomorrow at 9 am.\n","13":"\nWe left the 3rd Bdg at 9am with a limber for our baggage, Capt Hurley and myself riding horses and after about a ten mile ride we arrived back at Dieran where we again took up our residence. \nfor a few days\n","14":"\nWe left Dieran this morning in a box ford car for Esdud the roads have dried considerably but the wadies are still boggy and\n\nwe stuck several times. Just outside the village of Mughar we had magneto trouble which prevented our going any further untill we could get a reserve car. In the meantime we visited the native village of Mughar and secured a series of pictures. The village is built on a steep hill which rises from the plain and is by far the most pictorial I have visited yet. The houses or mud huts are entirely of mud and stone very little of the latter, they are hedged in by high walls flat roofed and squalid.\n\nIn the small courtyards are kept considerable numbers of fowls. A string of camels winds its way through the narrow streetway there\n\ncolor nearly matching the mud walls \"brown\", there drivers dressed in light blue dungarees. Along they move stately and dignified, out of the village along the prickly pear hedged road and away into the yellow sands of the desert there must be at least 800 of them. They are all heavily laden and are moving forward to the front line dump. Hail to the gipo, without them progress against the Turks would have been slow indeed.\n\nAfter waiting about four hours the relief car came up and conveyed us to the village of Beit-Dieran a charming native village with atrocious roads and where\n\nwe once again stuck fast in the mud half the population came out and gave us a hand to extract the ford car from the mud, our skidding wheels sending the mud flying like a catherine wheel, the gipos made great fun of it and put us on the road once again for Esdud where we arrived about an hour later. After erecting our tent we had a good hot dinner and then turned into our blankets and had a talk over the trials we had had with our equipment getting it about the country.\n","15":"\nThe rain which has been threatening much of late came down\n\nin heavy downpour during the night and has continued without cessation all day heavy winds accompanying it.\n\nThe big flat where we had the unpleasant experience of being washed out on Xmas day is again awash and the roads impassable, the wadies have been running bankers and transport is more or less disorganised, thank heaven it is dry in our tent for I look across a dismal expanse of mud and water where the horse and camel transport are having a miserable time of it.\n","16":"\nMonday. Wild stormy night with tropical deluge conditions\n\nmoderated considerably during the day and only occosional showers fell. Capt Hurley and myself went out after mud \npictures\n and flood pictures in which at present the country is swimming. The great plain in front of Esdud station is submerged to about two feet and with it valuable supplies of rations, fodder, and army equipment. A great string of over 3,000 camels had to pass through it and I pitied the wretched creatures and there destitute drivers to see these fine beasts of the burning desert wallowing in the mud of Palestine winter is pitiful indeed and there native drivers with hardly any suitable clothing or protection from\n\nthe fierce weather, it is no wonder that they perish in such large numbers. The endless stream of limber transport sink to there axles in the mud, and the railway being washed away in places transport by rail is again disorganised and as we are to just about wet through we made our way back to camp for dinner and a change of clothing. I had a throughly enjoyable ride across the sand dunes to the sea at eventide with Capt Hurley. Owing to the recent high winds a great sea was rolling in and no goods were being unloaded, the cargo vessels being compelled to\n\nput out to sea on account of the heavy sea that was running. Arrived back at the camp about 7.30 had dinner and then turned in for a good nights rest.\n","17":"\nImprovement in the weather which enabled the 1st Bdge to parade for the camera. The horses and men who have been in rest camp now for several weeks are all in fine fettle, the riding was great and all seemed to enjoy the exercise and turnout. The immediate neighbourhood is the centre of a number of camps, so that the sand hills and plain are always a bustle with horses and\n\nmen and the unending streams of camel transport, our Hdq have there tents pitched in what was once an old piggery and isolated from the other camping, what astonishes one is the great rise of the big trees and the density of there growth more so as the owners apparently pay little or no attention to pruning or fertilising.\n\nJan. 9th \nWent across to the beach and the wadie Nahr Sukereir where a vessel is being unloaded, the beach was teeming with natives engaged in the work, and was one of the most animated and noisy sceans I have witnessed\n\nhere. The vessel lay out about half a mile and a large number of small craft were ferrying the cargo ashore. When the bows grounded a line was made fast and about a hundred natives hauled the craft inshore.Imense dumps were formed and from the dumps the stores were being transported by camels to the camps.\n\nWe returned across the sand hills in the evening the desert being the more impressive on account of the dead quiet and beautified by the wonderful delicate flushing of sunset.\n","18":"\nMorning spent amongst the camps, afternoon took a limber\n\nwith cameras across the sand dunes to the Wadie Nahr Sukereir where Capt Hurley secured about eight hundred feet of film pictures.\n\nJan. 11th \nGlorious weather, visited the 2nd Bdge . The Bdge paraded for pictures. A finer body of men it would be well nigh impossible to find, they sat in the saddles as though part of there horses, the discipline excellent and the turnout even excited the Generals admiration. The General who is famed for his Generalty gave a fine display of boomerang throwing \nin\n at\n\nwhich he is an expert. The 1st and","19":" Bdge are moving towards Dieran in the morning and Capt Hurley has decided to travel with them.\n","20":" \nReville at 6 am early breakfast out in the open under an old fig tree, tents struck and the limbers packed. The column moved off at 10 am. The seeming endless stream of men and horses winding there way across the plains far away from the horizon, the stream moved slowly across the plains over hills into wadies across wadies and streams it pushed its way impressively. The men were in\n\nhigh spirits and the horses in good fettle. I rode a little pony by the name of Abdul. Abdul is a great favourite with the men and is a captive from the Turks at Bersheba, he is one of the most perfect little creatures I have ever set eyes on, a perfect model of Arab breed and blood. Going however was bad the roads were still sticky and treachous from the recent rains but in spite of this difficulty we made good progress.\n\nThe good weather was threatening a breakdown which threatening was realised more speedily than anticipated.\n\nThe rain was soon coming down in a deluge, flooded the roads and brought the wadies down gushers, the journey was concluded soaked to the skin and splashing through a mud sludge churned up by the thousands of hoofs. Transport was frequently held up by the limber sinking into the soft mud and flooded streams. The Bdge wentinto a wet bivouac about a mile from Dieran. Capt Hurley and myself rode on into Dieran where we put up for the night and by jove what a cold night it was, our blankets etc did not arrive untill the following day\n","21":" as we could not keep warm laying down, we had to walk about best part of the night to try & get a little warmth.\n","22":" \nThe rain came down in torrents all night and has continued through the day accompanied by heavy lightening.\n\nThe Bdge in Bivouac were washed out during the night and are having a very miserable time of it most of the men being wet through. We are now attached to Desert Corps again for a few days.\n","23":"\nHeavy rains and thunderstorms continued through the night but cleared into glorious sunshine during the morning. Capt Hurley secured two rooms today for his photographic requirements close to hand and we spent the remainder of the day fitting them up ready for developing etc. The new workrooms are part of a house occupied by a jewish family and are quite clean and convenient.\n","24":" \nRemainded\n Remained at Dieran for the day helping Capt Hurley develope plates etc., the results being very good. Beautiful mild weather with blue sky making Dieran\n\nlook more beautiful than it really is. The little red tiled houses nestling amidst the green gum trees reminded one strongly of home. C\/H and I often wonder how long it will be before we all get back to Aust and dear ones once again.\n","25":"\nWent to Zernukah a native village a few miles from Dieran, beautiful weather favoured an enjoyable trip made a trifle exciting by the ford car getting stuck in the mud. We requisitioned the energies of some passing bedouins and soon got on our way once again. Zernukah like many other similar villages is built on a\n\nhill slope, its approaches being hedged by fine avenues of cactus. The Sheik \"head man of the village\" gave us all assistance possible and all the rest of the indolent ragged population and ever accompanying crowd of small boys and girls joined in. Capt Hurley had the 2nd Bdge paraded through the narrow laneways and in many other pictorial sittings. It is amusing what the officers and men will do for the camera. The various Bdgs have been marchalled and all in turn have passed before the camera, they have all keenly taken there part. The mud huts of Zernukah are just a series of dingy hovels\n\nhuddled together like swallows nests and risen entirely from mud the roofs are thatched and mudded and now that spring is drawing nigh grass is begining to make them verdant with young shoots but the most interesting sight of Zernukah and in fact most other native villages is the waterwheel. This remarkable structure is moved by a donkey, which lifts the water in small buckets and discharges them into a large reservior.\n\nAround the valve of the reserivorthe \"bynts\" women collect with there big terracotta water jugs and discuss no doubt the gossip of the village. They carry away the heavily laden jars balanced\n\non their heads with a gait and erectness truly enviable but the colors are the greatest charm, even the small boys cloths are repaired with multicolored patches and the women though appearing as if a good bath would do them a deal of good are bedecked in a variety of colors. The green cactus hedged roads along which a number of donkeys are now coming heavily laden with golden oranges winde there way across the fields now asprout with barley.\n","26":"\nLeft Dieran for Ramleh at 7 am the resent rains have caused the grass and orchards through which we passed to spring into shoot.\n\nBeyond Ramleh we made for Ludd but the changing soil which is heavily cut up by military traffic gave us a great deal of trouble. Frequently we sank axle deep and when we got out to push which we did every hundred yardsor so, the skidding wheels sprayed us with mud from head to foot. Still it was marvelous how the little ford with our assistance forced a passage through the quagmire and eventually succeeded in reaching our destination. We only had a glimpse of Ludd, charming in the morning sunlight and especially beautified by a great number oftalldate palms as we had to push on to Meichia, and push it was most of the time, for the\n\nrecent rains had converted the soft patches into deeper mud, it clogged our wheels and at times the car sank in up to the footboards. With the combined assistance however of numerous natives and our three selves we managed to force a passage.\n\nMeichia is on the top of a high rise and commands an extensive view across the plains and flat country right away to the sea. It is a superior village from others as far as residences are concerned being for the most part built of stone which is quarried in the near vicinity.\n\nAnd here the land itself undergoes a great change from the clay and sand patches of the plain, there is an abrupt change into hilly country of\n\nlimestone formation. A little beyond Meichia we took to horses the roadway being impassable for cars. The way led us across mountain sides steep and rocky to the bed of a wadie which we followed for a few miles and here the scenery was very grand. The mountains are just great boulders of limestone and though not of a very great height, present great problems for transport. We passed by the base of the hill on which is built the fine village of Nalin, Reg Hdq being just opposite. Of fighting there is very little just now, the Turks hold a ridge about 1,000 yards away and apparently are unwilling to make any aggressive move. The country is extremely difficult for an attack on our part,\n\nfavouring the defensive more on account of its natural cover. The forces however with which we are now contending seem to be just a rabble and disappear with any advance made by us. Jaffa was clearly visible and many other villages nestling in the hollows or on the hill crests, stayed the night at Hdq and are to return to Dieran tomorrow morning.\n","27":"\nUp at 5 am and away shortly after 6 am. The early morning ride over the mountains was most enjoyable, the sun came up in a serenely blue sky gilding the mountain\ns\n tops and blazoning Nalin with a flood of golden light. The Olive trees turned\n\na vivid green and the very rocks seemed to reflect the golden rays. It was beautiful and scarcely have I enjoyed myself more. Ater handing the horses over we again took to the car. The ride back was an odeal through slimy mud as far as Ramleh. We requisitioned natives wherever possible and made all sorts of detours by cutting down cactus hedges and using the leaves for laying on the mud so as to give the flying wheels a chance to get some sort of grip. The road is in a fine condition from Ramleh and leads through orchards and vineyards which now are springing into life. The ground is ablaze\n\nwith a beautiful little flower like the milk thistle. We arrived back at Dieran at 10.30 am just in time to keep an appointment to photograph the staff.\n","28":"\nSpent the day at Dieran helping Capt Hurley to develope and bring work up to date.\n","29":"\nUp at 6 am and away to Richon-le-Zion a delightful jewish village six miles from Dieran spent the day taking photos of Anzac Mnt Divn and attached mountain Battery.\n","30":"\nLeft Dieran at 7 am in a ford car for Jerusalem. With a beautiful morning favouring we had a fine though bumpy run to Latron which is at the foot of the Judean hills and we began the assent of the foothills along the road to the Holy City. After a few hours run through mountainous country and numerous pretty jewish villages we arrived at Jerusalem, reported to the M.C. and found out where we were to camp.Our camping place was on Mount Zion so pitched our tents had dinner and shortly after turned in for the night.\n","31":"\nUp at 6 am and away soon after to see the sights of the city and take pictures. The Jerusalem of to day cannot be termed a typical oriental city inside its walls, its eastern character has been generally preserved but in recent years European influence has been great. Without the walls a new town has grown to the north, south and west, jewish settlements are to be seen, and tiny cottages have everywhere arranged themselves in tortuos alleys and in many cases no alleys at all, so hopelessly confused as to make it almost\n\nimpossible to locate any one of them.\n\nOne of the most lamentable influences of the west is the gradual extinction of national dress.\n\nSome of the native women are still to be seen dressed in there national dress and they are dressed like a woman and not upholstered like an armchair. \"Of course this only refers to the women of the east\". Her dress consists of a white coarse linen robe with tastefully embroidered bodice and a simple hem ornament on the skirt, carelessly tucked into the waistband on one side. A flowing white linen head dress reaching to the hips on which\n\nis lavished the most beautifully designed embroidery. Erect and free she steps in raw hide shoes blending in perfect harmony with her suntanned ankles, but the pity is that so few are to be seen in there national dress now, most of them being dressed in hideous colors and designs of cheap european clothing. The main entrance to the old city is through the Jaffa Gate on the west side. From sunrise to sunset a never ceasing throng moves to and fro. Jews steal through the crowd with bent shoulders, downcast eyes betraying their history of oppression. Immediately on\n\nentering the old city through the Jaffa Gate we find ourselves in the midst of a gay and busy scene, men women children camels horses and asses are constantly passing and repassing in either direction, after a few steps we come to a large open space or market square where the natives from the surrounding villages are generally exposing there goods for sale, this may in fact be called the market square of Jerusalem. On one side is an arcade of shops where all kinds of curiosities etc are sold, on the other side stands the great tower of King David at one time a Turkish garrison.\n\nAfter seeing a good many of the sights in the old city Capt Hurley decided to visit the Garden of Gethsemane, it is now kept in order by the Franciscan monks and is in the most beautiful order. At intervals along the garden path are arranged the fourteen stations of the Cross and in the garden are a few ancient olive trees which the monks tell you are the ones that were there in the time of Christ, but myself think it improbable that any are remaining here which were in existance in the time of Christ. Near the garden is the grotto of the Agony and a few paces further is the Virgins\n\ntombe. After seeing a few other places of interest we returned to camp. After dinner as Capt Hurley dose not require me again to day I got permission to again visit the old city, went to the Via Dolorsa and walked through the streets that Christ walked through on his way to calvary according to tradition. I next went to the chapel of the Rising of the Cross on Calvery . In the apse beneath the alter is shown the hole, now lined with silver where the cross was fixed. The positions of the crosses of the two thieves are also marked on the floor, to the south of the chapel and separated from\n\nit by two piers only is the latin chapel marking the spot where Christ was nailed to the cross, and between the two chapels is an alter on the place where Mary received the body when taken down from the cross.\n","32":"\nUp at 6 am had breakfast and away soon after to the dead sea. Capt Hurley took a number of pictures. The dead sea is the lowest known spot on the earths surface being 1,292 ft below the Mediterranean Sea 3,786 ft below Jerusalem and 4012 ft below the summit of Mount Olives, though\n\nvery lonely and desolate the dead sea and its surroundings have a distinct beauty of their own. The impression of my visit to the Holy Land will for ever remain indelible upon my memory, we leave here with much regret for Dieran in the morning.\n","33":" - Dieran\nUp at 6 am and off to Ramleh where at the present time a huge dump of materials is accumulated and distributed. The materails are brought by camels from the railhead now near Dieran and from the costal landing at\n\nNahr Sukerier, great strings of camels miles long heavily laden discharge there cargos daily and present such a scene of life and bustle, winding in and out amongst the cactus hedges and across the dusty plains as I have never seen before, over 9,000 camels are so employed at the place, and are attended by native drivers.\n\nFrom the dump at Ramleh we motored over the dusty and bumpy road to Jaffa. Jaffa is much modernised and has lost most of its attractions. I was much interested however in the landing of railway materials which is at present going on. The cargo\n\nvessels lay out to sea and the materail is ferried in by surf boats. The port is extremely treacherous as the boats have to pass through a narrow waterway between the rocks of Andromede and even when inside the reef there is barely enough room in which to swing them. There is some fine color in old Jaffa the walls being painted a variety of tints with here and there glimpses of the deep blue Mediterranean. Like all these villages and towns old Jaffa is filthy and smelly. Around the town are many fine old \norg\n orange groves the fruit being at present ready for market. We went into one\n\nof the orange groves for 10 P.T. worth of oranges and returned with a great sack of two hundred. We returned to Dieran via Richon-le-Zion a pleasant though rough journey of twenty miles.\n","34":"\nWent to Ramleh and thence to Ludd. Ludd is the old biblical town of Lyddia and the birth place of St George. Ludd is one of the prettiest villages hereabouts and being on fairly high ground it overlooks the fertile plains to the horizon of theJudean mountains. I like Ludd on account of the huge number of tall\n\npalm trees which rise majestically from dirty little courtyards and more or less helps to realise ones conception of a Palestine village. Its streets are more alleyways dirty, dingy and smelly here and there arched over by a building and very similar to Jerusalem. There is quite a fine Greek church erected to St George and its interior is a remarkable display of tawdiness and show. After taking a series of pictures we returned to Dieran. We stopped on the return journey at the old Crusaders Tower at Ramleh where there is a fine look out over the country. Exposed twenty plates and 600 feet film.\n","35":"\nThunderous weather and occasional bursting downpours all day compelled us to remain at Desert Corps. We spent the day bringing our work up to date and getting our equipment packed once again. And as we start on our way back to Cairo again tomorrow I will finish trusting that these few notes will interest any who may read this.\n\n F.L. Edmonds\n\n\n\n"}}