{"Document Name":{"0":"Diary_0362","1":"Diary_0362","2":"Diary_0362","3":"Diary_0362","4":"Diary_0362","5":"Diary_0362","6":"Diary_0362","7":"Diary_0362","8":"Diary_0362","9":"Diary_0362","10":"Diary_0362","11":"Diary_0362","12":"Diary_0362","13":"Diary_0362","14":"Diary_0362","15":"Diary_0362","16":"Diary_0362","17":"Diary_0362","18":"Diary_0362","19":"Diary_0362","20":"Diary_0362","21":"Diary_0362","22":"Diary_0362","23":"Diary_0362","24":"Diary_0362","25":"Diary_0362","26":"Diary_0362","27":"Diary_0362","28":"Diary_0362","29":"Diary_0362","30":"Diary_0362","31":"Diary_0362","32":"Diary_0362","33":"Diary_0362","34":"Diary_0362","35":"Diary_0362","36":"Diary_0362","37":"Diary_0362","38":"Diary_0362","39":"Diary_0362","40":"Diary_0362","41":"Diary_0362","42":"Diary_0362","43":"Diary_0362","44":"Diary_0362","45":"Diary_0362","46":"Diary_0362","47":"Diary_0362","48":"Diary_0362","49":"Diary_0362","50":"Diary_0362","51":"Diary_0362","52":"Diary_0362","53":"Diary_0362","54":"Diary_0362","55":"Diary_0362","56":"Diary_0362","57":"Diary_0362","58":"Diary_0362","59":"Diary_0362","60":"Diary_0362","61":"Diary_0362","62":"Diary_0362","63":"Diary_0362","64":"Diary_0362","65":"Diary_0362","66":"Diary_0362","67":"Diary_0362","68":"Diary_0362","69":"Diary_0362","70":"Diary_0362","71":"Diary_0362","72":"Diary_0362","73":"Diary_0362","74":"Diary_0362"},"Date":{"0":"unknown","1":1259.0,"2":1261.0,"3":1262.0,"4":1265.0,"5":1267.0,"6":1272.0,"7":1273.0,"8":1282.0,"9":1283.0,"10":1286.0,"11":1295.0,"12":1299.0,"13":1304.0,"14":1305.0,"15":1306.0,"16":1307.0,"17":1309.0,"18":1310.0,"19":1321.0,"20":1322.0,"21":1329.0,"22":1332.0,"23":1344.0,"24":1347.0,"25":1348.0,"26":1349.0,"27":1350.0,"28":1381.0,"29":1397.0,"30":1418.0,"31":1420.0,"32":1421.0,"33":1422.0,"34":1423.0,"35":1425.0,"36":1426.0,"37":1428.0,"38":1429.0,"39":1431.0,"40":1432.0,"41":1433.0,"42":1434.0,"43":1435.0,"44":1436.0,"45":1437.0,"46":1438.0,"47":1439.0,"48":1440.0,"49":1441.0,"50":1442.0,"51":1443.0,"52":1444.0,"53":1445.0,"54":1446.0,"55":1447.0,"56":1448.0,"57":1452.0,"58":1458.0,"59":1459.0,"60":1460.0,"61":1461.0,"62":1463.0,"63":1464.0,"64":1465.0,"65":1466.0,"66":1470.0,"67":1474.0,"68":1475.0,"69":1476.0,"70":1477.0,"71":1478.0,"72":1479.0,"73":1481.0,"74":1482.0},"Entry":{"0":"\n\n","1":"\n: During the past few weeks there have been no events of great importance on this Front. Our forces have been chiefly engaged in constructing two strong lines of defence, the main line being on the West side of the Wadi Ghuzze running from Gaza South, & through the Shellal positions recently evacuated by the Turks. Our Brigade has been engaged in reconnaissance patrols & also in outpost duty along our advanced outpost\n\nline running along the Eastern bank of the Wadi Ghuzze. We have had a few skirmishes with enemy cavalry recently while on patrol. Heavy artillery on both sides has been showing great liveliness around the Gaza positions during the past few days.\n","2":"\n This afternoon at 2 o'clock the whole of the Anzac Mounted Division with the artillery attached to us moved out of camp, our object being to reach the Beersheba - Bir-el-Wadia railway, about 28 miles from\n\nhere & to blow it up. We had a very weary all-night ride & did not reach the railway line till 7.30 am. next morning. The engineers immediately got to work & in two hours time had blown up two railway bridges and fifteen miles of railway line. At 10.30 a.m. we set out on the return trip home, & we did not reach camp till mid-night. We had been 34 hours almost unceasingly in the saddle, with very little food or\n\nwater & absolutely no sleep, so that on reaching camp both horses & men were about knocked up completely. These night treks are something to live in dread of, their fatiguing effect upon men is very great. We met with practically no opposition on this \"stunt\" except that we were fired upon just at daylght on the","3":" by a party of armed mounted Bedouins. They also sniped at us at long range & from the top of the rocky\n\nhills \nthrough\n between which the railway runs, while we were engaged in demolition work. We had no casualties however in our Regt, & in retaliation for their treachery, we burned, on our way back, all the hay-stacks & crops we encountered belonging to the Bedouins, & which to them will mean a very serious loss. We also took possession of most of the poultry.\n","4":"\n: Our Regt. out all day on reconnoitreing work, encounted about a\n\nSquadron of Turkish cavalry & drove them back about a mile to their entrenched positions. On \"Listening Post\" last night about a mile out in front of the barbed-wire entanglements.\n","5":"\n: Our Division withdrawn to Khan Yunis today where we expect to be more or less \"resting\" for awhile. Relieved by the","6":" Division (Imperial).\n","7":"\n: Went through gas drill today. First of all we attacked through heavy clouds\n\nof smoke, secondly through smoke and gas (chlorine and phosgene), & lastly we were marched through a weak cloud of gas without our gas helmets. The whole business is very unpleasant & I am by no means anxious to try the experience of withstanding a big gas attack.\n","8":" '17\n: At 9 o'clock last night very heavy artillery fire accompanied by much rifle & machine gun fire was opened on our left & around Gaza. The artillery firing lasted for about an hour & the\n\nrifle machine gun firekept breaking out now & thenall through the night. Evidently our troops attackedsome Turkish positions butso far have not heardparticulars. ","9":" Redoubt near thesea taken).\n","10":" '17\n: Have been rather \"off colour\" for the past couple ofdays & today was sent away to thedoctor to the Anzac DivisionalField Hospital near Bela, my complaint being Tonsilitis.\n","11":" '17:\nDischarged from thehospital today & rejoined theRegt now resting on the beach\n\nnear Khan Yunis.\n","12":" '17:\n The Brigademoved out again todayto the vicinity of our oldposition on the second lineof defence.\n","13":" '17\n: Moved out ofcamp at 1.30pm to aposition near Tel el Fara,and about 1½miles from theWadi Ghuzze. We hadreveilleagain at 11.45p.m. and at 1.30 a.m. onthe","14":" inst our Brigademoved out to take parton a big reconnaissanceEast and north East of\n\n\n\nthe Wady Ghuzze. Inall the reconnoitreingforce composed sixbrigades of mounted menwith Artillery. Our objectwas to clear all thecountry East and NorthEast of the Wady to a depthof about six miles & ona front of something likefive miles. All enemy forces were to be forcedback in this area, \ninorder to enable the nextCommander in chief of the Egyptian Forces,General Allenbyto inspect\n\n\n\nthe country\n. This objectwe had achievedby 7 A.M. & with practicallyno casualities. At 5.p.m.we commenced to retire& as our Regt. emergedfrom a long gully inwhich our horses had beensheltering during the day,we came into view of theenemy's artillery & hada lively five minutesgallop chased by manyshrapnel shells. Wehowever got off very luckily,the Turkish artillery beingjust a little short in their\n\nrange almost all through.\n","15":"","16":" '17\n: Our Troop wastoday temporarily detachedfrom the Regt. & sent toour Divisional Hd. Qrs,as duty troop \nattached toDivision\n.\n","17":" '17\n:In the early hoursof the morning the wholeof the Anzac Mounted Division moved out onan exactly similar stuntto that of the","18":" inst. Precisely the same countryhad to be cleared of theenemy. The chief objectof the \"stunt\" on this occasion\n\nbeing to enable the new Commander-in Chief ofthe Egyptian Forces, GeneralAllenby to inspect thecountry. Our Troop wason quite a \"cushy\" jobtoday being the escort toGeneral Chater, the Officercommanding the AnzacDivision.\n","19":"\n:Divisional stuntsyesterday & today we werebombed & shelled yesterdaybut had only 20 menkilled & wounded.\n","20":"\n:Returned to ourRegt. being relieved from ourjob on D.H.2.\n","21":" '17\n:During the pastweek our Brigade hasbeen acting as DutyBrigade of the Division,consequently we havehad a good dealof reconnaissance workto do capturing afew prisoners during theweek. Today our Regt.moved off from theBrigade camp, situatedabout 1½miles S.E. ofTel-el-Fara, & took overthree redoubts furtherround on the flank. These weman every night.\n\n\n\nWater for men & horses isscarce, the nearestwatering place being5 miles distant, so thatmuch of our time duringthe day is occupied intaking our horses towater & in grazing themnear the Wadi.\n","22":" '17\n:For the past threedays I have been sufferingwith a very bad back,have been off duty &almost unable to doanything. Today I was sent away to the RestCamp on the beach between\n\n\n\nKhan Yunis & Bela.\n","23":" '17\n: Returned to theRegt.The Brigade having movedout on a \"stunt\" towardsBeersheba about 3 p.m. I wastoo late to go with it.\n","24":"\n: The Brigade movedout of camp at 3 p.m. ona reconnaissance \"stunt\"near Beersheba. We hadonly light skirmishing withTurks & Bedouins. GeneralsAllenby, Chauvel, & Chaterinspected the country onthe morning of the","25":" TheBrigade then withdrew &returned to camp (about\n","26":" miles) & arrived about8.30 p.m.\n","27":"\n:The Regt. onoutpost duty last night. Today the Brigade movedin on the Beach nearKhan Yunis, where we areto rest for sometime, theother two Brigades of theAnzac Division moved inyesterday. Our Division hasbeen doing the \"lions share\"of the mounted work on theFront, & we should accordinglybe due for a good restnow.We were relieved bythe new division from\n\n\n\nSalonica, the Imperial Yeomanry Division. There has been a considerable amount of sickness amongst our men lately & a great number of our horses are weak & in very poor condition & badly need a spell.\n","28":" '17\n: The Anzac Division moved out to the Second Line of defence today our month's rest on the beach having expired. We relieved the Australian Division, which moved out to the Front Line to relieve the Yeomanry Division which moves into the beach\n\nfor its \"spell\". This is an awful camp, the dust being almost beyond endurable.\n","29":" '17\n: The Brigade moved in to a camp on the beach near Rafa, our horses having been declared unfit for the Front line. Rumours are current to the effect that the Brigade is to be sent to Upper Egypt, & I am inclined to believe that there is a big chance of us going there. There has been more sickness amongst the men of this Brigade than any other\n\non this Front &our horses are also in the worst condition & need a change.\n","30":"\n: The Brigade moved out at 4.30p.m. & travelled to Abassin-el-Kebir (about 7 miles) where we arrived in camp at 8.30 p.m. We expect a big offensive operation to commence by us in a few days time. Two enemy aeroplanes were recently brought down by our new fighting machines. We have something like 250,000 men now on this\n\nFront & we are well equipped with artillery, & the air service has wonderfully improved recently, we having a number of the latest fighting planes added to a large number of the older machines which are chiefly used for reconnaissance & bombing.\n","31":"\n Brigade moved out of camp at 4.30 p.m. and travelled a further 13 miles to Esani where we arrived in camp at 11 p.m.\n","32":"\n: Tonight our Squadron\n\nescorted a \nconvoy\n camel convoy out 8 miles to Kalassa, handed the convoy over, and returned as escort to another camel train to Esani. Arrived in camp at 12 midnight & had to stand to arms at 4.30 in the morning.\n","33":"\n The Brigade moved out at 4.30 p.m. & arrived at Kalassa about 9 p.m. where we camped the night.\n","34":"\n: Moved out to Asluj a further 8 miles where three mounted divisions were encamped ready to \"kick off\" for the attack on Beersheba.\n","35":"\n: Last night at 7 p.m. the Anzac Mounted Division, the Australian Mounted Division & the Camel Corps with a good number of guns moved out of Asluj & trekked during the night a distance of over 20 miles. We sighted Beersheeba about 5 miles distant soon after daylight & the mounted troops approached from the North and East, not meeting with any serious opposition until within\n\ntwo miles of the town. The strong system of redoubts to the South and West of the town & situated on the ridges on that side were subjected to a severe bombardment by our heavy artillery & when the Infantry made a general assault at about 4 p.m. the positions were carried with few casualties, hundreds of Turks being found dead in the trenches. The general assault by the mounted\n\nforce on our side was not made until just before dusk, though there was a fair amount of fighting from about 9 a.m. till 4 p.m. on a number of disconnected enemy earthworks & redoubts. The town was completely in our hands just as darkness arrived, the Turks setting on fire many provision dumps and buildings containing supplies. As we entered the town many explosions\n\noccurred, the enemy having mined most of the wells, water supplies, pumping plants etc. We captured something like 19 guns and 1200 prisoners & much booty. Our losses were very slight indeed. The general offensive all along this Front from Beersheeba to Gaza has commenced, but so far we have had no official news as to how things are progressing away from our scene of operations. I forgot\n\nto mention that in our advance along the road from Aslujto Beersheeba our force cut off 1300 Turks who attempted to blow up the road at different points, this enemy force was later on surrounded & captured by our Camel Corps. The bombardment on the Gaza positions and at other points of the line during the past couple of days has been tremendous. Though we are 30 miles off we can hear the guns thundering heavily all day & night.\n","36":"\n: Moved camp out about \ncouple of\n1 mile from Beersheeba\n\n& rested the night, horses & men are having a very strenuous time.\n","37":"\n: Last night about 9 o'clock our Brigade moved out to attack in conjunction with other troops some strong Turkish posts at Dureideh (Quelfeh) about 9 miles north of Beersheeba. Our Regt. was detached to attack one of the posts. We were given no supports and only about two thirds of the Regt. went into action. The position proved by far too\n\nextensive & formidable for us to take & we suffered a severe reverse. It was the most severe fighting I have ever been in. All our \"A\" Sqdn. officers were either killed or wounded, & just half of the men of our particular troop were either killed or wounded. I lost some of the best pals I have ever had, poor old Oliver Hind and John Martin were both killed, each being shot through the head. Walter Smith, Tom Mountain and Guyer were all killed out of \"A\" Troop, and Lieut Gray, Holliday,\n\nRichardson, Doust & Ferris were wounded. We withdrew under cover of darkness, those of us who escaped being very lucky, we were outflanked on both sides by the enemy positions, but luckily he did not counter attack us before we evacuated. Only about 150 men out of the Regt. actually participated in the attack, of these 69 were either killed or wounded. We retired back to Beersheeba at night, we were unable to obtain water for our horses though\n\nthey were in a famished condition.\n","38":"\n: Had a great deal of trouble in getting water for our horses, but were eventually successful.\n\nNews from the remainder of the Front is good especially around Gaza where most of the enemy's strong points are gradually falling into our hands. Our air service seems to have established complete ascendancy over the enemy planes lately,& a number of German machines have recently been brought down.\n\nThe enemy have brought a very clever man to match our Commander-in-Chief (Allenby), news having just arrived that Falkenhayn has established his head quarters at Jerusalem. I am of the opinion that he will meet his match in General Allenby though. Buried all our killed in the Australian burial ground at Beersheeba.\n","39":"\n: The Anzac Division moved out of Beersheeba towards evening, after travelling all night we engaged the enemy about mid-day on\n\nthe","40":" & drove them back. About 2 p.m. our Brigadewas ordered to attack \nSheria\n Hareira. We had a five mile gallop into the main Turkish dumps, had only slight skirmishing but succeeded in bagging nearly 250 prisoners. Hareira is the Junction of the railway from Gaza to the Jerusalem-Beersheeba line. We captured a great quantity of war material, shells, ammunition etc. We passed hundreds of the enemy's transport waggons today abandoned by the roadside. In many\n\ninstances the animals were left still standing in the vehicles, many of them were however shot by the Turks before their retirement. We had ample proof of the Turks demoralisation today, the enemy having left his positions in a very great hurry, abandoning much material & not even blowing up the bridges, viaducts etc which he had alreadymined. Did outpost duty at Hareira. Now on coastal flank.\n","41":"\n: Promoted to rank of Corporal. Continued our pursuit taking a few more\n\nprisoners. Camped the night at a big water supply & pumping station from which Gaza is said to receive its main water supply.\n","42":"\n:Advanced another eight to ten miles, passed the town of Ashdod, (mentioned in the bible), where we watered up & camped a few miles out.\n","43":"\n:Advanced another seven miles passed two more large villages, had some scrapping with the enemy rearguards.\n","44":"\n:- Still harassing the\n\nenemy, the Infantry arrived up with us Today, Turks are now in entrenched positions. Very short of food & water for both men & horses.\n","45":"\n: Went into action with Scottish Infantry, attacked an entrenched ridge with redoubts. The action was fairly hot, we having to advance over a thousand yards across flat country absolutely without cover. Our Regt. withdrew after dark leaving the Infantry dug in their positions.\n","46":"\n:The Brigade moved back on to the beach about four miles to the rear, evidently with the idea of giving us a short rest. It actually proved very short, for hardly had we our lines down& stripped off for a swim when we were ordered to saddle up at once, & we again moved out.\n","47":"\n:The Turks having retired during the night, we advanced another ten miles today through Askalon & on to Deiran,a pretty little Jewish village. Only\n\nArtillery action today so far as our Brigade was concerned. Beautiful orchards, especially oranges around Deiran. Outpost at night outside the town.\n","48":"\n:Advanced another eight miles today through the large native towns of Ramleh & Ludd. Our Regt. performed a splendid feat today, about \n160\n80 men from \"A\" & \"B\" Sqdns. surrounding & capturing 300 Turks with 4 machine guns. We had hardly any casualties, the Turks seemed absolutely tired\n\nout & too demoralised to show fight.\n","49":"\n:Moved on again today to within about 5 miles of Jaffa. The country we are now in is some of the finest I have ever seen, orchards of oranges, figs, dates and almonds are everywhere to been seen. The oranges are now well in season & we manage to do them justice. Only a few shells flying around today.Passed two or three more villages.\n","50":"\n:Outpost duty tonight.\n","51":"\n:Moved on to within 2½miles of Jaffa, the New Zealand Brigade having already entered the town & taken up positions beyond. Jaffa out of bounds to us unfortunately.\n","52":"\n:Raining all day.\n","53":"\n:Outpost duty last night, terribly wet & cold & miserable.\n","54":"\n:Our Brigade was relieved by the","55":" Brigade & we moved back a few miles (about 12 miles today).\n","56":"\n:Moved back a further six to eight miles\n\ntoday & went into camp to rest for a while. Weather dried up but very cool at nights.\n","57":"\n:Moved out to Rechon le Zian (about six miles South of Jaffa) & camped there till","58":" On the night of","59":" we were trench digging all night some miles out for the I.C.C. who are holding part of the line. Getting plenty of oranges & brown bread (at 1\/- per loaf) from the inhabitants of Rechon le Zian, which town by the way is the head-quarters of the Jewish community in Palestine.\n","60":"\n:Moved out to Jaffa, passed through the town at night & camped about ½a mile outside.\n","61":"\n:Obtained leave & spent part of the day exploring the town of Jaffa. The population of the place in normal times amounts to 45,000, there are now however only12,000 people there which gives the town a rather deserted appearance. There is a great dearth of \"change\" in this country for the present & one is almost forced to spend either a 10\/- or £1 note when purchasing\n\nany goods. Raining today.\n","62":"\n:Moved back again in the early hours of the night to our old camp at Rechon-le-Zian. Our duty at Jaffa was merely to protect some batteries of guns until Infantry arrived and relieved us. Been raining off and on for two days & nights & still unsettled.\n","63":"\n:News was received today that Jerusalem fell early this morning to our Infantry, we have thus now occupied practically the whole of Palestine, after a most successful campaign.\n\nRaining heavily today, ground very boggy.\n","64":"\n:Weather cleared up. Nothing unusual doing.\n","65":"\n:Heavy artillery & rifle fire on our right today, but have not heard exactly what was doing. Witnessed some fine air fighting today. (Small Turkish attack followed by counter by us, positions finally unchanged).\n","66":"\n:Was recommended by Colonel Granville for a Commision in the Regt., but was informed by the Brigade Major that I was too \nold\n, at the age of 28 years & two months, 28 being the extreme limit. Less said the better perhaps so \"malesh\".\n","67":"\n:Our Brigade moved out just before dusk & after dark took over portion of the front line of trenches S.E. of Jaffa, relieving the 155th Inf. Brigade, 52nd Division (Scottish). Was in charge of listening post in front of the trenches last night. We are now temporarily dismounted, our horses having been taken back some miles to the rear to Richon, & they are being looked after by the horse holders.\n","68":"\n:Doing Listening Post every alternate night. Been raining off and on during the past three days, have spent some cold,\n\nmiserable & wet nights on dudty. At 8 o'clock last night, all the artillery on this section opened a tremendously heavy bombardment, the heaviest I have witnessed, which lasted till about 3.30 a.m. & at daylight the Infantry made a very successful advance on the left flank near the coast, & crossed by means of pontoon bridges, the small river which up to the present had been dividing our line & the enemy's. The Infantry captured\nsome\n 250 \nhundredsof\n prisoners this morning.\n","69":"\n:Heavy artillery bombardments during the night, also some heavy shelling by the warships\n\noff the coast. The 3rd L.H. Regt. supported by the","70":" Regt. & in conjunction with the Infantry attacked positions on our right (Bald Hills) at 1 o'clock this morning, gaining all their objectives with few casualties. At 8 a.m. after more heavy artillery preparation the Infantry attacked on a four mile front running from the coastinland, &advanced something like five miles in depth during the day, the Turks retiring without offering any serious resistance. We now have our line straightened & also Jaffa well out of range of the enemy's big guns. In all the recent engagements\n\nour artillery has absolutely outclassed & outranged \"Jacko's\", & this has been the chief cause of our many recent successes. Twenty of our aeroplanes bombed the enemy's transports during their retreat today.\n","71":"","72":"\n:Returned from the trenches to our horses back at Richon.\n","73":"\n: Xmas Day. Has been raining spasmodically though at times very heavily during the last two days & nights. Xmas gifts & also many parcels have just arrived, thus we have many good things to eat as well as Richon wine to drink, had it been fine\n\nwe may have spent quite an auspicious Xmas, however I think we shall fare better today than at any previous Xmas since I have been a \"soldier of the King\".\n","74":"\n: The Brigade moved back 15 miles to Ashdod, had a very wet trip, & country awfully boggy after the heavy rains. Hear \nwe\n the whole of the mounted troops are to move still further back to Bela to relieve the transport, during the wet season there is no likelihood of a further advance here for at least six weeks. The railway is now duplicated as far as Bela.\n\n"}}