{"Document Name":{"0":"Diary_0228","1":"Diary_0228","2":"Diary_0228","3":"Diary_0228","4":"Diary_0228","5":"Diary_0228","6":"Diary_0228","7":"Diary_0228","8":"Diary_0228"},"Date":{"0":"unknown","1":1589.0,"2":1590.0,"3":1591.0,"4":1592.0,"5":1605.0,"6":1606.0,"7":1607.0,"8":1608.0},"Entry":{"0":"\n\nTuesday 9th April\n\nSo far I have only passed the doctor & dentist, & have still to be put through gas before being eligible to be put on draft. My teeth have yet to be fixed up, so probably I shall not leave for a week. \nyet\n\nThe battle has not yet entered on its second stage. The fierce yet only intermediary fighting which is going on at present, has been taken part in by Australians, so probably I shall be in the thick of a stunt soon.\n\n","1":"\n\nMy teeth \nhave been\n are supposed to have been fixed up, & so any day may find me off. As a matter of fact Walter & I were both put on draft a couple of days ago, & after we had been paid on the strength of it, the discovery was made that no 1st Division men were needed.\n\nWhilst waiting for the train at Boulogne, we saw the transport of the 1st Field Ambulance go by\n\nOn a train bound, we presumed, for the Somme. Since than (on account of the push at Messines perhaps) we hear that they have been returned to the Northern Sector, so we may see Caestre again yet.\n\n\tX\tx\tx\tx\n\nYesterday we heard that Fritz had begun a push from Armenteres to the Ypres-Comines Canal sector (from the paper). Today the startling news arrived that he had pushed us back almost to Bailleul \n\nsouth west of which place there has been heavy fighting. The line apparently runs the wrong side of Merville through Neuf Berguin in front of Bailleul & thence round to the Ypres Comines Canal.\n\nFrom this the safety of the Convent at Locre is doubtful. If it is not in German hands it is within the shell fire zone for they have got Neuve Glise. \nDrani\n Dranoutre must be right in the zone.\n\nIt is doubtful if all the civilians could have got away in time. The picture\n\nthe imagination conjures up of the orphans & nuns at the convent, & the civilians of Locre & Dranoutre, under shell fire, & in the confusion of evacuation is not pleasant.\n\nThen there is Caestre, which now comes very close to the line: that will be shelled no 1. It is to be hoped that all the civilians were able to get away in time but one fears it was too sudden. I am wondering what has become of Mdme Van Uxems\n\nOur last resting village\n\nSee Bois – must be in a terrible state of confusion & also shelled\n\nMarie, the little girl on the Loche Dranoutre road who used to describe so vividly the German occupation of ’14, will now have a second harrowing experience of invasion. Then the whole of the Somme area is full of such cases. Still, apparently we have held him firmly & only fallen back under great pressure. As long as the retreating is orderly one can hope for\n\nA definite ending & then a severe counter thrust.\n\nWednesday 17th April 1918\n\nI am writing this at Routh in the little bit partitioned off & arranged as a little chapel. On the table are numerous theological, religious & poetical books, & it is very quiet.\n\nX x x x\n\nWent into Havre on leave last Sunday afternoon. Visited a cinema, the Y.M.C.A.\n\nfor tea, the low\n\npart of the town left by the last train at 8,30 pm.\n\nHavre, is of course the most normal town that I have visited in the North of France, on account of its immunity from raids. The fact that several cinema shows were open in the afternoon testifies to that.\n\nIt was fine, & outside all the citizens were to be seen hurrying on pleasure bent – the girls in smart black or dark colour with apricot stockings, & the \n\nmen in black or dark suits also. In uniform there were Yanks, English troops, Australians, girls of the W.A.A.C’s, nurses & officers of all armies. Inside the cinema was the usual family scene inseparable from a French cinema on Sunday afternoons. There was Monsieur \nwith h\n in his uniform as officer in the cavalry, his native servant (Algerian), & two small pretty boys the younger \n\nof which was evidently spoiled by our dapper officer father. Then Mdme & her two daughters all in black, and innumerable French & Belgian soldiers with their fiancées in various affectionate attitudes. The thought that such pleasure on the Sabbath was wrong was stifled by the amount of bereavement represented there. Still, I suppose even that does not excuse a cinema Sunday afternoon.\n\nIn the busy shopping centres – round the square – although the shops were shut, there was a busy & animated scene,. \nto\n \n\nLeaving the square & walking towards the docks towards the docks along the broad main Rue de Paris, it is surprising how the change from friend shops to mean ones, & dirt both on the shops & their inhabitants, is effected. It would be hard to fix any point of change for it is gradual\n\nyet very complete.\n\nWhen I \nwas\n returned to camp I found that Walton & I were on draft & would be expected to go the following day (Monday) \n\nAccordingly I spent as much time as I could spare on Monday in writing to Rita & Dad, & conveying to them the fact that I was going up the line this time specially prepared & cheerful.\n\nThe reason for this being is the fact that after\n\ntheir Amiens push had fizzled out the Germans have made a desperate attempt between Armentieres & Messines & succeeded in pushing our troops back to Neuve Eglise & capturing Merville & N. Belgium.\n\nThe startling changes (referred to last Saturday) of such a situation would, of course, cause anybody to think seriously. To go up into the present battle which is raging, for Calais (a kind\n\nof later & worse development of the Amiens one) facing of all kinds of possibilities. Today the news of the fall of Bailleul has arrived, & the news of fighting at Meteren.\n\nOn Monday night, thinking I might be leaving on Tuesday morning, I went to the vestry of the C of E hut to see the Padre for a prayer before leaving. By good luck the Bishop of Bathurst who had attracted me heathy by his inspiring\n\nsermon (David & water) on Sunday morning (when I took communion), was there. My visit did me a great deal of good, and from that hour on I rapidly got into nearly spiritual communion with God than, with all my trying, I had ever done before. Crises affect men in various ways, and if one snatches all the good possible out of a critical & anxious period it must be for the better after. What I detest is the idea\n\nof suddenly becoming religious when danger is near. It seems that one might “suddenly\" succeed in finding during a crisis what one had been looking for long. To suddenly begin to look then, would not be right it seems: yet what is the position?\n\nWe did not go on Tuesday morning. I awoke with the consciousness of having dreamed of Rita. Curiously enough, for the hour or so after getting \n\nto bed, before going to sleep, I held forth to the tent on spiritualism & supernormal incidents. The dream was a vivid one in which all was confused, but standing out less confused than the rest were the facts that I was trying to do some impossible kind of task, I had friends there & Rita was expected to visit me. She came, & the feeling of intense pleasure I had when I \n\nfolded her in my arms & looked in her dear faithful brave eyes, was with me long after waking.\n\nNow for the sequel: (I am paying more attention to subconscious prompting of the mind since I have taken up the study of psychic phenonema & spiritualism).\n\nAfter dinner at parade for mail I said to Walton after having seen some parcel cards in the Sergeants hand “You will find that one \n\n \n\nof these is for me. We will go to inspection by the C.O., then I will go & get my parcel, & then we will write letters & pack up our kits.\" He smiled & said nothing. Sure enough my name was called out for a parcel card (although I did not normally know anything about it before), & with the insertion of a visit to church and the Holy Communion, I spent the afternoon as outlined.\n\nThe important part of the narrative is, however, here. When I got the parcel it proved to be the one I was expecting from Lily. Enclosed in it were (besides chocolates & cigarettes & tobacco from Lily) a pair of socks & 3 letters from Rita. When I came to read the letters I found to my surprise that in one of them she described a dream she had had, which while not agreeing in the\n\ndetail of doing impossible work, with mine, was identical in regard to a visit, only it was I that was going to visit her. During the morning I had written & told her among other things, about my dream, & here in her letter to me I found the exact expression that I had used, in Rita`s letter to describe the feeling after waking up.\n\nEnclosed in the letter were numerous photographs (6) of Haybury Nook, that I have been waiting for\n\nI am tremendously glad to get them! Splendid! \n\nI am in the truck on the way up, but I doubt if I shall be able to write much. These trains are the limit for jolting – (we have paused.)\n\nWe are passing through the beautiful (once again) country between Rouen & Abbeville (2) Wooded valley with a smooth road at the bottom running parallel to & not ¼ mile from the line.\n\nJust passed Margny a small village.\n\nThursday 18th April\n\nPassed a very comfortable time last night although we were packed like sardines.\n\nPresent moment the train is stopped Boulogne side of Wimereux station which makes us exactly opposite 53rd Hospital.\n\nWe can see away on opposite hill ( hospital) the inscription\n\n“Glorire a’ Jesus Christ\".\n\nWe have passed through Bologne & Etaples, so on this journey I have been within sight both of the hospital & convalescent camps I was in.\n\nWeather is putrid.\n\nEngineers, one or two infantry & machine gunners & our four A.M.C. are in this truck – 30 all told All night it appears there were constant querulous demands to remove feet from faces & vice versa, but I spent a very good\n\nnight. This was good, for the first night from Havre to Rouen was murderous. We had a new style of truck there, about the same \nmake\n size of box (oblong) truck as this, but with seats \nround the\n along the sides & along the middle. This insured that everyone got a seat for sitting, but when it came to trying to sleep the trouble commenced. With packs under the seats, if one man laid down to sleep he took up the room of\n\nthree, for there was only just sitting room for all.\n\nAfter trying to sleep sitting up, I tried to scrape up a little from what a “dieu et mon droit\" expert had buffed from our seat. That proved worse for my feet would not keep on the narrow ledge he had left. Finally I squeezed down on to the floor between one sleeping man, some pails, & several feet. What with the restlessness of the sleeping man, (accounted\n\nfor by the fact that my ration bag, containing a hard tin of bully beef, was sticking into the small of his back), owners of the feet to my turning round their legs & resting on their feet, & the absolute rigid nature of the packs, I could sleep very little.\n\n We are supposed to be going to Hazebrouck, & it is probable\n\nThere is a rush here (now in Wimereaux station precincts) for \ntea\n hot water\n\nto make tea. At every stopping place, for however short a time, there is always a rush for hot water from the Engine, or for a wash or something, & the train never restarts without many having a sprint to catch it. Often they have to get in trucks further back, & get back to their own later.\n\n1 p.m\n\nJust moving out.\n\nGot some hot water from a billet\n\n& strolled down to the village. The ubiquitious Count captured a carnation from somewhere. Waves headquarters opposite Frome, & they gave troops some coffee. Plenty of fun between them & the soldiers. \n\nIt is cold & windy.\n\nRumours we have held Germans at captured some ground S. of Bailleau.\n\n\t\t\t10.30 p.m\n\nAfter Wimereux, to my surprise came Calais. Here the signs of the present battle were more noticeable in the trainloads of salvaged material, smashed guns, & light railway stock that passed us. Also three long hospital trains of wounded passed us. It was a constant succession of trains on the other line. \n\nCalais was a confused impression of narrow streets,dirty houses, & networks\n\nof railway tracks.\n\nAfter Calais came another stretch of fine wooded country which showed up well as the sun began to burst forth for intervals (quite an April day)\n\nNext came St Omer where stayed a long time. A batch of beautiful V.A.D nurses were seated with their baggage on the main platform waiting to be evacuated. This on account of the retreat & consequent bringing of St Omer into more frequent shell fire.\n\nAlso on the station were a few recently captured prisoners. White faced & red nosed with the cold they huddled together, & exchanged scraps of talk with our boys who crowded round them. They did not seem very downhearted, in fact, closely watching them, I detected significantly truculent glances one to another.\n\nAfter St Omer several things bought the zone nearer into realisation. Bomb holes caused by aeroplane\n\nbombs were very frequent, but in harmless areas such as open fields. A large aerodrome & motor transport dump was untouched, yet huge holes in neighbouring fields told of attempts to get it.\n\nMore significant were the neatly dug trenches we found around every hill or on the face of each ridge. These are evidently future lines of defence if all does not go well. \n\nAt St Omer we learned\n\nfrom one of the 4th Batt. that the 1st Division is the only one up here, the next being still in the Somme. They (1st) have dug in at Stragesle he told us, & also he told us the French had lost Meteren. (*Strageele! Ye Gods!)\n\nWe passed Wardreques & other places memorable in our march to the Boulogne rest area, finally detrained the St Omer side of Hazebrouch. The latter town, we were told\n\nwas a trial one usable as a railway centre because of the shelling. Considering it got a fair shower of shells when the line was back, it is natural to suppose it would be hot now.\n\nI don’t know the name of the village where we detrained, but it was between Aires & Hazebrouck. From this village we marched due south (apparently) through two other villages, to a corps reinforcement camp \n\n*The first rest camp of Australians in France on arrival from Egypt was Estrazeile. Now they are defending it.\n\n In the third range on way lay along a ridge overlooking a flat stretch & on this we observed what looked very much like the Pyramids of Egypt. They were not true Pyramids, one face being long than the other, but they showed just as prominently on the landscape as the fashion was in Egypt. What they were I could not conjecture.\n\nI am writing this in a semicircular roofed hut. We got soup & afterwards\n\ntea, so now I am ready for a comfortable night’s rest. The Count’s feet are at my head, for we are along the centre of the hut, & he is asleep. Walton is in the next hut.\n\nThe nearest front is in the direction of the station we detrained at which seems to be due North so we must be on the Southern side of the Baulleul is ahead. I am not sure of this, but cannot account for the \n\nline being in that direction any other way. Our indications of its directions are gained by the sight of \nour\n the flashes of our guns & the flashes of Fritz shrapnel quite distinct in that direction. Also, along the road, various \"walking wounded\" notices on trees, pointing in this direction (& therefore away from the line), were good indications.\n\nGood news greeted us on arrival. They say that the French have\n\n \n\nrecaptured Bailleul It seems to be official for one officer told me, & if it is, things are on the mend surely. The very light firing from the line seems to show that there has been a lull today. It freshened up at sunset, but has now died down again. It is moonlight & clear, but no German planes have come yet. Plenty of time I suppose.\n\n\t\tSaturday 20 April 9 A.M.\n\nFrom later information it appears we are a fair distance due south of Hazebrouck & nearer Merville which is a few kilos distance. This confirms the idea that we were on the southern side of the : I wonder if the powers that be are preparing to strike hard towards Merville, & so cut off or chase the retirement of the Bailleul & Keterin forces.\n\nWe are now preparing to move up the line. I\n\nunderstand we have about 15 miles to march, & it is uncertain whether our packs will be carried or not.\n\nYesterday we went along the top of this ridge, (where an icey wind was blowing) to the gas school. I did not go through the chambers but had practice in putting on the mask quickly & also were lectured by a very facetious Sergeant. \n\nOne amusing expression he used was: “all you need\n\nis common sense with gas. For instance, when you see a Fritz coming what do you do? You remember your old musketry instructions – presight in line with backsight then pull your trigger & then -- \nanoth\n a strange face in hell, another widow in Germany, & the war an hour nearer to ending!\n\n\t\t\t\t10.30 p.m\n\nStiffish march to late Divisional H.Q. found them moved. Had tea (Bully biscuits & water)\n\nin a field & then on per motor lorry to Brigade H.Q. on Caestre-Cassel road, about 2 kilos from Caestre. Here we are at present billeted in a barn. Hot tea & bread & jam tonight. Heavy guns & pretty active.\n\nOn the horizon in the ; a big red flare shows where Bailleex is burning still. Heavy shells are falling on Paestre which I hear is knocked about badly.\n\nIt is rumoured that Fritz is massing for an attack on Hazebrouck (which we came through on the lorry), to take place during the night I hope not for I am dog tired.\n\nSurprised that motor traffic should be so near the line as this is. Road still good, & houses & trees practically untouched.\n\nFrench soldiers are up this way.\n\nSunday 21 April\n\nDog tired last night, but toothache kept me awake a long time.\n\nLovely Sunday morning, clear & cool. A band is playing somewhere, & a few men from 9th Batt headquarters are drilling on the other side of the pond at the back of this barn. At present our breakfast is being cooked.\n\nHeavy bombardment last night, but the German push rumours did not materialize.\n\nGerman planes over during the night & this morning & many bombs dropped, but not near here.\n\nUnderstand the 3rd are near Castre & we are joining up about this afternoon. Civilians are still about here, & desultory motor & vehicle traffic on the road. Except for the firing of heavy guns, there is no undue prominence of war here despite the fact that we are about 6 kilos or 3 or 4 miles from the Germans.\n\n\tX\tx\tx\tx\n\nAfter writing the above I suddenly saw a red cross limber passing the entrance to our grass yard. Running after I was very surprised to find Reynolds, the postman, who was on his way to collect the mail. The 3rd, I found, were not at Caestre, but back along the cobble road (Castre Cassel) the other side of the village where the lorries landed us. This village is St Sylvester Cappel.\n\nHastily packed our kits, got permission from the Sgt at 9th Batt headquarters & started on our way. We found the 3rd a couple of hundred yards the other (Cassel) side of the village running a main-dressing station in some farm buildings alongside the road.\n\nIt was a lovely fine Sunday afternoon when we arrived back, & most of the bearers were free, so we looked up most of our friends.\n\nSnowy Eva I found in my billet, which is the upper storey of a barn – sleeping opposite me. Clongly I found round about a to up school. Vic Hall & his friends in C Section were in another part of the billet.\n\nThe 3rd have had a rough time, yet have been lucky since I left. \n\nWhen the push started in the Somme, they had to take over a further\n\npart of the line at Whytchaete in addition to the Hill 60 position. Several of our old positions, including the Verbianden point dugout where the mortors were, got a share of shelling, & the latter place was blown in.\n\nLevey, who was wounded (while I was up there), at the same place, subsequently died, & H.A.T Reynolds, who was secretary of our Literary Circle, \nwh\n was killed outright by a shell on the right of Hill 60.\n\nLater the 3rd left Vermozelle, & after two days in Caestre left for the Somme after the 1st, whom I saw on the train. They landed \nat\n near Amiens, & went through some bombing experiences, -- losing Birch of the transport who was killed, & several wounded including \nBilly Roscoe\n . Heisman of party.\n\nAfter this they returned north, & \nafte\n their train on the way to Hazebrouck\n\nran within a mile of the Germans, & in front of our own guns. They stayed in Hazebrouck at a foundry, & were shelled out. Nevertheless they got plenty of food which was found in the deserted houses. It was in Hazebrouck that Billy Roscoe was wounded.\n\nThen they came to St Sylvester Cappel where I found them on Sunday afternoon.\n\nTuesday 23 April\n\nYesterday Fritz started to shell the other end of the village with 5.9s, & then after tea got in to the village proper & hit some buildings. He shelled at about five minute intervals \n\nThe result was that we had some civilian patients: one old woman with a broken leg, & a young girl.\n\nThe worst side of it, however, was the evacuation\n\nof the town by civilians which followed the shelling It was a cold evening & a drizzle was beginning to fall when the line of women children & old men began to pass our gate-in-the-hedge.\n\nThe huge piles of stuff on old fashioned wheelbarrows, which the old men had to carry, was a \nwonder\n pitiful sight. That they could carry them far was a wonder.\n\nThen there were women\n\nwith loaded perambulators, & a younger unfit man with a loaded byke, & a fair number of children all of whom, down to mere toddlers, were called upon to carry something.\n\nCol. Cade went up to the village & \nbrought\n caused Dave Rees to carry back a youngster with pleurisy. When I saw them the mother was following the Colonel & she was on the verge of tears. A younger girl, evidently a sister of about\n","2":" years, was sobbing loudly despite the Colonel’s attempts to soothe her with sympathetic tut! tut!s\n\nApparently he (the boy) had been too ill to start on the long journey away from home, & the danger of keeping him in the village must have broken the family up. Even after the Col. Solved the difficulty, their own future remained in doubt.\n\nWe evacuated all civilian wounded\n\nby motor ambulance, & in some cases the family as well.\n\nHow can I write what I felt when I saw the pitiful sight of those poor people in the dangers of shell fire, & the desolateness of leaving their homes.\n\nX x\n\nNews has just arrived that B Section (my own) is to be prepared to move at a moment’s notice. I have been expecting that \nfor\n to happen since I arrived\n\nback.\n\nIt probably means that we go up into the forward area for stretcher bearing. The weather is good, & Fritz has seemed a bit quieter today.\n\nLast night one of our battalions had a stunt on, & were successful I believe.\n\nLater\n\nNo orders to move off have arrived yet.\n\nHeavy firing has broken out in the direction\n\nof Meteren, including participation by the heavies.\n\nVarious accounts have been given for this:\n\n(1) Batt hop over with the French.\n\n(2) Fritz attacking Kennel.\n\nPossibly we shall be sent for later. The sooner we are into it the better as for us I am concerned. Waiting for orders is always worse than going up itself.\n\nSome shells have been dropping near –\n\nduring the afternoon, but quite a number of them were duds.\n\nVic Hall has got a new stunt on now. He is studying the Sloan Duployan Shorthand system, & has already sent in papers for examining on the first part.\n\nOtherwise, as is natural the circle is very quiet. It will probably not be possible to re-continue the side lines till after the battle.\n\nPersonally I would welcome a debate to take my mind of the everlasting topic of “Will Fritz break through?\"\n\nMost people seem to agree that the English papers just now are too silly for words.\n\nWednesday 24 April ‘18\n\nLast night we slept in full dress expecting a call up theme, but it never came.\n\nInstead Fritz came over with swarms of planes & bombed the whole district for hours. It was very late before I got to sleep. \n\nThe stunt we heard of came off. Some of our chaps attacked Meteren, but, although they gained some ground, it is uncertain if they took the village. I fancy not.\n\nFelt very “anyhow\" this morning owing to the rough night, & a dose of “jerks\" did little to improve matters. At present we are still standing by, so I expect we may be called up at any moment.\n\nLater\n\nThe somewhat misty morning has cleared, and it is now a fine Spring evening. It is good for planes, yet at the same time it is a calm & peaceful evening, & makes me almost forget war\n\nI went for a quiet walk in the late evening sunshine through the fields of young green crops. Despite the heavy bombardment going on in the direction of Meteren my thoughts were turned successfully to Rita, & to spiritual ascendency over material dumps which Christianity gives one. This last onset to the line has made me long more than ever before to be back with Rita, more especially in view of the fact that I have just \n\nreceived these letters & photographs. I simply must get back there as soon as I possibly can, for \nthis\n now that it is almost 3 years since I left I feel I have earned a return to Rita. It is a return of that feeling I used to get at Guy Farcoles & Dorrigo, when I was just beginning to realise I loved Rita.\n\nIt is in God’s hands, & whatever the issue, the mere fact of placing implicit faith in the will\n\nof God is a great relief to one.\n\nWith increased visibility this evening, there was a great increase in gunfire. He put a few more shells into St Sylvester Cappel (just near us) at intervals this evening. One shot \ngot\n hit the church & went clean through the roof & out of the side towards us. It may be necessary from a military standpoint to take no risks, but I am almost sure the steeple\n\nof this church is useless for observation, & not used anyhow. Fritz seems to make aim at the churches before all else. Our old candle-stick steepled church at Caestre, is reported to have been smashed up. The dressing station in Caestre must be in rather a dangerous position. To think of that road from Fletre to Meteren over which Grey & I walked last winter (not long ago)\n\nShould be under direct machine-gun fire!\n\nHave discovered that the pyramid-like objects noticed \nnot\n from Arie, are the coal fields of Bethune.\n\nFriday. 26 April\n\nYesterday was Anzac day, and it was celebrated here in the morning by a good dinner of mashed potatoes & roast meat, in the afternoon by a Rugby match – Anzacs versus the Poms – which \n\nthe latter won.\n\nThe Anzacs, or those who were on the Peninsular, came in for a great deal of chaff from the “banditers\", concerning their\"old eyes & war weariness\".\n\nBy virtue of the latest order, any man who was at Lemnos or on lines of communication in Egypt while the Peninsular fighting was going on is entitled to put A up over their unit colours,\n\nWhich in our case are oblong chocolate coloured pieces of cloth. Originally the idea was that they were for the landing, Lone Pine, & evacuation only. Then came the actual seal of was at Anzac, only, & lastly the Order which heaps a large number of men into the privileged A wearing class.\n\nThe Divisional train camped nearby invited the 3rd to \n\nan Anzac night concert,but shortage of music & artists made it necessary for an eleventh hour help from us, which ended in our contributing half the programme.\n\nDowning – the wiry ragtime & popular song singer who returned to the unit in \nour\n my absence, was the hit of the evening.\n\nI gave a couple of recitations & accompanied\n\nBill Drew & some of their singers.\n\nThe programme was extremely varied, was well received, and took from 8 pm to about 9.30 or 10 p.m. At that time Fritz planes should have been over, but owing perhaps to the slight clouds & mist, he did not come, thank goodness.\n\nAn observation balloon was tried from a neighbouring field\n\nyesterday evening, & would probably have been up today but for the fact that it is very misty & bad for observing.\n\nWhen it is sent up I can imagine we shall get some shrapnel round here, for we are directly behind & very near it.\n\nFrom what an old","3":" Field Amb man (now with","4":" Field Unit) told me today when he was on his way through as a gas patient, the\n\nbearing up the line here, is “no boon\". They get a lot of shelling both in the truck & in their farmhouse dressing stations, & also some machinegun fire. Therefore we must consider ourselves as lucky in having been kept on the margin instead of having had to go up bearing. Yet the suspense, & the uncertain feeling arising from bombs & stray shells is almost\n\nas bad I should think.\n\nSpiritually, the anxious days have brought me nearer to bed-rock. At present I am discovering that the imperfect beginnings of spiritual communion with God have the effect of making me feel more fear than I probably would otherwise have done. Yet I am sure that in the true test, the strong help I have obtained will be\n\nmanifest. So far even I have been impressed how when one understands the meaning of “in God’s hands\", \nwhat\n a very real and world transcending help can be obtained. Particularly if I am to be spared, I want the effect of what I have learned, to flow when peace time comfort comes again, & not as is more natural, decrease.\n\nI had a chat to F.O. Grey today (the\n\nbig Grey’s brother), & whilst impressing him with the fact that I had embraced Christianity (as I imagine), we seemed to touch mutually evident truths in our conversation. He is a seeker after Truth I feel sure, & as a man is fine.\n\n \n","5":" Aril\n\nMisty, inclined to rain, on which account the kite balloon has again not been hoisted. In the morning we had a route march, & some practice in bandaging broken thighs.\n\nIn the afternoon I intended to go to the church in the little village, to play the organ, as, before the shelling, Capt Griese had spoken to me about it. Found the village almost deserted, but one or two\n\ngirls in best black clothes \npast\n passed me --\n\nChurch was locked, & when I went to enquire of a French soldier, for the caretaker, my quest was diverted. He saw the red cross on my arm & asked me to attend a wounded man in the cottage. No shells had fallen lately, so I wondered.\n\nFound a crippled civilian suffering from a revolver shot wound on the finger. They told\n","6":" he had killed an Australian soldier who came looting in the previous night, & accidentally had shot himself.\n\nPoor fellow, it preyed on his mind, although his crippled condition (by the war) & general helplessness, almost justified it if not fully.\n\nGave up the idea of playing the organ, & took him with his escort (the French soldier) back to our dressing station.\n\nHis sister in black came part of the way with him. Afterwards he was to go to St Omar for a formal trial.\n\nA wet evening & still no planes on account of mistiness.\n\nIt seems that Fritz has got Kemmel. Yet we are putting up a good defence. May it hold!\n","7":"\n\nRoute march in morning. Watched socker match in \nmorning\n afternoon between our team & that of the the erection balloon staff. Our chaps were all over them! Speculation in billet afterwards, on the composition of our team --- \nmos\n all English-Australian.\n\nIn the evening a terrific bombardment started which seemed to be in the direction of Kemmel first but spread to the front opposite here – Meteren.\n\nIt was the loudest that I have heard since we came here, & some shells fell pretty near. It lasted all through the night & slackened off at about 7 a.m. Our heavies seemed to have affair amount to say in affairs. Luckily I did not have much trouble in getting to sleep. To try to sleep when bombs & shells are falling any where near is awful.\n\nWe had a service in the evacuation hut \n\nat seven oclock, & McIlroy gave a very definite & strong sermon which was most unappealing to me.\n\nMonday 29 April\n\nRoute march & physical jerks in the morning. \n\nWent on leave with D’Arcy Dickson & Rogers (the fourth & last occupant of our barbers shop at Sec Bois) to Cassel at about 1 oclock. \n\nGot a lift in by means of a Flying Corps car. Saw where shells had\n\nfallen near the town.\n\nWe went right up to the top of the hill on arrival. Cassel is of course on a fairly high hill which is part of the Remarel Mt des Cats ridge.\n\nAt the top we found a Chateau & Casino now converted for military use. This was reached by a kind of rustic pleasure garden.\n\nWe looked over\n\nthe panomaric view of the flat country all around, & , but for the mist, would probably have seen quite ten miles all around. As it was we could make out Mt des Cats, a vague Kemmel, Hazebrouck, Steenvorde, & small villages scattered round.\n\nIt was wonderful to see the perfectly straight roads radiating from the hill. It reminded me somewhat of Box Hill\n\nDorking as far as the hill was concerned, but the flat country & poplar lined straight roads were without parallel in my experience.\n\nWe exposed a kind of underground vault which had a small opening on the extreme end of each side wall. These led to identical narrow passages ending in nothing but wall. On one side of each were bricked up arch tunnels.\n\nHad a meal of fried (alleged) beef, & roast potatoes which cost the dear price of 13 francs each.\n\nAfter mooning round the narrow streets, &’ meeting a lady whom I had met in one of the Caestre refugee shops last October (she did not know what had become of Mdme Van Uxem) we left, & had to walk all the way back.\n\nFritz was shelling\n\nSteenvorde regularly, as we walked home, with big high explosive shells. Judging by the shell holes, the stuff he has been putting over here lately is very big --- 12 inch or so I should imagine.\n\nReceived news on arrival back that B section is again standing to, more anxiety! Would rather it were definite news to go up I think!\n\nThe mist & clouds have entirely cleared away & now the sky & air are perfectly clear. That means at least a raid by Gothas tonight I feel pretty confident though, for I have perfect trust in God whose connection with this war is now quite plain to me. Ever since I came away, even at times when it seemed to me that I should not go to the \n\nfront again, I have had a subconscious feeling that worse was to come, & I now feel that the Supreme & last ordeal is before me, & it will soon be over.\n\nI pray that it will be God’s will for me to be spared, but am quite resigned in any case.\n\nTuesday\n\nLine this afternoon.\n\nNow in charge of a squad.\n","8":"\n\nRoute march in morning\n\nDuring afternoon I watched a socker match between our team & that of observation balloon.\n\nReceived another letter & 3 more photographs from Rita yesterday in a Cheery letter from her Much comforted.\n\nTonight a terrific bombardment has been in progress. Seems to be in direction of Kemmel.\n\nOh this uncertainty!\n\nYet we are better than the \n\n"}}