{"Document Name":{"0":"Diary_0017","1":"Diary_0017","2":"Diary_0017","3":"Diary_0017","4":"Diary_0017","5":"Diary_0017","6":"Diary_0017","7":"Diary_0017","8":"Diary_0017","9":"Diary_0017","10":"Diary_0017","11":"Diary_0017","12":"Diary_0017","13":"Diary_0017","14":"Diary_0017","15":"Diary_0017","16":"Diary_0017","17":"Diary_0017","18":"Diary_0017","19":"Diary_0017","20":"Diary_0017","21":"Diary_0017","22":"Diary_0017","23":"Diary_0017","24":"Diary_0017","25":"Diary_0017","26":"Diary_0017","27":"Diary_0017","28":"Diary_0017","29":"Diary_0017","30":"Diary_0017","31":"Diary_0017","32":"Diary_0017","33":"Diary_0017","34":"Diary_0017","35":"Diary_0017","36":"Diary_0017","37":"Diary_0017","38":"Diary_0017","39":"Diary_0017","40":"Diary_0017","41":"Diary_0017"},"Date":{"0":"unknown","1":952.0,"2":953.0,"3":954.0,"4":955.0,"5":956.0,"6":957.0,"7":958.0,"8":959.0,"9":960.0,"10":961.0,"11":962.0,"12":963.0,"13":964.0,"14":965.0,"15":966.0,"16":967.0,"17":968.0,"18":969.0,"19":970.0,"20":971.0,"21":972.0,"22":973.0,"23":974.0,"24":975.0,"25":976.0,"26":977.0,"27":978.0,"28":979.0,"29":980.0,"30":981.0,"31":982.0,"32":983.0,"33":984.0,"34":985.0,"35":986.0,"36":987.0,"37":988.0,"38":989.0,"39":990.0,"40":992.0,"41":993.0},"Entry":{"0":"\n\nWhen day broke we could see what position we were in & our line was adjusted accordingly. We worked like niggers till about 9 oclock, then we had a look around to see what damage had been done, dead men were lying all over the place both ours & German’s, & the boys were hunting the Hun’s like terriers do rats from the ruins of the village they were hiding in the old walls & cellars they quickly accounted for all those above ground & I need scarcely say that very few of them were taken prisoners, the bayonet was the \n\nweapon chiefly used.\n\nWhat do you think of this & its quite true 2 of our chaps fought 10 German & killed the lot of them, one of our chaps the very first German he stuck, his bayonet broke off & he used the butt end of his rifle & smashed 4 of their heads in.\n\nAnother funny little incident happened, during the charge to a mate of mine, he got stuck in the barb wire & while trying to free himself a big German came out of the trench & wanted to surrender my mate did not know what to do for the fire was very hot & bullets were dropping all around him & he reckoned that once the German\n\nknew he was fast he would shoot him, so he decided to take no chances & shot him dead. I reckon he done the right thing.\n\nYou have no idea how fierce & ferocious the boys are once they taste blood, I believe they would charge into Hell itself once they got going quite a number of them were killed with our own guns through being too impetuous for they even tried to rush through our own curtain fire to get at the Germans on the other side of it, & as true as I value my life the Germans were absolutely terrified by the fierceness of the boys charge, all the prisoners that we get say the same thing, they have a\n\na very healthy respect for us & from what I have seen of them 1 Turk is worth 2 of them as far as hand to hand fighting goes, you want to take your boots off if you want to catch them once they are driven from their trenches, for they run like atheletes from what I have seen of them they are a miserable ragged looking lot with a few fine men here & there among them.\n\nThere were any amount of fun to be had bombing them out of the cellars & dugouts, we used to throw smoke bombs in first that would drive them out: you ought to hear them singing out \"Mercy Kamerad\" when they knew they were discovered\n\nbut very little quarter was given & none asked for, they were shot as fast as they came out.\n\nAbout 10 oclock a stand to was ordered for we could see Germans in the distance massing for a counter attack but our guns promptly took all that out of their heads, about 60 of them reached the fringe of the wood, & there they were scattered by our machine gun & rifle fire you should have seen the boys standing up & shouting to the oncoming German’s urging them on & promising them something when they reached our trenches, which happily for them they did not do we got all these men later in\n\nthe day, by nightfall we had nearly 200 prisoners & our booty consisted of 8 guns, (5 big howitzers & 3 field guns) & thousands of shells. I don’t know how many machine guns we captured, but we are using one or two of the best against them & we have I might say thousands of their rifles. A party from our Battalion marched nearly a 100 of them into Albert, the Tommies nearly went frantic with delight when they heard of the success of the Australians they regard us as marvels, they had failed twice in their attacks on the wood & village & we took it first time, we had a good reputation before but Australia’s name stands higher\n\nto day than ever it did before. \n\nAll day long there was scarcely a big gun fired, it was unaturally quiet, but we had no idea of the frightful storm of shell that was shortly to follow & nearly wipe us out Just before dinner the Colonel came round he was as pleased as Punch & his usually stern face had a broad smile on it he had a bit of a yarn to Jock Mackie & I we were sitting on top of the trench sunning ourselves, he reckoned we had done wonderfully well & was delighted with the boy’s\n\nWe were not deceived by the quietness of things, for we worked all day long putting in fire steps &\n\nimproving our communication trenches for we knew old Fritz would not take it lying down, everyone was also scouring the country about looking for the dead & wounded of which I am sorry to say there was a terrible lot, quite a number of the old hands were killed including Sergt Howarth Corp. Howarth 2 brothers, they are an unlucky family for the 3 of them have been killed now, the other one was killed on Gallopoli, they were fine fellows Paddy Stevens, Tom Waugh, & several others of the few remaining originals were also killed there are 7 of us only left now in C. Coy. now, one or two more such battles & we will\n\nbe no more.\n\nTo night we advanced our trenches to the other side of the \"Pozeries\" wood Some of our chaps got some bonzer trophies, Zeiss glasses watches, rings, compassis, revolvers & etc & helmets by the thousand. \n\nThis afternoon we got 15 German Red Cross prisoners, they were marched down & searched & 13 of the dogs were found to be carrying daggers & revolvers they promptly put against the wall & finished.\n\n","1":" Things were fairly quiet last night, but at 6 oclock exactly this morning the expected storm broke, not as we expect with, whizz bangs & 6 in.\n\nbut 9.2 & 12 inchers, the first hour or two was mostly spent in getting the range, once they got it they made the pace a welter, they would frighten the bravest man on earth I’ll bet these enormous great shells, they sound just like an express train rushing through the air, & when they explode it is more like a ton of dynamite exploding, you can see them real plain sailing through the air on their frightful mission & every one holds their breath & grip themselves for the frightful concussion that arises from explosion of these monsters, they throw earth & stone, & men too\n\nor rather what is left of them to a height of easily 300 feet. words fail to make anyone understand, the terrible power possessed by these engines of destruction, about 3 oclock in the afternoon the bombardment reached the climax, the air sounded with one continuous whistle & roar from the big shells that were streaming through it, yes, in thousands. I stood with my watch in hand & counted in 5 minutes no less than 75 shells lob on an area no bigger than 4 acres, & not one of them was under a 9.2 & some were up to\n\n15 in. All day long the ground rocked & swayed backwards & forwards from the concussion of this frightful bombardment, it put me in mind of being on top of a well built haystack & swaying it about, thats how the ground behaved, any amount of men were driven stark staring mad & more than one of them rushed out of the trench, over towards the German’s, any amount of them could be seen crying & sobbing like children their nerves completely gone, how on earth we stood it God alone knows, we were nearly all in a state of silliness & half dazed\n\nbut still the Australians refused to give ground, men were being buried by the dozen, but were frantically dug out again some dead & some alive, one big shell killed & buried no less than 15 men, they were afterwards pulled out in pieces, torn to ribbons & another 15 incher accounted for no less than 40 men you might think I am exaggerating it, but as I said before you have no idea what it is like I am certain they tried to break the Australians heart completely, they say it was one of the fiercest bombardments that has ever taken place\n\non the Western front, by nightfall the trenches had practically ceased to exist. Pozieres\" Wood & village was an onion bed for the earth was that torn & shattered, still they kept an unceasing fire up. I had a marvellous escape from being blown to atoms in here, I was crouched on the fire step when 2, 9.2 lobbed right in front of the parapet they dug right in pushing the earth & me right off the firing step & most wonderful to say neither of them exploded, I thought then that surely there must be some Providence watching over me for it was a\n\nmost marvellous escape for so very few of these big shells are duds, they not only shot every size shell they had at us but we also had to face the gas & tear shell which they plastered on to us, & on top of that again the liquid fire shell was showered on us Hell was no name for it, but even this tornado of fire failed to move our chaps About 7 oclock they evidently thought every man was killed & they were not very far out, but still when the Prussian Guards changed they got the shock of their lives for they got cut to ribbons & the few remaining\n\nAustralians actually hopped out after them with the bayonet, we took a few of them prisoners.\n\nWe were relieved this evening by the 2nd Bde. & if ever men were glad to get out of such a death trap well we were, but we had to run the gauntlet of fire all the way down the communication trench for the Germans were shelling it like mad, their object of course was to prevent any help reaching us & so we would be cut off, here & there the trenches were very shallow & we had to make short rushes over them, even then we lost a few men coming down, as each man left the firing line he\n\ntook a German rifle with him \n\nThat night we lay in supports but sleep was impossible for the unceasing roar of the guns, we were constantly digging one another out for they were shelling every thing that they thought would hold or be sheltering men even the gullies were searched with shrapnel & they killed hundreds in them for supplies had to be kept up by hook or by crook\n\nWe were using some 16 inch guns & they fairly roared above the noise of all as they sped on their errand they were lobbing them about 600 yards in front of us & huge pieces of shell would fly back over our heads & bury themselves\n\ndeep in the ground one such piece just grazed my head, a very close shave \n\nWhile all this was going on an aeroplane flew pretty low down over us & blew the cock-a-doodle-do on her horn again & again this sort of cheered us up.\n\nWe had a fine tea tonight just before we left the firing line the cooks brought it up as much steak & bacon as you could eat & to spare, tea, boiled potatoes & onions mashed together, this was the first square meal we had for some days & we enjoyed it.\n\nIts wonderful how they kept the supply of food up to us during this fearful bombardment.\n\n25th The bombardment continued all night & never let up as yet, I had a terrible narrow shave & shock early this morning, myself & Bob Creasy were lying in 2 dugouts almost touching one another I was almost asleap, & was dreaming of home, when all of a sudden a terrific roar & I found myself all dazed lying in the trench a shell had exploded without a lie not 5 ft from my head but just above it, it wounded poor Bob Creasy I bandaged him up he was hit in the head, chest, & nose I think he will get over it alright.\n\nI think the shelling is even worse today than yesterday\n\nfor they are covering the whole area with shells of every calibre.\n\nI had a most dangerous piece of work to do with a party this morning it was cleaning out the communication trench for the Germans were still playing on it & every here & there it was blown right in & traffic was getting dangerous, however we got it finished in about 3 hours all under heavy shell fire.\n\nWhat a lot of brothers this stunt parted Howarth’s Manton’s, Hydes, Benning’s Sharp’s, & several others it is a certainty that either Len or I would have been killed had he been here, you don’t know how pleased I was at him,\n\nbeing away, I reckon it is a great mistake brothers being in the same Battalion for one is constantly worrying about the other.\n\nOur chaps made another charge today & cleared the Germans from another trench, they still continue to come in, one fellow they questioned reckoned Germany had control of the seas & that England was nearly done, they reckoned that Germany would win in August I saw plenty of their black bread & tasted it, it is sour & heavy to the taste I would not care to eat it at any rate.\n\nThe dreadful fire slackened down a lot tonight thank God\n\n& if we are going to be relieved by the 2nd Division I don’t envy them their job, they wont have it quite so hard as us for we had to take the position & consolidate it.\n\n26th. Last night about 11 oclock we filed out & I think everyone breathed a silent prayer when they got clear of it, I know I did for I never expected to come out alive the 17th Battalion relieved us, when we got out to the Gordon dump our cooks had hot stew & tea waiting for us how we enjoyed it, God alone knows what a relief it was to us to be out in the clear ground again & among the light; & men.\n\nWe were about an hour here & then we moved on again, we marched about 3 miles & nearly into Albert & bivouacked out on an open piece of ground for the night we just simply threw ourselves down & slept as we were, &, to many of us it was the first time we had closed our eyes for 6 nights so you can imagine how we looked We rose when we liked next morning & had a good breakfast\n\n27th. That day we rested except for a few fatigue parties, one of which had to go to the firing line they were pretty stiff, for it was a very long walk.\n\nI went down to Albert & search\n\ned all over the place for a suitable book to continue the diary in but you have a job to get any other sort but this, all French note paper is ruled like this too.\n\nDuring the day some English correspondents visited us & collected a lot of experiences from the boy’s we also had the moving picture man he snapped what was left of the Battalion, just as we were all laying on the ground a lot of them were wearing German helmets & caps, afterwards he got all the boys with the helmets & caps in a group with a captured German machine gun & took a slide of them, all holding up\n\ntheir hands like the Germans do when we get up to them the squibs its grand to be an Australian Some English officers also took snaps of us for the papers.\n\nThe Colonel lined us all up & for the first time in his life he reckoned we had done a marvellous thing how he praised us up, he said we had now by taking this \"Pozieres Wood\" after the English had twice failed to take it covered ourselves & Australia with glory, & we had upheld the old Gallopoli reputation in the grandest of possible way & have quite settled the old favorite argument of a lot of \n\ncritics that we could not stand heavy shell fire.\n\nThis famed Pozieres\" Wood was a stumbling block in the way of our advance & had to be taken somehow so thats how they decided to give us a chance to prove ourselves, to look at it, it is nothing more than a straggling line of trees all stripped of every leaf & branch they might have once possessed by the torrent of shells that had been poured into it, there was an odd orchard scattered about it & a small village or two in it, the German line ran round the edge of it, & inside it was all trenches & guns, a most formidable thing\n\nto tackle, the night of the charge the whole horizon was lit with the flame from the bursting shells & the air was charged with the sweet smelling Lachromatry or tear gas, & also heavy with a sort of cholorform, a most uncanny state of affairs but it made no impression on us Kangaroo’s\n\nThe roll was called out here & we had 350 left out of 1100 men who went into action myself & another Corporal were the only two N.C.O’s left in our Platoon, while some of them had only a Lance Jack in charge, 6 officers were left, so we had lost our share but the 5th Batt. suffered even worse than we did for only\n\n7 officers & 128 men turned up at the muster some going eh, we had lost the 2nd heaviest then the 3rd Batt. next the others had all lost heavily too. While here some of us went up & had a look at the 75’s who were pretty close to us, as soon as we got there some French officers got hold of us the first thing they said, Anzac Bon\" Australia bon\" plenty Australia finish Allemand\" they showed us all round their little beauties & how they worked, the gun itself looks an insignificant little thing you could almost pick it up & throw it over it looks that frail & innocent but only those who have had to face their fire know what a\n\nmurderous & merciless thing it is the French undoubtedly think the Australians are marvels, what a name our glorious land has it is spoken of over here as a sort of mysterious place & anything is likely to spring from it. As we pass through their villages the French people all come out & have a peep at us, I expect they think we are a rum lot by the way we stroll along for you could scarcely call it a march, for the boys march anyhow, they please themselves.\n\n27th. Last night we left the camp near Albert & marched a little way to the other side of it, here we camped for the day, in the evening the 6th Bde marched past us & camped in the \n","2":" paddock, what a fine lot of men they looked. as they marched past us, & us all ragged, unshaven, for you know we had not even our razors or towels since we left Warloy, & had been through all the toil hardships smoke & dust of a most tremendous battle, & had tasted the joys & exhilaration of victory, I can assure you that will make men do almost any thing it is a fine sensation to be flushed with victory especially when you can say that you have taken a good part in it yourself men fighting with the confidence of the Australians will accomplish almost anything nothing seems impossible to one at such a time\n\nthis charge made the","3":" one that I have been in thats a pretty good record & not many can beat it I surely can’t go any further without getting a smack of some sort or other, it seems impossible I saw Harry Kelly here, he is the Battalion bombers of the","4":" Batt. had a good long yarn with him he looks alright, they were on their way up to Pozieres\" to have a smack at our friends, one German when he came in wanted to know who we were for he said he knew we were not English, for he said English bombard, & then charge but we bombard & charge at the same time, & so we did;\n","5":" Last night we left this camp it was a very hot day one of the hottest I have felt in France, we had a good long march but it is more of a pleasure than anything else in France for the country is so beautiful we pass through, all the crops are scarlet & blue with poppies & a pretty little flower about the same size as a carnation & here & there we march through an archway of beautiful beach trees that completely shut the sun out it is a most beautiful country. everyone was very tired as we got towards Warloy, here we saw the","6":" Brigade they are camped in the village our camp\n\nlay a couple of miles beyond this on top of a hill, it is a small forest where we pulled up & big canvas shelters have been erected for the troops hardly any sun penetrates this beautiful place & great big trees are everywhere, we have no trees as green in Australia as the trees grow here, they are more like a hop field of enormous poles & there is scarcely a limb on them for nearly 40 ft up, they spread out umberella fashion, they are a sight once seen never forgotten \n\nIt was about 9 o’clock when we arrived here, & shortly afterwards we had tea & went to bed, soon all were asleep thoroughly tired out.\n","7":" Last night some reinforcements arrived the old Colonel blew them up properly for something or other, & he told them that it was only discipline that made the Australians the finest soldiers in the world, he told them to buck up & get ready for the next turn out which was not very far off \n\nGeneral Smythe had a look at us as we marched along yesterday he was very pleased for he was smiling a most unusual thing with him he rarely speaks, they call him \"Silent Smythe\".\n\nGeneral Birdwood was here this afternoon, the boys crowded round him like children do round their mother he had a good long yarn\n\nwith us about our recent battle he reckoned we had one splendidly & he said he was well pleased with us & we would soon have another opportunity of coming to grips with them, he told us that our guns had knocked out the battery of big guns that had caused us such a lot of casualities, & 7 other batteries besides, according to him the Germans are bringing all their heavy artillery from Verdun to here, so he must think things are getting serious on the Somme\" from our most advanced trenches you can see behind the German lines for miles, so you can guess it is a pretty important\n\nposition, & they done their damn’dest to blow us completely out.\n\nThere was an issue of clean shirts & socks this evening, & they were badly wanted for we were all as lousy as could be & filthy dirty, for we had not had a change of clothing for nearly a month, & our boots had not been off our feet for nearly 10 days \n\nWhat do you think of this for gameness a poor chap was being carried out on a motor, his leg was smashed, both arms broken, & he had a nasty cut on his head, yet when he passed a lot of us he said; what do you think of this walk in & get carried out in motor cars a lot of men would have turned\n\nit in right away, but our chaps are fighters in every sense of the word\n\nIn this battle I had more narrow escapes than all the others put together one bullet cut my puttee nearly in half & just grazed the skin I was saved 3 times by my steel helmet & had 2 holes in my equipment good enough wasn’t it.\n\nWe moved from our billets this \nmorning\n evening, & had a stiff","8":" miles, down a hard metal road didn’t our feet ache, & when we reached our destination we were dog tired.\n","9":" This morning we moved off again, it was very hot & the sun fairly beamed down\n\non us, about a mile further on we passed through a complete tunnel of trees made by the trees planted on either side, & they had completely overlapped one another in the middle it was nicely trimmed & not a ray of sun penetrated this canopy of leaves, it was nearly ½ a mile in length & lovely & cool.\n\nThe march this morning was a very fierce one, we were unlucky for we had to march with full pack up & the other Battalions were in marching order & some in battle-order, the distance was a little over 9 miles & the boy’s were as near done as it is possible for men to be, they just simply threw themselves\n\ndown thoroughly exhausted, from where I am writing this it is a lovely little spot I am sitting under a lovely plum tree in a grassy orchard & the shade is bonzer, the name of this little village is Bonneville\" This afternoon I & a few more went looking for a little creek about a mile from here, so as we could have a wash we found it after a little while By jove it was bonzer nearly ice cold, there were a lot of Tommies there, & they reckoned the water was icy cold, & wouldn’t strip off & go in, but we lost no time about diving into it, they were surprised for they thought us being Australians we could \n\nnot stand cold water.\n\nOn the way back we went in & had a look at a pretty little church She was built in 1418.\n\nOne of our motor lorries picked us up & gave us a lift back to our village which was very welcome General Birdwood told the boys the other day that he thought the","10":" Battalion one of the finest he has got without any exception. I believe General Smythe gave the 3rd Battalion a good talking to over so many of their men leaving the trenches when the heavy shell fire was on, a lot of the 11th Battalion also squbbed it, our Colonel took nearly\n\na Company of them back to their position these were the only 2 that showed the white feather. \n\nThere is a rumour going about to night that the","11":" Division have advanced nearly a mile, I would not be surprised for we cracked the nut that was so hard\n\nJock Mackie, Howard, & I went for a little stroll round the pretty little village this evening, & made a few purchases.\n\nWe are having lovely weather at the present time nice & hot.\n\n30th. Fairly liberal scale of rations this morning, we live pretty well take it all round, though at times we have to do a starve\n\nThis little incident has just come to my memory, it was a 3rd Battalion officer, who when his dearest friend was killed alongside him, took an oath that he would chop every Germans head off he came across, the tool he selected to do this with was one of their own heavy steel bayonets, & he carried out his oath to some purpose nothing was to hot for him & he was everywhere when last I saw him he was covered with blood & going strong, he must have killed scores\n\nThere are scores of transport waggons rumbling through the quiet little village this morning, most of them loaded with hay bully beef, biscuits, oats tarpaulins meat & etc all bound\n\nfor the firing line & every now & again a quaint old French waggon passes by loaded with hay, or sticks for the winters fire, these old peaseants look very funny in their baggy cord trousers & big wide straw hats nearly 3 feet across the top.\n\nPay day & the boys are drawing fair amounts from 40 francs & upwards not bad for a fortnight\n\nThere is scarcely a tank used in this part of France for catching the rain water everyone uses a pump & there is one at every house, & the water is always ice cold\n\nOn the move again this morning it was a frightfully hot & trying march of about 6 miles for \n\nyou know it is summer time here & the middle of the day is very warm especially when you are marching & carrying everything you possess, & the dust kicked up by the troops nearly chokes you, Saw some beautiful crops of wheat round this part, they were a picture Halloy where we are billeted is the same as most of the little French towns, very pretty but I fancy this a prettier one than most of them, there is a nice little stream running through her, & a very fine chateau & beautiful green trees line the roads & stream, & flowers, flowers, every where especially rose’s\n\n \n\nLast night all estaminets; were placed out of bounds to British troops till the\n\n10th of August. the boys are going crook over it, but I’ll bet they find some way to get the beer, unknown to the authorities Just before dinner some of us went down to the little river, & had a good swim the water was icy cold but it was beautiful all the same the reason why it is so cold is that it is fed from the Alps, & the snow from Alsace & the mountains there abouts she runs fairly fast, & is a dark blue color there are plenty of fish in her too.\n\nThese few lines which the boys often sing get the Light Horse\n\nnearly mad, they are a useless lot alright only good for M.P.s or as they boys call them Mothers Pride\" These are the lines.\n\nThe A.I.F. are in the lines\n\nThe A.F.A behind them\n\nBut when we look for the – Light Horse\n\nI’m – if we can find them.\n\nThere is great rivalry between the Infantry & Light Horse, they at one time reckoned they were a superior class of men to the Infantry but Gallopoli knocked that nonsence out of their swollen heads & now they hardly dare show themselves much less brag about their doings, for the Infantry have made their name in Gallopoli & France now\n\n31st. Last night a most wonderful thing happened to me a messenger came down & said that Capt Mackenzie wanted to see me I thought at the time that it was something about my second stripe he wanted, but when I got to him he told me the Colonel wanted to see me at Headquarters at once, what on earth is the matter now I thought; as I went round, arrived there I reported at once & the Colonel told me to wait a little & he would see me, there was another chap waiting there also & he had been sent round for the same as I had after a little time the Adjutant came outside & called me in, I entered\n\n& saluted the Colonel, there was only the Major Adjutant & himself there, he started to question me, & I was wondering what on earth he was driving at, when he had finished, he asked me if I would care to enter an Officers Training School\" I nearly fell through the floor, as you may imagine, I thanked him for the offer & accepted it. \n\nWhat do you think of that for luck When he had finished he said to the Major put him down for 3 months training I was then dismissed, just imagine my feelings if you can at the prospect of a rise like this, I seemed to be walking on air, I never dreamed of getting so high, & I made up my mind there & then that if I was \n\naccepted I would leave no stone unturned to make it a success, & all going well I will carry it out properly I am pretty well sure Capt Mackenzie has a lot to do with it, if ever a change has come over a man as regards treatment to me well it has come over him, he had an awful down on me once, for I used to speak pretty straight to him & straight off my chest at that, he done all in his power to get both Len & I chucked out of the Battalion just before leaving for France & only for an officer or two who knew us he would have succeded, but now things have entirely changed & he thinks the world of me I am sure I done him a good turn on the night\n\nof the great charge at Pozeries\" & I think he is now trying to make amends Some one must have told him some terrible lies about us I would like to find out where it came from.\n\nAnother thing I am sure the Colonel noticed himself was a pretty dangerous job I had charge of & had to stand up & expose myself to a Hellish shell fire that was raging at the time, as he came along he spoke a few words to me, I fancy he remembered this, & thought he would do me a good turn.\n\nHowever there must be something in it somewhere for just imagine me an obscure Lance Corporal jumping over their heads like that.\n\nThe boys are all wondering what is the matter for I have been sent for 2 or 3 times to Hqrs to day, & several signallers have been round to me with message’s I do hope it gets through This morning we had physical exercise & a short parade after it, & then finish for the day. It is very hot this afternoon & there is not a breeze blowing a leaf about\n\nThis afternoon I had charge of a fatigue party down at Headquarters I had to check all the wounded packs & see that they were correct a pretty tiresome job to have anything to do with at all, for you have to be so careful about them & see that no mistakes creep in.\n\nI finished this about 8 in the evening A lot of Scottish regiments passed through here this evening bound for Albert & the Somme, they are fine fellows are the Jocks & our chaps get on famously with them.\n\nThe boys are getting the beer & wine alright in spite of all the orders forbidding it, I am sorry to say that a lot of them are making hogs of themselves.\n\nA small mail came in this afternoon I got a couple of letters out of it & very welcome they were too Saw Ferguson again tonight & had a good long yarn to him he is a fine fellow, & a mate of mine he is one of the old origionals\n\nCaptain Jacobs is back again in the Company he has been away a very long time now, I think Capt Mckenzie is going to Hospital in the morning he has a small piece of shrapnel near his eye.\n\nSent a few letters away to day the first chance I have had for some time\n","12":" Another beautiful & glorious morning not a cloud to be seen in the sky, & the birds are singing sweetly in the shady trees all around me, the world is not a bad old place after all.\n\nLast night the boys were very riotous & noisy, they kicked up a terrible row to well on to 1 in the morning\n\nAm on Headquarters guard today a pretty snaggy job for you have to so particular & see that everything is done correctly, one of the intended guards was shot in the clink he was helplessly drunk & has been the same for the last 2 days.\n\nAbout an hour after I had taken the guard over, a guard came along from D. Coy. there had been a mistake on their part, their Coy don’t come on till tomorrow.\n\nOur Artillery have been passing through here all day some going in & some coming out, they reckon it is still a deathtrap.\n\nTwo French priests have just passed me they wear big long black\n\nfrocks like women & a small black bowler hat, I fancy they are very good fellows.\n\n2nd. A picket from our Coy. were out last night patrolling the roads for everyone is supposed to be in their billets by 9 oclock, needless to say this rule is \nstrictly\n observed, hence the picquets.\n\nThere was a musical evening last night at Headquarters.\n\nI think to-day the Brigade starts Divisional training, that will mean plenty of route marches & bayonet fighting Another beautiful morning, & everything is so quiet & restful after the trying ordeal we have come through, I am sitting\n\non lovely green grass & clover fully a foot high under the shade of a fine old apple tree, in front of me the old & grassy orchard runs for about 200 yards & finishes up at the end of a reserve of lovely \nbreech\n beech trees & at the foot of the orchard runs a lovely little clear river with plenty of fine trout in her, every here & there little coloumns of smoke are rising up toward the bright blue sky showing where the boys are camped & are cooking their breakfast, I can see them sitting round about in the shade, & doubtless a good few like myself are silently contrasting, the difference between Egypt & this lovely land\n\non either sides of me are lovely crops stretching right away to the horizion & broken here & there by little clumps of trees & great long avenues showing where the roads are running & above all the birds are singing for all they are worth, & the sun shines brightly over all, as I write here I can see the French women & girls at work in the fields some reaping, mowing, hoeing, some at work with the teams helping cart the hay & clover in, others leading their cows home to be milked, its wonderful how quiet the stock are here, I suppose they have kept the same breed of cattle for so many years, that quietness is bred in them. I would like to\n\nsee the Australian cattle her where there are no fences, how long would you have them not 5 minutes I’ll wager they would be at the other end of France in no time from what I have seen of them but the stock here are that quiet that they will hardly get out of your way & so contented & fat; grass goes to waste here by the tons.\n\n3rd. Parade again this morning & a little bit of drill, I had a go at the platoon drill this morning. We also had some instruction in bayonet fighting from our officer.\n\nJust before dinner Tom Flattley came round to our billet his bike had punctured he told us that\n\npoor Bill Carey had been killed he used to belong to our old Company H, & the night of the charge at Pozeries, he left the Pioneer Battalion, & joined in the charge with us, the day after we went out he was skittled.\n\nThis afternoon we were out on a route march with full packs up it is punishment for the number of drunks that have been about & to punish the few, they punish the whole lot; thats a bad point I reckon in the military, to make the many suffer for the few but they did not take us far, & we marched without Tunics, so we were not so badly off\n\nI bought a pair of Zeiss glasses this morning for Ferguson, they are bonzers, the chap got them off a German, I gave 40 francs for them real cheap I reckon.\n\nThere has been a bit of fun down in the South of France with our chaps in the lead, it started this way, The tommies have charge of the camp, & they crucified 2 of our boys, that is to say they were stretched out both hands & feet & kept of the ground, that is a part of 1st Field punishment, when our chaps saw this they got together, & gave the officer in charge of the Camp 10 minutes to cut them down or take the consequences, they\n\nrefused to do it, so the Australians about 300 strong rushed the joint cut their mates free, & smashed the things to pieces, they then started to muck \n off\n up, & smashed every thing they came in contact with they nearly killed the two Tommy Sergt Majors who were responsible for it, & the officers came in for a rough handling one General had one of his eyes knocked out After they had gone a little while the Scotties joined our chaps & the Canadians all the Tommies cleared for their lives, they reckon our boys are demon’s but I reckon they were quite right, I’ll guarantee they will crucify no one \n\nwhile the Australians are about they do what they like with the poor Tommy, they have to suffer something If you are in a big camp & ask a Tommy where the Australians are camped he will tell you to go down the lines till you come to some fellows wearing big slouch hats & wearing wristlet watches, & calling one another B- B- they are the Australians, or Orstralians as they call us, I believe it is very funny at the big concentration camp of Etaps, they are all Tommies in charge & our fellows lead them a dogs life, they simply can’t stand their instructors, the Tommies say they will break our boys heart but\n\nthey have a pretty stiff job on, one or two of the instructors have learnt a pretty severe lesson already, & won’t come back to Etaps again they are not drilling poor inoffensive little English lads when they have got our boys just imagine some of the burly & rough boys from outback taking lip from some of them Imperial men, why its like a lamb fighting a dingo of course all the Instructors are not the same, & finer fellows you could not meet than a lot of them, but they have a few bullies there who have been at it all their lives & they think they can play the same game on the\n\nAustralians, what kind of a handling they are getting is better imagined than described, there wont be many of them left if they are there much longer at any rate, the English lads look on our chaps with a sort of wonder, they are amazed at the way our boys treat these bullies, & I am sure they regard the boys as wonders, its very seldom you will hear a Tommy say anything bad of an Australian, or our boys of the Tommies with the exception of a few who are being taught a pretty severe & much needed lesson, they’ll not forget the Australians in a hurry I’ll wager\n","13":" A lot of details came in last night from England, some of them have been malingering there for 15 months & more, & must have been absolutely kicked out: or they would have never stirred\n\nThis morning the whole company were instructed how to load & work a Lewis gun, a fine & most necessary thing I reckon for it often happens that the whole crew of them get knocked out & if you are in a tight corner they are just the thing, & they are so light & handy, they fire 47 shots in 5 secs so they are pretty fast while they were instructing us a shot was accidently fired\n\nbut luckily no one was hurt, the bullet went right through a fair sized tree, from now on 8 N C O.’s from each Coy. have to have an hours instruction each evening on the guns.\n\nThis afternoon we all went for a wash, there were no showers so all the water was pumped up into buckets & we washed in them the water was very cold.\n\nI believe our Battalion is specially mentioned in Army Corp Orders for fine work done at Pozeries\" & thats a fine honour for any Battalion to have\n\nA fair sized mail came in to night I got a few letters out\n\nof it, & a parcel for Len from England. the parcel was made up of cakes & lollies, cigarettes, biscuits, & chocolates: I opened the parcel, for it is not much good sending it on to him.\n\nThis afternoon the Capt asked the Company which they would prefer to do, dump their packs or blankets for we have to do one or the other we almost to a man decided on dumping the blankets & carrying our packs\n\nLast night a lot of Tommies came through here they were A M C. & were making out for a spell There has been a lot of our artillery going through here lately, & also some of our Division seem to\n\nbe returning, with their guns so I expect we will be back any day now\n\nThis day 2 years ago England declared war on Germany, how it has dragged along since then I wonder when it will all end, but there is no doubt about who has the upper hand now, Germany won the first 18 months of the dust-up, but what does it matter if we lose 49 battles & win the 50th & last, that is the one that counts, & the one which England always wins, & so it will be this time again Germany is undoubtedly getting weaker & weaker, while we are there is no doubt about it getting stronger & stronger\n","14":" This morning the Colonel was out on parade watching the N.C.O. drill the men, he is a very particular man but a fine soldier & the best we have had in the Battalion so far I believe we are losing him shortly Got my second stripe today & am now a full Corporal thats not bad considering its only 7 weeks ago since I got the first one\n\nIts all over the place about me being recommended for a commission, the Headquarters Signallers let the cat out of the bag. Got orders to pack up & be ready to move off at any time probably tomorrow, for we generally move of a Sunday\n\nTonight I am Corporal of the picquet, we have to patrol the streets with a body of men, & see that order is kept.\n\nThe Australians have adopted a movement of their own in the new bayonet fighting, & it has been so successful, that it is being taught by all the Instructors in France be they British or Canadian it is called the \"Australian Punch\" & is the finishing movement after you have engaged & missed your man in the thrust, it is done with the butt & is very effective the boys are fine with the bayonet I reckon we do that part of our drill best of all\n","15":" To-day is the anniversary of Lone Pine\" the fiercest battle that was fought on blood stained Gallopoli, & by far the most frightful of the 3 great dust-ups I have been in, there were trenches in the Pine where our own boys & Turks lay 3 & 4 deep, & on top of these we had to fight for our lives When the fighting died down there was over a thousand dead men moved from this Hell, & it was no more than 2 acres in size, but a valuable position to have \n\nChurch parade this morning, & it was held in a very pretty little place just imagine if you can a brilliant sunny morning, & us marching\n\nsmartly down a fine road lined on either side by beautiful shady trees & a nice little river running alongside one row of trees, & everyhere & there you would pass quaint old French farm-houses with their tiled roof’s, & pretty flower gardens around them, after a mile or so of this we come to the enclosure, where the service is to be held it is no more than an acre in extent & like all the rest of France is beautifully grassed & clean on 3 sides of this square we are walled in by bonzer green trees, & the other is bounded by the road & railway, as we march in our markers are ready, & we have formed up in two shakes, in a few minutes the other Battalions make their\n\nappearance, shortly followed by the Brigadier & the padre.\n\nWhile the service was being held we could hear our boys practicing with the machine guns, their sharp & snappy bark can be heard for miles & aeroplanes were humming & droning over us, like a well oiled sewing machine while the church bells were mingling their mellow tones with the rest, & over all a great peace & beautiful sun was shining, the padre’s sermon was chiefly on the new phase the war has entered upon & the great name & fighting qualities of the Australians & especially our old 1st Division, he urged us to keep it going\n\nThe following is a pretty fair sample of a \"Soldiers Life\"\n\n6.30 A.M. \"Reveille\", Christians awake\n\n6.15 AM \"Roll Call\", Art thou weary\"\n\n7.0 AM \"Breakfast\", Meekly wait & murmur on\"\n\n8.15 AM \"C.O. Parade\", When he cometh\"\n\n8.45 AM \"Manouvere’s\" Fight the good fight\"\n\n11.45 AM \"Swedish drill\", Here we suffer grief & praise\"\n\n1.0 PM Dinner \"Come ye thankful people come\"\n\n2.15 PM \"Rifle drill\" Go labour on\"\n\n3.15 PM \"Lecture by officers\" Tell me the old old story\"\n\n4.30 PM \"Dismiss\" Praise God from whom all blessings flow\"\n\n5.0 PM \"Tea\" What means this eager anxious throng\n\n6.0 PM \"Free for night\" O Lord how happy we shall be\"\n\n9.0 PM \"Last Post\" All are safely gathered in\"\n\n10.0 PM \"Lights out\" Peace perfect peace\".\n\nThis afternoon we had a lot of\n\nTommy clothing come in, but the boys practically refused to wear it, we all prefer our own Australian clothing even though it may be all dirty torn, & ragged\n\nA couple of new officers knocking about tonight.\n\nWent for a walk as far as Canaples tonight it is a very pretty little place & well worth the trouble, you can also buy daily papers there.\n\nWe will be sleeping without our blankets tonight, so it will be very cold, they have taken them away to the transports, so that means that we will be shortly moving to somewhere, Thiepal I guess, at any rate she is \n\nfavorite.\n","16":" I had charge of the platoon this morning for physical exercise as the Sergeant was not feeling too well, it is dull & warm a lot like rain, we had bayonet drill, & bomb throwing this morning the Colonel was around again this morning to see how things are going I think he is well satisfied with things for you never hear him growling now like he used to one time, but the Battalion or what is left of it are well up to their work & very keen This afternoon a lot of Australian clothing turned up they apparently tried to force the Tommy clothing on us but the boys absolutely\n\nrefused to wear it, so along came our own.\n","17":" This is our daily routine, Physical jerks from 6. till 6.30 parade from 9 till 11.30, parade again in the afternoon from 2 till 4, & then again in the evening All N.C.O’s have to attend Instruction classes on the Lewis Gun. so you can see they keep us going\n\nThis morning in addition to our usual drill the whole Company had to go through a bomb course & each man had to sling 2 bombs about 20 yards, there was only 1 dud in about 70, so the bombs were pretty good & reliable Mills\" were the bombs used\n","18":" This morning we packed up & moved off from Halloy-Pernois toward the firing line, it was a scorching hot morning, & the dust was something awful far worse than the marching which was quite stiff enough for anyone.\n\nWe passed a lot of our artillery, & the 5th Brigade on the way back they did not get the cutting up we did, we had a good long spell on the grass while the Artillery passed us.\n\nWe are now in billets about 6 miles from Halloy.\n\nReceived quite a budget of letters yesterday, & Gretas photo among them how she has changed.\n","19":" This morning we left our billets in Lavigcona, it was just starting to drizzle, so the order was given for everyone to put their waterproofs on. I had none for I dumped it at our last billet on account of the weight, so I had to fall back on the old chaff bag, & she kept me dry as a bone It was a very stiff march & the roads were greasy & slippery, which made the walking anything but easy, we passed on our way through Herrisart a fair sized village.\n\nReached our destination Loutencourt, & everyone was about knocked out.\n\nBefore we were dismissed, our officers gave us a lecture on how to behave & etc. it was of not much use for no sooner had they got their packs off, than up the apple trees they went like monkeys & soon the apple were coming down in showers, this was forbidden fruit to the Tommies & they were afraid to touch them they stood with their mouths open, when they saw the boys rooking the apples hardly able to believe their eyes, & there was a garden close handy with peas & etc in her, they were not long in finding it, the same with the town she was full of our boys in\n\nless time than it takes to tell the Tommy police tried to stop us, I can see trouble ahead for them if they are not very careful for the boys are not be trifled with & are liable to do nasty things when once started.\n\nAt present we are camped in long & low huts built of galvanised iron & canvas roofs, they are dry & that is the principal thing these times. We have no blankets, as yet.\n\nThe guns can be heard quite plainly from here belting away for all they are worth.\n","20":" King George is knocking about these parts, just now so the Grenadier Guards are \n\nhere doing duty, they are a fine body of men & very smart on parade.\n\nI can see a row or two here if the Tommy police are not careful how they order us about, they, or I should say some of them, are very officious, & seem to take a delight in their rotten crawling cold-footed job, how the Infantry hate these police for as the old saying has it; \"They neither spin nor do they reap\" I reckon they make the boy’s play up & you can’t blame them.\n\nOut on parade this morning it was dead funny, I gave a demonstration how a man with\n\nout rifle or bayonet can fight & beat one with it provided he tries to bayonet you, it made them all laugh officers & all, surprised a few of them I can tell you for it is novel & effective, very;\n\nThey paid again this morning so I would not be surprised if there was trouble tonight\n\nThere is a canteen in this town & the boys are making good use of it\n\nThere was a very heavy bombardment about 12 last night so I expect there was another charge on or something like that.\n","21":" Off parade this morning on account of my boots, had to get them half-soled, for you know\n\nthe hard metal roads wear our boots out like fun.\n\nThere was a great kick up here last night, for most of the boys got full as expected, & played up top ropes.\n\nThe last 2 mornings here have been very foggy a very fine Scotch mist falling till 7 oclock & after that a hot day.\n\nThe King is supposed to be in town today, Loutencourt is General Haigs Headquarters so it is a very important place, plenty of cars & swell officers, to much saluting for my liking, & you can’t very well dodge it, though we do our best to do it.\n\n13th. Church parade this morning, we had a good long walk to Herrissart where the Service was held, we paraded in belt & bayonet, the whole Brigade was there, including General Birdwood & Smythe, the service was a joint one given by the Presybeterian & Church of England ministers, after the service was concluded General Birdwood presented the medals won by different chaps since fighting in France there were 3 in our Battalion Lieut Moffit Capt Price & Pvt Hyde, the latter chap got the Military Medal for leading the 11th Battalion into their position\n\nunder heavy shell fire at Pozeries & he also had a brother killed there so the medal was some little compensation for his loss.\n\nAfter this was finished General Birdwood made a speech how he praised the Australians up, he said he told the King that 2000 Victoria Crosses were earned by our chaps in the storming & capture of the fortress of Pozeries\", he then told us how the other Divisions had got on, & they have done well we seem to be bearing the brunt of the fighting round that \"Hell & theres one thing as he said that so far the Australians have never failed in their attacks.\n\nhe also said that our artillery knock out on an average 10 guns a day, & he remarked how absolute was our mastery of the air & the ease with which our boys beat back a heavy German counter attack on Pozeries & he said he was fully convinced now that we have tried ourselves against the German that one Australian was worth 12 Germans once we get to close quarters, & I think he is right, for our scraps have proved that fully, all this of course coming from a General puts the boy’s in great heart & even if he is kidding it has a good effect.\n","22":" I had a picquet down the town last night, & in one place there was a bit of fun, the Tommies didn’t like the idea of shifting them & they sent round for our picquet it was after hours, & there was a great argument raging, which threatened to turn into a free fight any minute for some of our boy’s were pretty full & looking for stouch, it started like this, just at closing time one of our chaps gave the woman who runs the cafe; 6 franc’s for a bottle of champagne, she in turn handed it to a Frenchman who was sitting in there, & he refused to go & get the liquor, this made the boys\n\n \n\nnearly mad, & they threatened to burn the joint down if they didn’t hand over the good’s, while all this was going on I came on the scene with the picquet, as soon as the woman saw the picquet coming she grabs a bottle & puts it in the chaps hand & shows him out the door & closes it, the chap was that mad at being treated like that, that he wanted right or wrong to smash the joint in & stouch the Frenchie up, & they would have carried it out if I had not been there, & one of them had bricks in their hand ready for the assault, however after \n\na bit of persuasion, I got them to go away quietly.\n\nI reckon it would have served them quite right, if the boys had smashed their joint right in, for they really all bring it on themselves by this sort of thing.\n\nThey have a new way now for describing a drunken man when he is playing up, they call it \"Showing\", & they say that so & so is going to \"show\" well tonight. \n\nLast night I was promised my 3rd stripe in a day or so which would make me a Sergeant, pretty rapid promotion if you like.\n\nBridge is all the go here now we play it every opportunity we get\n","23":" Physical jerks again this morning, & I purposely scaled them for I was pretty tired after the picqueting stunt last night. I had a row this morning with one of the most unpopular & rotten good for nothing men as ever breathed Sergt Major Barber of B. Coy. he got the worst of the argument with a vengeance I can tell you.\n\nReceived orders to move off at 2 o’clock this afternoon, & I had to report at Battalion Headquarters at 1 o’clock that left me exactly 20 minutes to pack up & eat my dinner so I did not have too much time, however at 1\n\nI reported, & great were the guesse’s made as to what\n\nI was wanted for, most of them thought it was for billeting N.C.O. but I had a pretty shrewd idea what it was for.\n\nOrders from the Adjutant were that we were to report at Divisional Hqr’s at 3 oclock sharp that meant a march of 4 ½ miles to Rubempre after receiving these orders I went back & shook hands to all the boy’s who by this time had guessed what was on, & many were the congratulations showered on me\n\nJust before we reached Herrisart a Tommy picked us up in a motor & gave us a fair lift on our journey on arriving at Rupempre we reported, & I was put in charge of the \n\nmen as they arrived, & had to guide them down the town to where tents had been provided for us in a most beautiful little grassy orchard.\n\nThat done we went & had a wash & got sopping wet through on the job, we had to haul our water about 150 ft up a well on a windlass & when we had just got it started on the way up, I’m hanged if a heavy shower didn’t fall on us we could not let the bucket go so we wound it up & got wet through.\n\nThat done we come back & had some tea, which consisted of bread & water for that was all the rations we had brought with us, some tea wasn’t it, but one a soldier \n\noften has to put up with\n\nAbout 5 oclock the Town Major came down to our camp & gave me some more orders as regards the tents. \n\nThere are 30 of us altogether from the","24":" Division, & I believe we are on our way to Bristol or Scotland, where we will go to our Training School, how lucky were we to get away for a big scap is coming off.\n","25":" This morning General Walker inspected us & gave us a lot of advice & told us where we were going to, Etaps the great Australian training Camp is to be our first stop & there we are to have platoons & Company’s to drill before\n\ngoing into the Training School.\n\nGeneral Walker told us we were all selected for services & good work on active service so my luck was in this time & caught the Colonel’s eye We are to have a 6 weeks course in the Old Country somewhere, & then if suitable will be given a commission I am going to do my dam’ndest to win mine for it is the chance of a lifetime, how envious the rest of the N C.O’s must be especially those who are higher up than me but I’ll warrant that no one was more surprised then myself at the turn things have taken within the last 3 months with me, about that time ago the\n\nCaptain in charge of our Coy & myself were deadly enemies, & I am sure he tried to get me knocked out on several occasions, by the jobs he gave me to do, but I pulled through each one safely, then all of a sudden he seemed to change, he gave me a stripe which I refused at first but he induced me to take it a little while after, then I got my leave to England, coming back I got gassed & done no work for about 10 days, shortly after this he promised me my second stripe & I got it after coming out of \"Pozeries & the day I left to come away for the my Training I was to have been made a sergeant, & I am \n\nsure that he was at the bottom of it all for he has been as nice to me as any one could be, & now we are the best of friends, that is often the way, you start off badly with a man & finish well with him, but I know for a fact that someone posioned his mind against me & I am pretty well sure now who it was he had better be careful in the future I could never make out what his object was in setting the Capt against me, but whatever it was it has turned out badly for him now & I’ll bet he is grinding his teeth \n\nWe are leaving here tonight & this afternoon we are being fitted out with new clothing & etc.\n\nIts funny to hear each chap tell you what his thoughts were when the Colonel first sent for them, they all without any exception thought the one thing the same as I did, & that was; What the H. have I being doing; for it is always something important when the colonel wants to see you, & very seldom any good for you but this time it was a notable exception\n\nWe are living on grapes, sardines, tomatos & bread today for we have not been issued with any rations as yet, & have only water to drink\n\nThings seem very quiet to-day I miss the boy’s of the Battalion very much for there were some\n\nsplendid chaps amongst them & we had been together for so long. Every night a few of us used to get together & yarn & argue & talk over old times & present day topics with the war always of course the main one. I shall never forget a few of them no matter what happens or how long I live. McGrath, Turner, Land’s Jock Mackie, Hayes, Howard, Holmes, Ferguson & a few more were right good fellows & white to the backbone.\n\nWe had a dixie of tea & some bread issued this afternoon from Div. Hqr’s, & 4 of us also paid a visit to the Field Cashier, & drew some money I got 80 Francs\n\nthe first money I have drawn since February that’s a long while to go without making a draw, but what is the good of drawing too much in Francs for it is only wasted 9 cases out of 10. I much prefer to let it run on for you can always draw it when you want it & now it will come in very handy to me while going through the course.It is very showery today one minute the sun is shining brightly & warm the next she is raining cats & dogs. I fancy the summer is drawing to a close & soon the rainy whether will be setting in, the last 4 weeks or so had been wonderfully fine scarce a shower of rain the \n\nwhole time.\n\nJust before we left, Colonel Foote came round & gave us some useful hints as to our future behaviour while training, & when we are made officers, he is a fine sort of chap & a strong advocate of getting the officers from the ranks.\n\nAt half past 6 we left our camp & made off towards Valdemaison about 2 miles distant, as we were going along the sun suddenly came out & brought 2 pretty rainbows with her, it seemed to me a good omen just as we were starting off on our journey. It took nearly an hour to reach our present quarters, for the road\n\nwas slippery & muddy after the heavy showers, where we are now is a detail camp for all men coming back from the Base, at present there are only 2nd Div. men in her our little party were allotted 3 tents for the night, but we could get no blankets, & so we had to sleep again in our clothes.\n","26":" This morning we drew our rations & the cooks refused to cook it for us, so a chap volunteered to do it for us, there was only bacon & tea to dish up, we gave him 20 francs this morning I’ll bet the other cooks were wild. The morning passed very slowly though we tried to kill it by playing\n\nBridge\" which is becoming very popular in the Army.\n\nFor dinner we had bully, biscuits, & tea so we are not living to flash as yet. All day long & night as well there are great strings of motor lorries passing backwards & forwards. All engaged in carting shells to the firing line & most of them 9.2. Left the camp this evening about 3.30 & marched to the railway station about 3 miles distant, here we had to wait until 5.30 & in the meantime I went over to where an old Tommy was cooking I scored over here for I got a big joint of roast beef 2 loaves of bread, & a dixie of hot tea\n\n& a tin of butter, I can tell you we enjoyed it thoroughly for we had not too much to eat lately I got 15 francs for him a nice little bit of backsheesh, they are very obliging are the majority of Tommies & treat us well.There were a lot of Australian wounded at the Station waiting to be taken off.\n\nI saw about 5 tons of cordite burnt here talk about a flame & it looked a dark red color. There are any amount of binders round this part, & 9 out of 10 are Massey Harris, they make very good work with them but they of course can hardly help it \n\nfor the ground is so level & the crops so fine especially the wheat. There are scarcely any level crossings on the French railways they are nearly all overhead or underneath this does away with a lot of accidents. The country we are passing through now is very pretty as far as you can see on either side is nothing but bonzer crops all turning yellow & a lot of it cut & storked they have a peculiar way of drying their handreaped wheat & oats they stand it up & tie it round the top of the stook, & there it stands like a stook of tied sheaves you should see the rows of stooks all regular & straight as a gun \n\nbarrel nearly anyway you look it is like everything else in France very clean & methodical. \n\nThere are some fine crops of lucerne round this part & marigolds flourish well, all along the line we keep passing little villages each with its tall church spire & little reserve of pretty trees, & every here & there great columns of black smoke are rising telling of busy factories things seem so peaceful & quiet along here you would never think a war was on, but for some aeroplanes scouting about, & observation balloons in the distance, & one other thing & that is the barbed wire enclosures here & there each\n\nchockful of German prisoner’s. I noticed a lot of girls & women round about some of them, I suppose woman’s strongest point brought them there namely curiosity.\n\n17th. Had a very slow journey down last night but it was a pleasure for we passed through some lovely scenery & some of the hills were very steep & the views down the winding gullies & valleys were very pretty, went through one fairly big town \"St Guen\" all along the line there were plenty of Australians.\n\nWe reached Roman’s Camp at 2 o’clock in the morning, hopped off & rushed into a fine canteen where we got\n\nhot tea, cake, & etc. ££&There’s one good thing about the British & that is they always provide very fine canteens for their troops & it is money well spent, we had to wait here till 20 past 11, a long & tiresome stretch, we had a good few German prisoners aboard from Pozieres\", a lot of them were very young, we gave them cigarettes & water, & very grateful they were for it. A fellow cant help but treat them well once they are away from the battlefield no matter how he might feel on the matter, for they are so helpless & dependent on you. The Frenchies can’t stand them at any price but they of course\n\nhave very good reason to hate them, they reckon they have a job to stop the French from killing them when they make them prisoner’s. We travelled like lightning from 11.30 till 2.30 & must have covered nearly 4 miles, the pace was terrific you could have picked baskets of flowers & then boarded the train again. At last we pulled up & over we went again to another big canteen, & got some hot tea, fruit & etc, the run from Roman’ Camp we spent in 2nd class carriages, while the first part of the journey we done in old trucks so much for the budding officers we are doing well so far & have\n\ntravelled nearly 18 miles since yesterday at 5.30 what do you think of that for speed, I don’t think any of our old stock trains can come near that speed.\n\nAll different intervals down the line there are enormous piles, of timber & various other goods required for the different British Armies. 8The country is very pretty just below Romans Camp the line winds in & out & on either side of you there is the vivid green of the young crops & the golden yellow of the ripening wheat, the light brown of the oats & black & chocolate colored ground which has been fallowed & here & there we hit a fair sized\n\nriver which keeps on broadening out & forming very pretty lakes which are all surrounded by belts of green trees & long rushes there seems to be plenty of fish in them for you can see people angling everywhere, & boats are rowing on it by the dozen.\n\nIt is very funny to watch the French people & kiddies when they catch sight of the Germans which we have on board, they shut their fist & shake it at them, & hold their nose, (for they reckon they stink) & the old men make a motion with their hands suggestive of cutting their throat, they have a terrible hatred of the \n\nAllemand\" alright.\n\nArrived at Abbeville about 8.30. We got a pass here for the lot of us to go into the town, so off we went she is a very nice little town & very clean, the shop windows too are very well dressed, the best I have seen in France so far, a big Cathedral is in the town & the Somme\" runs right through the town they have so turned the river that she forms a complete circle on the edge of the place & a fine park & promenade of trees are planted hereabouts, that’s the one outstanding feature of all the French towns & villages I have\n\never seem, the way they try to make their own particular place as beautiful as possible & they have succeeded remarkably well. We walked for just on 2 hours & was pretty well all over the principal parts of her there is a very fine piece of sculpture just close to the Cathedral & I should think it was very ancient judging by its looks our train which was to have started off for Etaps at 11 oclock has now been delayed till 4 in the morning, so tonight we are sleeping in an old hut crammed with Tommies & Jocks of all regiments \n\ntruly this is some train.\n","27":" Left Abbeville at 3 oclock this morning after a weary wait we done this part of our journey in trucks & fairly crowded at that. Arrived at Etaps at 5 o’clock & had to walk 1 ½ miles to our camp & we were all very glad when we reached our destination. We were 36 hours doing 90 or 100 miles what do you think of that. I made enquiries here for Len & found that he was down in the Convalescent part of the joint, so after having a wash I went down & hunted him up. I soon found him, he looks alright after his illness\n\nhad a good yarn & then went back to see what arrangements had been made in regard to us. After a little while we marched down to the Convalescent part of the Camp, & pitched a tent for ourselves, that being done Len & I went for a walk over the sand here for the tide was right out & you could almost walk across to Paris Plage, but a fast running little channel blocked things unless you wanted to swim it, the ground around is just alive with cockles & crabs.\n\nAfter coming back from here we had our dinner & then Depena & I went down to the\n\nConvalescent Home & saw Sergt. Gelding & a few more of the boys he was buried a few hours before we were relieved at Pozieres but apparently was not hurt much for he looks so well & strong, there are scores & scores of Hospitals here & most of them are full of sick & wounded, there are several hospitals here for the treatment of German wounded.\n\nIts wonderful what a small amount of sickness there is in any army considering what we have to put up with. \nit\n\nThe roads are very fine & wide down in this part but the land is not so good for it is \n\nso close to the sea & very sandy & chalky.\n\nIt rained very heavy last night at times, hope it dosn’t do the same tonight for some of us will be sleeping out.\n\nIt seems funny to hear the bugles calling again after being away for so long from them.\n\nSergt Major Pegg asked Len today if he would take on Company Q M for a while, if I was him I would grab it.\n\nThere are all sorts of hospitals here, including American, Canadian, English & Australian. I believe the Yankie’s are being recalled to America for they\n\nreckon trouble is brewing with Mexico, & they will want them. I expect we will start our work tomorrow on some duty or other. Everyone down here knew that I had been recommended for the commission long before I got here, Len tells me Capt. MacKenzie told all the boy’s that I was getting a \"star\" & that he had seen that I had the interview with the Colonel before he left for hospital, he turned up trumps alright as far as I was concerned I believe he cracked me up to the boy’s, I know for a certainty now that it was him that \n\n \n\nrecommended me, & once he was my greatest enemy, but this old world is full of surprises, but this was the greatest shock of my life for you don’t know how bitter we were to one another & even now it has got me beat, for it seemed an impossible thing one time that he & I could be friends, or even on speaking terms, & now he appears to be my best friend this side of Australia, he admits now that he was led astray as regards to me & I am thankful to know that he was in a position at Pozieres\" to see how thoroughly he was mistaken\n\nfor there I did what is known among the boys as a few of the \"mad acts\", & was right among the thickest & fiercest of the fighting that was waged mercilessly & without quarter to either side by Tuetonic & Colonial soldiers I shall never forget the mad intoxication one seems to be in at such a time, for you see absolutely no danger & will do almost anything, for the roar of the guns are ringing in your ears, & you can smell the salty fumes from the powder stinging your nostrils, & this combined with the shouts of the boys & the peculiar & ghostly lights of \n\nthe many colored flare’s among which the green, while, red, & blue stand out prominently, & under this tangle of coloured lights you can see Boche’s getting for their life, these are moments when I reckon a man live’s 10 minutes of this seems to be at the time worth a year of ordinary life, but the reaction sets in afterwards & nearly all men feel a faintness come over them once the scrap is over & they realize what they have been through, but this don’t last long either & you are soon itching for another smack at the rotten Hun.\n","28":" `Was at a concert last night given in the Y.M.C.A. & I could not help feeling wild at the injustice of things, for here were hundreds of men in the pink of condition loafing round about the camp & huts, while up in the trenches their mates were being killed & wounded in hundreds & many & many a poor devil up there in the trenches was only fit to be in hospital but their indomitable spirit kept them where they were wanted, & you hear very few complaints from them as regards tucker & hardships, while down here they \nlit\n live like Kings compar\n\n-ed to the \nmen\n, & grumble & growl all day long, (not all of them you know but the majority) how I would like to grab some of these malingering \ncows\n & shot them fair into Pozieres\" they would have something to talk about then I’ll guarantee, you should hear some of them talking about the terrible battles they have fought in & the men they have killed, & rescued under fire, I dropped across one of these last night he was holding forth to a mob about his doings on the Peninsular & Pozieres\" he did not notice me, for I knew all about him & his wonderful\n\ndoings & so, on. At last I could not stand it any longer, & I hops in & exposes him properly to the boys he nearly fell through the ground & turned all the colors imaginable what a shock he got he was one of the biggest squibs imaginable. I’ll bet he is more careful next time he starts skiting. Went over & slept with Len last night for we have no blankets as yet. I have had none now for a fortnight & more & last night was the first time I had my clothes off for that period, & it was bonzer, anyone who has not had these sort of experiences have no idea the relief it is to strip off.\n\nAfter breakfast this morning 4 other chaps & myself went out for a bit of practice at detailing a very necessary thing & not easy to master by any means we took several books of Instruction with us & a rifle to demonstrate how it is done, we took it in turns to do the detailing, & we used to also illustrate the writing of problems on the sand. Not a bad way I think we all learned something or other. Just before dinner a smart little shower came up & we had to do a get for all we were worth. We were out again for an hour or two after dinner, & then\n\nwent down to where they were holding a Sports Meeting saw the high jump & various other items but somehow I had no time for it it seemed so out of place to me while the rest of the boys were battling for all they knew, & them big strong hulks down here enjoying themselves, I suppose I am foolish to think these sort of things & all that, but coming from the seat of war & noticing the contrasts, one if he has any feelings at all towards his mates must think the same as I do \"poor devils\" but for all that I would just as soon be up there doing my bit\n\nas loafing down hereabouts. \n\nTimber & troops are passing in one constant stream past here train load after load of them.This morning, I saw a big train load of Jocks go past.\n\nThere is a military band in the camp here which plays fairly often it was playing at the Sports this afternoon.\n\nThey are feeding us pretty well here, we get far better food then the rest of the men, that is of course due to the position we are likely to hold later on. We live entirely on our own here so far, for our movements are directed from Divisional \n\nHqrs. & the Commandant of the Camp has very little power over us thank goodness.\n\nA couple of big drafts went out of here today & not before its time.\n","29":" Len is now Regimental Q. Master, here, so if he can hang on to it he has a fine job one of the very best, but it all depends how the Dr’s mark him next examination.\n\nSunday this morning & they are holding a Field Service just outside the Y.M.C.A. where I am penning this scribble, there is a piano going & they are running through some of the old old, hymn’s\n\n& the band about 50 yards away are playing for the Service. This afternoon I went down to the Hospitals to see if I could find any of my mates, I went to St Johns Ambulance first but could find nothing there, so I tried No. 1 Canadian, & here I found Jimmy Brennan, he had a great bayonet wound in his side 8 inches long & a tube was through it draining the wound, he got it in the great charge our Battalion made & met the Germans in the middle of No mans land\". It must have been a fine piece of work & our boys chopped the Germans\n\nto pieces & took their first trench. Jimmy tells me that the ground is simply covered with German dead left over from the counter attacks they have been making & the best of it is that they all come over with full packs up so they evidently intended to stop over there once they got across. You can see Baupaume quite plainly now, the old 1st Division has been nearly wiped out again it seems a downright shame to keep on putting them into it again & again, but then that is what you get for having a good name, if we had not been a success we would not have had\n\nhalf the fighting we have been through, our boys have done wonderful good work at Pozieres & it will be more widely known one of these days after the war though even now all the English papers have nothing but praise for the Australians & their work. I went along afterwards to the 26th 24th 23rd but could find no more of our boys, so I expect they are at Camiers or Bologne.\n","30":" All tents are struck this morning & everything packed up neatly. There is a big medical examination in the camp today.\n\nA lot of Australian troops have been coming through from\n\nBologne way I think they must either be the 3rd Division or some of our new formations, & New Zealanders are also pouring in. We have been practicing all the morning, & again this afternoon we were out drilling one another & detailing by turn, this evening I came out on my own to do a bit of studying. I had a couple of hours at it, & then the pretty scene in front of me claimed my attention. I am sitting on a little grassy bank overlooking the sea for miles, & it flows right at my feet at the present time for the tide is coming in, away to the West & towards old England\n\nthe summer sun was setting in a bed of purple & golden clouds & the reflections it threw on the water were lovely & the fishing boats were all out with full sails up & they looked like huge while birds sitting on the water.\n\nTo my left is the pretty little town of Paris Plage with 2 great lighthouses standing boldly out like sentinels of the deep, their snowy white appearance showing splendidly against the hills of green trees at their back. On my right is nothing but the coast of France (very sandy at this part) & the wide wide ocean, behind me are the hills\n\nwith the railway running at the foot, & the great military camps & Hospitals of Etaps, also the town of the same name, it is principally a fishing place & many curious sights are to be seen when walking through it, on the flats below me a lot of our chaps & some \"Scotties\" are playing football, & about 100 yards from where I am sitting an elderly Y.M.C.A. man is giving they boys his weekly lecture on the French language.\n\nIt has been a lovely day today something like an Australian day in early spring just cold enough for us to keep our coats on & plenty of sunshine.\n\nI have just counted an engine going past here with no less than 73 trucks & all big ones, & a troop train is passing her filled with Kakhi & guns all bound I suppose for the \"Somme\".\n","31":" All last night trains were passing in one constant stream about ½ a mile between & such trains they were some of them ½ mile in length, one train had nothing but enormous great howitzers & caterpillars on board & thousands & thousands of troops went through & ammunition, aeroplanes, wagons, & field guns, & small howitzers by the hundred, they must\n\nbe going to make a mighty drive or something like that, for supplies of all sorts are simply pouring in. I heard some heavy firing early this morning up the coast towards Belguim, so I expect there must have been either a naval action, or they were bombarding the coastal defences of Belguim. There is a fair sized draft leaving here today to join their units & not before it is time.\n\nThis morning we went up to the Q.M. to get our shortages, he was very snappy at first but when he found out we were going to an officer’s Training School, what a change came\n\nover him, he could scarcely do enough for us, we got the best of everything he had, so tonight I have a clean change of clothing, the first for a long time, & how nice it feels to be clean once more.\n\nThere is plenty of nice cool clean water here for a little creek runs quite close to us & I can tell you it is well patronized. There was sports here again to-day & the band was playing. The trains are still pouring through, all loaded with troops, guns, & the various articles connected with the Army.\n","32":" This morning Tom Scott & myself went for a long walk along the sea shore, we followed it for 5 miles, skirting the low sandy hills most of the way, every here & there we came across the remains of old boats that had been driven ashore by the fierce storms that sometimes sweep over the North Sea\" in winter time we finished up at the ruins of what had, at one time been a beautiful summer residence, about 5 storeys high & fitted with lifts\" & all the modern conveniences but the sea had smashed\n\nbreakwater & rushing through had pounded against the tide & finally undermined the foundations, & causing the house to break exactly in half showing all the rooms & everything so nicely, it is only a matter of another storm & the whole concern will collapse, we wrote our name in chalk on the walls to show we had been up that far, then continuing on, we came across a little café, but we could get nothing to eat or drink, for the cafes are only allowed to sell at certain hours, & the military police see\n\nthat it is carried out, the name of this little village is \"St. Gabriel\" from here we walked nearly 2 miles to Camier’s, there are great training Schools, here, & nearly all machine guns, there are also some Hospitals here, it was now 12 oclock so we bought some melons & grapes. I did not care much for the melon it tasted too much like bananas for me after this we went to the canteen & had some tea & rolls.There is one good thing about the British & that is they always provide their men with tip top canteens, there is also a \"Nurses Rest Home right here. I should not think they \n\nwould care much about it for it must be deadly quiet & slow we walked home along the railway line 2 more miles. This evening I saw a small French airship. She looked very nice & graceful as she flew slowly along the sea, they patrol the Channel & Sea on the look out for submarines & Zeppelins. Saw Brummie Hall & Dick McKenzie tonight, they are here in the Convalescent Camp.\n","33":" To day is the anniversary of my second year in the Army. I never thought it would last this long when I enlisted, but you can never tell how long\n\nit is going to last.\n\nWent for a swim this morning & the water was fairly cold. Done some more detailing this afternoon. I can now run through all the rifle exercises correctly so I reckon I am getting on alright, & I know a fair bit of the other work.\n\nThey have a great way of expressing themselves over here when they fall in, they call it a \"gutser\" pretty expressive isn’t it.\n\nThis morning I tasted some cockles there are tons of them on the beach here. I can’t say that I care much for them.\n","34":" This morning we all had 5 minutes each with the squad & drilled them as we liked for that time, that took up over 2 hours so we had a fair length of time at drill, after we finished we went & had a swim in the mouth of the \"Somme\" there is a pretty stiff current running in her, but the water was lovely & we enjoyed ourselves.\n\nThey are a fine lot of chaps with the exception of 1 or 2 who are inclined to be conceited & know all, they will learn a severe lesson I’ll bet before it is over they will come what the boys call a \"gutser\" \n\nLen tells me this morning that his groin is getting sore again & that he is going to see the Dr. in a couple of days.\n","35":" Last night was a stormy one & the wind howled & raged like fury & now & again heavy storms of rain would come down, but luckily we are camped on sandy ground & that saved us from being flooded out though we had gutters dug round our tent. Heavy firing could be heard yesterday evening I think it was Verdun way for it was East from here.\n","36":" round once more & we are still here & kicking our heels with impatience at being\n\nkept so long at the Base.\n\nThis morning a few of us went for a walk round the beach, & got caught lovely in a sharp squall which sprang up suddenly from the South West, we took refuge in the sand dune’s but got pretty well wet to the skin, the sandy beach is a favourite walk with us for it is very pretty & the salt air is bonzer & there are always plenty of \"white horses\" breaking round about the entrance.\n\nLast night the M. P.’s made a raid & caught everyone crossing the railway line without a pass they caught 2 of our chaps among them.\n\nWe got the shock of our lives today an order came along that we were wanted at the Orderly Room\" at 1.30 of course we were all there to time, & many were the guesses made as to the reason of it, some of us reckoned marching orders for England others reckoned duties\" but we were all a long way out as we were soon to find out, at last out came the orderly room Sergeant, & we were all lined up in expectation he reads out the message form he is holding well of all the shocks as ever I got this was the heaviest but it was over in a minute & I looked at the\n\nboys faces, you would have killed yourself laughing if you could only have seen them they looked so blank & idiotic well the result was that we all burst out laughing together the message was that we were to return to Divisional Hqrs. & so that ended our long looked for trip to England, I can’t imagine what we are being recalled for, it will be rotten if we have to re-join our Batts. after going away with the expectation of getting a commission & putting in 10 days hard grind down here, I can tell you I don’t feel to cheerful to-\n\nnight by any means, we are leaving here I believe on Tuesday morning.This evening some of us went over & had a game of cricket, & got ordered off the ground by one of those cold footed M.P.’s who have never even seen a shot fired however we went & saw the officer & he towelled the M.P. Sergeant up properly & so we had our game. The Canadians were having a game of baseball just close to us it seems a funny game altogether to me.\n","37":" Another nasty windy night with the sand & dust blowing in the tent by bucket fulls & this morning we were\n\nquite black with the grit & etc. We went for a stroll round the beach this morning & picked up a couple of dogs we then struck out across the heath & went hunting for rabbits the dogs put a few up & we had a bit of fun, we then went down to the beach & the tide was just coming in, & it travels across the open sand very fast, we watched it come in breaker after breaker, we then stripped off & had a fine bit of fun in the surf with a big piece of pine that we found lying on the beach we used it to shoot the breakers\n\nwith & there were some nice busters to be had.\n\nLen was marked \nM\n A. Class this morning which means active service, but I don’t think he will ever see the Batt. again.\n","38":" Got our marching orders last night & this morning we were up at 2 oclock for we had to catch the early train from Etaps, a big draft went away with us & the Camp band played us down to the railway station, it is one of the worst bands as ever I heard, left Etaps in big trucks about 5 o’clock & we soon reached Bologne where big batches of Tommies & a few Australians got out to go over\n\nto England how we envied them for we should have been with them by rights, passing through the tunnels we were nearly suffocated for the doors of our trucks were open, & the tunnels are long . Our train ran at a pretty fair pace & we were soon in Calais where we got some cakes & tea we were very hungry for we had no breakfast. It started to rain while we were here, & it has continued ever since, there was a good long run from Calais to St Omer\" here we had a fair stop but once on our way we were soon in Hazelbrouck where we had to report to the R.T.O., he\n\nhad orders to put us on another train, & so off we went to Poperhinge the renowned Belgian town she is a good big place & shows a few signs of being knocked about by shell fire, here we heard the guns again after an absence of a fortnight from them, I need scarcely say they were not particularly cheerful, especially in our present state of mind, for you can guess how we felt didn’t give a cuss what happened.\n\nWe saw some of our chaps about here & learned that the Brigade was about 4 miles out of the town, we had to report from here to Divisional Hqr’s so off we\n\nstarted & had to march 4 miles before we reached her, & it just started to rain as we got there. We reported & after a little while we were taken to some quarters where we are to put the night in. After we had got our gear off we went into the little Belgian café where we had a good tea on bread butter & coffee & eggs the Belgian girls are very funny with their broken English. They are pretty smart at their work.\n","39":" It rained like cats & dogs all night fully 2 inches must have fallen, we got up at 8.30 shaved cleaned up & had our breakfast in the café.\n\nThis morning we are to have an interview with the Colonel & we will know whats doing but you can bet that we will return to our units. There are great numbers of hop-grounds round here & some of the crops are very good & there are a few old windmills in action I suppose they use them for grinding corn.\n\nWe left Hqrs, after the interview in pouring rain, I was in charge of the","40":" Bde N.C.O.’s we had to report at Bde Hqrs, we followed the directions given to us, & came to a fair sized town, here I made enquiries, but try\n\nas I would I could not hear of our Hqrs. One of the 4th Div Captains took me into their Hqrs to see if he could find where they were but they knew nothing about them, so I left the party there & set out myself to see what information I could get. I was directed to the other end of the town to the Engineers, but nothing doing there, next I tried the 12th Battalion, they were in Ontario Camp but they knew nothing of our Hqrs. I then went back to the Engineers & borrowed a bicycle. The roads were absolutely\n\nswimming with water & mud but I chanced the bike, it was the first time I had ridden one since","41":" but I had not forgotten how to stick on & soon I was ploughing through the mud bound for the Post Office where I thought the most likely place to get information, they had an idea where it was but could not tell me exactly where, but outside I happened to strike some 4th Bn. chaps & they put me right on to it. I followed their directions & on the way passed a lot of Belgian cavalry they\n\nhad been watering their horses. Just before I reached the 4th Bn. I met Bill Graham of the Pioneers he was surprised to see me for he thought I was in England, a few minutes more & I had reached the 4th Bn. & they showed me the way to Hqrs. I went past them & round the back way to the town were I left the boys, the roads were in a horrible condition & it was raining nearly the whole time & I was wet to the skin by the time I got back I took the bike back to the Engineers & came down & \n\njoined the boys & off we started it was about 2 miles to Hqrs, & as soon as we got there I reported the Major & Captain were there & after a few explanations we got orders to return to our units so off we went after saying good bye to one another, the road leading to our Batt. was absolutely horrible mud 3 feet deep & water everywhere for it had been raining pretty heavily for the last 2 days & nights & Belguim has a nice name for mud at any time but under the present conditions it seemed\n\nabout the limit, I was very glad I had not written home telling them of what I was up to but I believe Len did all I hope is that, that, letter never reaches them for it will make them so disappointed, but no more than our little party. But I suppose its no good of getting down in the mouth over it, & I for one am looking on the bright side of things, but I can tell you I did not like the idea of returning to the boys for I am wofully thin skinned & sensitive, but you have to put up with a lot of disappointment in the Army.\n\nHowever I reached the Batt. & it was not so bad as I thought it would be for the boys welcomed me back heartily. I am not skiting when I say that they think a fair bit of me for I have always acted as fairly & squarely to all sides as it was possible for me to do & I am sure I have very few enemies. I reported at once to our \"orderly room\" & here I saw the Colonel & Major they were surprised to see me, they knew nothing whatever of us being recalled, however the Colonel said he would make a note of it.\n\nI then reported to the Company & was put on the strength, was handed out a fine batch of letters which I was very pleased to get.\n\n31st. This morning is a beauty after the rain & the sun is shining brightly & mud is drying fast as ever it can. I saw the officer & got off parade this morning, & am now writing this in a fine Y.M.C.A. within a hundred yards of our camp. You can buy apple tarts & etc in here not bad is it. This afternoon I went into Poperinge & had a look round she is a \n\nfine little place with all sorts of shops & trams in her. There are some very fine buildings including a splendid Cathedral. The tower shows traces of the fighting which seems to have taken place in & around her at the beginning of the war. There are five big hot baths here for the troops, & a big building is set apart for the soldiers & it has all conveniences such as restaurants, reading & writing rooms, pianos & such like handy things.\n\nAll the Brigade men such as trench mortar & machine gunners have gone into the trenches & we follow them tomorrow so we will soon be in the thick of it again.\n\n1st September. Cool & cloudy this morning & the country is drying fast you can’t beat a fair wind to dry the mud. A lot of Tommies came into our camp last night they are taking the huts over from us & we are going into the firing line sometime to day. Got off parade again this morning I had a few stiches that wanted mending in \n\none of my boots, so the officer let me off to go & have it done. Things are very dear in Poperinge they know how to charge for things alright, there is some nice lace in there that I would have liked to have got but I was not quite financial enough. Most of it is hand made. Like most other towns in this part of the world every other house seems to be a boozer, its wonderful the amount of beer the people consume they must nearly live on it, I think it is one reason why they are stout for all classes\n\nsock it in.\n\nfrom what I have seen so far of the Belgian people they are not so good looking as the French nor as tidy & clean but of course this is open to contradiction later on for we might strike better people & alter our opinions.\n\nIt is surprising the number of hop grounds about this part they seem to be everywhere & nearly all are on the wire system though there are still a few poles used, instead of 3 in one hill they only have 1 I don’t know what their idea is.\n\nThis afternoon the Colonel had us all formed up on the parade ground & he gave us a good lecture against the gas\" which we are bound to get in the Ypres Salient\" where we are going for a while. It is a very dangerous thing alright & we can’t be too careful about it for it has life long effects on a man if he gets a bad gassing. I had a fatigue party this afternoon cleaning up a lot of garbage & rubbish that was lying about round the cookhouse, it was a most disgraceful state\n\n& the troops who were here before us were responsible for it. The name of this Camp is Erie\" they are Canadian places & are named after Canadian towns & lakes some of them are these.\n\nOntario, Erie, Michigan, Princess Patricia’s Quebec & etc.\n\n2nd. Just before we left our Camp last night, a lot of Details arrived & Len among them he schemed to get away with the draft I wish he had stopped down below for he is far safer there. We had to walk about 2 miles to the station or \n\nsiding where we entrained for Ypres some style us flying about in trains, the engine was behind the carriages & was an armoured one. The country we passed through showed the ravages of war for practically every building about was razed to the ground by shell fire the engine ran us slowly along & almost into Ypres, he we got off, & a few shells were already flying round they were bursting them in the town at last off we started \"two deep\" & when we got into the town we found \"single file\" for they are always dropping a \n\na few shells into her. By Jove it seems a shame that such a bonzer city should have been destroyed there is not a sound building left in her & the biggest part of it is level with the ground, the beautiful \"Cloth Hall\" of which we have all read & heard about is absolutely in ruins only a few tall spires are left standing of what was once a magnificent pile, there is one thing that is very noticeable, & that is the streets they are hardly touched & are just as good in many places as they were before the war. I think the lesson\n\nof it is this, that the angle of descent of the howitzer is so steep that the buildings on either side catch it & makes the shell burst before it reaches the street. That is the only reason I can think of to account for it.\n\nWe have men all over Ypres living in cellars & the majority have electric lights it seems strange but true. Ypres is like a dead city for there is not a sound as you march through her only your own echoing footsteps. Who would have thought a few years back that this Belgian town would resound to the steps of Australian soldiers.\n\n"}}