{"Document Name":{"0":"Diary_0330","1":"Diary_0330","2":"Diary_0330","3":"Diary_0330","4":"Diary_0330","5":"Diary_0330","6":"Diary_0330","7":"Diary_0330","8":"Diary_0330","9":"Diary_0330","10":"Diary_0330","11":"Diary_0330","12":"Diary_0330","13":"Diary_0330","14":"Diary_0330","15":"Diary_0330","16":"Diary_0330","17":"Diary_0330","18":"Diary_0330","19":"Diary_0330","20":"Diary_0330","21":"Diary_0330","22":"Diary_0330","23":"Diary_0330","24":"Diary_0330","25":"Diary_0330","26":"Diary_0330","27":"Diary_0330","28":"Diary_0330","29":"Diary_0330","30":"Diary_0330"},"Date":{"0":"unknown","1":872.0,"2":889.0,"3":1042.0,"4":1062.0,"5":1066.0,"6":1067.0,"7":1068.0,"8":1069.0,"9":1071.0,"10":1081.0,"11":1088.0,"12":1092.0,"13":1095.0,"14":1098.0,"15":1099.0,"16":1100.0,"17":1101.0,"18":1108.0,"19":1109.0,"20":1110.0,"21":1116.0,"22":1118.0,"23":1123.0,"24":1124.0,"25":1126.0,"26":1127.0,"27":1135.0,"28":1148.0,"29":1150.0,"30":1151.0},"Entry":{"0":"\n\n","1":"\n\nEnlisted Prahran\n\nTown hall\n","2":"\n\nWent into Maribyrnong Camp (Artillery) \n","3":" \n\nReveille at 3.30 am. Returned blankets to Q.M. store 5am breakfast.6am marched from Maribyrnong Camp to Ascot Vale station arriving there about 7am.\n\nSpecial train to Port Melb. Stopped at Flinders St Station for about 15 min. arrived Port Melb. Bout 8am.\n\nEmbarked on H.M.T.S.\"BORDA\" (A30) at 10 am, and allotted to tables, stored our kits, then allowed on deck.\n\nOur friends were not allowed on the \n\nPier till 12.50pm and as we sailed at 1pm we had not much time to say good-bye.\n\nAfter leaving Melb. We got paid for the few days that was due for the time in camp, as we start afresh on board.\n\n Arrived off Queenscliff about 6.30 pm and lay there for about an hour. Paymasters’ disembarked and mails sent ashore.\n\nWe then sailed through the Heads and about 10pm the lights of Australia disappeared. \n\nAfter a very pleasant voyage, we sighted land at 10.15am on the","4":"\n\nAlways to the front the Y.M.C.A. welcomed us at Port O’Call No1 (Durban) even before the ship was made fast.\n\nFrom far out on the Jetty a young lady Semaphored the greetings of the ubiquitous and ever helpful institution. Come to the Y.M.C.A. Hut close to the Town Hall.\n\nArrived in Wharf at 12 noon but were not allowed ashore till a guard of 50 Artillery men\n\nwent to the goal and brought back about twenty Australians (who had deserted from previous ships) and were safely lodged in the Guard room. \n\nAt 3.45pm, we disembarked and marched to the Town Hall (about","5":" mls. from wharf) \n\nWe were then dismissed and granted leave til11pm, that night. This Port O’Call was the soul of hospitality towards us.\n\nThere was however a humiliating exception namely, that the use\n\nof hotels was rigorously barred against us.\n\nThis humiliation was bequeathed to us by our own countrymen (Australians) who had gone on before us.\n\nIt was simply an absolutely necessary precaution, taken by the town people amongst whom we found ourselves, against the repetition of sheer madness perpetrated by the men of earlier troopships. But the closing of the hotels did not keep some of the \n\nboys from getting a drink. At Durban one of the printing forms presented the ship with a printing press and all accessories, for printing a paper on board (called The Log of the Lunatic Ship).\n\nWhen we were dismissed at the Town Hall, I think most of the Boys made for tracks for a good feed, and I can safely say that they did enjoy it, after the ships tucker.\n\nThen went for a Ricksha ride round\n\ntown, and after that a circular tram ride to the zoo. Tram are free to soldiers in uniform, and when we were returning to the ship at night they had special trams waiting for us.\n\nArriving on board at 11pm.\n\nThe next day","6":" we had not finished coaling, so we were marched into the city arr. there about 10am, and granted leave till 2pm that day. Visited the zoo\n\nWhere the Ladies of Durban were entertaining wounded soldiers, who were returning to Australia by the hospital ship “Karoola\". About 1pm we returned to the city and paid the Y.M.C.A. a visit, where we had a splendid tea, consisting of Fish Salad, bread and butter, Tea and as much fruit as we could eat for the small sum of four pence.\n\nAfter taking a few photographs I returned to the boat\n\nat 2pm, but did not sail till 5.15pm.\n\nBefore we sailed the Ladies were handing baskets full of oranges and pineapples to the Boys.\n\nThe Boys all enjoyed themselves at Durban and would have liked to have spent a few more days there.\n\nThe first day out from Durban we had it very rough but as all the Boys had their “Sea Legs\" by this time, it did no effect them in any way.\n\nReveille at 6.30am\n\nRoll call 7am\n\nBreakfast 7.30am\n\nGeneral Parade 9.30am\n\nRetreat 11.30am\n\nDinner 12 noon\n\nParade again 2pm\n\nRetreat 4pm\n\nTea 4.30pm\n\nHammock parade and roll call 5.30pm\n\nFirst Post 9pm\n\nLast Post 9.30pm\n\nLights out 9.45pm\n\nBetween Port Melbourne and Durban (only) Life boat drill, signalled by one long and three short blasts on the steam siren.\n\nIt was so rough that the ship was only doing about two knots per hour, and the sea was breaking over the forecastle. \n\nKept in sight of land, till we reached Capetown, when we sighted the lights at 7.30pm on Nov.13th.\n\nWe lay off in the Bay till the next morning (14thNov.) when the ship made fast in the Wharf at 6.30am.\n\nNo leave granted, as the Capetown medical officer said that we had a case of\n\nMeningitis on board, but the ships Doctor said that it was nothing of the kind, any way the ship was isolated.\n\nThe general opinion on board was that it was a tale put up by the shore officials to keep the Boys on the ship, as some of the previous ship’s with Australians had played up and had destroyed a few places (hotels).\n\nIn the afternoon we were allowed to go for a route march.\n","7":"\n\nRoute march in the morning, and back in time for dinner.\n\nAfter dinner we were marched to the oval where we had sports, Tea and cakes provided by the Ladies of Capetown.\n\nAbout 5 O’clock we marched to the Feather Market where the Y.M.C.A. provided us with Tea, scones, cakes and fruit, then a concert after, but I don’t think many of the Boys remained\n\nas they were anxious to see the city.\n\nThere was a guard at the entrance to prevent us going out, but the Boys we in a body and of course the guard was helpless.\n\nAfter leaving the Feather Market I boarded a tram at the Statin in Adderley St. and went for a circular trip to Camp’s Bay, (said to be the finest tram ride in the World) eleven miles round the “Lions Head\" (A high peak alongside Table Mountain)\n\nThe car goes up Adderley St. over the Kloof Nek, along The Twelve Apostles, rising 700 ft. above sea level, and down into Camp’s Bay.\n\nThe fare for the circular journey with break at Camp’s Bay is one shilling for Australians and New Zealanders in khaki.\n\nThe actual time taken is one hour twenty minutes.\n\nThe trip affords a fine panoramic\n\nView of Capetown and the Suburbs.\n\nOn approaching the Nek the “Devils Peak\" may be seen on the left above Groote Schuwr and the Lions Head on the right.\n\nOver the Nek, on the shoulder of the “Lions Head\" are the famous Silver Trees, while the Apostles extend on the left.\n\nCamp’s bay is said to be the prettiest Watering Place in the Cape Peninsular.\n\nThere we visited the Warmed sea water swimming bath, but were unable to get a dip as the baths were reserved for clubs that day. (Mixed bathing too)\n\nAny other time the Attendant will admit you and give you the use of a costume and towel, free of charge.\n\nAfter coming out of the Baths the Ladies provide Tea and a cake free between the hours of 2 and 5 pm\n\nto all Australians and N. Zealand soldiers, in the Tea rooms called the Old Pagoda under the Pines.\n\nShould you wish to write to your friends at home the Ladies will provide you with all necessary writing materials.\n\nA very enjoyable afternoon may be spent at Camp’s Bay.\n\nWe had hard luck as it was getting dark\n\nwhen we arrived there, and were too late for Tea.\n\nWe then returned to the city via Sea Point, and by the time we had a walk round town and visited the great Promenade Pier, it was time to return to the boat.\n\nWe had to pass the Feather Market on our way to the ship and the Boys were just coming out of the Hall, so our party joined in with them and\n\nmarched back to the “Borda\" and got on board without any trouble.\n","8":"\n\nLeft Capetown at 6am\n","9":"\n\nAs we are now entering the danger zone, no lights are allowed on deck, and all port holes are covered.\n\nFinals of Tug o’ War today, and there was great excitement among \n\nour Boys when Artillery won.\n\nNov.24th Friday\n\nCrossed the “Line\" this morning about 6am.\n\nSmoking allowed only in the Well deck, and we have to go into the Washhouse to light up.\n\nNov.25th (Saturday)\n\nOrders issued that no smoking allowed on any part of the ship after dark, and that\n\nWe have to talk very quietly.\n\nThe Boys have all been wondering what’s doing as the ship has been changing her course nearly every hour.\n\nNov.26th (Sunday)\n\nEvery man to carry a lifebelt.\n\nSighted land at 6pm. (Freetown Sierra Leone. British West Africa).\n\nArrived in bay about 7pm\n\nLay off in Bay until next morning\n\nList of ships at\n\nNov.27th (Monday)\n\nWent into the Bay and as ther is no wharf we lay off from shore.\n\nFreetown, Sierra Leone B.W.A. is a Naval Base.\n\nH.M.S. Donegal\n\nH.M.S. King Alfred\n\nH.M.S. Swiftsure\n\nH.M.S. Highflyer\n\nH.M.S. Kent\n\nFrench Man O War Duflex\n\nFleet store ship East Wales\n\nH.M.S. Sutlej\n\nFreetown Seirra Leone B.W.A.\n\nH.M.S. Borda\n\nH.M.S. Willochra\n\nH.M.S. Tofua\n\nH.M.S. Boonah\n\nH.M.S. Argyllshire\n\nH.M.S. Port of Melbourne\n\nH.M.S. Port Lincoln\n\nH.M.S. Durham Castle\n\nH.M.S. City of Sparta\n\nH.M.S. Ulysses\n\nH.M.S. Ascanius\n\nH.M.S. Marathon\n\nH.M.S. Port Nicholas\n\nH.M.S. Benalla\n\nH.M.S. Afric\n\nCoal ship Portsea\n\nAlso armed Merchant man\n\nOphir (Orient)\n\nMarmora (P and O)\n\nOrotava (P.S.N.Co.)\n","10":"\n\nAbout 10 am we went ashore in the ships boats, pulled by a small steam tug.\n\nGranted leave till 3pm.\n\nHad a good ramble round town visited Victoria Park, and the only White people to be seen about the place is the Government officials, and a few store keepers.\n\nThe rest are all blacks.\n\nIt is a very interesting place, and one particular thing I noticed is that the streets are not formed.\n\nThey seem to be only beaten tracks.\n\nAfter walking about for two hours we began to feel hungry, but could not find a Café so we bought lemonade and biscuits at the store.\n\nWhile eating them the Blacks kids were round us like bees, cadging\n\nbiscuits.\n\nWe then visited the fruit market and bought some fruit, then made our way to the Wharf.\n\nGoing back to the ship we were so crowded in the barge, that by the time we got on “Borda\" our clothes were saturated with perspiration.\n\nThen there was a great rush for the bathrooms for cold showers, and change of clothes before tea.\n\nWe did not get any more leave during our stay in Sierra Leone.\n\nWhile lying in the Bay the natives came alongside every day in canoes and rowing boats selling fish and fruit (Oranges 24 for 1 shilling, Bananas 1 shilling per doz, Coconuts 3pence each, Limes 3 pence per doz).\n\nThe Boys were greatly amused by the natives diving for silver.\n\nThe Saturday before leaving Freetown we had to take 60 sailors on board from the H.M.S.King Alfred.\n\nThe sailors were reserves, and were going to England.\n\nWe had also to take 450 men (Australian Soldiers) from the Port Lincoln on board, as their ship had run onto a sand bank at the mouth of the Harbour, and had strained her plates in her effort to get off.\n\nAs our boat carried on thousand, five hundred (1500) troops before, and with these extra 600 coming on board, we are now packed like sardines.\n\nA certain number of the Port Lincoln troops, were allotted to each Transport and the remainder were sent to the barracks ashore.\n\nDuring our stay here it was very hot, the temperature ranging from100 degree to 110 degree in the shade, and we were\n\nall glad when we weighed anchor at 4.35 pm on","11":" and thought we had seen the last of this Hell as the Boys called it.\n\nAfter being a little over three days sail from Sierra Leone and just beginning to get into the cool climate when we received a wireless massage ordering our boat back to Sierra Leone.(It was rumered that the German Raider was not far off about 10 miles) \n\nWe turned back about 2 am on","12":"\n\nWhen the Boys got out of bed in the morning and found out, that they wee returning to Sierra Leone, they did enjoy themselves.\n\nThe language was something awful.\n\nWe arrived back at Freetown about 2 pm","13":" to find that the other Transports has also returned.\n\nThere were now about 30 ships in the bay including two French cruisers.\n\nAs the “Borda\" has not coaled since leaving Capetown her supply is getting very low, and as labor if scarce we have all been detailed to assist in the coaling of the ship, when the collier comes alongside.\n","14":"\n\nFive or six Troopships left the bay this\n\nafternoon about 3.30 with escort of Auxilary Cruiser Marmura (Pand O) and French cruiser Duflex. Said to be going to Dakar for Guns.\n\nOur ship has to stay behind as we have not coaled yet.\n","15":"\n\nCollliers came alongside this morning about 7am and the first shift of 34th Infantry started at 8.30am (64 men from each unit)\n\nThey were nice and clean when they\n\nWent down the hold of the collier, but what a difference when they finished their shift of 3 ½ hours.\n\nThey were as black as niggers.\n\nNevertheless the 34th Infantry tore in and put up a fine performance.\n\nThere we followed by the first team of Field Artillery, who suffered from a shortage if bags.\n\nThe 33rd next went into the fray. They were practically unhampered throughout\n\nand topped all other scores by many tons averaging 41 tons per hour.\n\nGreat grafters the 33rd.\n\nThe 35th put in a good performance and would have bettered it by many toms had they not been without lights for 1 ¼ hours.\n\nThe 36th only worked 2 hours 35 mins, but averaged 43 ¾ tons per hour during that time.\n\nThe","16":" Pioneers put up a great effort and finished in third place.\n\nThe second team of Artillery suffered\n\nFrom jammed bunkers; the 37th and T.M.R. also suffered this disability.\n\nFinishing was done by the 39th, the most awkward coaling shift next the opening one.\n\nTonnage worked by each unit\n\n34th Inf. 84\n\nF.A.1st team83\n\n33rd Inf.123\n\n35thInf. 90\n\n36th Inf. 111\n","17":" Pioneers 108\n\nF.A.2nd team 67\n\n37th Inf. 64\n\nT.M.B.and A.S.C.60\n\nThe Admiralty, so runs the tale, asked skipper if he could get 850 tons on board I 48 hours.\n\nHe replied it could be done in 36 hours a statement which was received with polite incredulity.\n\nWell; it was done in 28 ½ hours, and everybody concerned can be very proud of the performance.\n\nJohn and I were in the second shift of the F.A.3 till 6am.Trousers, white hat and boots\n\nwere all the clothes we had on.\n\nWe had to fill 2cwt. Bags, and whenever we had ten filled they were hauled up by the ships wenches.\n\nSix men in each corner of the hold two holding the bags and (4) four filling.\n\nAt first I did not like the job but soon got used to it. The dust was something awful, and we were not very long in the hold before we were\n\nas black as the coal and we could only recognise one another by their voice.\n\nDuring this shift they called for five volunteers to go into the Bordas bunkers to relieve the firemen in clearing the shoots, as we had been sending the coal down so quick that they got chocked.\n\nJohn and I volunteered, and when we got down below the dust was so thick that we could hardly see our hand\n\nIn front of us. I was jolly glad when I got out of it, and back to the collier.\n\nAt 6am we finished our shift and then there was a great rush for the baths and we had to use a scrubbing brush to get the black off.\n\nAfter getting nice and clean, one of the Boys, who had not washed, would either hug, or brush up against you, and you had to start again\n\nwith the scrubbing brush.\n\nNothing of any importance happened during the remaining few days of our stay at Freetown.\n","18":"\n\nArtillery mounted guard at 6pm.\n\nFinished guard at 6pm next day (Xmas)\n","19":"\n\nHad a great dinner (I don’t think)\n\nLeg of Lamb and a small piece of greasy pudding.\n","20":" Dec.16\n\nGreat cheering when we sailed away from Sierra Leone at 10.30am.\n\nI reckon if we had remained much longer at Lierra Leone, the Borda, would have been a Hospital Ship as some mornings between three and four hundred were up before the Doctors.\n\nThe Hospitals were full and dozens of the Boys were walking about with Mumps, unable to\n\nto get into the Hospital.\n\nThe H.M.S. Kent, Durham Castle, City of Sparta, and the Marathon left at the same time, and when we got out of the Bay we got into the following formation.\n\nDiagram drawn showing position of these 5 ships in one,two,two formation H.M.S Kent leading and Borda in the second two\n\n \n\nAbout 8.30 this morning we sighted five Transports, Auxilary Cruiser, and French Warship.\n\nAt 9.30am we started going round in a circle as we had to wait until the other ships made up to us and it was a great sight watching the manoeuvers of all the boats getting into line.(These were the transports that left Sierra Leone a few days before us, to get guns at Dakar)\n\n \n\nThe following is the formation that we got into, and kept on our way to England\n\nDiagram drawn showing one, three, three, three formation H.M.S.Kent continues to lead.\n\nAfter getting into this formation the French Warship and the Auxilary Cruisers left us.\n","21":" Jan.1917\n\nVery quiet day. The last few days we have been put on half rations and we never get enough to eat. No use complaining to the Orderley Officer. Stew for breakfast, Soup, Roast and rice for dinner no potatoes or any kind of vegetables, Bread and butter for tea, occasionally a little cold meat.\n\nTucker very poor, and sometimes unfit to eat \n","22":"\n\nAbout 4pm the H.M.S.Kent left us then the Transports all went separate routes. At five o’clock 10 destroyers came alongside but only two remained, the remainder going with the other transports.\n","23":"\n\nVery rough we have to hang on to the rails, as it is impossible to stand without holding on to something.\n\nAbout 8.30pm we sighted the first lighthouse in England\n","24":"\n\nArrived in Plymouth at 4am .Disembarked at 2pm. Taken ashore by the S.S.Sir Walter Raleigh.\n\nLeft Plymouth at 4.15pm by corridor train (G.W.R.) John and I and four others had a lovely first class compartment. At Exeter we were provided with Tea and buns by the ladies. All blinds have to be kept down on case of Zep. Raids, Very little\n\nlight in the station and the lamp glasses are painted black.\n\nAt 10.30pm we arrived at Tedworth. Then we had a four mile march to Park-house Camp Salisbury Plain.\n\nArriving there about 12 midnight.\n\nWe were kept out in the cold till nearly 2am as they had not arranged for our coming. Then we had to be issued with blankets (four).\n\nWe were then put into a hut (40men). About 3am our biscuits and tinned meat, arrived from the Station, and we did enjoy them as we had nothing to eat after 12o’clock dinner on the “Borda\" except the bun that we had at Exeter.\n\nWed.10thJan17\n\nDid not get out of bed till 9am as we were all so tired after our march the night before.\n\nNo parades so have just been walking about Camp. Snow on ground this morning.\n","25":"\n\nAfter dinner walked to the village of Shipton, it is the right old English style. Thatched roofs and a creek running alongside the main street.\n","26":"\n\nRoute march this morning and after dinner snow started\n\nto fall and all the Boys were crowding round the windows watching it fall. Great excitement but none went outside it see it. It was too cold.\n","27":"\n\nOne of the Artillery Boys who had Mumps on board “Borda\" and was sent into the Devonport Hospital returned last night and was allotted to our hut. \n\nAs he did not feel too good he went\n\nTo the Doctor this morning.\n\nHe was sent into the Hospital with measles, and all the Boys in the Hut (No24) were isolated.\n\nWe were taken off the Parade ground and sent into the hut, and not allowed to mix with the other men.\n\nI don’t think the Boys mind, as they will get out of the long route marches.\n","28":"\n\nLeft Parkhouse Camp this morning at about 11am and had a seven or eight mile march to Larkhill Camp.\n\nArrived at Larkhill about dinner time ans ther was a good dinner of roast beef, potatoes and cabbage waiting for us.\n\nMeasley mob visited the Doctor to see if we could get out of isolation\n\nbut no luck. Were told to stay in hut.\n","29":"\n\nHeavy fall of snow (about 6 inches). The Boys from the Isolation went out and had a good snow fight.\n","30":"\n\nAllowed out of isolation about 2pm\n\n"}}