{"Document Name":{"0":"Diary_0295","1":"Diary_0295","2":"Diary_0295","3":"Diary_0295","4":"Diary_0295","5":"Diary_0295","6":"Diary_0295","7":"Diary_0295","8":"Diary_0295","9":"Diary_0295","10":"Diary_0295","11":"Diary_0295","12":"Diary_0295","13":"Diary_0295","14":"Diary_0295","15":"Diary_0295","16":"Diary_0295","17":"Diary_0295","18":"Diary_0295","19":"Diary_0295","20":"Diary_0295","21":"Diary_0295","22":"Diary_0295","23":"Diary_0295","24":"Diary_0295","25":"Diary_0295","26":"Diary_0295","27":"Diary_0295","28":"Diary_0295","29":"Diary_0295","30":"Diary_0295","31":"Diary_0295","32":"Diary_0295","33":"Diary_0295","34":"Diary_0295","35":"Diary_0295","36":"Diary_0295","37":"Diary_0295","38":"Diary_0295","39":"Diary_0295","40":"Diary_0295","41":"Diary_0295","42":"Diary_0295","43":"Diary_0295","44":"Diary_0295","45":"Diary_0295","46":"Diary_0295","47":"Diary_0295","48":"Diary_0295","49":"Diary_0295","50":"Diary_0295","51":"Diary_0295","52":"Diary_0295","53":"Diary_0295","54":"Diary_0295","55":"Diary_0295","56":"Diary_0295","57":"Diary_0295","58":"Diary_0295","59":"Diary_0295"},"Date":{"0":"unknown","1":1156.0,"2":1157.0,"3":1158.0,"4":1159.0,"5":1160.0,"6":1161.0,"7":1162.0,"8":1163.0,"9":1164.0,"10":1165.0,"11":1166.0,"12":1167.0,"13":1168.0,"14":1169.0,"15":1170.0,"16":1171.0,"17":1172.0,"18":1173.0,"19":1186.0,"20":1188.0,"21":1189.0,"22":1190.0,"23":1200.0,"24":1209.0,"25":1210.0,"26":1211.0,"27":1212.0,"28":1213.0,"29":1214.0,"30":1215.0,"31":1216.0,"32":1217.0,"33":1218.0,"34":1219.0,"35":1220.0,"36":1221.0,"37":1222.0,"38":1223.0,"39":1224.0,"40":1225.0,"41":1226.0,"42":1227.0,"43":1228.0,"44":1229.0,"45":1230.0,"46":1231.0,"47":1232.0,"48":1233.0,"49":1234.0,"50":1235.0,"51":1236.0,"52":1237.0,"53":1238.0,"54":1240.0,"55":1241.0,"56":1242.0,"57":1243.0,"58":1244.0,"59":1245.0},"Entry":{"0":"\n\nThis volume opens in a lightsome tone, how could it be otherwise. Two Australians swanking in khaki in the reserved seats at a picture theatre, with bright music, and with two pink-cheeked English \"wussies\" by their side, are not likely to feel down-cast and for the moment, at least, the sorrows of military service and reduced to the happy minimum.\n\nThe music was good, the pictures fair, the seats comfortable etc, etc, but ……. At 10.20 we had to flee from our cosy seats, and seek the coldness of Tottenham Road. Our friends escorted us to Euston Station, which was within a few minutes walk from their home and we boarded the 10.50 train to Birmingham after the process of victualling had taken place. This being the mail train, it\n\nwas comparatively slow & landed us in Birmingham at 3.30 A.M. The night was fairly dark & it is compulsory to keep a;; blinds down whilst travelling, so we did not try to admire the passing scenery but slept the trip through.\n\n","1":"\n\nOf course Alan & I were quite at sea when we arrived at B’ham station & as the place was in almost total darkness (for Zepps.) we found it rather difficult to improve upon our ignorance of the ins & outs of the place. However, after wandering about for a while, we came upon an English \"Tommy\", who kindly took us to the Sailors & Soldiers Institute & there for the large sum of 9d we got a bed for the rest of the night. The beds we really fine, & being the first we had had since leaving Sydney, we greatly\n\nappreciated them, and in order to show our appreciation, slept in till 10 o’clock. At 10.30 we tasted & paid for, the Institute’s eggs & toast and then proceeded along Corporation St in search of the premises of Messrs Sames, piano makers & salesmen, to whom Alan had a card of introduction from Palings. \n\nWe found the retail city shop & thence were directed to the factory & arrived at the latter at 12.15 & were cordially welcomed by Mr Sames Sen. & his two sons & after being shown over the premises, were taken into town again in Mr Leonard Sames’ car & had dinner (a little turkey etc) at the \"Midland’s\" Hotel. \n\nIn the afternoon we went for a tour in the car around the suburbs of B’ham, seeing among other\n\nthings the University Buildings, which are at present used as a hospital for soldiers, we also went through Bournville, Cadbury’s model village, Chamberlain’s residence, and much of the English country areas. We then went for tea to Mr L. Sames’ home & spent a very pleasant hour or so there.\n\nIn the evening we motored back to town & the three of us occupied a box at one of the Variety Theatres & enjoyed the programme very much. Oyster supper at Pape’s Hotel followed & Alan & I then dodged off to the Soldiers’ Club & arrived there by midnight to find that all the beds were taken.\n\nNothing perturbed we got two blankets & a cushion each for 3d & slept on the floor of the billiard room in company with a score or more of other \"swaddies\" as happy as could be.\n","2":"\n\nBreakfast at Soldiers’ Club at 9.30. We sat at the same table as a convalescent soldier who had stayed at the Club for the night instead of going home to his hospital & he was on his last sixpence we had to pay for his breakfast but in return he told us all about the trenches & & fighting in France and gave us a very entertaining hour.\n\nMr Sames brought his car into town for us at 11 o’clock and drove us out to Mr Allen Gibbs’ home at Moseley, to whom Alan had a letter of introduction. Mr Gibbs’ home was a very fine one and his family were most exceedingly kind to us and strove to their utmost, by deed & word, to make us feel at home.\n\nHe has two sons & two daughters at home, & the daughters especially were simply grand. Before dinner his eldest son took us for a drive in their car and showed\n\nus some more of the snow covered fields surrounding B’ham. The afternoon was cold & snowy & so we stayed at home beside the fire and talked & played etc, etc. The evening we spent in much the same way & by midnight we felt just as much at home there as if we had been living there for a month, and, tired out, turned into a nice warm bed & dreamed of ……- by the way, I don’t think we dreamed at all.\n","3":"\n\nBreakfast at 9.30 and by 10.30 we left for town, followed by a very warm invitation from every member of the family, to return upon the first opportunity. One of the daughters, Gladys by name, came into town with us to show us round & to take us to dinner.\n\nAfter buying a few cards & presents for home we called at Mr Sames’ shop & he then took the three of us to dinner at the S. & N. W.\n\nRailways’ \"Queens\" Hotel. After dinner we went with him & Gladys to the pictures. These were very good, but the best part of the entertainment was a suite of Selections by a fine Russian violinist. His performance was wonderful.\n\nOur two friends then saw us to the Railway Platform, after having afternoon tea, & we caught the 4.50 train to London.\n\nThere were 6 other \"swaddies\" in the carriage with us, most of them being \"Tommies\", and as one of them was very soon quite drunk, we had a nice bright time. By 7.25 we arrived & Euston took the tube thence to Waterloo Station. Who should sit opposite us in the tube than our two London girls? We persuaded them to come to the station with us to see us off, and very nice too!!\n\nTrain to Amesbury occupied the time from 9 – 12 P.M. & after walking a mile or so towards our \"home\" from the latter, we\n\nmanaged to get a taxi & seven of us scrambled into the ’Ford’ & thus pleasantly ended a very pleasant holiday. We arrived at Rellestore by 1.30 & were in bed by 2.\n\nWe were suffering rather severely at this time with chilled feet & this to a degree interfered with the enjoyment of our furlough ,but since then we have almost recovered, as a result of oiling & massaging.\n","4":"\n\nUp at 7 to go through the usual parade routine etc. We commenced elementary musketry exercises today. The snow is thawing now & this means that there is mud everywhere, especially on the main thoroughfare of the camp & we have mud all over our boots, puttees & overcoat tails, much to our discomfort etc. However, spring \nis\n coming.\n\nOur Australian military boots have proved quite useless to keep out the\n\n \n\nwet etc, here & so we are all issued with new imperial boots, which are infinitely thicker & heavier than the Australian issue. They have steel horse-shoe heels steel toe-caps as well as a large number of large headed nails & are very hard on the feet but will stand any amount of wear & bad weather, They are particularly meant for service work in France.\n\nThe evening was spent in Salvation Army hut, but being too tired to write we turned in early. Being now financial we can treat ourselves to a little light supper each evening; this usually consists of tea & cakes & is very nice after the day’s work. A good hot shower helped to drive out the evil effects of the previous evening’s trip & the three Australian letters warmed up our hearts ere our eyelids closed, so today wasn’t so bad after all.\n\n \n","5":"\n\nUsual full day’s drill in mud & ice. Evening in Y.M.C.A. Hut, where we heard a very stirring address on the grandeur of a pure life by an Anglican Canon.\n","6":"\n\nUsual day’s work.\n\nEvening in Regimental writing room, where there is one of the best stoves in camp.\n","7":"\n\nUsual work, especially musketry exercises. Throat very sore all day as a result of a cold caught while on leave.\n\nEvening in Regimental Writing Room.\n","8":"\n\nRoute march with full pack & rifle this morning. The mud on the roads was simply \"out of bounds\" & we arrived back at camp with boots & puttees pasted over with the stuff & our overcoat tails were a disgrace to Australian dignity. However we are so used to it now that we paddle through it like young children & quite enjoy the fun. Talk about wading through blood & tears to\n\nvictory & glory! We are only as yet wading through mud.\n\nIn the afternoon, Fred Heap, Alan’s friend, took us to the Shrewton Manor House for the evening. We arrived there in time for tea & after doing it justice spent the evening in front of a fine \"Olde Englishe\" fire, with soft sofas cushions & music \"to taste\". Mrs Pratt is the hostess & seems to be only too glad for any of the lads to come to her home. She is a grand old lady, with snow-white hair and a bright, beaming smile & is a mother to every wanderer who comes her way.\n\nShe particularly asked us to be sure & come back again whenever we could & no doubt we will avail ourselves of this invitation in the future. The Manor House itself dates back a couple of centuries, I believe, & although rather uncompromising\n\nfrom the exterior, it is most spacious & exquisite & homely inside, & everything is of the best, (including the soup & trifle etc). We took a short cut home from this place & walked for about ¾ of a mile over a ploughed field. We didn’t mind the mud!!!\n","9":"\n\nChurch Parade in morning. In afternoon we again walked to Shrewton & had tea in a little private house. There are quite a number of private people, there who entertain paying guests for tea & to one of these places we went. \n\nThe place we chose was one of a terrace of houses built in 1842 out of brick & stone & mud. The terrace was built shortly after the great flood of ’41 & all profits coming from the houses in the way of rent go towards the upkeep of the poor of the parish. There is a large plate on the terrace giving\n\nthis information to visitors & this is plainly visible in one of the picture post-cards which I an sending home.\n\nWe spent a pleasant hour in this house in front of the big open fire & also had a nice, although plain, tea.\n\nIn the evening we went to the Shrewton Anglican Church, a P.C. of which I am also sending home.\n\nOur walk home was very enjoyable for the lads we met in Shrewton told us that some \nletters\n were waiting for us in Camp, and letters above all things else are the joy of every soldiers’ heart; they are the solace of his lonely moments, the substance of his hopes.\n","10":"\n\nUsual work today including Platoon drill. At 4 P.M. I was called up for guard, which extends over the 24 hours. My post was inside the \n\ndetention room & my duty to keep an eye on the prisoners, of whom there were 11 when I went on duty & 19 when I came off. The job was not too congenial but we have to take the good with the bad. The prisoners gave me no trouble; perhaps because I was armed with a naked bayonet! but the guard room itself was so small & inconvenient that I had not a wink of sleep for the 24 hours. Part of the time was spent in washing & writing, part in dreaming etc.\n","11":"\n\nOn guard till 4 P.M. Too tired to do anything then until bed time.\n","12":"\n\nUsual work, including turnings on the march & saluting.\n\nEvening in Regimental Writing Room with Les Dimond & Alan.\n","13":"\n\nUsual drill. Paid 30\/-. Y.M.C.A in evening, writing etc.\n\nFeb 23\n\nUsual drill in morning. As it rained in the afternoon we were issued with service rainproofs, & of these the boys are very proud. Y.M.C.A. in evening.\n\nTo my surprise my weight, without great coat, was 11 stone 2 lbs. This is not bad considering that I was 9-6 upon date of enlistment on","14":" last year.\n","15":"\n\nWe had a very enjoyable route march in the morning. In the afternoon Alan & I went to Shrewton and after walking right through that place, continued along the main street into the country beyond. After going for about 1 ½ miles we discovered between two hills a quiet little hamlet & immediately made straight for it. Upon investigation we found that it was a very diminutive village of about fifty houses, with two churches, photos of which I posted home, one Inn &\n\none small shop. A very small boy, to whom we spoke, escorted us through the place & interested a good deal & after we had given him a couple of pennies & some cigarette cards for his birthday, which was a few days back, he was very anxious in inviting us back another day. At tea time we resorted to the only shop in the place but were somewhat dismayed when the lady told us that she could not supply us. However, she had plenty of bread etc, & so we bought 2lb of bread & 1lb bottle of jam & cut the loaf into five slices & spread all the jam on it & sat down on the wayside to eat it. An old lady noticed us & very kindly sent over to us a nice jug of hot tea & a cup & we just \"carried on\" until…….there was none left. We then started home & after about four miles walk\n\nthrough mud inches deep we landed home quite satisfied with our little excursion.\n","16":"\n\nChurch Parade in morning. At two o’clock we mounted a motor chars-a-banc & with 28 other \"swaddies\", including Les & Alan, went to Salisbury City. The drive occupied about an hour & a quarter & was grand. We passed through fields, across creeks & rivulets, through several hamlets & one fairly large town & after going through a mile or so of Salisbury itself, we again took to foot. We had a nice quiet walk through the city & into its suburban lands & through the Cathedral lands, having a good look at the Cathedral itself.\n\nWe had afternoon tea in a flash wee restaurant somewhat after the style of the \"Chic\" in Hunter St. It was called\n\nAt Salisbury the weather was simply perfect & the sun was shining brightly & we seemed in quite a new clime; you may therefore guess how surprised we were upon finding the the temperature in the middle of the afternoon was 4.6°F. Goodness only knows what it must be at \"Rollestone\" at times.\n\n\"The Gold fish\". Later we had tea & then went to the evening service at the Cathedral which we enjoyed; the organ music was especially fine. The organ itself has wonderful power & the gothic nature of the building’s architecture added a wonderful echo effect to its music. As we walked away from the place after the service the throb of the organ followed us until the houses intervened & brought us back to the consciousness that we had to return to our muddy camp.\n\nAfter a nice drive through the country with a young moon shining down upon us, we arrived home at 9.30 & were soon sound asleep in our little bunks.\n","17":"\n\nUsual work to-day including platoon drill. We were also issued with\n\nMch 3\n\nIn afternoon Alan & I walked about 3 ½ miles to the tiny village of Winterbourne Stoke & had tea there, the wherewithal having been purchased at the local store.\n\na new style of paybook in which both our debit & credit accounts are shown to date. Y.M.C.A. hut in evening.\n","18":" – Mch 1\n\nUsual drill. We were also issued with razor, Jack-knife & lanyard, flannel belts etc. which now makes our equipment complete.\n\nMch 2\n\nI was detailed to-day with a party to do a few hours pick & shovel work & at this strenuous occupation filled in most of the day.\n\nMch 3\n\nUsual Saturday’s route march after which we underwent a feet inspection by our officers.\n\nMch 4\n\nI was detailed as a member of a fatigue party this morning & instead of attending Church Parade we were marched to head quarters to receive instructions & to our gratification found that there was nothing to do. Alan & I then went for a walk to the A.I.F.\n\nCamp at \"Lark Hill\", about 1 ¼ miles from \"Rollestone\".\n\nAfter dinner we walked to the village of Orcheston, - about which I have already told you, - but to our disappointment we discovered that we could not get tea at the Inn, & of course the store was closed. We had expected to get tea there & to attend the local church in the evening, but had to wend our way back to Shrewton: Once there we soon found ourselves inside a small mud & brick house with eggs & bacon & bread before us & in the usual way we said good-bye to the victuals. After warming ourselves before the big open fire for an hour we adjourned to St Mary’s Church & were back to Camp by 9 o’clock, tired & sore but still hopeful & happy.\n\nMch 5\n\nHaving completed the more elementary part of our training, we entered the \"Bull Ring\" today. In this we are trained in the various drills which are of immediate value at the front and spend an hour on each subject, a change of work taking place at each \"smoko\". In the morning we had our usual hours march, then did a little \"Company Drill\" for an hour and then bayonet fighting for the same time. After dinner we did \"Extended order\" work, had a lecture on the use & value of bombing in modern warfare & finished up with physical training & organised games.\n\nMch 6\n\n\"Bull-Ring\" again.\n\nMch 7\n\nThe wind was so cold & so severe this morning that we could not drill in the usual way & so spent the day indoors. In the morning we cleared all the forms & tables from the \"Dining Hall\" & after having a lecture on Open Warfare\n\nwe did an hour’s Physical Training. In the afternoon I was detailed for guard & at 2 P.M. had to fall in for instructions on guard-work. At 3.30 the bugle call for \"fall out guard\" was blown & headed by the band ,with fixed bayonets we marched to our post in full ceremonial fashion, the guard was changed.\n\nMch 8\n\nMy post was at the door of the detention room & my duty to see that none of the inmates escaped. As penalty for losing a prisoner, a guard has to go into the cell himself & serve the time in place of the \"bird\" who escaped. The guard is armed with a short, bare bayonet which he is instructed to use if at all necessary. Whilst on guard we can’t go to sleep on account of the smallness & dirtiness of the guard-room. However we can partly drown our sorrows in tea for we get two good supplies of\n\nthis during the night. Whilst getting our bucket of tea from the cook-house, \"Liverpool\" & myself managed to lay our hands on a half-loaf of bread, & a couple of bloaters apiece, & accordingly found for ourselves a pleasant occupation for a few minutes immediately succeeding.\n\nHowever, despite such variations we were by no means sorry when the new guard relieved us, & I can assure you, I needed no rocking to put me to sleep that night.\n","19":"\n\nSnow fell fairly thick last night & it was also falling during our morning’s parade & as a result we had to resort to the \"Dining Hall\" & there had a lecture on the service bomb known as the \"Mills’ Hand Grenade\". We then did an hours Physical Training & this was followed by exercises in which we used rifles as dumb-bells.\n\nIn the afternoon, a mass parade of all hands, including cooks etc, was called & this was followed by a medical inspection & a kit inspection.\n\nMch 10\n\nRoute march as usual in morning. The roads were very muddy & we were thoroughly coated with mud & clay. Alan was a bit tired in the afternoon so I went for a long walk through Shrewton & Oncheston & out into the fields beyond & must have covered about 8 miles between lunch time & bed-time. I had tea in a small old-fashioned house in Shrewton at the cost of 10d. I noticed that the lady only charged the other lads 9d & came to the conclusion that the extra tariff was put on me because I put some sugar on my bread & butter. When I get back to Australia, as perhaps I may, I will be able to \"pinch\" sugar without\n\nbeing docked for it, but as yet, such delicacies must only be dreamed of by poor privates.\n","20":"\n\nChurch Parade on the open air this morning was disturbed by the rain & the service had to be much curtailed as a consequence.\n\nAfter dinner Ptes. Lloyd, Piggott & McRae J.D. went to Shrewton for an early tea & then walked to the Orcheston Church for evening service. The service was beautifully simple & we thoroughly enjoyed it, as did we also the 3 miles walk back.\n\nWhen we arrived back at our hut we were deeply grieved at finding four of our hutmates dead-drunk, and another one \"on the road\". Two of them were in an awful state, the other two were noisy & merry. At about 10 o’clock the fifth man turned up, as drunk as could be & coated from head to foot with mud & wearing someone\n\nelse’s hat. \"Bluey\" Cavanagh, such is his name – is a fine little chap in his own rough way & I like him very much. He must be about 30 yrs of age & was a \"navvy\" on the N.S.W. Railways. Although his manner is what might be expected under the circumstances, his heart is good, & his feelings are extremely sensitive. Sad to say \"Bluey\" has been rather drunk the last three nights & on Friday night he got into trouble with someone & came home with a long cut on his cheek & three of this teeth knocked out & as a result looks rather battered in appearance. However, while such \"rough diamonds\" can be found, I will have faith in human nature to the uttermost.\n","21":"\n\nWith a party of 40 men I was detailed as one of a \"firing-party\" at an officers funeral which was to take place next day. We were drilled in slow-marching\n\nand the \"reverse arms\", \"rest on the arms reversed\" & \"firing the salute\" etc.\n\nMch 13\n\nA final rehearsal of our drill took place in the morning before the Adjutant & the Major of our T.B. & we then set to & polished ourselves up for the afternoon.\n\nAfter dinner we","22":" miles to meet the gun carriage & coffin & then accompanied it to the Church in Durrington to the tune & time of the \"Dead March in Saul\" and also Chopin’s \"March Funebre\" both of which were rendered in grand style by our full Battalion Band, and it takes a band to give the full spirit to these grand marches. Our party in all consisted of the band, led by the drum-major with his huge silver mounted baton, officers, & about 200 men as mourners.\n\nThe service at the Durrington Church was short & impressive especially because of the old hymns which we sung, viz \"Rock of Ages\"\n\n& \"Abide with me\". We then had the procession to the cemetery in slow-time & after the burial service fired our three volleys of blank-cartridge as a salute, & presented-arms whilst the buglers sounded the \"Last Post\".\n\nWe then left the cemetery, formed up on the road & marches back to camp in great style to the tunes \"Keep your eye on Germany\", Australia will be there\" etc & arrived back in time for 7 o’clock tea & a hot bath at 8 and supper with \"bluey\" Cavanagh at 9.\n\nSuch a parade as this is of the pure ceremonial type & more than almost anything else inspires one with that military & regimental pride, commonly termed \"spirit de corps\". This sentiment was particularly evident as we marched home post the other camps and \"swanked it\" for all we knew.\n\nMch 14\n\n\"Bull Ring\" again especially bayonet exercises & open order work as under shell & musketry fire.\n\nMch 15-16\n\n\"Bull Ring\" & guard\n\nMch 17\n\nUsual Saturday’s route march in morning. Walked with Les Dimond & his friend to Orcheston in afternoon & there we bought a couple of bags of fancy biscuits & sat down on the roadside & shared them with three wee boys whom we met there. We had tea in Shrewton & strolled back early in the evening.\n\nMch 18\n\nChurch Parade in the morning. After dinner I went alone for a stroll across the hills. The afternoon was glorious. The sun forgot his bashfulness, and ventured once more to brighten the hills with his brightness. Gloominess was ushered from the landscape & the very grass of the fields & wayside & the trees of the valleys showed their gladness in their faces. How could\n\none feel downcast on such a day! Everything seemed to suggest that the world had decided to commence an era of peace & joy, but even then I heard in imagination the boom of distant guns & the whistling of shells on their message of slaughter, & I thought of the green hills of sunny France bathed in the blood of sacrifice & I saw the glistening tear run down the cheek of many a broken-hearted loved one & the temptation to ask \"how long? O Lord! how long?\" was upon one’s lips, but the freshness of the spring-time breeze, & the perfume of the newly ploughed ground, & the beauty of the cloud-sprayed blue above whispered hopes.\n\nMeanwhile some three ancient milestones found themselves between the wanderer & camp & then his footsteps were guided by fantasy down a narrow country lane, & past farmhouses & farms & fields\n\n& hayricks it led, bringing me finally on to a high vantage ground & thence I could discern the whole out-lay of a winding rivulet, with green banks & with a track meandering alongside. In the distance it lost itself behind the rolling hills & in the foreground it slowly crept round & through a picturesque English Village.\n\nI scarce know yet whether the Village draws itself out along the winding banks of the stream, or whether the stream goes peeping in & out the hidden parts of the village. All sign of artificiality is absent. The whole scene seems as natural & as touching & as suggestive as the blue-brown smoke that slowly rises to heaven from the chimney-tops. There is a suggestion of happy homes, of cosy firesides, of peace with the world. Such were the impressions which the first sight\n\n \n\nof the Village of Stapleford stamped upon my heart.\n\nBy now I was about six miles from Camp & once again took to the road & two miles further on, at Wishford Village, picked up another wayside wanderer from another A.I.F. Camp, who also came from Newtown, and with him I journeyed towards Salisbury City.\n\nHowever we had to pass through the town of Wilton ere reaching our destination & so had to tack across country in order to dodge the M.P.’s for we were by then \"out of bounds\" without a pass. The sally was successfully negotiated & by 6.30 we arrived at Salisbury & proceeded to the Soldier’s \"Guest House\" & had tea in a room known as \"Tipperary Room\". At 7 o’clock we went to the Cathedral Service & stayed to hear the grand organ play its\n\nfinale after the service was over.\n\nStrolling round after Church Service we met two nurses from the Salisbury Infirmary who seemed rather lonely, & we spent the next hour with them and caught the bus in time to get back to camp at 11.15. My nurse was rather young & had taken up her work since the outbreak of the war but could not get an appointment to a Base Hospital on account of her limited experience. She was very bright & had lovely pink cheeks, with dimples which showed themselves everytime she smiled, and as her manner suggested a good deal of culture & refinement we exchanged addresses. Of course an Australian in England can always speak to whom he likes, provided he behaves himself, & in this way we need never be at a loss when stranded in a strange city, & one has only to be careful & all is well.\n\nMch 19\n\n\"Bull-Ring\" again. In the evening we took our washing down to Shrewton & spent the evening at the house where we took our \"dirties\" and sat by the fireside with the two daughters who lived there. After having treated them to a few chocolates they seemed to become somewhat amiable towards us and we certainly enjoyed ourselves. We returned to camp at 9.30.\n\nMch 20\n\nRain and snow severally & together for most of the day. Accordingly we cleaned away the forms & tables from our mess-hut & did what drill we could in there.\n\nIn the afternoon & evening I was on duty with the \"Inlying Picquet\". This is merely an emergency squad, kept in camp in case of any unusual occurrence, such as fire or disturbance. We had to stay in a hut by ourselves while on duty. Our time as well as our programme were partly filled as the result of a little booty\n\ncaptured from stores. One of the lads procured a loaf of bread & we collected a few rations of margarine and between us polished off the lot, much to our satisfaction & gratification.\n\nMch 21\n\nCold & wet again, and part of our drill in the mess-hut. Walk to Shrewton in evening, having supper in the C.E. Soldier’s Institute there.\n\nMch 22\n\nSnow and rain & more snow again. Mess-hut was early sought to shelter the budding soldiers from the severity of the elements. Out interest was enlisted by a couple of lectures on bombing and bombing raids.\n\nEvening in C.E. writing room.\n\nMch 23\n\n\"Bull-Ring\" again. The usual routine was departed from for an hour and we were instructed & practiced in the construction of sand-bag revetments and barb-wire entanglements and were also shown the use of the P.H.\n\ngas-helmets, a very good & realistic picture of one of which I am enclosing.\n\nI spent the evening in the Regimental Writing room & had \"supper\" with \"Bluey Cavanagh\".\n\nMch 24\n\nRoute march in morning. Having a little money, five of us, Alan, Ron Piggott, Norman Lloyd, Gerald Spring & myself hired a car for Salisbury & arrived there in time for lunch. We forthwith proceeded to the \"Gold-Fish\", a nice little house after the style of the \"Chic\" in Hunter St. and there did the disappearing trick with certain rissoles, chocolate pudding etc.\n\nAfter a wander round the city Alan & I had tea at the Soldier’s \"Guest House\" and then visited the popular \"Picture House\".\n\nWe caught the 11 o’clock bus & arrived home by 1 o’clock.\n\nMch 25\n\nChurch Parade at 9.30. Hot-Bath at 10.30. Ron Piggott & I then walked to Salisbury (10M.) & had afternoon tea at \"Guest House\". In the afternoon I went for a walk along the river bank with my nurse, Miss Hayter, and had tea with her at 5.30. After tea I went out towards \"Old Sarum\"\n\nthe original stronghold of the historic Salisbury. It is a huge hill something like Mount Renuie in Moore Park, & has three tiers & each of \"steps\" is hollowed out to hold water. A gentleman told me that these ditches were 40’ deep in places. The stronghold originally stood on the top & each of the three ditches had to be crossed before the castle could be entered. The only remains of the edifice itself are a few remnants of old-fashioned guns which are partly covered with debris& protected now by the Antequarian Society. When I went to the City market square to get my bus home at 10 o’clock, I found that the last bus had just left and after making a few inquiries etc. I decided to walk back to camp. Of course it was too late by then to get anything to eat & as I felt rather hungry at the inception of so large a walk I knocked at the door of a private\n\n \n\nhouse on the outskirts of the city and asked for a snack. The gentleman cordially invited me in, despite the late hour and the untoward circumstances of the case and although he said he had very little to offer me, I dined to satiety. The lady of the house was very much like Mrs. King, of Haberfield, and was as kind & homely as could be. She boiled me two eggs & got me some nice warm tea & set a whole loaf of \ngood\n bread, & a large almond cake & plenty of real, fair dinkum \nbutter\n before me. By the way, butter is quite an unknown quantity in and around Camps. Margarine takes its place & even that ran short one day & white dripping was given us in its place. However these things are not at all bad, & it is wonderful how quickly one becomes used to them. To return to the point, I made a fine meal and then had a good chat with my host & hostess and at 12 midnight set out on my three hours walk, after an orange &\n\nan apple had been stowed away in my pocket for company. After being treated so well by strangers who knew me not, I felt exceeding happy & with a light heart & with a song on my lips – metaphorically of course – I picked my way through the darkness. The road was very dark & lonely; there is not a single house near it for about nine miles. At first the stars did make a feeble effort to twinkle down on me but soon the lowering clouds turned black & darkened the heavens, the wind began to blow & to get cold & biting & then a little later the rain came down & tried its best to find its way down my neck. This part of the scene was acted twice on the way but nevertheless I arrived home safe & sound at 3.15, next morning & after making my bed in the dark, found \"peace in sleep\".\n\nMch 26\n\nWe commenced a two-day’s course of instruction on the effects & prevention\n\nof effects of a gas attack.\n\nGas is a very potent opponent in the field unless full preventative measures are take; if such measures are taken it can do no harm.\n\nChlorine seems to be the most powerful gas used. It is packed in liquid form in large metal cylinders and is also used in \"gas-shells\". Chlorine is so strong & poisonous that even when mixed with air in the proportion 1\/10,000 it proves fatal if inhaled. Thus with a fair breeze it will kill 10 miles behind the point of attack & its effects have been felt up to fifteen miles away.\n\nTo nullify gas effects helmets or box respirators are worn. The helmet is made of a double thickness of flannelette with eye-glasses & mouthpiece, the latter being provided with a valve. The helmet is soaked in certain chemicals\n\n \n\nwhich neutralise the obnoxious gasses. The box-respirator is a little more complicated in construction but the principle is the same. Every soldier in France carries one of each of these as part of his equipment & if found \"in action\" without at least one of the two he will be crimed.\n\nMch 27\n\n\"On Gas\" again. We had to gain a fair knowledge of the use of the P.H. Helmet & had also to gain facility in putting it on. After lunch we placed the helmets in position & marched etc for an hour with them on in order to get quite used to them.\n\nThe mail today brought Alan & me a nice box of home-made cakes from our two girls in London. Needless to say we greatly appreciated their kindness and also very much enjoyed the cakes.\n\nMch 28\n\nOn Elementary Musketry all day.\n\nThe musketry course covers two weeks, the first week being taken up with elementary work & miniature-range firing, the second week being spent on the range.\n\nMch 29\n\nElementary Musketry & minature-range firing. We also went back after tea for a little extra practice & fired ten rounds each.\n\nMch 30\n\nThis morning we were marched to \"Durrington\", 3 miles away, and there went through what is known as the \"gas-chamber\". This is a room in which a strong poisonous gas is liberated and we have to stay in it for a few minutes with our P.H. helmets on. I think that this parade is calculated to give one confidence in the helmets, ourselves, and thus to minimise fright under active service conditions. It also teats one physically, it being useless to send a man to France who can’t stand \"gas\".\n\nAfter dinner the boys of our hut were\n\ncalled out and informed that one of our members had been taken away with German Measles & as a result we were to be \"isolated\" for an indefinite period. Thirty of us are thus confined to the hut our only liberty being a little outdoor exercise twice a day.\n\nTo minimise the likelihood of our escape a permanent guard has been placed over our hut and no-one is allowed to go outside the door without an escort. \n\nHowever, to relieve the monotony four of us scaled out after tea. I dodged the escort & Alan & another climbed out the window. Such is life! Freedom is never so precious as when it is partially or wholly denied.\n\nMch 31\n\nMy","23":" Birthday! And isolated all day! Never mind: iron bars do not make a prison & one who\n\nis compelled to depend upon outside circumstances for enjoyment & peace of mind knows not the best that life has to offer. Dogs can wag their tails and gambol & be happy while they are well-fed & cared for materially; they whine & die when heaven seems to frown on them: but there is something strange & indefinable in human nature that can exalt itself \"in the midst of alarms\", that can smile in the face of nature’s stinginess, & that can be contented out of sheer spite for the contrariness of environment. When all goes well & smoothly one forgets the resources of his nature, but in untoward circumstances, that old-time grasping for infinitude asserts itself, and in \nits\n discontent gives \none\n such satisfaction.\n\nIn the morning we were taken for a\n\nmarch, in the afternoon Alan & I etc scaled out & returned in time for bed much to the chagrin of guards etc. As we were nearly all just about penniless there were very few natal festivities to-day, but, a few good slices of bread & jam & some biscuits went down as well as the most sumptuous of dinners,\ncould have\n & we had the satisfaction of saying \"better next time\".\n","24":"\n\nIsolated all day. It being Sunday, we were not taken out at all and had to make the best of the hut, and besides, having no money, it was worse than useless to scale out. In the evening the boys collected & borrowed all the available cash in the hut & got the guards to buy them beer from the canteen & this game continued until there was no money left & most of the boys were merry and a few quite drunk. Such is life!\n","25":"\n\nSnow storm last night.\n\nStill isolated. I came across a fine record of poetic imagination in \"My Gardener\" by an Indian writer, Rabindah of Tagore. Form and suggestiveness seem to unite in his picture poems; they are admirable and make excellent reading for a quiet, thoughtful hour.\n","26":"\n\nStill isolated. We had a heavy snow storm last night. This was about the heaviest we have had yet .In the morning the snow was packed in the window corners and also against the doors. The camp looked a real picture, everything being covered with a beautiful white, glistering garment, which shone like polished silver in the morning sunlight. We were drilled in our hut in the morning & in the afternoon went for a march through Shrewton. Needless to say we pelted one another with snow all the way & in the village pelted all the boys & girls who dared to show\n\n \n\nfight. We purchased a tin of golden-syrup there to put in our \"pantry\". Needless to add, we made a good supper of bread, toast & treacle.\n\nWhile in Shrewton we had our photos taken in the group.\n","27":"\n\nStill \"isolated\". We did our musketry course on the large Range today, firing about 95 shots in all, each. We fired at ranges up to 400yds, both in slow & in rapid time. We also had five shots at a disappearing target in the shape of a man, which was exposed for 5 seconds each time. I caught the man three times, but did not do too well on the other rapid firings.\n","28":"\n\nStill \"Isolated\". We had 25 rounds each for field firing this morning. We were all assembled in the range trench & acted just as on active service. Sentries watched for targets & gave us the signal for jumping up & firing. All targets were of the disappearing type & included sections & companies of men, and also machine guns. This practice was\n\nrather interesting, especially in view of the fact that no one knew where our shots went. I had a few \"pots\" at objects other than the targets but could not see the effect of my fire.\n","29":"\n\n\"Good Friday\". Still \"isolated\". We marched to Shrewton for exercise. After tea the boys got the guard to act as messengers to the canteen & between themselves they got fairly well \"boozed\" & by bed-time the hut was rather rowdy, but most of the boys only get merry & joyful when drunk & there is really nothing disagreeable about such festivities. It is just as well that such is the case for we have a couple or more such jollities every week.\n","30":"\n\nAlan & I \"scaled\" out this afternoon to the town of Devizes which is about 13 miles from Camp. We walked both ways and \ntook the\npassed over part of the most desolate of the all times notorious Salisbury Plains.\n\nWe had a most enjoyable walk there, seeing much of the country, & were particularly struck by\n\na fine valley which we crossed just before entering the town itself. It is about 1 ½ miles broad & is well cultivated & makes a fine picture. We had a good tea at 6.15, visited the post-card shop & then went for a walk along the canal bank for a mile or so with two lassies who volunteered to show us round the town. The canal is used for barge transport & was chiefly interesting to Alan & myself on account of the large number of locks which it has. The canal rises up a fairly steep hill by means of these & there must be over twenty of them within a mile or so.\n\nWe had a drink of coffee at 9.15 & after purchasing a loaf of fresh bread for the \"pantry\" set out for Camp & arrived there at about 3 o’clock next morning. We lost an hour on our homeward trip because \"Summer\" commenced at 2 o’clock & in accordance with the \"Daylight Saving Act\" our\n\nwatches had to be put on an hour at that time. Our walk home was made enjoyable by the fact that the sky was clear & the moon was full & shed a clear silver light, & the stars twinkled down upon us in their wonted way. We love the stars because we know that all our loved ones can see them as well as we can & we often whisper quiet secrets to them to carry across the seas for us. \n\nOf course our absence from the isolation hut had been noticed by \"the heads\" but nothing came of it except a threat for the future.\n","31":"\n\nStill \"isolated\". Exercise etc. I read. Emerson’s essays on \"History\" & on \"Love\"; the latter is particularly inspiring and the former is a fine appeal for a practical, personal interpretation of historic events & characters.\n","32":"\n\nStill \"isolated\". Exercise etc. I read a few of Edgar Alan Poe’s poems & liked them very much. Poe has a delicate sense of\n\npoetic rhythm and the melody of expression.\n","33":"\n\nIn \"isolation\". Exercise etc. I read Oscar Wilde’s \"De Profundis\". The deep sense of humility which breathes from these pages cannot but impress one favourably. Whatever predilections I may have had regarding the writer, I thoroughly enjoyed this book. Perhaps Wilde is somewhat over-individualistic here, but the circumstances of the case partly, at any rate, excuse this. I intend adding a copy to my library when I return to Australia & will also go more deeply into the study of his other works. If all else were worthless, his powerful poetic imagery would tell in the hearts of his readers.\n","34":"\n\nIn \"isolation\". Write & yarn around the camp stove.\n","35":"\n\nSmall fall of snow this morning. \"Isolation\" lifted at mid-day. \"Bull-Ring\" again. After tea Alan went to the pictures & I went for a walk through Lark Hill &\n\nDurrington Camps. On the way I heard some men singing a well-known hymn & soon found myself in a nice short Y.M.C.A. evening service. We sung a couple of Hymns lustily and with deep feeling and were then addressed by a Chaplain-Captain. It seemed rather a coincidence that he should choose one of his texts from Rabindah of Tagore’s poems, and gave great commendation.\n","36":"\n\nFive of us were detailed for the ‘Australian Supply Fatigue’ this morning and we had to load & unload the bread for a couple of days’ rations for our Camp Group. Altogether we handled some 7,500 loaves of bread & quite enjoyed the novelty of the job and by dinner-time we were quite expert in juggling two or four at a time. We stood in a line between the lorry & the racks & tossed the loaves along from one to the other as fast as we could go. Needless to say, a good few loaves went wide of their mark & caught the lads on the chest & knees, & in fact\n\nwe got knocked all over the place before we had finished. Before leaving we got our \"mits\" onto a couple of loaves & these went down very comfortably with a tin of plum jam. You know, as the boys are always saying, \"the troops \nmust\n be fed\".\n\nAfter dinner we returned to our job, although we had finished it in the morning – and when we saw that the ordinary parade was out of the road, we returned to our hut & in a few minutes four of us, Norman, Ron, Alan & I were on our way to Shrewton. When there we purchased two loaves of bread, two pots of jam, ½ lb of margarine and a large cake and with these proceeded to a nice green field about ½ a mile out from the village and there, with our capes as tablecloths, we had a fair-dinkum banquet. What bread & jam was over made a good supper an hour later.\n\nThe green grass underfoot, the blue sky above,\n\nthe budding trees close to hand and the bare branches of the old firs silhouetted on the horizon, only needed the beautiful little village brook to complete the ideal picture. Such was the scene of our banqueting-house; such were the touches of nature’s hand that thrilled us with sober & sombre delight. A \"superb intoxication\" is what Wilde would call such joys, and the expression seems to be superbly apt.\n","37":"\n\nThe 19th Reinforcements of our Battn. Arrived last night. They are finding the place a bit cool as yet, and are getting about in their overcoats. We don’t wear such encumbrances, even at night.\n\nUsual route march this morning. After dinner we again walked to Devizes across the artillery ranges and on the way managed to get a few shell caps. If anyone finds these in our possession we will be liable to prosecution, but that is nothing under the circumstances.\n\nWhen about seven miles out of camp, and out in the middle of the plains we were caught in a heavy shower of rain and in a few minutes waterproof cape & boots etc. were soaked through. The wind was terrific and seemed to blow the rain right through everything. The picture which we cut, miles from shelter, on the desolate downs, reminded me very much of poor old King Lear in his distress in the midst of the elements when he said that although his enemy’s dog had bitten him, he would not put him out in such a night.\n\nHowever there was a silver lining to the dark cloud & the storm ceased, the sun came out, we sat by the wayside and poured the water out of our boots and wrung our sox & had a smoke and all was serene once more. \n\nOnce in Devizes, we were quickly sitting by the fireside in the restaurant and said ‘good-bye, for ever’ to a square meal.\n\nWe then were taken by our aforetime guides right round the town for about five miles walk, down country lanes, across green-fields, over rustic bridges and right through the town again. Rissoles & green peas made a very palatable supper, and we then made the best of our way home across the monotonous undulations of the notorious English camping reserve.\n","38":"\n\nChurch Parade this morning. After this the whole Training Battn. Was drawn up & sub-divided into parties of six and set to work at tent-pegging. In about ½ an hour we had 250 tents up and then it was dinner-time; (roast-pork and cabbage & Burgundy, - I don’t think!)\n\nIn the afternoon Alan & I went to Mrs Pratt’s at Shrewton, and there had tea and spent the evening with quite a number of soldiers, including a few from the Royal Flying Corps. Mrs Pratt is an admirable hostess and is the very personification of kindness.\n\nWhen we left, to come home at 9 o’clock, it was still quite light outside; in fact the sun had hardly set and the sky was tinged with the colour that speaks. As we walked along the country road, with the high trees on either side mingling their branches overhead, I was able, as never before, to understand the origin of the Gothic design for Churches, and I remembered then how realistic the architecture of the Salisbury Cathedral was. The pillars represent the trunks of the trees & the arches above with their intermingling designs represent the intermingling of the branches of the trees.\n\nSo simple & yet so grand; so beautiful, so rich with design & yet so true to the original.\n\nI also saw the brightness of a sunset sky shining through the interstices between the myriads of branches, and this, I believe,\n\nsuggested to early builders the idea of brilliantly coloured lead-lights. Thus have I seen the original of the Gothic design, and also one of the finest monuments of Gothic architectural culture; the former, a country grove; the latter, Salisbury Cathedral. One is strongly tempted to ask ‘What is \nart\n?’ or ‘what ought art to be?’ but the solution of such problems is hardly commensurable with the demands of war & so I must make my little bunk on the floor, get my equipment ready for tomorrows’ parade and dream sweetly of a country far away. (I forgot, unlike Joseph & Daniel; I \ndon’t\n dream at all!).\n","39":"\n\nIn the morning all hands (& the cook) were called out & given a little preliminary practice in review marching for we were \ngoing to see the King\n next day. In the afternoon a number of Battalions from other camps close at hand joined\n\nus in a ‘mass parade’ but just when we had congregated a rain & hail-storm came upon us & the Brigade Staff Officer told our C\/O to ‘take us back and put us to bed\", which he did, but not in the literal sense, of course.\n","40":"\n\nReveille blew at 4 this morning and at 4.15 \"the troops\" breakfasted and a little later received their lunch, which consisted of a (1) sandwich of bread & margarine & bloater-paste and two ‘dog’ biscuits. At 6.30 every Battn moved out of camp, and I can assure you there was ‘some khaki’ on the road within half-an-hour or so. The tents which we had put up were occupied by visiting troops & these all joined us. ‘Rollestone’ alone must have contributed four or five thousand Australians to the column. That means that our line was just about a mile\n\nin length (Four deep, that is). We marched six miles to Bulford parade & review ground, & there were joined by 40 or more thousand Australians and all formed up in Review Order. At 11.30 the King and Staff etc inspected the men drawn up before them and at 12 the mass began to move and to the music of a grand military brass band we all marched past His Majesty in double-column of platoons, ie, in lines of 60 men. After this we waited to cheer the King as he rode away and I had a glimpse of him when he was only ten yards from me. He is a small, slight-built man and looks somewhat older than his portraits would lead one to imagine. His face portrays gentleness & meekness & an expression of deep sorrow & worry seems to rest on his countenance, even\n\nwhen he smiles. Me thought he would not often smile, but flesh & blood could not have withstood the cheers of our lads. From what I have heard, & inferred, and seen I now have absolute confidence in England’s King and our King, his sad, sweet smile and the tone of his deep voice impressed me greatly, and more than ever am I proud to think that I may in my small way help \nthe King\n & his ministers in their ‘Crusade’.\n\nI am sorry to confess that Royalty is by no means universally popular amongst the boys and the value of tradition and of traditions’ emblems is not acknowledged generally by Australia’s sons. That is something which has yet to be learnt by them. How this may best be done should, me thinks, be a problem for our coming pedagogues. \n\nI had intended sending the paper cuttings which told about this Review, but they were rather misleading than interesting, and somewhat distorted the facts of the case, as is usual with a popular Press.\n","41":"\n\nA party of us commenced our two-days bombing course this morning. Practice in throwing \"dummies\" introduced us to the game and then lectures on fuses & explosives and the mechanism of the \"Mills’ hand Grenade\" filled in the rest of the day.\n\nExplosives are of three classes; viz low & instantaneous explosives & detonators, gun-powder is an example of the first ammonal of the second and F.O.M., or Fulminate of Mercury, of the third. Ammonal is used in our grenades and explodes them with terrific force. It is much more powerful than gunpowder or cordite and if used in ordinary\n\nrifle or cannon cartridges it would burst the barrel when fired. The force of a detonator is almost incomprehensible. For instance, the detonator in a grenade which fires the explosive is very small & thin but nevertheless it alone has enough power to burst the bomb. Or again, in a fuse made with detonating material the charge travels at the rate of 6500 yards per second. No wonder that war now-a-days is a little hell!\n\nYou will now not be surprised that we have great confidence in the bombs which we are to use on the other side of the Channel.\n\nAlan & I had a game of billiards in the evening.\n","42":"\n\nWe completed our course to-day by throwing two live bombs each. We were also shown a number\n\nof trenches and dug-outs and shell-holes and also one large mine crater, all of which were constructed by the Engineer Corps. The mine crater was of special interest. It is about 35 yards across at the top and must be about 20 or more feet deep. It was made by a mine charged with 6,000 pounds of ammonal. Fancy getting a charge like this underneath a trench, especially if you were not expecting it.\n\nI have now gone through the training necessary before going to France and may be called upon at any time to get ready for the trip across the Straits.\n","43":"\n\n\"Bull-Ring\" in morning and a general inspection in the afternoon. After parade Alan & I walked to Tilshead Village, about six miles from Camp, and\n\nhad tea there. After having a good look through the place we cut across the fields for home in the early twilight, and enjoyed the rural scenery in the light of the setting sun, passing through Orcheston on the way.\n","44":"\n\nIt fell to my lot this morning to be put in the \"emergency platoon\" and this meant that I had to carry 200 rounds of ammunition in my pouches as well as the usual pack, on the route march. One of the boys facetiously remarked that the military authorities never use horses to drag the lead when they can get donkeys to carry it & perhaps there is some truth in this.\n\nThe mid-day mail to-day brought me 8 letters from Australia! \"nuf sed!\"\n\nAlan & I spent the afternoon reading our letters & playing billiards and after having a stroll to Shrewton in the evening, did a little writing & finished up with another game of billiards.\n","45":"\n\nChurch Parade in the morning. The singing of the old hymns is especially inspiring. We are accompanied in this by our brass band, and the various instruments used make an excellent substitute for the organ manuals. The big bass trombone, rumbles like the 32 foot pedal stop, while the soprano obligato is supplied by the piercing tones of the cornet, & the intermediate mass of music gives substance to the whole effect. Of course we always sing well-known hymns, hymns that have associations dear to us all, hymns calculated to give us hope & confidence. My favourite in this morning’s service was \"Sun of my Soul, Thou Saviour dear\",\n\n\"It is not night, if Thou be near.\"\n\nMy old yellow pencil is too ignoble a thing to be entrusted with any more of my secrets, so I must pass on.\n\nAfter Church Parade I was \"warned for draught\" to leave for France on Tuesday following. Alan has to complete his bombing course yet, and will\n\nmost likely follow me in a week or so. Les Dimond is going with this draught.\n\nIn a week or so I expect there will be \"dirty work at the cross-roads\", and as Tagore says, the \nold\n man may not return from the crossing, since he does not know whom he may meet on the way. However, whatever is in store for us, we are all very eager to join our Battalion, and to lend them a hand in their work, and under these circumstances, you may well imagine how glad we are to be getting out of our ‘Rollestone’ home.\n\nTwenty-five men are on the \"draught\" from our Company (ie 19th Battn.), & 250 from the Brigade.\n","46":"\n\nWe were put through a little bayonet-fighting this morning, just by way of a final ‘brush-iup’ before leaving \"Rollestone\". A dental & medical inspection & the preparation of our equipment occupied the rest of the day. A new blanket & a leather-vest were added to our service issue to-day.\n","47":"\n\nWe were thoroughly inspected & reviewed \n\n \n\nby the Major & then by the Colonel to-day and were then issued with 24 hours dry rations. These consisted of ½ loaf of bread, lump of cheese, parcel of butter, 5 biscuits, 1 tin of corned-beef each. These go in our havasack.\n\nAt 7 in the evening the \"Draught\" fell in for roll-call & left soon after in full marching order for Amesbury Station. For the first time we were ‘on route’ in proper style and so it would be interesting to note what the words ‘equipment & pack’ connote. The ‘equipment’ is very similar to that used in the Militia in Australia, & in the pack on the back we put all our necessities; these include, 1 service blanket, 1 waterproof sheet, 1 towel, 1 shirt, 1 singlet, 1 pr underpants, socks (4 prs I took), shaving gear, etc, soap, wash-rag, ‘kerchiefs,& cap-comforter. On top of these & partly showing outside we place our waterproof cape; underneath the supporting straps we roll our leather-vest, while on top of the pack, & outside, is fastered our mess-tin.\n\nIt is too warm to wear our greatcoats now & so we roll those like a life-buoy & tie them round the pack. In our pockets we carry a supply of writing material, bible & Daily light, pencils, purse, diary, 1st field dressing, bottle of issue iodine & anything else that will go in. With the dry rations & bottle-full of water added, one is ready for the road, wardrobe & cupboard complete.\n\nAll being ready we set out for Amesbury Railway Station which is about 6 miles from Camp. The march there reminded me very much of the march from the Show-ground to the \"Sueric\" last year. All the boys & officers who were not going with us turned out to cheer us off and a good number of the boys came along with us part of the way, as did also the Rollestone Band. The Train left at 11 p.m. for a destination practically unknown to us.\n","48":"\n\"Anzac Day\"\n\nWe were in the train till 5 this morning, and just as day was dawning\n\nsteamed into Folkestone Station. Folkestone is a fine watering-place, and from all appearances, there is accommodation for a great number of summer visitors. We marched from the train to a large hotel which faces the sea, and which has been taken over by the Military Authorities as a Rest Billet & there we were quartered for a few hours & given some breakfast. Les & Ron & I had a walk along the beach and made a general tour of the Billet .\n\nAt 11 a.m. we steamed from Folkestone Pier across the Channel in one of the swift troopships kept for the purpose. Three such ships went across, together with two fine Hospital ships and a couple of Destroyers. It took about 1 ½ hours to reach Boulogne harbour. Once safe in port we were soon on the road & made the best of our way to a Rest Camp about two miles from the wharf. The city was very quiet except for a few women & children who worried us to buy sweets etc.\n\nOur temporary resting-place was on top of a high hill overlooking the city and from it we could see the houses & churches & spires in the foreground, and in the background the expanse of the Ocean while hills and fields lay behind us. We were forbidden to leave camp and picquets were placed all round the Camp boundaries but nearly all of us pinched out. Ron & I had a good look all round Boulogne, including the stronghold walls of the original fortified city, and finished up with supper of ham & eggs. The waitress in the restaurant couldn’t understand a word of English & we had to scrape up the little French that we once knew in order to make her comprehend what we wanted, all of which amused both her & us very much. By now I know how to ask for a bit of \"tucker\". ‘Voulez-vous me donner a manger?’ is good enough for something to eat anyday. However most of the French people whom we see know a bit of English and in fact the young boys,\n\n \n\n& girls too, know the Australian swearing as well as we do.\n\nWe returned to Camp at 9.30 & slept very soundly although we only had a blanket apiece.\n","49":"\n\nAfter an impromptu breakfast we paraded at 10 o’clock and set out for Etaples by road. The march is between 18 & 20 miles. We passed through several villages some fairly large, and saw French people in all of them. These waved to us our of windows etc & tried to communicate their good wishes to us as best they could in their pigeon-English. We stayed at a Rest Camp on the way & there had our lunch of Bully Beef & Bread and after that continued on our way arriving at Etaples Camp at 6.30. Until last week the new troops were taken by train from Boulogne to here, but all the train-service is now being used by the red-cross staff and so the new troops have to use the road.\n\n \n\nThe country around here is rather hilly and our road kept fairly close to the sea-coast. Etaples, the town, is ‘sur-le-mar’, and our camp is on a high hill just to the back of the town. About two miles down is the city of Paris-Plage Sur-le-mer, which lies on a long peninsula separated from us by a narrow bay. It is very difficult to get leave to visit Etaples, but from report & from my own observations & deductions it is by so means a very clean place, in every sense of the word. Paris-Plage looks very fine from Camp. The trees on land, & the long border of white sand round it & the blue sea behind it show its buildings off to full advantage. Its two fine ‘Phares’ also give an appearance of significance amid the surrounding common places. It seems to be an up-to-date sea-side resort. Unluckily it is impossible to get leave to visit this place at all.\n\nWe arrived at Camp somewhat tired after\n\nour march, but a good tea was soon ready for us & we were in bed in an hour or so.\n\nThis camp is a big one, and is very compact. We are all under canvas to the extent of 16 per tent & find this sort of home fairly comfortable although all our feet are in a heap at night just like a bunch of turnips, or something like that.\n","50":"\n\nWe pararded for our service rifles and bayonets this morning and were then inspected by the Camp Officers. We also got an issue of two helmets, one for gas-attacks, the other as a precaution against shrapnel. This latter is made of steel & is worn here on all parades & at all times in the firing-line.\n\nA dental & medical parade occupied the rest of the time.\n\nThe training as a rule covers a period of ten working days and is styled \"intensive\" and is to a large extent recapitulatory.\n\nThis afternoon I accidentally met Stan Whealy, (Artillery) who was the cadet senior to me for three years in the Mines Dept. He had been wounded & was on his way back to the line.\n\nThe evening was spent in the \"Soldiers Christian Association\" Hut, where I did a little writing & then had a bit of a sing-song. Every evening a short meeting is held here, a few favourite hymns are sung, a short address given & a prayer for the wounded etc tendered before the throne of grace. The address is usually very fine & to the point.\n","51":"\n\nWe were paraded as a company, to the Bath this morning. Owing to the number in Camp we can only have a proper bath once a week, & then it is compulsory. The water is as hot as one can stand & is as good as the steam in a Turkish bath. We then struck tents in order to freshen the soil underneath &\n\npitched them again later in the day.\n\nI spent the evening in the S.C.A. Hut. At nine o’clock orders came out that Reveille would be at quarter to six next morning. Needless to add, this abrupt introduction to our new work somewhat chagrined us, bur all the same, I hardly think we slept any the less sound for that.\n","52":"\n\nWe were introduced to the Etaples \"Bull-Ring\" to-day. This parade ground is 3 miles from our Camp and we have always to march there & back with full packs up & take our mid-day rations with us.\n\nThe day opened with a lecture on bombing & a little practice in throwing dummy bombs.\n\nAfter lunch the programme continued as it had commenced & we were taken through the elementary bayonet exercises.\n\nAfter tea I visited the Y.M.C.A. Hut and this being Sunday, an address was given us by Dr Norman McLean of St Cuthbert’s Edinburgh entitled \"Thoughts on God\". The service was tremendously inspiring & uplifting. I was particularly struck by an illustration which the Doctor used & which is well worth repeating.\n\nThe anecdote says that Wilhelm of Germany made a pilgrimage to visit the young child Christ in order to crave a blessing upon himself & on behalf of his nation. He pleaded that he was Christ’s lieutenant and that he was fighting for right & justice and for God’s cause. But despite his utmost entreaties the blessing was refused him. Still he continued his prayer, and urged to the uttermost the righteousness of his principles. He pointed out that he had left the pleasures of peace in order to fight in God’s cause, and that thousands of his men had\n\nsacrificed their all, had shed their blood & had suffered & had lain down their lives in that same interest. But the divine Child shook His head, and meekly replied that He could not bless him since He had no hands wherewith to confirm the blessing. For, two years ago, He said that He had been ill-clad & hungry & defenceless on one of the roads of Belgium, and Wilhelm’s soldiers came along. In terror He fled & hid behind the hedges but the soldiers followed and ruthlessly cut off both His hands. Thus did He have no hands with which to bless Germany’s cause.\n\nThe story illustrates the fact that a prayer \ncannot\n be answered by God Himself if the actions of his life & the attitude of his mind are inhumane and contrary the Christ’s teaching.\n","53":"\n\nBull-Ring again early this morning. The day opened with a lecture on trench duties and spent the rest of the day in the trenches which have been constructed\n\nhere for the purpose. We acted just as on active service in the front line; but of course there were no \"Fritzes\" in the trench in front of us.\n\nI spent the evening in the S.C.A. Hut. In the short meeting which was held there I was particularly struck by the few words which one of the Australians had to say. The lad was very nervous, and awkward & found difficulty in expressing himself, but he told us simply and plainly that a message, a secret, had been entrusted to him to give to all his brothers in the great campaign. Just before he left Australia a sweet wee girlie had come to him & told him that she was going to continually pray for him, and she told him to tell all the boys that she was praying for them too. And he told us. Since then I have often seen, in imagination, a tender form kneeling beside her bed, remembering us before \nOur\n heavenly father’s throne.\n","54":"\n\"May-Day\"\n.\n\n\"Bull-Ring\" again. In the morning we had a short musketry practice with instructors re \"care of arms\" etc. After lunch we were on fatique work and were armed with shovels (banjos) and occupied ourselves in cleaning out trenches & such like until 6 o’clock; we then marched the 3 miles home in about 45 minutes, much to the amusement of the \"Tommies\" whom we passed on the way.\n\nTo-day was rather dusty & as a result a light haze rested on the whole landscape, & the sun set amidst a curtain of blood-red clouds, something similar to that in Sierra Leone.\n\nLes & I did a little writing by candlelight in our tent before turning in, a practice better in contemplation than in reality. With sixteen men & rifles & equipment in a bell-tent there is very little room left for such extras as writing desks. However, the bright company makes up for an\n\ninfinity of such deficiencies.\n","55":"\n\n\"Bull-Ring\" again. The whole day was spent in the \"gas\" school. Lectures on \"gas\" and on anti-gas precautions were given and we all went through a chamber filled with one of the deadly gases similar to that used by Fritz: We also went through a trench filled with \"tear-gas\". A little enlightenment concerning \"liquid-fire\" was also imparted to us.\n\nWe mixed up a good deal with the Scots (\"Jocks\" we call them) & Tommies and chatted with them and quite enjoyed such a novelty. Needless to say we were, & are on fairly good terms with them all.\n","56":"\n\n\"Bull-Ring\" again. We went through the ‘Final Assault’ test and the ‘Wood attack’ with bayonets this morning. These include almost everything in the way of bayoneting likely to be met in the line. Attacking trenches in a ‘charge’, jumping-off from our own trenches, getting over barbed-wire\n\nentanglements and across country riddled with shell holes, and racing through a wood with trip-wires etc. etc. on every hand. This we go through with fixed-bayonets in the ‘on guard’ position, ready to stab every ‘Fritz’ we see. Sand-bags & chaff-bags filled with straw take the place of Fritz for practice purposes.\n\nOur skill with the bayonet was tested by means of a number of small tin rings on rods at which we had to run & try & pick with the bayonet-points. Not bad sport at all!\n\nAfter lunch we each threw a live bomb and were then lectured on First Aid in the Field & sundry other matters of a similar nature.\n\nIn the evening I took a stroll down the road as far as Etaples Railway Station to see the locomotives etc; some of which are quite novel & really interesting. Whilst there a hospital train arrived from the front filled with wounded swaddies. We could see nearly all of them through the windows, and they were wounded in every\n\nconceivable manner; some were standing along the corridors, others were siting & others in bed, but there was scarcely one who did not wave & smile to us as the train passed along. They seem so bright that one is inclined to forget that many of them will be months in hospital & that others will never be able to fight again. What most disturbs the peace-of-mind of a great number of the wounded men is the fact that they are treated in French hospitals & do not get their trip to \"Blightey\".\n","57":"\n\n\"Bull-Ring\" once more! A lecture on trench discipline & tactics, and a tour over the model trenches here filled in the morning’s programme; Two dog biscuits & a drop of tea filled \nour own\n programmes at lunch hour; and a spell in the trenches from 4 to 9 o’clock completed the day’s programme.\n\nOur relations with the \"Tommy\" & \"Jock\" instructors is rather funny at times. Of course none of the boys care about being beaten in any way by\n\nEnglishmen, & whenever possible, they \"pull their legs\". An English sergeant generally wants everything \"spick & span\" & quite up to the mark, but the boys insist on taking things quite easily. They do not believe in standing too long in the lines, for instance, & if half a chance is given them, they all take a seat on the parade ground. This practice has become so general that no notice is now taken of it & it is quite common to see the Tommies all standing in a row, quite the thing, & the Aussies sitting all over the place. One of the instructors was telling the boys what an \"organised army\" was, and illustrated his point with the sarcastic comment, \"Just like the Australians, you know\". I didn’t over hear the remark that one of the lads passed about it, but you can well guess its nature.\n\nAn instructor became quite desperate one day on account of the apparent disinterestedness of the platoon & in sheer desperation, after having tried all that he knew in order to gain a keen\n\nattention he asked \"What will interest you men\". \"Nap\" & \"Crown & Anchor\" were the replies immediately given. The boys like free talk better than drill or lectures & try to qull the instructors into side-issues by asking them about their experiences at the front and so on, & the result nine times out of ten is a good yarn about the Somme or some such place. This is better than drill & makes the time pass quickly.\n\nThe other day one platoon was doing \"extended order\" drill in the Bull-Ring & the line was very long & extended beyond some of the huts there and when the order was given to close in again none of those under cover made their appearance. However, it has been reported that they all turned up at dinner-time a couple of hours later. Poor \"Tommy\" was none the wiser.\n\nThe ‘box respirator’ that is used as an anti-gas precaution consists of a ‘mask’ and a tin box with an india-rubber tube\n\npassing from the box to the mouth-piece of the mask. Instructor ‘Jock’ told us all about the article, its uses & advantages etc and then asked the boys what they thought of the thing. One of them told him that he thought it an improvement on the bag-pipes. Too True!\n\nAlthough Australians are content to leave strict discipline to the Tommies, they like to show them a point or two occasionally. Coming home from the Bull-Ring the other evening we were in the front of the column and the Tommies were just behind, and so the boys stepped out & went for all they were worth, (‘hell for leather’ in the words of the ‘Sentimental Bloke’) and when we turned the first corner, which is about a mile and a half along the way, the victims of discipline were nowhere to be seen. There \nare\n other things besides discipline in a good army; at least, \nwe\n think so.\n\nI think that I omitted to tell you of the\n\ncosmopolitan mob we have at Etaples Camp. Not only have we New Zealanders, Australians, Tommies & Jocks of every county & description, but to give a yellow touch to the place, there are quite a number of Portuguese here, - ‘Pork & Cheese’ the boys call them.\n","58":"\n\nA very hot, dry day but quite cool in the evening and by midnight we were all shivering with the cold. The days are always cheered with the glorious sun, and the nights are generally cool and bracing. French climatic conditions are all that could be desired just now.\n\nA bath-parade in the morning made us fell quite fresh & fit for the afternoon’s half-holiday. The winding paths across the green fields beckoned my feet away from the dust & din of the camp and led me into the realms of freedom, of quietude and of sweet dreamy meditation. The gentle shades of the roadside trees, the balmy air, the smile\n\nof the heaven above, the unspoken message of the young, upward-bound crops whispered joy & peace amidst a world at arms: the daises & violets and buttercups at my feet were as suggestive in their inaudible way as are the twinkling stars on a summers’ night. I am afraid that one’s feelings become inarticulate at this point; natures’ spell must be felt & known, it must be experienced & realised, before it can be understood & enjoyed, but when once that has been done, the spell can never be entirely obliterated. \n\nAbout two miles from Camp I came upon a rather unusual sight; on the one side of the road a round tower reared its ancient strength amidst the green trees, and in its outstanding bareness, and with its formidable appearance, greatly aroused my curiosity. It was evidently a remnant of Feudal times in France.\n\nOn the other side of the road stood a large representation of the Crucifixion. Such are by no means uncommon here in France, and impress the visitor somewhat strangely. There are two of these on the road from Boulogne to Etaples.\n","59":"\n\nA Church Parade was held in the Mess-Hut this morning. The Chaplain was very much alive to the needs of the moment and spoke to us on the text \"Fear not\" and he clearly showed us that we need not fear the past, and that there was nothing to fear either at present or in the future. It is really grand to know that whatever befalls, all is well. After service, a few of us remained for the Communion. We sang the old hymn \"O love that will not let me go\". The Chaplain said he liked to sing this one at every communion service in order that it might gather round itself a great mass of rich associations. Perhaps there would come a day when we would look back upon our wanderings, and this tune could then remind us of the quiet hours spent under strange circumstances.\n\nThis Hymn is also one of the favourites of Mr Ward, the S.C.A. leader here. He told us a story connected with its composition by Dr Matheson. This good soul was deeply in love with, and engaged to a beautiful young woman. One day he was told by his doctor that blindness was coming upon him, and somewhat abashed at first he confided his sorrow to the one with whom he had pledged himself. She pondered for a moment & then let him understand that she would never be willing to bind herself to one who could not see. With heart well nigh breaking he dragged himself home, almost totally overcome with his emotions, with utter dejection & hopelessness, but amidst the storm within his soul the still small voice spoke to him & the consciousness of a love which \nnever\n fails downed upon him; his inarticulate anguish faded & his joy expressed itself:-\n\n\"O love that will not let me go,\n\n\"I hang my helpless soul on Thee\"\n\nJ.D.M.\n\n"}}