{"Document Name":{"0":"Diary_0506","1":"Diary_0506","2":"Diary_0506","3":"Diary_0506","4":"Diary_0506","5":"Diary_0506","6":"Diary_0506","7":"Diary_0506","8":"Diary_0506","9":"Diary_0506","10":"Diary_0506","11":"Diary_0506","12":"Diary_0506","13":"Diary_0506","14":"Diary_0506","15":"Diary_0506","16":"Diary_0506","17":"Diary_0506","18":"Diary_0506","19":"Diary_0506","20":"Diary_0506","21":"Diary_0506","22":"Diary_0506","23":"Diary_0506","24":"Diary_0506","25":"Diary_0506","26":"Diary_0506","27":"Diary_0506","28":"Diary_0506","29":"Diary_0506","30":"Diary_0506","31":"Diary_0506","32":"Diary_0506","33":"Diary_0506","34":"Diary_0506","35":"Diary_0506","36":"Diary_0506","37":"Diary_0506","38":"Diary_0506","39":"Diary_0506","40":"Diary_0506","41":"Diary_0506","42":"Diary_0506","43":"Diary_0506","44":"Diary_0506","45":"Diary_0506","46":"Diary_0506","47":"Diary_0506","48":"Diary_0506","49":"Diary_0506","50":"Diary_0506","51":"Diary_0506","52":"Diary_0506","53":"Diary_0506","54":"Diary_0506","55":"Diary_0506","56":"Diary_0506","57":"Diary_0506","58":"Diary_0506","59":"Diary_0506","60":"Diary_0506","61":"Diary_0506","62":"Diary_0506","63":"Diary_0506"},"Date":{"0":"unknown","1":853.0,"2":854.0,"3":855.0,"4":858.0,"5":860.0,"6":861.0,"7":862.0,"8":865.0,"9":868.0,"10":869.0,"11":870.0,"12":871.0,"13":872.0,"14":874.0,"15":878.0,"16":879.0,"17":880.0,"18":881.0,"19":882.0,"20":883.0,"21":884.0,"22":891.0,"23":892.0,"24":893.0,"25":899.0,"26":900.0,"27":902.0,"28":903.0,"29":905.0,"30":910.0,"31":911.0,"32":912.0,"33":913.0,"34":914.0,"35":915.0,"36":916.0,"37":917.0,"38":923.0,"39":924.0,"40":930.0,"41":931.0,"42":932.0,"43":961.0,"44":970.0,"45":971.0,"46":972.0,"47":973.0,"48":974.0,"49":975.0,"50":976.0,"51":977.0,"52":978.0,"53":983.0,"54":984.0,"55":992.0,"56":993.0,"57":994.0,"58":1001.0,"59":1002.0,"60":1003.0,"61":1008.0,"62":1009.0,"63":1010.0},"Entry":{"0":"\n\n","1":" We started drill this morning it consisted of Boxing mainly. We fell in on our deck which by the way is called P. deck and marched to our parade ground which was situated aft of the end deck Port, and there had a few boxing bouts. The idea of these bouts are, that owing to limited space we hadn’t enough room to do otherwise so to keep ourselves fit we practice these Authorised Games as they are better known by. I had them on with Cop. Bouhan for a couple of rounds just to keep warm like. Then after a good dinner we had a life-belt parade, Which is at a given signal all men put on a life belt and fall in on there parade ground facing the sea or sometimes facing in the direction of the boats. For it must be understood that there are no boats aft. Then we had the rest of the day off and either read or played cards according to one’s own desire. I myself am in the best of health and never felt better.\n\nTuesday 18th. We arrived in the Great Australian Bight (commonly known to all as the Bight) late yesterday and today were well into it when we woke up but one who had never travelled before would not know the difference I mention it in that light not because it is any different but to show how like the outside of it is like. The Bight is similar to the Bay of Biscay\n\nCalm at times and at other times a terror, since we left Sydney the decks have always been wet so that Organised Games (the same as Authorised Games as mentioned before) have been rather difficult to carry out, but still we endeavour to keep fit. To day 2 of the boys got 48 hrs for gambling but still it goes on, It is a vice that cant be stopped. We had a hammock inspection to-day as some of us hadn’t them and so are now being provided for us. We were also issued Y.M.C.A. paper and envelopes, with the title, With the Australian Forces, but that is a farce. The Y.M.C.A. provide a man with 3-4 sheets and envelopes and of course he uses ‘em and then they get the praise for being good. They themselves aren’t here you can bet your bottom dollar. Red Tape is the name for it. I wrote 3 or 4 letters, ready for the post at Albany which we hope to reach tomorrow sometime, My appetite is enormous I eat like a bullock. 19th. Things are going on in the same old way excepting a bit liveler, the boys are just getting over the effects of Mal- de-Mar. They are round\n\ntonight with a pair of \nhorse\n hair clippers and a deck broom and when they come across a chap who hasn’t the Military Cut (like a convict) they take off enough to spoil the look of it, then brush it with the broom. I am one of the lucky ones because as I mentioned in a letter I wrote to you a day or so ago I had mine cut but didn’t get any deserts afterwards. We were boxing again this morning and life belt drill this evening. The work is very light in fact its a holiday altogether. Contrary to my expectations I have not come across vermin yet, that is very good considering it is a troopship. I forgot to mention that the Ceramic is known also as the A.40. That is her Naval Name. also the other Batt & Reinforcements on board. There are the 17th R. 2nd Batt (Old Coota Boys who left Coota for Sydney while I was there). The 2nd R. 56th Batt (Ourselves) 2nd R. 55 Batt. 2nd R. 54 Batt and the","2":" Batt. (Queenslanders). The","3":" R of the 55th Batt are the Kangaroos who marched from Wagga Wagga (NSW) to Goulburn (NSW) a distance of about 155 miles. ","4":" We have now been at sea a week and are just about clear of Australian Waters. We got into Albany on 12 oclock midnight of the 20th-21st. We were not allowed ashore but I and 10 others managed it\n\nAt about 6 oclock just before dark we went in ones down a rope ladder, into the Collier. For we were coaling ship, and hopped on to the next collier by the side and slid down a rope into the dingy, which we got the use of. We pulled first of all to the big jetty and decided not to land there but pull more towards the town It save a 2 mile walk. We were within about 50 yards of the beach when we went clean bang into the sand bank which runs almost all round the bay, but to which knowledge we were not acquainted with, it took us about 10 mins to get her off again, then we pulled to the broken down old jetty and at last succeeded in paddling ashore through water about a foot deep. Well then we parted company, four of us who were coba’s (mates) went our way the other 7 going down towards town. Now there was a chap by the name of Hardy with us, who was at Gallipoli, but returned, who knew the place and was taking us to see a friend of his, A certain barmaid in the Esplanade Hotel. Well we cut through the bush and struck the road that runs round the harbour, then the one we ought to have taken but didnt but kept on walking straight up the hill until we struck \nthe\n another road.\n\nThis road we followed until we were pulled up by the guard at the fort or signal station I counted myself out then, but still faced it like a cub. We or rather Hardy it was who did the talking, told ‘em that we brought officers ashore and that we had leave till 9.30, Well after about 20 min, \na\n questioning the squddie called the corporal of the guard or station, He asked me after he heard all the ins and outs of it was Dinkum, Of course, I said yes, so he rang or rather tried to ring up, first of all 195 then 92 (but he didnt get them) to ask the veracity of our statements But our luck was dead in for that saved us. He thought we were deserters but any how he opened the door and told us to get. Well we arrived at our destination about 8.10 pm. We had a jolly evening and met the others at 11 pm as per arrangement and got back safely to the collier, I was second over the side up the ladder and down below. We met the Officer of the Guard on Deck who said Good-night, boys been ashore we answered yes, he said, good luck to you. So you see we were all right. You might think we ran a risk but things out here are different in every respect to those at home A very interesting note which I think worth while\n\nmaking a note of is the birds which inhabit Albany harbour. They are of the sea-gull breed, When we were going along the jetty the birds which were asleep on it, when fully awake to the fact we were strangers didnt fly away as most birds do, but fell plump into the sea first, then flew away. Albany isnt a very big town, in fact it is about the most smallest sea-port town I have ever been in, I dont know the population but some idea of its size can be judged by the number of Hotels (Public Houses) in it, there are only 4. The harbour is beautiful but not so good as Sydney Harbour. To-day is Good Friday and we had a hot cross bun each for breakfast. We had a good sermon at 3 deck. I washed my great coat and breeches as they were as black as a stove, through going through the previous nights experience, ","5":" We have had a busy day considering it is Easter Monday for Australians absolutely refuse to work on Bank Holidays. This morning we had our usual exercises, which by the way are very scarce now. Then we Tues\n\nwe all inspected, to see either or no we were suffering or had any signs of Venereal Disease Then this evening we were paid, the sum of 10\/- wether it is for the reason that they havent the money aboard or to stop drunkedness when we get to Columbo, for we expect to strike there within the next week, We had a first entrance made in our Pay Books, and it is also possible to get now with a duece of a lot of trouble one glass of beer per day. It isnt worth bothering about, of course one has to pay 6d per glass, The Chaps have started to read a lot now, for the Red Cross have given a lot of books, I was reading a book called \"Hearth & Home\" an old London Weekly, Gentlewomans Book, But the date (to which I am relating this narrative) was","6":" the year I was born in. Gambling is still going strong as ever, in fact I think some of em will gamble in Hell. ","7":" Today is very wet and we have had our first bit of work on fatigues. We take it in turns and this is the first time we have had to do it. I was in charge of 6 men, and my job was to sweep down the aft deck, It has to \n\nbe done 3 times a day, Yesterday was Anzac Day. We had a memorial service and an easy day of it. It is getting very warm now as we are right in the tropics ","8":" I have not made an entrance lately owing to the lack of events, we have been in the \nmoous\n monsoon’s but are out of them now. It rained almost continually for 2 days, and the steamers going about 400 miles a day or more so that means to say a stretch of 800 miles of rain. I guess it is still raining there, but thank goodness we have left it behind. I have written 4 or 5 letters lately. I wrote a long one to a Mr E. Buttenshaw President of the Bland Shire Council Wyalong with a list of the Wyalong Boys aboard. There are 26 of us. I have also been doing an awful lot of reading, almost sickened myself of it. there are two or three things which I have promised myself if I ever get back to England, they are that I shant sleep for about a week shant eat any more mutton and will leave reading alone for a while. The first\n\ntwo of these resolutions, I made up my mind to do when working for Les, Wilson for I had enough of all three in fact to last me a life time, but reading somehow I can’t stop. Before we embarked our black kit bags were sent aboard with all things we didnt require in and we were isued with while kit bags we have since been given our black ones back, There is a terrible lot of thieving going on, petty thieving it is and of course some money is missing too. It is very warm now and is almost unbearable down below. I sleep below myself because I have a nice little port hole on my own. But the majority sleep on deck. They huddle together more like sheep but all cant sleep there Owing to the machinery etc on deck things are very crowded there.\n","9":" Today is Wednesday and we have just left Columbo or Ceylon as it is better known by. Now Columbo is situated as you may doubtless know in the Indian Ocean, It forms part of an island which is situated somewhere about the Most Southern Part of India. I dont happen to have a map or perhaps I could give you a better idea, We arrived there about \nMon morning\n 4 am Monday Morn. Leave was not granted as per usual but","10":" of the Ship went out for a route march on the Mon and the other 1\/3 on the Tuesday We (the 56th) were supposed not to go out until the Tuesday, But some of us went on Monday instead, Of course nothing dauted yours truly went ashore on Monday also. We marched through the town, and then to the garrison, where we stopped for about an hour and they marched back to the jetty where they embarked and went aboard\n\nI say they because others and myself were missing so of course we couldnt go back with them, During the hour we were at the garrison we were allowed one drink either beer or lemonade and as much fruit as we liked to buy of course One had to purchase the drink if one wanted it, \nI think it worth mento mentioning that\n some had more than one, because it was awfully hot and by the time one got back to get the second, one could quite appreciate it, owing to the weather and the crowd, One lost about 2 pints of sweat \nwhile\n while waiting for the next drink. Well to get on with my story of how we got out of mustn’t dwell to long on the latter subject I will draw a little sketch of the garrison where we were and then you will be able to see more distinctly how we managed it.\n\nNow we were all free to walk about the ground there and of course there were a lot of chaps talking to the Guard who was black, So we just climbed over the two gates (as you see in the plan I just roughly sketched) and borrowed a ladder from out of the shed, which came in jolly handy because the wall was about 14 feet high. There were 4 of us and the fellow named Hardy was with us again. The first one up on the wall took a jump and landed all right, the second one the top bricks came away and he fell bang right into one of the rickshaws which were there by luck and smashed the shaft of it, well the third jumped too but I was last and made use of the tree, We enjoyed ourselves immensely, but it was dark so we didn’t see much of the town, It isnt a very big town and if you turn off the main street you find yourself in the native quarter before you know where you are. The \nmay\n majority of the population is black, In fact we didn’t see more than 2 score \npeople all told\n white people all told. On the march\n\nto the garrison we kept all to the main streets which by the way aren’t many and what we saw was real good, Its would be a lovely town if it were not for the native dwelling places which are simply awful. The natives are as black as coal and wear a little cloth skirt, the women wear the same but across their left shoulder making it look more like a costume, some wear turbans and some dont, but they are the most thieving, swindling cheating lot of blacks I have ever met or ever hope to meet, The money runs in Rupees and cents, \nR100 are equal\n one hundred cents is one Rupee and one Rupee is worth about","11":" in English money, 5 cents is a penny. We met some Dutch Sailors and had a pleasant chat with them while we were visiting the Hotel Britania. There is a Y.M.C.A. Depot there and according to my horse (rickshaw boy) whose name was James, its respectability is rather doubtful. Well we got back all right and stayed on board the next day because that route march was not at all welcome. H.M.S. Venus and H.M.S. Tripod were in the harbour when we got there\n\nand were there when we left There was a Burial Service tonight aboard","12":" A chap in the Pioneers 2R","13":" Batt. died of double pneumonia He had a proper military funeral aboard, He was sewn up in his water proof sheet and covered with the Union Jack. The service was read and three volleys were fired, Then the Last Post was played by the buglers and he was comitted to the deep, The engines were stopped whilst the Burial Service was going on and know \"lights out\" has gone so must close for today’s entry. ","14":" Things are going on in the same old routine, It is our day of duty to-day but we finished getting the stores out of the hold for the canteen before breakfast so are now free from duty until 2.30 pm. I was talking to the canteen manager and he said \"That they had sold about £ 2.300 worth of goods, such as fruit (tinned) fish (tinned) biscuits, tobacco choclate, and tobacco.\" In fact they had nearly run dry and could have sold £ 500 worth more A bottle of lemonade is 4d., all soft drinks are the same price except a non-alcohol\n\ndrink called Neer-Beer which is 6d. Which is a similar drink to Hore-hound Beer, which is used at home, One penny is returned on all bottles when returned. The canteen’s are run by the Government but strange to say 2 civilians work them aboard, The sea this morning was like a sheet of glass, I have never seen it so calm before. It was a beautiful sight The flying fish were about in their hundreds, and one saw the fin of an occasional shark, A very deplorable deed was done by two of the boys when they went ashore at Columbo They got hold of a nigger at home, killed him, did things unwrittable to his wife and then set fire to his house, This very same thing happened in Cairo when the first Batt went there, with the exception that they tied the women naked to the bed posts and put them in front of the windows and then set fire to the house\n\nThat is the reason why Cairo is placed \"out of bounds\" now. And if one gets caught there it means shooting. There is a rumor about that a French Transport has been sunk in the Mediterranean with 3,000 boys aboard. I do not vouch myself for the veracity of this statement, but think it might have happened. Out of 150 of our Company (which is its strength) 75 were caught ashore, at Columbo, Our Sergeant Major Quarter Master Sgt, and a Sergeant were caught with them, They were reduced one stripe apiece, The Sgt Major, is now a sergent, the Q.M.S. is also a sergeant and the sergeant is a corporal. I know a bit too much to get caught it seems In fact another corporal said to me \"You’ll never get shot, you’ve too much blame luck and cheek\". Diseases are keeping quite quiet, this ship couldn’t be much dirtier but strange to say that there are very few who are \n\nwho are suffering from diseases. The rest who were caught ashore are remanded until we land, wherever we are going.\n\nWe seem to be absolutely looked upon as machines, We haven’t had a minutes leave from the time we left Cootamundra except French Leave, There would have been a good deal more of French Leave here had it not been for the shortage of cash. The tucker \nabord\n aboard is something awful, We had rabbits the other day for dinner and in the evening there was 158 men suffering from slight ptmaine poisoning. I have just overheard a good piece of news we disembark at 4 o’clock this evening, I suppose that means right here because she couldnt get to Alexandria by that time if she flew. ","15":" We are at the place now will famed in English History which is known as Tel-el-Kibir it is in Egypt but what part I guess it would be hard to describe. About the nearest I can get to it is Cairo, which is 70 miles from here, It is about the most dirtist place one could hope to be in \n\nTo day is the","16":" of May, it is a good while since I made an entry but things have been going on in the same old routine, meanwhile we have passed through Suez Canal and are at present at Port Said We got to the begining of the Canal \nof\n on the","17":" inst Sat. When we stopped for a good while. We then proceded up the first stage of the Canal as far as Bitter Lake When we anchored for the night, That was Sunday the","18":" The next day we again got a move on and got into Port Said on the afternoon of the 15th, Where we are at present the canal is a fine work of engineering, one can throw a stone from the deck to the land on either side, and when one considers the size of this boat, (18,000 tons) it seems rather impossible, The canal is well guarded, The English Tommies are at the other end, near the Persian Gulf then are the Australian Artillery and various other regiments along the banks also, In fact I dont suppose there is a mile of it, that isn’t patrolled some time during the day. Leave was forbidden as per usual \n\nWe arrived here on Wednesday morning at 2 a.m. We were up again at 4.30 am and were busy on fatigue work until about 11 oclock, and by gum it was the hottest day I ever struck, It was 119.75 in the shade and a lovely hot scorching wind into the bargin It nearly sorched out our eyes. When we left the ship it we were issued with dry rations, namely a tin of boiled mutton and 9 biscuits These we 24 hrs. rations I can tell you they were not too good. In fact if writing permitted it I should use stronger words Well on Wednesday evng we were inspected by one of the heads, we were standing from 4 oclock until 10 minutes to 6, in a broiling sun, without Shade. A dozen men went out to it, Then after finishing the remains of our dry rations we had to march down to the railway to carry up blankets. Then we were up at 4.30 the next morning and had 3 solid hours of drill and had breakfast at 8, Now, that was 14 hrs between meals and what we got for breakfast was a half of a biscuit and a half ounce of bacon and half a pint of tea? What do you think of the army eh, If I had known what I now know my feet would have been terribly cold, before I left Australia, Any how, being an N.C.O. in charge of the tent, (which by the way holds 31 instead of about 10) put in a complaint At dinner however we had stew which was absolutely lovely as compared with any other Army rations\n\nThere are about 60,000 men here, and some die every day, In fact the biggest fatigue is employed in digging graves. Two New Zealanders were shot for the rape the other day. Men die, and are reported killed in action etc, Life is valued very cheaply here, and the sooner the war is over the better I should like it. The system of the army is absolutely rotten. Today is Sat. 20th May and we are a bit more settled down. It comes in our drill to shift camp every now and again, we have shifted once and by 9 am they make a mess of it too. It took us from 5 p.m. until 12 noon to shift 900 yds in the military style, we could have done it in an hour our own way. The tucker is getting a bit better now. Last night we were on picquet (or picket) at the Cinema Show. We saw Charlie Chaplin and Allasdin and Lamp, The Heading and Sub Headings were in Egyptian, One can get the gist of it when reading but I blamed if one can understand it, when delivered by word of mouth, We saw the Tropical Bagel and saw George Robey, and Seymour on it\n\nThey are a pretty rough mob here, one of our chaps who was on picket the other night got a punch in eye because he tried to stop them from getting into a circus which we have here without paying. To-day is Sunday. I wrote a few letters to-day but I dont know when I shall get the opportunity of posting them. The major had us (N.C.O’S) all up today and gave us a lecture and said \"In all probability we shall be in England about June,\" if we buck up and show the stuff we’re made of. The major is an English man, one of the \"Imperial Officers\", which means one of the proper officers who were in the army before war was declared. \"Revallie\", was at 6 oclock this morning. Surrounding us is all desert except for a canal called, \"Sweet Water Canal\", but needless to say it stinks like h—l We had a \"Church Parade\" this morning. The Brigade formed up like this almost a square, with the \"Chaplin\" where the dot is. It would have made a fine photo-graph or picture. The back ground was tents as far as the eye could see, and our front\n\nwas the desert also as far as the eye could see, There is about 250 men go sick every day This camp (I don’t think I mentioned it before) was condemned about 3 weeks ago. A party or battalion leave here nearly every day for different places, where they go we dont know until we either hear or get there. We dont know where we are until (as I said before) we know. Just fancy we are in the third line of trenches here, not a rifle in our brigade, rows going on reorganising and hell in general, Excuse me for using these terms but there not another word in the English Vocabulary that would emphasis it so well, I forgot to mention that we had a Taube fly over the A. 40 the morning we disembarked at Port Said. Below is a list of the time lost in coming from Sydney to Port Said, a very interesting feature of sea life I only regret I haven’t go the complete list. The orders were issued at 6 am aboard so the time goes back from mid-night the day before.\n","19":" men\n","20":" men\n","21":" men\n\n 4 28 men\n","22":" men\n\nApril 29 15 men\n\nApril 28 15 men\n\nApril 27 16 men\n\nApril 26 17 men\n","23":" men\n\nApril 22 18 men\n\nMay 9 13 men\n\nMay 10 19 men\n\nToday is Empire Day the 24th May. We had a half holiday. We were up again this morning at 4.30 am and had a route march of about 7 miles before breakfast. Our Lieutenants left us to-day to go else-where, They were very decent chaps, Lieut Tofler & Lieut Schofield by name, two of our Sergeants went with them, as orderlies They resigned their positions to go with them, 7000 English Tommies landed at Port Said last Mon, (22 May) It was bombed again on Monday also but no aeroplanes went up after the Taube, it did no damage, bar killing a few niggers and they don’t count. We are the next Party detailed to go away. We were on fatigue yesterday, Sitting down was about all we did. We are more climatised now, in fact I haven’t sweat since the day we lobbed here, lobbed is an Australian word meaning, got, Lob means get, I am back again with almost the same men in my tent as I was at Coota, five Scotchmen, Three come from Wyalong. Wyalong is well represented here in our Brigade","24":" Training) considering the size of the place, some Queenslanders lobbed here just a few minutes ago from Port Said. Today is the","25":" of June, I haven’t made any notes as things have been going on in the same weary, dreary military way.\n\nI was Company Orderly Corporal on the","26":" 3rd and","27":" one could fill up a book alone with his duties, but his main duties are to parade the sick and detail all fatigues which by the way is a very unthankfull job. Well to get on with what I am trying to get at, During my three days, I paraded some somewhere about 80 sick men (one half of whom were malingerers) one venerial disease, and one case of measles. The measle case was quarantined also 10 other men who were in the tent, so you see by figures that Egypt isn’t too healthy. We left here (Tel-el-Kebir) for Alexandria on the","28":" (June). We \"fell in\" at 4.30 pm, and left the parade to walk to railway about 11 pm with full packs and kits. We entrained about 12.30 midnight, and reached Alexandria about 9 am, There were 40 men in each truck and you can take it from me it wasn’t to comfortable, we were packed like sardines. The reason we went to Alexandria was to embark on the \"S.S. Francoina\" a Cunard Liner bound for England.\n\nAny how we got aboard about 11.30 am, and turned in, for we were just about beat, Our swags are pretty heavy and when one carries them head, there, and every where, one suffers \nfrom\n with fatigue any how about 12.45 we \nwere\n received orders to get on the wharf as quick as possible as there was some mistake, We then marched about 1 ½ miles to Camp A. where we camped until the evening of the","29":" We were actually granted leave from six until ten, to see the sights, I think it was about up to them to grant it too not once seconds leave since","30":" until then, Alexandria is a very big town, in fact the biggest in Egypt. We went round and saw the sights, visited the Casino and the American Kursal , The Casino is in short a miniature Monte Carlo, while the Kursal is the Cabaret, a place where one can eat, drink and be merry and see music hall turns at the same time, (This is a very crude way of expressing or explaining but I dont feel in too good a humour this morning. The way we are banded from pillar to post is disgraceful.) Well any how we spent a most enjoyable evening and arrived home about 12 instead of 10 but we werent even asked for our passes so everything was so nice. \n\nThe next day we had a swimming parade we were marched own to the shore (about 2 miles) and had a good swim. We passed a Refugees Camp (which besides other Native Compounds are placed \"Out of Bounds\" by the Provost Marshall owing to Contagoues Diseases) There wasnt any need for notices I guess, the smell was enough to kill one, well I had to put my handkerchief to my nose while passing. We went down town again in the evening again and got back bout 6.30, We entrained again at 9.30 pm, and disentrained again at Tel-el-Kebir about 4 am this morning, we had","31":" class carryages on the return trip. It a whole blame mess up altogether we ought to have stayed aboard the Franconia and instead of coming back again ought to have embarked on another ship. Now if you don’t think that the organisation of this army is rotten, can you tell me what is? We are on fatigue work again now putting up tents etc, In fact I’m fed up, and I did curse em for disembarking us, I thought we were A.1 and was counting on next week end in London. Ugh I’m sick of it, We have received £ 2.18.0 in pay since we left Australia. Today is 56 days since we left and money due to us is £ 5.10.0, Hows that That is on 2\/- a day some only draw \none\n 1\/-\n\nToday is the","32":" Out of the past 9 days I have had 5 days and nights guard and 4 days at the shooting ranges. \nOn\n On the 15th I was made acting sergeant and on the 16th I resigned and got to the ranks on my own initiative. We have had a new sergeant from the battalion here and he had been acing sergeant major and he is a pig. I don’t know why but he has had a set on me, and sooner then be a sergeant under him I resigned, also because the stripes were \"backsheesh\" as the Egyptians say, which is Arabic for, \"unpaid for. I haven’t received a farthing for my stripes \nso\n are am not in the habit of working for nothing Stripes even at","33":" a day aren’t worth holding. Every Reinforcement N.C.O. as soon as he \ns joined\n joins up with his battalion is put in the ranks so I and a few others have left instead of getting the sack as it were, Now that I am a private again the Ac\/S\/M has been pumping guard into me, The other half of the Coota boys who we were\n\nseparated from when we went to Alexandria went away 2 nights ago, I dont know where they went but went with some 17\/4 and","34":" as the 1\/56 The sooner we get from here the sooner everyone will be glad, they have reduced our drill from 5 hours a day to 2 hrs a day, because it is killing men like flies, Sixty men went into hospital yesterday, This climate is playing hell with my eyes, It is the terrible dry heat and the dust, The dust starts between 1 oclock and 2 oclock (pm) as a rule but sometimes starts about 11 oclock (am) Theres never a day but what the or dust storm, We also had one in the night list night and the night before, Roy Whitey has been out of hospital some time now, I have been trying to get him transferred into our company but haven’t succeeded so far.\n","35":" 16\/4 and 1\/56 stands for","36":" Reinforcements of the","37":" Batt and so on.\n","38":" This climate as I have mentioned before plays the Duece with ones eyes, and of course if am one of the unfortunate ones who suffer. First of all they run and it looks as if one is crying. then they are scorching and burn, then they are all sticky and the dust comes along and then it’s the same performance until the sun sets, At night is about the only time I can get any ease with them. I \nhas\n am losing the sight of my left eye, I used to be able to go for a weeks stretch without glasses but now I cant for a minute. I have been ","39":"\n to see the doctor but he is only a quack, He put \nZing\n Zinc, sulph, (A.M.C. Name or something) drops in them but they didn’t do any good, I asked him if I could see the eye specialist but he wouldn’t let me. One feels, by the way one is absolutely messed about, that one would sooner be dead, In fact all say they would sooner be in the Trenches or anywhere bar this (To use our own majors words), dusty, stinky, filthy, dirty, fly blown hole, The world-famed Tel-el-Kebir is, absolutely the worst joint one could wish to strike \n\nScores upon scores go sick daily, but still no, we cant go away until we get orders, that means until the heads know that there are 60,000 men in the desert. Doing absolutely no training, waiting for orders and living on dust, yesterday and to-day I have been working in the Officers Cook Joint (joint is Australian for place, house etc). One hasn’t the stomach to stand a good feed, though, tea and tobacco is what we mostly live on, and bread and jam which I nearly forgot to mention, (we get that much of it we don’t even like to speak about it). We are told daily to \"play the game\", by our officers, who are of the best (bar for their messing about which I suppose is Millitary Equitte.) While the heads never give us a square go at all, Paid when they think fit, and if we try to barg in with a dirty, black, cheating nigger, and these M.P.s (Military Police) see us, we are put in quod, if we miss a parade or do the slightest thing wrong, which many seem right from our way, but not so them, we get 7 days Confined to Barracks as a first offence\n\nand sentences get harsher as they go on. ","40":" I have been in hospital and out again, and \nare\n am at Tel-el-Kebir again at present, I got put into No. 2 Stationery Hospital at Tel-el-Kebir. On July","41":" on the","42":" I was sent to the base, which is at Cairo, where I was put into No. 3 A.G.H. (A.G.H. means Australian General Hospital). I was seen by the specialist there, and got fixed up temporally, It was my eyes that caused all the trouble, My left is only useful as an ornament, They have put in the new glasses, just a plain piece of glass for the \nleft\n right lense, I think there idea is this, I am practically looking out of one eye now, and if they put in a good lense in the right it will be straining to see, and so affect the left. The hospital aren’t too bad, It would greatly supprise some of the heads to know the number of malingerers there are in these hospitals,\n\nI had three afternoons in Cairo so had the opportunity of having a bit of a look round. Cairo as far as morality goes is about the worst city in the world. It has the same appearance of any foreign (black) town, The streets are narrow and not too clean, One is pestered by niggers who sell or rather try to sell all sorts of rubbish and ask ridiculous high prices for them, Before you have been there an hour, they have one nearly mad, There are a whole heap of Greeks there, and one feels like them, and their oily smile into hades. They try to get big prices too, but dont always succeed About the biggest (for all different nations, represented there) occupation there is prostitutes, and brothals. Immorality reigns supreme. The best feature of this place is the Pyramids and Sphinx which lie about 12 mile out from the city. They are a wonderful masterpiece of stone masony. \n\nThere are three of them, they are the tombs of kings, \nThe Sphinx\n, One can get inside them and there are wonderful carvings, here and there, The Pryamids look smooth from the \ndif\n distance, but when one gets there, one gets a sort of shock, There are stones there about 8 to 10 feet high and they must weight 20-30 tons, and instead of being smooth they are like steps only very big ones at that The Sphinx is supposed to be a solid block, It is like a bust, and is a God. The White quarter of Cario is Heliopolis, where there is a big hospital for Australians. \nOut\n No 3 A.G.H. is situated at Abbassia. They call the cabs, gharries, they are a carriage and pair and cost 9 Piastres an hour, 9 Piastres is","43":" ½ in English money. But the niggers are lucky if the get 5 from the boys for about 4 hrs. You must take into mind that what is sauce for the goose\n\nis sauce for the gander, They cheat so of course are cheated. The niggers deal in Millemes, which are farthings in our money. 10 Mill, is 1 Piastre (2 ½ ) They work all day and hard too for about 15 or 20 mll. We saw the old Egyptian Slave Market. There is the block there where they used to behead some poor unfortunates, and the blood stains, are as plain as if they were a month or so old, The blood, used to come through a sort of window about 6 inches wide and 2 feet 6 inches high, like a drain, and the dark stains are very plain, Below you will see a rough sketch of it: There is a swell hotel called the \"Hotel Continental\" but only officers are allowed the. The rank and file used to frequent it also but they got stopped, Another hotel is \"Shepheards\" also a nice joint called the \"Anzac Hostel. Then \n\nthere is a \"Soldiers Home\" another hotel. There is also, a very nice park in this vicinity called the Gardens, the grass is as green as the Irish Shamrock and there is a Y.M.C.A. joint and Skating Ring, and Cinema. The Y.M.C.A. joint sells, tea, home made cakes and soft drinks, the women made ‘em, and sell ’em and a half piastris a time. The women are of course of white and Australian and snogers too. The railway station has a big square front to it enclosed by railings, its not too bad and rather picturesque in a way. It’s wonderful when one considers it, that the Egyptians are about a thousand years behind English or rather British method or culture, but yet they can give us points yets in Architecture, July 15, Things are still going on in the same old joy millitarty style. No signs of going away in fact just the reverse. Kesr-el-Nil.\n\nThe officers have had camp ovens erected, so now they can have some good tucker, They have been living \nout\n on tucker out of dixies the same as us but \n def\n in a more refined, dainty, sort of way, but now its about good-bye to ever leaving Egypt I have seen the specialist again about my eyes and they reckon they cant do any thing until we get to England, I guess I shall be grey headed, and totally blind by that time. We actually got a pay of £2.10.0 on the","44":" What, We’ll buy up Egypt I guess if they continue to play the game. That pay is about the only turn due to us that wev’e got and always told by them to play the game, Our staff \ninca\n (the 14 Training Batt) managed by our Major, (Major Higgins) is incapably (More than not,) drunk and we pay for it in a way too.\n\nTo give you one instance, There has been a wet canteen opened by Gypoes (Egyptians) here, for rent they pay 7 ½ P.T. per man (in the","45":" Training Batt) a week. That’s money is supposed to be divided among the rank and file when they go on leave to Cairo or such places. Now we never see one farthing of that money. In fact we have to pay 13 P.T. for our railway ticket to go up (\nand\n return) to Cairo. Another instance. I was reading the \"Bulletin\" yesterday and in it were items on various articles, dealing with Soldiers Comfort Funds. We never see it at all It mightn’t leave Australia, and the Australian Public, subscribe wonderfully for the boys, but other boys of some sort (the heads) get it. Even in hospital there are apples sent from Australia, for us Now the can be purchased at the canteen for 1 P.T. (2 ½ d) each, until they are half bad, then they give rotten apples to invalids. \n\nThen because our cooks use all the old wood, we are giving a lecture by our Major, that the Goverment has a bill against it for £: 600 for shacks destroyed, by our cooks, to keep fires going. Now the whole truth is this, niggers build shacks of old wood, boxes, any old things, in all probability stolen for the Goverment, live in it and sell goods at ten times their value, and make a fortune in a few weeks or so, (a niggers fortune I mean) then go away and leave the place which is not worth","46":" as far as wood and fittings (excuse me) are concerned, (In fact there isn’t anything concerned). The cooks are supplied with chucks of wood (of a sycamore type) which is absolutely the worst possible wood one ever saw, It wont burn, its hellishly hard to cut, one cant split it, one has to chip it it is like rubber. Of course the cooks used to pull down these shanties in all innocence to help the fires along. They are terribly handicapped all ways \n\nOur cooks have 9 dixies to cook three meals a day in, do you wonder why we are fed on bully, bread and jam, Then up pops Mr Nigger and puts in a bill and \ncrys\n cries and grovel (like only niggers can) and tops off his fortune. The sneaking pests left it there to be pulled down.\n","47":" Time has indeed slipped away since my last entry, thruth to tell I havent had much to write about, because in hospital things don’t happen which are worth commenting upon I don’t know if I mentioned it but I went into hospital again on the","48":" was boarded for Australia on the","49":" and left hospital for the train which took us to Suez on the","50":" arrived on board the S.S. Borda, P & O Branch Service Line. On the same day, and sailed the following day","51":" August, Of course while we were in hospital that fighting at \"Katin was going on, I saw some of the prisoners (Turks & Bedouins) being marched from Cairo Railway Station up to the Citadel\n\nWe have about 5000 of them now, and the rest surrounded. The light horse did good work there, Helped by British Infantry. Our wounded and killed was very slight, Some of the wounded were brought to No. 3. A.G.H. where I was but none died while I was there. It took the Turks 8 months to come across the desert, and our outposts have had several brushes with them in 2’s and 3’s, a remarkable feat was, that the shells the Turks were firing at them were marked, Birmingham 1915, Britian I believe was supplying Bulgaria with shells before she declared war against us, and she must have given them to the Turks. But its funny our munition workers at home are making shells to kill their own men isnt it. A wouned Australian gave me a clip of cartriges which were there in the battle, Our aeroplanes and outposts couldn’t locate the enemys water holes\n\nor the affair would have been ended before this. Our aeroplanes lately destroyed the enemys machines. Another peculiar part is that the enemy attacked after all the Australian Infantry had left Egypt, Our Batt, left about a week or ten days before, We volunteered to make a mounted regiment out of the patients but were declined so you see my luck \nhas\n is dead out as far as action is concerned. We passed Aden this morning. We have had 4 days pretty hot weather coming through the Red Sea but it is decidedly cooler today. The boat is a beaut, the tucker good and theres only 350 of us, and shes a 11,000 tonnes So every thing is grand, We were all given a Red Cross bag which contained 2 pair of pyjamers, 10 Packets Cigaretts 14 tins tobacco, 1 Towel, 2 Handchiefs 2 face flannels, 1 singlet \n","52":" Piece Soap 1 Pipe 1 Tooth Brush and Powder 2 Pairs Socks and Writing Paper and the bag is a pillow slip. ","53":" We are now well on our way. We passed Cape Guardifini on the","54":" Cape Guardafini, is situated in Italian Somaliland on the North East Coast of Africa. The Tucker is still good but we have struck the cooler weather now, and it, was a bit choppy last night and the night before, We expect to be striking the Monsoons presently I am not feeling too good myself. The headaches are starting again, I had no sleep two nights ago, and the headache I have now has been raging for the last 3 days. Sept,","55":" We have now been 17 days out and are nearly to Freemantle we have had 2 deaths, One chap died, he was passing his internals, poor fellow he only came abroad to die. The other case (a very regretable incident) occured on the","56":" His name was McDondall, He was on ships fatigue in the morning at 7 oclock, then he was again detailed for Quartermasters fatigue which was to get some blankets from the \n\nForward Hatch, The weather was a bit rough and consequently the ship was pitching and rolling and the men had to get down this hatch which was dark, and light being very bad, well poor old Mac fell forward and fell about 30 feet, No one knew he was there until we searched the ship, When he was found his neck was broken and his skull was all pulp and one of his legs was broken. In my opinion they sent that man to his death, We are all hospital patients and ought to be exempt from all fatigues. Four of our boys also patients were put in detention cells for 24 hrs for smoking in between decks while a sergeant for the same offence was let off That also happened on the","57":" No we had been to sea 15 days then and the adjutant had seen men smoking ‘tween decks but never took any notice, but I suppose he had had a drop to much wine\n\novernight, We cant get a drink aboard ourselves yet men (sick) are detailed off to carry beer etc, also bag of flour (2 cwt) from the aft hold to ships canteen for the blame officers. The ajutant is an absolute bully. Hed been in Egypt 10 weeks, as soon as he lobbed there he put in for an Anzac Officer (Police) and got it. Its the biggest cold footed job in the Army and now hes coming back. He isnt worthy of the name of a man. His name is Lieut Newves. He came round this morning rounding up men and forced them to attend church, said it was compulsory, didnt attend himself and neither were a good many of the sergeants. All Red Tape and as soon as I can I’m into a suit of civies and they can all go to the he-l for all I care, I hope to ---- they do.\n\nToday is the","58":" We pulled out from Freemantle last night, We got into Port on the","59":" about 12 noon. We got a rousing welcome from the people of the West, We had 14 W. Aust. aboard. We all got a packet of cigaretts and a bar of choclate from the W.A. People with a badge on it with the words on it \"Lest We Forget.\" Also, a ribbon (white) with \"The West is Proud of You\" on it in blue letters. We had the best food there too, the best we have had since we left Australia. They brought aboard some eggs and they were Dinkum ones too, quite a change from the Gypo style. Leave was not allowed the first day and we thought we were not going to get it at all, so about 200 went ashore over the ropes, mind patients going over the side, they must be getting fit again. Anyhow they let us all off because we paraded for it 3 or 4 times from 11 am until 4 pm on our honor. Told us not to get drunk etc.\n\n Well we went ashore and had a ripping time, Freemantle is a rather smallish town but big enough if you can understand what I mean, It has trams etc. and is five times I should say bigger than Albany. The people are good and treated us like Britons, Of course the majority got rather full but there wasn’t any disturbance ashore, One can excuse them for that they have been away a long time, and Freemantle is Dinkum Australian stuff. One chap from our mess fell backwards and split his skull and is in Hospital ashore be put off a cot case, the poor chap is suffering from cancer and idattis but they didn’t tell him about the cancer. We have been racing against time for the poor chap and won but God only knows if the operation will be successfull or not. We pulled out into the stream about 7 oclock, and before we dropped the pilot one of the Seamen fell overboard, He was drunk and wouldnt get hold of the life belt but kept\n\nswimming along by it. On these life buoys is an arrangement that is like a tin and you hit it on the top before throwing it overboard and when it touches water it ignites, and throws about 12 inches long heavenwards. He wouldn’t get aboard the pilot boat even until one of them jumped over the side and roped him. One of our boats were lowered but if the chap couldn’t have swam he’d have been drowned 4 or 5 times over. Nineteen men are missing this morning 16 of whom are married. Three of the prisoners escaped one of was to do 5 years for shooting at an officer. By the above events you will see that things have been going some around our way lately. While I was ashore some dirty cus stole a silk shawl from my bag and a few silk trifles That is a great fault with our army some would shake the tail off a brass monkey if they could.\n\nThere are good and bad, but there are a good many platry thieves wherever you may go, in any Millitary Camp. I almost forgot to mention that about 30 got caught going over the side and were fined 8\/- each.\n\nA Sergeant was caught also and was reduced to ranks and 10\/- fine. He wasn’t a Dinkum one or else they couldn’t have reduced him without a court martial. ","60":" We are having better tucker now, and we also had an issue of tobacco to day. My praise for the Red Cross of W.A. is above imagination. This morning we had to give a declaration of the silk stuff etc we are fetching home. We are only allowed £10 worth and above that we have to pay duty for but I guess that £10 is quite enough for a Soldier, wer’e not tourists I guess. I have been rather fortunate of late, I scored a cabin yesterday a two berth, an Hospital Orderly and I occupy it and it’s a snogger too\n\nIt has a bonzer port hole so we get plenty of fresh air and I guess I’ll be kidding myself I’m Lord knows who before long. No more stuff shaken and sleep in peace not on the table but in a Dinkum bed again Oh my I could write for hours out of pure joy, unless one has travelled in a troop ship one cannot appreciate the fact like myself. We have three boys, aboard whom we picked up at Freemantle and are taking to Sydney \nwho\n with us, They are going on a Training Ship for the Navy. They are only about 13-14 years of age but dont seem to mind leaving home The climate is a bit cooler now and our over coats come in handy of a night when sitting on deck I went for mine the other day and blame me if somebody hadn’t cut off two of the buttons so of course I had to return the compliment. I \n\nhappened to be on Q.M.S. Fatigue getting all the mens kit in who missed the boat so I got a set off them with the Q.M’s consent: so everything is \n","61":" We have just pulled out of Melbourne where we stayed for about 12 hours to disembark, Victorians and Tasmanians. We were allowed to go ashore and you can bet we appreciated the fact and had a right Royal Time. It feels like home again and everyone of us is happy.\n","62":" To-day has been a day of days. We pulled into \"Our Harbour\" about 6 am and Gee we were as happy as could be. To see our dear old Sydney again after the Deserts of Egypt is better than all the in the world. And to-day has been the proudest day in my life. The Millitary Bands met us at \n\nthe wharf and Played, first of all Home Sweet Home and I cried like a big kid. then Auld Lang Syne, I don’t think I can adequately express myself and feelings they are too sacred and I felt quite a hero as we passed through the cheery crowds on our way to Randwick Hospital per cars, and then we were met by the Red X Ladies and given a Welcome Home and after that our Leave Passes and Railway Passes to go home. That’s where it hurt. I a stranger in a strange country, with no friends or relations to meet me, but I went up to Wyalong and they gave me a Welcome too Speaking from a full heart may I say how deeply I appreciated it. Then when my leave was up I returned for my discharge which I got on","63":" and then returned back to Wyalong to take up the ropes again that I had left to go and serve my country. In conclusion of my diary I must say I have not one regret and if my services are again needed although I have only one eye, they are welcome to the Government P.T.O. Best\n\n"}}