{"Document Name":{"0":"Diary_0504","1":"Diary_0504","2":"Diary_0504","3":"Diary_0504","4":"Diary_0504","5":"Diary_0504","6":"Diary_0504","7":"Diary_0504","8":"Diary_0504","9":"Diary_0504","10":"Diary_0504","11":"Diary_0504","12":"Diary_0504","13":"Diary_0504","14":"Diary_0504","15":"Diary_0504","16":"Diary_0504","17":"Diary_0504","18":"Diary_0504","19":"Diary_0504","20":"Diary_0504","21":"Diary_0504","22":"Diary_0504","23":"Diary_0504","24":"Diary_0504","25":"Diary_0504","26":"Diary_0504","27":"Diary_0504","28":"Diary_0504","29":"Diary_0504","30":"Diary_0504","31":"Diary_0504","32":"Diary_0504","33":"Diary_0504"},"Date":{"0":"unknown","1":615.0,"2":616.0,"3":617.0,"4":618.0,"5":619.0,"6":620.0,"7":621.0,"8":622.0,"9":623.0,"10":624.0,"11":625.0,"12":626.0,"13":627.0,"14":628.0,"15":629.0,"16":630.0,"17":631.0,"18":632.0,"19":633.0,"20":634.0,"21":635.0,"22":636.0,"23":637.0,"24":638.0,"25":639.0,"26":640.0,"27":641.0,"28":642.0,"29":643.0,"30":644.0,"31":645.0,"32":646.0,"33":647.0},"Entry":{"0":"\n\nEgypt Heliopolis\n\n","1":"\n\nCamp was struck at 6 a.m. and the 22nd Battalion piled arms and settled down to bivouac. Rumor says we may still be here a couple of days. The troops having pockets full of money gradually gravitated into the neighbouring Heliopolis and our champion Private \"Tucker\" Vienna was later removed to hospital with injuries resulting from a gharry running over him. \"Tucker\" it seems was reclining in the middle of the road suffering from an overdose of hops when the accident occurred. At 6.30 am our final batch of reinforcements arrived and were straight way sent off to do a musketry course. Our pack drivers have all been picked out and labelled as \"muleteers\" today left for Alexandria for parts unknown – but we think Servia. Major General Legge blew along and spoke to all officers and ncos \n\n27\/8\/1915 Heliopolis\n\nStayed in camp all the evening though just longing for one fly more round Cairo – that incensed perfumed exotic. Suppose we shall be off to Turkey in a few hours so there is no time for anther look round Casino de Paris, Abbaye de Roses Kursaal and other old haunts. Well after dark the troops were crowding back to their beds – a doss on the bare sand. Many well \"freighted with wine\". \n","2":"\n\nUp by starlight. Must have chosen the hardest piece of ground for my bed – little sleep. Parades for cholera inoculation. Great talk in Cairo about the first appearance on the stage of an Egyptian actress. Up to now these people have considered it degrading womanhood for one to appear on the stage of a theatre though they can give private or café shows. The \n\nprecedent breaker is one Munira a local girl. All our kits are packed and we are ready to move at a moments notice. All hands are hoping to be sent to Anzac and hope for an attack before settling down to plain trench work. Full orders for move arrived from Brigade HQ at 7 pm. Our trains go 9 pm & 2 am.\n\n29\/8\/15 \n\nReveille 5. Big church parade. All kits were stacked at 9 and motor lorries turned up and gave a good example of what efficient organization is. No bustle and no confusion as they shifted all the gear. Our Transport is to be the \"Scotian\" and her complement 1300. Our battalion all on the boat and also 6th Field Ambulance. The niggers are very funny in their setting up. Like the robbers they are they present all sorts of faked accounts and when bowled out treat it quite as a matter of course. The notorious \n","3":" Heliopolis\n\nMohommed and the washing man received heavy rebuffs departing wailing. Big Australian mail has just arrived. Remarkable how our men rush any job connected with horses. Only ask for a groom or a transport driver and they almost plead to be taken on. We left camp at 5.30 with 16 offers and 507 representing ½ the battalion; the other ½ following at 12.30 am. Marched through Heliopolis, the 1st Divn. wounded at Luna Park cheering. Reached Palais de Bouba where we found trains waiting & Pedler and myself marked up the carriages with chalk. Entrainment took place quietly and quickly and showed the results of training. While waiting on a small piece of grass two natives in front of our crowd quietly said their prayers turning towards Mecca and prostrating themselves. The operation\n\n29\/8\/15 Heliopolis\n\nconsists of first spreading a garment or mat on the ground facing East and then standing upright with bowed head and clasped hands meditating. Then down on bended knees and touching the earth with the forehead in complete prostration the while muttering prayers. This repeated 2 or 3 times. Amid cries of \"Saida\" for natives and others our train steamed out. It is now dark and we are leaving behind us the fascinating and most charming city imaginable. It may be long before we see Cairo again but the charm of the City of Arabian nights will long linger with us. At midnight we are passing at great speed through cultivated flat fields, a canal running alongside the railway and the night air full of the dank small of irrigated swampy land. Our train going fast cuts out space\n\n30\/8\/15 12.30 am\n\nHave just taken a walk along the train as a good Adjt should. The compartments are full of equipment and the boys are asleep sprawled in the queerest attitudes – sleeping like little children an odd one stirring slightly but the majority tired out are dead to the world. At 1.15 am we arrived at Alexandria and detrained on the quay just abreast HMT \"Scotian\" 10000 tons. The transfer of the troops to her was well and quietly done and 500 of the men are in 3rd class cabins. This Canadian ship was fitted for emigrant trade. Allotted a cabin with Capt. Bert Curnow – very comfortable. Supervised things until 4 am then had some tea shaved and bathed by which time reveille sounded. A crowded day. The 24th Battn. have arrived too & at 9 am were going on the \"Nile\". We notice (as before) that Alexandrian \n","4":" Alexandria\n\nnatives we notice as before different from those inland in dress etc. A busy port this – transports all around. The high masts of Arab dhows sticking up everywhere. Went into Alexandria at 10 am to purchase a supply of morphia for our doctor and succeeded in getting a good supply 200 grains cost £3-5d. Round the docks here there is great squalour but there are better class places about two miles away. Passed through the small shops and dirty crowded native quarter. All very dirty. The colour of the people is different to those at Cairo but too many armies have passed thro’ Alexandria to expect its race to remain pure. In the Mohamed Ali square are Steins Oriental Stores & the Bourse – fine buildings. Then part of the city modern fine and clean. Great variety of colours everywhere. Returned to ship lunch. \n\n30\/8\/15 Alexandria\n\nIn the afternoon we found three stowaways aboard and put them off. All on the ship derived great fun from crowds of little Gyppie kids scrambling for coins – a native policeman futilely trying to stop them. At 5.45 pm we swung out from the wharf and were tugged through the shipping. The beauty of the scene was very striking. In front the thick shipping – in rear the winding narrow channel with further off the white city like a lead pencil laid out along the coast. Good bye to Egypt!. The home of an intensely fanatical & religious people. Fascinating but filthy. Outside the breakwater the process of dropping the pilot was quite exciting owing to heavy seas. At 10 p.m. we are bowling along in pitch darkness with all lights out on account of feared submarines. Two machine guns\n\n30\/8\/15 Alexandria\n\nare mounted with their crews standing by and guards with ball cartridge are also mounted. \n","5":"\n\nA fairly good roll has made a good many sick. Beautiful blue skies and a cool breeze. Boat drill 11 am with all hands standing at stations. We need more practice in this as too many did not know where to go. Remember a funny event at Heliopolis as we were leaving. As head of column passed the Market a native woman came towards us with her head down pushing a cart of sukkar melons. As soon as she saw us she gave an agonised shriek and fled down a side street as hard as she could. Experience teaches these folk to take no risks when a tired or thirsty crowd like ours is on the march. We have a crowd of English officers aboard and some got very boozed at the bar tonight and retired helpless. \n\n \n","6":" \"Scotian\"\n\nUp at 6. Sea at its best and very enjoyable after 3 months in desert. Some seagulls about. This route we are on is perhaps the oldest in the world and its tides have borne Phoenician galleys. Perhaps the \"dark ribbed ships\" of the Iliad were past here in the days of Trojan wars. ’Twas from Lemnos the galleys returned \"freighted with wine\" – now this is our Base for Dardanelles. At 11 am we pass land (Crete?) high and mountainous. During the afternoon all officers met at a conference and decided to make a common stock of all belongings. Those of any casualties to go to the \"pool\". More land in sight later about 10 miles long with large town or village. White houses perch on the heights here. Troops slang: - \"Imshi Yallah\" a handy word. Songs. They chant \"Down where the water-melons grow!\" to the tune of a well known Salvation army hymn about \"living waters\". \n\n1\/9\/15 Scotian\n\nTo the tune of \"Three cheers for the Red White and Blue\" they sing a song with a refrain \"If the odd numbers don’t mark time two paces How the hell can the boys form platoon\". Made arrangement for issue of 150 rounds and an iron ration to every man and had 3500 rounds belted up for our machine guns. Some of our English officer passengers again \"well oiled\" tonight. One hiccuped \"Bai Jove, you know, ’twould be a terrible thing to be torpedoed while you’re drunk don’t ’cher know!\"\n\n10 pm\n\nDarkness everywhere on deck. All ports screened with blankets and screens of all kind. We are still passing among islands. \n","7":"\n\nFresh sea wet decks. Issuing ammunition and rations to excited men all chattering for they think they realise war’s reality at last. Each man as he gets his allowance of s.a.a. goes into a corner by himself just like a dog \n\n2\/9\/15 \"Scotian\"\n\nwith a bone and stows his cartridges into his pouches. Lemnos looms in sight long rugged and barren looking the sea in between all covered with dancing foam caps. Coming into harbour we swung round a large cape, scores of big warships and transports in sight – a lovely sight. Three hospital ships here and beyond, white tented camps. As soon as we anchored an embarkation officer came off and told us HMT \"Southland\" a quarter of an hour behind us has been submarined. 63 officers 1362 aboard her. All said to be lost. Much worried about my brother Jack who is on her.\n\nThe entrance to this harbour is by a narrow mouth from the open ocean across the mouth a boom. The harbour then bends round into a large bay surrounded by pretty green hills and divided into \n","8":" Lemnos\n\nsheltered coves by projecting capes. About 15 fathoms of water furnished anchorage for scores of transports. Coming up to our moorings we passed through two lines of warships – one side French the other British. Scattered camps fleck the hillsides and one village nestles among trees. Exquisite shades of green on the hills and right down to the water’s edge. Dancing seas and bright sunlight complete a pleasant picture. And yet at 9 am war’s presence came home to us by the sinking of our comrades on the \"Southland\". I hope to God Jack is on the \"Haverford\". At 4 pm Embarkation officer says \"Southland has not been sunk. Only 2 boatloads of men lost. She is coming in under her own steam!\" Frantic cheers. \n\n6 pm\n\nTorpedo boat destroyer passed. She was full of 21st men. Said to be hit 2 feet below waterline. After dark the roar of guns from Gallipoli can be heard. \n\n3\/9\/15 Lemnos\n\nMen in swimming and look splendid naked giants. Reported the Brigadier (Linton) has died in the Southland. There is a furphy today that 5000 Aust. are being sent back from Anzac on account of water shortage. Very peaceful in this calm harbour – yet fighting tops of warships meet the eye and the gun mutter tells of trenches only 4 hours away. We sail tomorrow for Anzac at 11 am 2 days war ration one water bottle full has to do us for two days. \n","9":"\n\nAll bustle at 6.30 with ration drawing. Up on boatdeck a fresh cool wind a-blow. The harbour a memorable sight with green country all around and in the water large ships. Two rows of warships lying right down the centre. The great \n\n4\/9\/15 Lemnos\n\nfour funnelled Mauretania is about a mile off and looks quite small. The Empress of Britain crowded from stem to stern with tommies. Sailing serenly down the centre comes a hospital ship painted pure white and carrying large red crosses. We leave on \"Osmanieh\" at 11 o’clock tonight. All hands getting loaded up with rations etc and the men are ordered to break up the boxes and distribute the wood among themselves as firewood is said to be scarce over there. I have just discovered that we have 2 ASC men here as stowaways from Egypt. Blind eye!\n\nSailed from Lemnos at 6.30 pm on Osmanieh for Gallipoli. The waiting about all day was most tiring. She came alongside the Scotian and the transfer was well carried out \n\n4\/9\/15 \"Osmanieh\"\n\nPassed through all the shipping. The Aquitania a grand vessel towering over all the other ships. Passed two of our own submarines. The Osmanieh 10000 tons and lightly built – greyhound like and speedy. Fresh sea cold and we plug along for hours. At last we came into searchlight arch and soon after this cold still night we could hear rattle of musketry – a new sound added to gun roar. We could see dark high cliffs repellant looking and flaring star shells illuminating some of the rises. Lighters emerged out of the darkness and the troops slowly and quietly filed on to them all in the dark. They had to be packed like sheep by me as\n\n \n","10":" Rest Gully Gallipoli\n\nAdjutant and God knows I’ve never cursed and sweated more than in this packing process. Poor lads they take it all well. Two lighters full. Ours was towed ashore by tugs to small pier. Coast rises abruptly in scrub covered sand hills all burrowed with dugouts and rough huts running right down to watersedge. We soon came under a dropping fire but most bullets high although an occasional one whizzed past ears. Guides met us at wharf and conducted us along beach and up gullies to a position behind the trenches. An awful journey with full packs and all were absolutely \"f____d\" (to use their own words) on reaching the destination – a scrubby deep gully. Everyone just sank down in the pitch darkness and slept – done with fatigue. The rattle of rifle fire going \n\n5\/9\/15 Gallipoli Rest Gully\n\non all the time and every few minutes comes a big boom and subsequent explosion as our guns shell the Turks. The illuminating lights very pretty & showing up the whole position. The whole country very difficult after the first precipitous sand and scrub rise the whole country goes back in rough scrubby hills like those at Frankston. All night the firing continuous but at dawn the rate of fusillade increased. The noise then rattling round these gullies was very unnerving and almost deafening. As soon as it comes breakfast time we remark comparative quiet. The men are lying all over this sheltered hillside in the scrub. Looking round – we are in a defile at the mouth of which is open sea: the other end is a steep bluff. On each side cliffs rise abruptly all sand with clumps of long stunted brushwood \n\n5\/9\/15 Rest Gully\n\nabout 2 feet high. The whole place has been cut into terraces on which we have stored our men. They are all on one side – that nearest the enemy. \n\n10am. \n\nWent through the trenches at Quinn’s Post for first time with my old friend Capt Percy Comyns 6Bn QM. Entrance overlooks Agean Sea with sea and land at feet for miles round. Shrapnel bursting on hills occupied to our north by Kitcheners Army. At feet a camp of territorials. On right the whole line of Anzac trenches. Went in with Field Artillery officer. Saw whole position through telescope impossible to describe but simply one matted mass of earthworks and incessant crack and burst of shrapnel cordite and bombs. Stench of dead very bad. Men & officers killed long ago lying unburied and just undergoing disintegration. Put our pioneers on to dig latrines but unhappily at 3 feet they dug up some English tommy corpses\n\n5\/9\/15 Rest Gully\n\nand trying again found another patch. Third try located clear spot. Batteries have opened fire over our heads and shells whizz queerly over. Shall we get a lively time when they reply: Took another walk this time to Courtneys Post and Steels Lookout and had an experience of being sniped at. Returned to gully where Major Bob Smith and myself share a hole (Egypt Mafeesh foulous – finish money. \"You go a Dardanell Misr Captn?\" \"Gib it Moya\"). Round trenches again. Down to beach for a swim after dark. Saw sniper dead lying between two high pinnacles of rock up on a cliff. Not much firing as I go to bed tired out. But wake up at 11 pm with sound of warships guns & much rifle rattle.\n","11":"\n\nUp at 5. We go to relieve 6th & 8th Battns at 9 o’c. Their \n\n6\/9\/15 Johnston’s Jolly\n\ntrenches are said to be good. All up early. Aeroplane reconnoitring puffs of shells all round. \"Beachy Bill\" a gun concealed in olive groves gives beach a bad time. The shells are whizzing overhead now and three have burst on a rise just the other side of our gully. The men getting kit ready for move into firing line and are busily cleaning up. They had erected little tents with their blankets and ground sheets. Some were sleeping among dreadful stench as under their beds were dead Turks and others buried. Fell in 8.30 and whole battalion in single file commenced to move into trenches opposite Johnstons Jolly. The long line in file extended right up only to top. Put 500 into firing line and stowed 500 others in old trenches and dug outs on a hill called Braunds Hill. Met Major Carl Jess Brigade Major and went along with him and took over from the Adjt. \n\n6\/9\/15 Johnstons Jolly\n\nof the 6th Bn. The HQ is a little semi-dugout semi lean to and from it I have a wonderful view over the dancing Agean Sea blue in the sun and a dream island called Samothrace and another called Imbros lying lying jewels out among the white prancing seas. In the foreground are store ships and others lying at anchor but they keep out of gun range. Looking down – a large gully sandy, steep on both sides with scattered scrub. At 2 pm went through trenches with Lieut Guilfoyle. Looking through periscope there was nothing to be seen but a confused mass of tumbled earth and sandbags – the Turkish trenches about 250 yards in front. Absolutely no one or no thing in sight and yet we know they are there right enough. \n\n6\/9\/15 Johnstons Jolly\n\nOur trench system is a confused network as tortuous as the catacombs of Rome surely. The support trenches have recesses cut in them for sleeping purposes when the men rest. The firing line is full of observers and others specially armed and ever alert. Enemies shrapnel bursting over towards our last home Rest Gully. Looking Suvla Bay way we see shell bursts. My \"dugout\" is a hole scooped out of the side of a trench with a sheet of iron for roof and an old blanket for a door. It overlooks a magnificent panorama – a sparkling sea and grandly severe depths & heights. Sweet cool zephyrs blow right in from the sea. When the blow is from the other direction it carries of taint of rotting flesh. From where I sleep the frontline \n\n6\/9\/15 Johnstons Jolly\n\nis 35 yards and the Turkish line not more than 50-100 yards beyond that. Colonel Crouch sleeps in a little shelter close to the telephone and Major Bob Smith about 10 yards from my place. \n\n7\/9\/15\n\nStand to arms at 4.20 am. A solemn and impressive business. All men armed and standing at their posts close together – the trenches full about a man every yard and a half. Stink of dead men very bad this morning. After ‘stand to’ I turned in for some more sleep and on getting up joined Major Bob Smith in a tour round the line. No casualties among our chaps but a 75 got a few 6th Battn men and splashed some of ours with their blood. Men are buried in the saps all round and as we dig they are constantly being uncovered. Legs and arms wizened and dark stick out of the ground. The men do all \n","12":" Johnstons Jolly\n\ntheir own cooking. The underground tunnels are an interesting feature here deep pitch dark and cellar smelling. Many queries from our blood lusty ones. \"What the hell’s the good of sitting here in __ ___ __ trenches. Why can’t we charge and turn the bastards out of theirs.\" Reply by a hard bitten 6th B. veteran \"You b_____ f_____s put yer b______ heads over the parapet and get ____ sudden death. Yer wouldn’t get five f_____ yards!\" A great expression here is \"dinkum oil\" meaning reliable information. Ian Hamilton’s order of the day to the French & British before last attack opens resonantly \"Soldiers of France and of the King!\" Bed at 9.30.\n","13":"\n\nStood to arms in the cold raw air of 4 am. Later a lovely sunny day and making a perfect view from \n\n8\/9\/15 Johnstons Jolly\n\nthe rear of the trenches over the sea. The fleet lying there peacefully at anchor. The 6th Battalion, having given us enough insight into their mode of warfare, moved out to the rest they so well deserve. I soon got busy with Adjutant’s work. Brig General Walker and Colonel Forsyth were callers. Several boots sticking out of our hillside here attached to dead men’s feet. Our chaps boots are getting worn so some of the dags have been seen to swop with a corpse! Unfortunately in pulling the boot off they often get the foot as well. Bed 21.00 – we reckon time like French.\n","14":" \n\nVery cold at stand to. Company reports slow in arriving as orderlies lost their way in the maze of trenches in the dark. Looking over the sea later on from the entrance to our mess dugout the scene was one to remember. Not a ripple \n\n9\/9\/15 Johnstons Jolly\n\non the sea. The warships put now and then a shell over on to Abdul the Damned. Through the cliffs we glimpse a flat stretch holding Suvla Bay – not unlike an Australian landscape this. Small puffs of white burst miles away. An aeroplane comes over and bursting shells leave delicious creamy white little clouds around it. They melt away in no hurry. At 9 pm we carried out a ruse or demonstration designed to annoy the Turks. Flares, rattling tins, showing of bayonets moving of sandbags followed by some rounds rapid from every rifle available. Abdul had his flares up inside 30 sec. Stood next to Capt Abbott in firing line and the shower of bullets streaming and zipping over head was accompanied by hellish din of musketry and machine \n\n9\/9\/15 Johnstons Jolly\n\nguns. Returning the 30 yards from the firing I got hopelessly lost and took a wrong turning which landed me out on the scrub covered dark hillside. Wandered here for an hour before finding the way again. \n","15":"\n\nA fine cool day plenty to do. Quite a lot of shelling today resulted in some chaps being buried but none hurt. We have some \"points d’appui\" in our line – a technical term too tough a morsel for the ‘warbs’ who call them \"points der putty\". One chap had a clip of cartridges in his pouches hit but no harm done. During the afternoon while they were putting over a lot of high explosive on us two Abduls poked up their heads and got bullets through them from our snipers. Being in such close contact breeds a great familiarity between men & officers – I can see\n\n10\/9\/15 Johnstons Jolly\n\nthem calling us by our Christian names soon. Today issued lime juice ration 1\/10th of a gill to each man. An old chap from \"C\" Co was acting as orderly and I gave him a tot of rum left over from yesterday. He was greatly delighted \" ’Ere’s luck to yer Sir and to Orsetrilier!\". The same gentleman later on had the nosecap blown off his rifle in this evening’s bombardment but escaped himself unhurt. His lucky day!\n","16":"\n\nCold as ____ & pitch dark at stand to arms. Signallers called us too early so had to freeze about for an extra half hour. It turned out a lovely fresh morning with the sea white capped flecked. With a telescope could see the sailors at work on the men-o’war. Abdul was very jumpy all night and pumping in a lot of lead. All \n\nmen off duty indulge in the latest sport. They take off the shirts and search for a \"scotch greys\". All are lice infested. Being lousy is at first a quaint and novel feeling but after a while one would not be happy without a few about. Mere fleas are a detail no one bothers about. We sent a small burial party out last night, cooperating with one of 23rd Bn from Lone Pine. We have an advanced underground post reach by long tunnels which go nearly half way across under No Mans Land. Cut upwards for air and light are sort of manholes opening on ground level. Burial party did not know what these were and looking round for good burial holes dropped a lot of dead men down these ventilators. The tunnels nearly stunk out. Went up to arrange their removal – poor dead wizened devils lying head first and \n\nall ways down these holes. One about 36 bald dark no features left. The others young but all shrivelled and unrecognisable. Sent up pioneers to collect them in old blankets and bury them in rear. Colonel Onslow Thompson’s grave with its cross right in the trenches is a familiar land mark near here. At sunset all the artillery start work shells flying round crashing and whizzing and the boom of big guns sounds on sea as well as on land. Bed early. Pioneers came down and said they ought to have an extra ration of rum after handling so many stray limbs and rotten corpses. Gave them all an extra tot. \n","17":"\n\nUp and stood to arms 4.30-5. Very cold. Busy with returns correspondence until 6.30 and then went back to bed till 8.30. Shaved in a cup of water \n\n12\/10\/15 Johnstons Jolly\n\nand breakfast on porridge made of ground up and pounded army biscuits. Also had a piece of steak bought by batman from some thieving sailor on the Beach. Mitchell is a batman who forages well. Yesterday a pillow materialized and questioned he said \"Oh, someone mislaid it Sir!\". Spent morning in trenches and sat up on fire step yarning to the men. They like the life and are full of jokes. Some of the letters home are very amusing. One chap describes for benefit of his mother a furious and totally imaginable battle – how we all charged, Turks fled, mates on either side dropped one shot through kidneys! – but the other \"absolutely blown to \"pieces by shrapnel!\" Another writing to a sister says \"I reckon one of us boys is equal to any three of these black cows in a dinkum fight!\" While sitting on their \n\n \n\n12\/10\/15 Johnstons Jolly\n\nfiresteps the men yarn smoke & clean their rifles. We have some very good shots and so has Abdul. Potting at loopholes is good practice. Great expression is possy = place. Our Kings prizeman (Bisley) Thurlow does good sniping work and lies in this little sniper’s nest waiting for Abdul to visit his latrines and then shooting him\n","18":"\n\nThe usual routine. Men in supports at toilet one shaving another \"washing\" – a wipe with damp rag. Others chasing scotch greys. Several using firesticks to burn them out of the seams – some of these chaps are Block knots! Spent evening in firing line quiet. A few wounded. One chap killed. He was just breathing when the stretcher passed me \n\n \n","19":" Johnstons Jolly\n\nVery cold at stand to – in fact so chilly today that one must take to breeches again as it is too frigid for shorts and bare knees. I had a bad cold and slept after stand to until 8.30. Today is quite wintry after all the warm weather. Very quiet in the line today. Colonel Henry Bennett leaves us tonight some shelling going on so only the snipers and observers are out in the open – the others take cover. One man killed; another had his arm blown off. Two others injured. Went up to a little observation post with telescope and had a good look at the Chessboard and could see Turks digging there. Quinns post is an elaborate place all wirenetted overhead to keep out bombs. After breakfast sat down and read \"Bulletin\". Not a shot to be heard and one has to keep reminding oneself \n\n14\/9\/15 Johnstons Jolly\n\nthat one is really at the front and that an enemy is close. Flies are troublesome and spread intestinal complaints as they come on to our food direct from ghastly banquets where the unburied dead lie. Censoring letters one is struck by the letters to Mothers. The fellows keep out all reference to hardships and \"don’t worry about me\" is the burden of the letters. The Turk is referred to as \"Abdul\" or the \"Joe Bourke\". Our new Brigadier is B General N.M. Smythe VC. Suvla Bay seen from here is full of warships and other craft and has a boom. Across miles away on the hills are the two lines of trenches. An occasional white fleecy ball of cloud denotes a shell burst. The torpedo boats or monitors lying off fire now \n\n14\/9\/15\n\nand then. A few local names. Legge Valley Monash Gully Bridges Road, Shrapnel Valley Hell Spit, McLauren Ridge, Dead man’s Gully Sniper’s Post, Steeles Post, Courteneys post, Lone Pine, Tambour Post, Brighton Beach, Quinns, Wire Gully, Browns Dip Gun Lane, Artillery Road. \n","20":"\n\nUp at 4.15. Raining. Clay mud in trenches, this place will be awful in winter and all rough weather comes right off the sea. One man killed in \"D\" Co during the night while repairing parapet. One bullet took half his face off. Abdul very jumpy and firing a lot all night. During the morning he tried some funny business waving a flag which drew some fire from us. Lower down one put his head over and called out something signalling a washout with a shovel when our chaps fired \n\n15\/9\/15 Johnstons Jolly\n\nTaube aeroplane came over this afternoon and dropped a lovely bomb on Walkers Ridge. Artillery firing at it failed to score a hit. A mail arrived this evening. In Lone Pine the 23rd have had a daring bomber who has been doing good work but rather venturesome raising head & shoulders right over parapet while throwing. Abdul waited for him today with machine gun and sliced the top of his head off like an egg shell. Beachy Bill and Rickety Kate busy today. Use at night a slush lamp made of fat and rag. \n","21":"\n\nAnother quiet day. All batmen stand to arms headed by the cook Jerry Bernau whose countenance hard & warstoushed is warranted to terrify any enemy. Noticed today that in one spot Abdul seems to have drawn his firing line back about 50 yards and lower down \n\n16\/9\/15 Gallipoli.\n\nhe has hung a sort of flag for an artillery mark over his parapet. Sniping slack and only stray shots being fired. Had to rouse our stretcherbearers up today for casually getting a man buried before we really knew he was dead! Man of 24th got bullet in head. SBs took him direct to our pioneer grave digger who promptly put him into a readymade grave & filled it up ready for Padre on his next visit. All done without any doctor seeing the alleged corpse – though no doubt the chap was dead enough. A case 2 days ago man with brains protruding from wound lived 24 hours. Inquiries into this other case seem to show that the chap had his brains pretty well scooped out. Still our stretcherbearers are too damned casual. Another instance of laziness – a man dropped hit. S B walks along turns him over says \"Oh he’s dead. It’s a job for the Pioneers to shift him\" and left the chap \n\n16\/9\/15 Gallipoli\n\nthere for 12 minutes until officer ordered removal. These same men last month would have fainted at the sight of blood or death! Still as we settle down we shall get s.b.s. picked who have the \"nurse\" instinct and a feeling of brave tender comradeship for all suffering. Abdul very quiet all evening but fairly late by concerted firing along all the front we drew hot fire from him. Went up into front line to view show. First up went some rockets beautifully lighting the show. Big things with sticks 6 or 7 feet long. Inferno of noise commenced from both sides bombs etc. The machine gun & rifles pouring a hail over our heads and cracking into the sandbags. We had a few casualties but none serious. Bed 10.20.\n","22":"\n\nBitterly cold. The winter here will be dreadfully severe on us. From trenches this morning \n\n17\/9\/15 Gallipoli\n\nhad a good periscope scrutiny. Absolutely no sign of movement to be seen. Chessboard is a mass of criss cross trenches – hence its name. Abdul opened up with 3 new guns. Our H.Q. mess consists of Colonel R. Crouch Major Bob Smith, Lt Paddy Stewart, MacLellan and Capt Dr Drummond\n","23":" \n\nArtillery started at an early hour and warmed up our right company. Brother Jack looked in. He is corporal of the Garland mortar in Lone Pine. At 10.45 Capt Buckley and Major Derrick were blown right out of their \"A\" Co H.Q. by a large shell. Derrick dreadfully wounded – Buckley not as bad. Curnow took over \"A\" Co and I took c.o. I was fed up of Adjutants work & would like the next company command. The hospital ships at night are pretty \n\n18\/9\/15 Gallipoli\n\nto view with every light glowing and their vivid red crosses. What a cargo of pain is on a hospital ship! Abdul woke up again this afternoon and started to play hell. Artillery opened and bombardment made it hot for us. Right up at Suvla we could see them getting it too. Suddenly the shelling stopped and they opened heavy rifle fire and machine gunning. Bayonets were shown over their parapets and there was every indication of an attack. We replied with steady fire at their parapets and until they stopped. Two aeroplanes up. Shrapnel bullets dropping round. While talking with Hogarth one hit him but was stopped by a pocket book. A few casualties – one man’s eye blown out. Bde Major rang up but phones were useless on account \n\nof the noise – a useful lesson in this. We could not talk at all till the sigs. swathed my head and the phone too in blankets to deaden the sound. 2 killed 6 wounded. Buried the two dead in 1 grave all inside an hour – so close are life and death here. Some badly wounded – hands off etc. Very nasty comments going round about the class of Tommies at Suvla Bay. Royal Marine Light Infantry when holding these trenches here shot their own Colonel. Slush lamps now in vogue – tobacco tin full of fat and a wick of flannel or rope they stink dreadfully. A lovely moonlight night. This morning from our little secret observation post with telescope I could see a turband Turk & mules passing to and fro also other traffic in groups. All day and all night we have shifts of \"miners\" working away in the bowels of the earth \n\n18\/9\/15 \n\ntunnelling under the Turks. A tremendous lot of the chaps claim to be professional miners since we started to issue rum after each shift,! Saw the base of the shell that knocked Derrick. 8\" – probably from Goeben\n","24":" morning. \n\nParsons unable to get congregations because all are on duty. Went up into trenches to secret observation post – cunningly concealed just near Lone Pine. Lovely sunny morning. They seem to be short of sandbags as their parapet consisted of all sorts of rubbish containers – kit bags and even gaudy colored blankets. Entanglements (knife rests) in front of their trenches and they have much timbered overhead cover. Work going on opposite – could see shovels chucking direct up and two Turks in turbans and robes tramping it down. Too far off to shoot at them. A crater in No Mans Land is supposed to have some Turks in \n\n19\/9\/15 Anzac\n\nit. The sea very tranquil today. Looking from here (opposite Johnstons Jolly) down into Shrapnel Valley men look like ants moving about. Extremely neat is all this \"back door\" right to the beach, incinerators burn all rubbish. If as many thousands of civilians happened to be camped here one shudders to think of the sanitary aspect. Our miners here to go to their work on the tunnel faces have to go down by ropes. The language here is filthy but the expression and feeling put into it is wholly delightful. One dialogue heard in Munros Bay when the Southland was torpedoed. Persons speaking – two old bush men puffing pipes. \n\nOne: \"The Southland had ‘er narrer squeak with the torpeder!\" (puff, puff, puff) \n\nThen: \"There’s some b_____ good men in the 21st Battalion\" (puff, puff, puff)\n\n’Tother: \"My b_____ oath there are!\" (puff, puff, puff)\n\nOne: \"Old Jim Brown is a b_____ good man!\" (puff, puff, puff)\n\n’Tother: \"My b_____ oath he is.\" (puff, puff, puff)\n\nThen silence \n\nAn Australian & a Tommy comparing notes\n\nAust: \"Yes we get 6 bob a day!\"\n\nTommy: \"Aw we awnly get one and f______ tuppence!\"\n\nAust: (in sympathetic surprise) \"You poor b_____ f______ bastard!\" \n\nFound a dead Turkish sniper rotting & stinking in the scrub off the beaten track. He was dead in a sitting position. Sent a chap to bury him and knew he must have had a gruesome job. He turned up smiling. I said \"How did you get on?\" \n\nHe \"All right only the f_____g gravy ran all over me when I shifted the b_____d!!!\"\n\nWhen the bombardment opened the other night one of our new chums rushed in to my shelter with his eyes nearly starting out of his head with fright and looking like a scared sparrow in a storm. Said I \"What are you doing here?\"\n\nHe: F____d if I know!\n","25":" Gallipoli\n\nStand to arms 4.15 and as cold as can be. Pitch dark and star lit when I rose and as I put my head out of the blanket door a bullet went \"phut\" into the earth only a few inches off. From where I don’t know but it was a narrow shave. A monitor putting shells into some position up Suvla way. The sound \"bang, pause, plonk\". This morning washed shaved and cleaned teeth in a cup or two of water. This is as per usual. A peculiar bomb affair in Lone Pine. A new man in the trenches lit a bomb but seemed to have no power to throw it gazing at it in a mesmerised sort of way. It burst and killed him and two others wounding several more. In the firing line this morning yarning to the \"heads\". All merry and profanely bright \n\n20\/9\/15 Gallipoli\n\nThey know every piece of grass and sand bag on their sectors – hours and hours of watching & observing tell them this. A chap (Coleman) turned up today from Alexandria having stowed away on a French gunboat. Had to put him under arrest for his escapade as a matter of form. When we were at Lemnos en route for Anzac every man was told to put a few sticks of firewood under the straps of his pack as kindling wood was reported short on the Peninsula. One gentleman was heard to remark \"It’s bad enough going into hell but it’s a fair _______ having to carry your own firewood!\" About 9 pm Turks could be seen digging in front of part of their line so this portion stood to and gave them two rounds rapid. No reply much \n\nCopy of a notice in \"B\" Coy firing line\n\nPALAIS DE SHRAPNEL. Gallipoli\n\nAccommodation for 6 bob a day tourists. Ground floor. Meals at all hours\n\nApartment a loner\n\nNewly married couples must have luggage. \n\nVisitors are requested to keep off the parapet. Offenders will be shot.\n\nVisitors must not use the drinking water for washing.\n\nGentlemen wishing to change their hose are requested to do so at night and as close as possible to the enemy trenches\n\nFleas lice & flies gratis. Not extra charge if served up in tea\n\nTurkish delight dealt out daily. New arrivals can get instruction free (at the rear) in the use of firearms. No close season\n\nThe management will not be responsible for barbed wire etc removed from the plateau\n\nNo credit given to \"stiff\" Turks\n\nBullets, bombs grenades & shells will be exchanged here day & night free of charge\n\nPositions vacant on our staff for Lady Snipers\n\nApply within\n\nMenu\n\nBiscuits a la Canine\n\nBoeuf de Bouilli\n\nRation de Maconachie\n\nDuck le bullets\n\nFoul a la Turke\n\nSmelle a la Turke avec Howitzer Sauce\n\nAbdul Salad. Mauser Cream\n","26":"\n\nLetter in dugout from D.R.A. says Jack Carman in Connells inquires after the \"dark gent\" and sent his regards – such is fame. Artillery bombard. after breakfast, stood watching shell bursts. Just a filmy white cloud first followed by a reverberating crash. Had a good look out through our secret observing post at Lone Pine’s junction with our line. The German officer’s trench seems an intensely strong nest. Very \n\n21\/9\/15 Gallipoli\n\nill all the afternoon and had to go to bed. This climate does not suit me – Egypt did. Dugouts unhealthy cut out of clay they are damp cellarlike. In winter they will be streaming with water the soakage from many graves. \n","27":"\n\nBetter but still unwell. Atkinson 23rd killed. Another chap insane. Lone Pine is a hit spot for bombing but our casualties in this Battalion are heavier than any other in the Brigade – due to their 75’s catching us here opposite Johnstons Jolly in enfilade. Sat on a Court Martial at Brown’s Dip all the afternoon and when returning with another chap got lost in a maze of trenches and came out exactly where we started. This in broad daylight. Turned in early and had a good sleep. \n","28":" Gallipoli\n\nThe coldest morning yet. Stood to arms for an hour with a wind like ice. Sea very pretty all flecked with white horses. Stood watching our shells bursting on Abdul – watched until their sniper moved me on. Bitterly cold up on these heights. We look right down on Braunds Hill. The hillsides are getting quite denuded of brushwood. Imbros in the distance and the high peak of Samothrace towers out of the water in the distance. Warships signalling by electric lamp. Piercingly cold wind – cloudy. Went up into front line and watched shells from our siege battery landing on enemy front line. Not a Turk in sight and one gentleman remarked \"We’ll Allah them – we have frightened c - out of them.\" Lovely moonlight night – the view magnificent. Turks at work repairing their damaged trenches \n","29":" Gallipoli\n\nA dreadful sleepless night driven nearly mad by vermin. One mass of flea bites from head to foot and awful irritation in head. On search found lots of the little devils. They parade on chest but bivouac in the Lowlands. A lovely day but still cold. The hills here are all covered in one shade of green undergrowth of 3 varieties. No where does it grow higher than 4’6\". Between Indian camp and Suvla Bay some trees are scattered round. The shrubs are a kind of holly. Rhododendrons and dwarf oak trees about 2’ high. Wild olives also abound. In gullies there are blackberries. Birds are scarce but we see robins linnets & sometimes a thrush. Flies of course are in their millions. They cluster round the top of dugout & at night if disturbed they set up a bee like hum. Late in \n\n24\/9\/15 Gallipoli\n\nthe afternoon we fired a rocket and then our guns on land & the ships opened. The warships made the Chessboard a sea of fire. Our F.A. engaged the Jolly and all troops rattled away with their rifles. Some enemy bombs set sandbags on fire in places. Enemy’s artillery replied the 7.5s getting some good hits and buried us in dirt. They got these good French guns, during the Balkan War. We located a Turk trench mortar. \n","30":"\n\nAfter sunrise the distant \"islands of the blest\" looked lovely. It was so clear that through the telescope looking north west we could see the outlines of the southern coast of Bulgaria. Have fresh meat now. Lovely day. Saw piece of web equipment sticking out of trench pulled it and brought out a mans ribs \n\n25\/9\/15 Gallipoli\n\nRum issue a boon to our hard working pick and shovel miners – all day and all night there are shifts picking and working. Remarkable how many of our shirkers and wasters have turned out well here. Being away from drink accounts for their temporary reformation. The man who is subject to mere outbursts of animalism is all right – the chronic waster never gets as far as the firing line. At 6.35 the Siege Battery shelled Lone Pine and big burst sent geysers of earth upwards. Blow back dangerous and pieces flew back over our lines. An aeroplane (ours) was registering the shoot. Behind the Turkish trenches beyond Lone Pine the country\n\n25\/9\/15 Gallipoli\n\nseems peaceful and cultivated. A white farm house is not a great distance away and further off there is a little white village. Beyond are the dim outlines of the mountains of Asia Minor. General Spencer Brown takes the place of General Smythe VC as Brigadier 6th Bd. Glad to have an Australian though the English have no keener critic than Smythe himself. Insects here not very numerous – two kinds of ants somewhat like \"bullant\". Always at war with one another. Now and then we see a dragonfly. The myriads of little house flies are damnably persistent. Kept down as much as possible by scrupulous thoroughness of the sanitary arrangements. The blowfly here is a small one, beautifully golden bellied. A gay chap for the loathsome banquets he likes. Saw the corpse of what \n\n25\/9\/15 Gallipoli\n\nhad been a good looking young man almost covered with these golden feasting flies – crawling in one eye to reappear out of the other. Hear that Luscombe 14th Bn is a prisoner at Constantinople. N.B. The heathen Turk comes in action with the name of God on his lips. \"Allah! Allah!\" Our alleged Christian warriors go in cheerfully profane. The English tommy swears far more filthily than our chaps – but ours will beat him someday if the war lasts long enough! \n","31":"\n\nFine but great stench from dead today penetrating everywhere. Put on a search party to cover any limbs etc visible. Agean Sea a remarkable sight this morning not a breath of wind and the water all current streaked. Craft lying aside as idle as painted ships so \n\n26\/9\/15 Gallipoli\n\ncalm their smoke goes straight up. C.O. struck a surprise packet today. Asked one man his occupation. He replied \"Draper’s assistant\". Said CO \"Rather effeminate!\" The chap replied \"Oh! I don’t know. I was in the ladies hosiery and always found it emphasized my masculinity, Sir!\" Taube aeroplane was over dropping bombs. Most like a bird – hawk. Padres running round like lost sheep looking for their congregations – men all on duty, few can go. Fatigues sweating up the slopes ration laden, bomb laden, ammunition laden. All carrying boxes they look like ants. Killing work this carrying every drop of water and every round of ammunition – it wears men to the bone. Oilstoves are being supplied for winter use. The day \n\n26\/9\/15 Gallipoli\n\ncontinues glorious. Imbros and Samothrace look abodes of the blest their highest peaks shrouded in fleecy clouds. There are many men who each evening ask and get leave to go out of the firing line to go down to the little parade ground there to sit and see the wonderful sunsets behind these islands. Much talk of Flight Commander Sampson who is doing much air work here. Periscope rifles safe accurate and much in use. Brother Jack (bomb Corpl) Lone Pine. Has been doing some good work with his little mortar. Turks are thorough. One bomber of ours was very daring and doing good work. Turks countered him by putting a machine gun directly opposite him. So torn about he had to rolled on to the stretcher when taken away for burial. Down at Helles\n\n26\/9\/15 Gallipoli\n\nthere seems to be a great deal of rumbling here relieved only by a little outburst about 9 p.m. Our bombers picked out a little post and put one right in. Tried another and then Abdul started to fire his machine guns. Bombers well under cover with their little gun – a piece of iron drain piping charged by gunpowder. \n","32":"\n\nDark when got up. Two hospital ships a mass of lights lying side by side. Rumble at Cape Helles was continuous all night. The monitors here dealing out heavy shells which land on Abdul’s trench with resounding \"plonk\". Back to bed till breakfast time. Very nice to lie down peacefully and hear the warships lamming it in. Snipers from over Chessboard way are very active at this piece of trench and their\n\n27\/9\/15 Gallipoli\n\nbullets came more close than is pleasant. Their observers can see the movement round here. Turks started at 0700 with a brisk bombardment of .75mm shells for more than 2 hours. Estimate fully 200 shells landed in our sector, the bulk fortunately bursting harmlessly on the rear of this hill. They tried persistently to knock out the guns on Plugges Plateau. In trenches dress is nondescript. All cling to Aust felt hat – comfortable shady and gives us the Australian look we would not readily lose. Some wear caps pulling the wire out of the top to make them soft. Equipment is constantly worn. Shorts bare legs perhaps socks and a pair of boots. In hot weather – above waist naked. Most have beards and unwashed look rough & tough. \n\n27\/9\/15 Gallipoli\n\nEveryone butt of jokes and fun. Diarrhoea a great trouble caused by monotonous tinned and hard diet and the fly curse. Chronic with many & weakening. Everyone wears a piece of mosquito net round hat. To make this dull color we soak it in tea. Sunsets here are wonderful. Last night shades of violet. Stood charmed for half and hour watching it change. The Turk has made a new post for his snipers and commands this spot which he has been tickling up – the cooks were stirred up. Night turns out pitch dark and bombardment up Suvla way presents remarkable sight. The whole range lit up by bursting shells and the flash of discharge. From the guns a sheet of flame leaps out into \n\n27\/9\/15 Gallipoli\n\nthe darkness. Heavy thunder at Helles. The guns have been roaring heavily round the straits for 48 hours, Bed 2056\n","33":"\n\nPitch dark standing to arms. Abdul busy working on repairs all night but our sniping must have hindered them. Daylight discloses entanglements placed in position by them – evidently made in rear and then carried out. Again he has started to bombard us but our guns are heavily replying. Parties on the beach are constantly under Beachy Bill’s fire. Sank an Egyptian ketch of iron and timber close in – shallow water. Masts sticking up hereabouts mark different wrecks. The Majestic was submarined close to the shore. The men in the trenches \n\n28\/9\/15 Gallipoli\n\ncould see the periscope. We got a tin affair full of gunpowder hurled on the roof of our dugout – noone hurt. Taube dropped some bombs too. Crozier our artist did a pencil sketch of me. RSM acting as O.R.S. too. Some extra sickness owing to cold snap 4 pneumonias. We have tied some grappling irons on to a rocket and are going to fire it to see results. If it acts we shall try and drag Abduls wire about with the ropes attached. A tug of (real) war!\n\nLater. \n\nThe rocket experiment failed. Owing to weights being wrongly balanced the rocket went quite the wrong way and landed right down Shrapnel Gully. \n\n"}}