{"Document Name":{"0":"Diary_0395","1":"Diary_0395","2":"Diary_0395","3":"Diary_0395","4":"Diary_0395","5":"Diary_0395","6":"Diary_0395","7":"Diary_0395","8":"Diary_0395","9":"Diary_0395","10":"Diary_0395","11":"Diary_0395","12":"Diary_0395","13":"Diary_0395","14":"Diary_0395","15":"Diary_0395","16":"Diary_0395","17":"Diary_0395","18":"Diary_0395","19":"Diary_0395","20":"Diary_0395","21":"Diary_0395","22":"Diary_0395","23":"Diary_0395","24":"Diary_0395","25":"Diary_0395","26":"Diary_0395","27":"Diary_0395","28":"Diary_0395","29":"Diary_0395","30":"Diary_0395","31":"Diary_0395","32":"Diary_0395","33":"Diary_0395","34":"Diary_0395","35":"Diary_0395","36":"Diary_0395","37":"Diary_0395","38":"Diary_0395","39":"Diary_0395","40":"Diary_0395","41":"Diary_0395","42":"Diary_0395","43":"Diary_0395","44":"Diary_0395","45":"Diary_0395","46":"Diary_0395","47":"Diary_0395","48":"Diary_0395","49":"Diary_0395","50":"Diary_0395","51":"Diary_0395","52":"Diary_0395","53":"Diary_0395","54":"Diary_0395","55":"Diary_0395","56":"Diary_0395","57":"Diary_0395","58":"Diary_0395","59":"Diary_0395","60":"Diary_0395","61":"Diary_0395","62":"Diary_0395"},"Date":{"0":"unknown","1":296.0,"2":297.0,"3":298.0,"4":299.0,"5":300.0,"6":301.0,"7":302.0,"8":303.0,"9":304.0,"10":305.0,"11":306.0,"12":307.0,"13":308.0,"14":309.0,"15":310.0,"16":311.0,"17":312.0,"18":313.0,"19":314.0,"20":315.0,"21":316.0,"22":317.0,"23":318.0,"24":319.0,"25":320.0,"26":321.0,"27":322.0,"28":323.0,"29":324.0,"30":325.0,"31":326.0,"32":327.0,"33":328.0,"34":329.0,"35":330.0,"36":331.0,"37":332.0,"38":333.0,"39":334.0,"40":337.0,"41":338.0,"42":339.0,"43":341.0,"44":342.0,"45":343.0,"46":344.0,"47":345.0,"48":346.0,"49":347.0,"50":348.0,"51":349.0,"52":350.0,"53":351.0,"54":352.0,"55":353.0,"56":354.0,"57":355.0,"58":356.0,"59":357.0,"60":358.0,"61":359.0,"62":360.0},"Entry":{"0":"\n\n","1":"\n\nLeft Kensington at 7.45 am for Fort McQuarie there we caught ferry boats to S.S. Afric. We left Sydney Harbour at 5 15 pm. Same date. It was raining all the time.\n","2":"\n\nAt Sea Been a bit squamish all day – but am better now. Had a concert on deck. Warship sighted about 3.30 pm Weather good Sea Calm.\n","3":"\n\nPassed Wilsons Promontry about 7 am. Had a good day. All A.S.C. gathered at 5 30 pm and Sung Australia’s Khaki men with Mulligan as instructor. Very funny.\n\nMulligan counted out. 8 pm. Ship Sighted on Starboard, wireless messages exchanged. Supposed to be “SS Karoola\".\n","4":"\n\nWeather Still Same Nothing to do all day. No land in Sight. Have left Adelaide behind long ago. 7 pm Storm coming up but I dont think it will be much.\n","5":"\n\nBathurst feigned heart failure so as to be put off at Albany. Strength is he has “Germanitis\" Nothing doing. Windy and Sea choppy.\n","6":"\n\nSea a bit rough. “Euripedes\" Sighted. We are nearing this end of the Australian Bight and expect to reach Albany some time on Sunday. Started to rain about 5 pm & everything points to a rough night. I have a billious headache & feel sick. Had a rough night\n","7":"\n\nStorm gone down. Sea choppy & air cold. Still feeling sick. Head very bad.\n\nWrote 10 letters yesterday and 5 to-day also wrote two more & Sent one Souvenir photo to Sydney. Food becoming very bad.\n\nExpect to reach Albany to-morrow.\n","8":"\n\nArrived in Albany at 5 am and anchored in King Georges Sound. Practically everybody\n\nup on deck at 4 am to See entrance into the Sound. We dropped anchor at 6.35.\n\nThere are a few Small islands at mouth of Sound, one of which is Breaksea. There is a lighthouse on it, and is situated to the right as you enter the Sound. I have not seen any beaches like we have in Sydney yet; though I am told there is a nice one near the township. One of the Engineers caught a small shark about two feet long and the men started to cut it up alive. After they had ripped it up & taken its tail off, they threw it back into the water.\n\n1 pm. The Shropshire has just come into the Sound. There is another one following. Supposed to be the “Saldanha\".\n\nThere are now about 14 troopships in the Sound.\n\nOfficers went ashore & returned to ship about 6.30. Rumours of march through Albany. I hope it comes off. The H.M.A.S. Melbourne arrived about 8 pm.\n","9":"\n\nHeavy wind blowing. Sea rough. Orvieto and Geelong arrived about 8 am. There are other boats continually coming\n\ninto the Sound. I am told that by to-morrow there will be over 28 in the Sound.\n\nIt is a public holiday being the W.A. Eight Hour Day, and is raining hard. All hands allowed below Mail in from Sydney Only a few letters for A.S.C. I received a letter from Sydney.\n\nWind blowing hard & there is every indication of a furious night.\n","10":"\n\nNothing much doing, still raining, in fact it is altogether a miserable day. I will be glad when we get on the move again Read out in orders this morning a Speech by Senator Pearce wishing us God Speed etc, also one by Earl Kitchener giving us advice and telling us to keep away from women and wine?\n\nWrote to Jim OConnor.\n\nAm feeling darned lonely and wont be sorry when our stay in Albany is over & we are on our way again\n","11":"\n\nNice and fresh. “Miltiades\" arrived at 8.25. There is only 10 New Zealand ships to arrive now 10 am New Zealand ships arrive\n\nThey are all painted grey and were escorted by three British Cruisers and one Japanese\n\nCruiser. All are anchored at mouth of the Sound.\n\nA small whaler came alongside with vegetables & supplies. She was very old and had a very dilapidated appearance\n\nThe Engineers & A.S.C. held a combined concert to-night Artists very good. Proposed to repeat same every week\n","12":"\n\nWarship supposed to have fired shots across the bows of a transport steamer while entering the sound at 4.am\n\nThere are now about 42 ships in the Sound. There is now a strict censorship over all letters leaving the boat but letters sent to those on board are left intact.\n\nJim Buchanan asked Jack Clark what does radium do who said it mucked up things in general.\n","13":"\n\nLeft moorings at 6.30 and came alongside the pier at 7.45.\n\nThe Infantry and A.S.C. from the “Benalla\" went ashore about 9 am. They were a fine stamp of men.\n\nThe A.S.C. and Infantry off\n\nthe “Afric\" also went ashore at 2 pm and went for a route march through Albany. We marched right through the city and round to the beach, then round the mountain and back to the boat making a complete circle. We passed Anthony Horderns memorial on the top of the main street near the outskirts of the town. We passed his grave further on.\n\nIt is not a bad little place though it is a one horse-power outfit and everybody has the outback look.\n\nThe day was spoilt by a few fellows who broke the ranks and got drunk. Bathurst was amongst them and was trying to get away. The patrol caught them all in town and brought them back to the boat. David was in a rotten condition. He is to be tried \nthis afternoon\n to-morrow\n","14":"\n\nFire alarm at 5.15 am All hands turned out half asleep & half undressed. The fire was among some \n\nstores in no. 6 Hatch but was soon put out without causing much damage. We left Pier at 6. am and returned to moorings Everything ready to move off.\n\nMock courtmarshall at 7 pm Bathurst was tried on a charge of wearing a belt insufficiently tight to prevent his heart from slipping into the seat of his trousers & having told our comrades on the “Benalla\" that all the men of the A.S.C. were suffering from Germanitis. He was found guilty & sentenced to a shower bath, a blanketing & Sent to Coventry for 14 Days. The Sentence was carried out right away and as there was not sufficient water in the shower the hose was turned on him.\n","15":" .\n\nNice and fresh Set sail at 7.45. and passed through the mouth of the Sound at 8.25 Sea very calm\n\nWe are moving along three abreast. The Afric is the fourth ship in the third line that is the last line on the \nport\n starboard\n\nSide. The “Orvieto\" is the flagship. She is the first ship in our column\n\nThere is a cruiser at each of the rear flanks and one out in front. It is truly a splendid spectacle. There has never been as many ships under one flag on this ocean before. and I doubt if it will occur again.\n\nAll lights are put out on main deck and portholes are closed \nare closed\n until 9 pm, when they are opened, after the lights go out on troop deck.\n","16":"\n\nVery Rough weather Rain at intervals. New routine for ASC.\n\nLost my Soldiers Pay book.\n\nThe “Benalla\" and Armidale are pitching and tossing like egg shells\n\n3rd.\n\nStill very rough. Ship very steady compared to the rest. Feel sick. Have a very bad head Pay book found by Lance Corporal Woolman.","17":" Reward to pay Pay Day. Only received 14\/-.\n\n3 pm Sea very high now. The “Medic\" and “Ascanices\" came into column\n\nfrom Freemantle escorted by two Japanese cruisers.\n\nEveryone is talking about the prophesy that the A.19. would go down on her Second day out They Say it is going down to-night at 11.55. Rot!!\n\n“Gmynastics\" to-night. Had gloves on with Jack Clark Good time. –\n\nSea gone down to heavy swell and ships rolled all night. I have no hammock and am sleeping on the troopdeck so which ever way the ship rolled I rolled too\n","18":"\n\nHeavy. Swell. Dull day, Dead horse thrown overboard from the “Shropshire\" Boxing tournament to-day at 2.30. It was a bit of a freeze. Too many forfeits Bob Mayman had a victory. \n\nA very close night.\n","19":"\n\nGlorious morning I am up on winch deck enjoying morning Sun while the rest are drilling We are in the tropics now and are beginning to feel the Sun\n\nThe food was pretty bad to-day although it has been improving. I have not had\n\na decent cup of tea since we left Sydney.\n\nThe Osterley passed homeward bound at 6.50. She was very close and we could read the name quite plain. The passengers cheered and the troops cheered in return They signalled Good bye & God speed and were soon out of sight.\n\nLater. A meeting was held over goods on board marked for troops. They say they were presented to the troops & want to know why they have not received them A committee is too be paraded before the colonel.\n","20":"\n\nVery warm all day.\n\nPractice in the use of lifebelts Had a tryout to join Glee club that is being formed on board.\n","21":"\n\nGee, but it’s hot to-day and the sea is quite calm.\n","22":"\n\nBurial at Sea.\n\nA chap by the name of Kendall died on board the “S.S. Euripides\" and was buried at 10.30 am. The Ship going out of her course to do so.\n\nI fell asleep on the winch\n\ndeck and having no shirt on woke up later to find myself burnt all over\n\nThe “H.M.S. Minataur\" left the head of the fleet this morning on other Service. The H.M.A.S. Melbourne will now be in charge of the escort.\n","23":"\n\nA Slight sprinkling of rain but still very hot Something doing to-day. The Japanese cruiser that was on our right crossed the line of transports and tore west as hard as she could go\n\nRumors of the Emdem being captured.\n\n11.30 am. Wireless from H.M.A.S. Sydney “Embden beached herself to Save sinking. Am now in pursuit of collier.\"\n\n11.50 “Embden beached & done for in an engagement with Sydney.\"\n\nLater “Two Killed and thirteen wounded on Sydney\"\n\n“Collier captured\".\n","24":"\n\nGetting warmer every day, storm during \nvery during\n night. Expect to reach\n\nline very soon.\n","25":"\n\nQuite calm again. A death on the Orvieto.\n\nWe have not lost anybody yet though there are a few in the hospital.\n\nThe fellows are continually going under the shower on account of the heat.\n\n3 pm. Three deaths on the Ascanices. It is rumoured they died from entenic fever. There is now a nice breeze blowing which is quite a change after the heat of the day. \nWrite to indecipherable\n \n","26":"\n\nSea like a millpond Expect to be on the equator Some time to-morrow The men are now rigging up the bath.\n\nA Ship passed outward bound at about 1.45. She was painted grey but her red water mark was easily discerned. Later. I have just found out that she is the Empress of Asia. taken over by the Naval Authorities and sent to fix cables at Cocos Island which were destroyed by Emden.\n","27":"\n\nRaining very hard New Zealand troopships moved out in front of the column at full speed. They are going direct to Colombo.\n\nAt one oclock the A.S.C. met the Engineers in a wet towel and water fight on deck. I had to change three times, and had one Singlet ripped to pieces. At two oclock, came the ceremony of crossing the line though in reality we went over early this morning ie at 7.35 It was raining all the time and to make it worse they turned the hose on us.\n\nOnly the officers and those men who were standing on the platform were put into the bath. I got off with a thorough wetting But Gee it was funny while it lasted\n","28":"\n\nIt is hot and sultry to-day. The air being very heavy. To-night I witnessed the most beautiful Sunset I have seen in my life. The Sun was like one huge\n\nfiery ball Sinking into the ocean. There have been some pretty Sunsets but this is the best.\n","29":"\n\nLand in sight at last, first we have seen for two weeks. Will be in Colombo this afternoon. There are about half a dozen native boats or catercuarangs as they are called. Sailing about with a few natives on them. They came as close as they could but are only allowed to a five hundred yards radius There are also a few schools of porpoises to be seen diving about near the Ship.\n\nI have a very sore throat So much so, that I am dieted and ordered by the doctor to cease smoking cigarettes.\n\nWe have our uniform on to-day for the first time since we marched through Albany. Jingo my feet are sore after being without boots so long\n\n2.pm. At last we are at Colombo. It is a great place, very pretty and picturesque. The town is built along the coast and there are some\n\nfine buildings to be seen near the water’s edge.\n\nBehind the breakwater are several Russian \nwarsh\n and Japanese warships, all the New Zealand troopships, the Sydney, Melbourne and the “Empress of Asia\" which has the prisoners from “Emden\" on board.\n\nShe is a very large ship having a tonnage of 23,000, and speed of 23 to 25 Knots. Nearly all of them are flying the yellow flag, but I am not sure if it is meant for quarantine.\n\nDuring the afternoon there were numerous people on the breakwater and the beach. They were all dressed in white and looked fine\n","30":"\n\nVery warm and Sultry. Mt throat is still very bad During the afternoon a native boat came alongside. It was between fifteen and eighteen feet long and was made of three long pieces of wood laced together . and floated practically level with the water. In all it was a strongly built structure\n\nand it was quite obvious that it would never sink On it were perched six Cingalees, one of whom had only one arm, which was severed at the shoulder. They were absolutely naked except for a bit of cloth around their loins and of course were coal black. \n\nThey gestulated and Sang out in pigeon English to throw “One shilling\" “Two shilling\" “All right. Get Him\" meaning they would dive for them which they did and always caught them before they reached the bottom. They never missed a coin, but would not dive for coppers as they said they could not see them. They caused us small amusement where on being asked to sing, Sang “Ta ra ra boom de ay\" at the Same time flapping their elbows against their ribs and clapping their hands.\n\n4 pm. There are quite a crowd of white people to be seen on the breakwater among whom are a lot of Russian, Japanese and English mano’warsman\n\nNew Zealand troops are to be seen continually going ashore in batches. We have the hard luck to be anchored in the stream so cannot follow their example\n\nIt is now the middle of the Indian Autumn. Gee whiz!! What must the Summer be like\n","31":"\n\nVery warm though there is a nice breeze blowing. A tug manned soley by. Cingalees came alongside at about 10.30 am with jam and preserved fruit for the Ship.\n\n11 am. A British warship and Some of the transports including the “Orvieto\" A3 Hymettus A1 and “Southern\" A27 moved off to sea en route for England via Suez Canal.\n\nWe will follow later in the day 4 pm. Tug again Came alongside with goods for sale such as cocoanuts, bananas, apples, and newspapers.\n\nIt is hard to realize that we are 5203 miles from Sydney. Nevertheless ‘tis true.\n\n7.12 pm. The anchor has just been heaved up. We are continually going ahead, stopping, and going\n\nastern. We moved off at 12. knots an hour at 7.46.\n\nThe Searchlights from the shore played on us until we out of Sight. We are now en route for Aden. It rained pretty hard during the night and those Sleeping on deck were forced to go below.\n","32":"\n\nIt is still raining, but its very close for all that.\n\nThere are now only transport and a Japanese cruiser “The Ibuiki\" in our column. We expect to catch up to the others to-morrow who are only travelling at 8 Knots. \n\n12 \nam\n noon. Up to now we have done 192 miles. I have since leaving Colombo omitted to enter up the mileage which is put on chart every day at 12. up to the present but will do so hereafter\n","33":"\n\nIt still remains very hot. We are moving very Slow in fact we are keeping the rest of the fleet back in consequence.\n\nThe Stokers complained of the heat and some of the A.S.C. & Infantry relieved them. The Speed is now improving\n\nthough the rest of the fleet are not in sight yet. Up to noon to-day we covered 256 miles\n","34":"\n\nVery warm. Practice for rifle team of which we are the favorites. The betting being 6. to 4. Mileage to-day 280. We overtook the rest of the fleet during the night but we are all mixed up that is we are not in our original positions.\n\n21st\n\nBeautiful morning Sea as usual. Calm A collision occurred at 5 am this morning between the “Ascanius\" and the “Shropshire\". The “Ascanius\" ramming the “Shropshire\" astern. In consequence two men who were sleeping on deck were shook overboard by the impact. The searchlight from the cruiser “Hampshire\" played on the water and two boats were lowered at once from the “Shropshire\".\n\nThey were picked up after being in the water about an hour. Both were none\n\nthe worse for their immersion.\n\nI consider that those on board the “Afric\" are extremely lucky having no mishaps and very little sickness.\n\nWe are now put in the Slow division. The fast steamers have gone ahead at 13½ knots.\n\nGood programme by Glee Club. Seaman Wilcox excelled and was returned three times. Mileage up to noon 278.\n\n22nd\n\nPractise for rifle compet. ion. Betting still unaltered At fire practice to-day Dutchy Roberts asked the Second officer (Ships) how big the fire was going to be. He is the nut of the corps. \n\n258 Miles\n\n23rd\n\nSokatra Island in sight at 7 am. Took all day to pass it. Competion run off to-day. No. 2 Coy had the bad luck to let one of their piles (of rifles) fall, and so lost points. The result was\n\nNo 1 sec of Engineers 1st\n\nNo 3 “ “ 2nd\n\nNo 1 and 2 Army Service tied for third place.\n\nA concert was given by the Bijou Orchestra & ASC. to the Engineers in honor of the competion coming to the Sharp end, otherwise the bow. The Orchestra played some very pretty Selections including the “Norwegian Cradle Song\". There was also some good songs.\n\nIt was attended by the A.S.C. & Engineers officers and men and we had a royal time. The fact of beating the Infantry at their own game was sufficient to make us happy.\n\nToasts were given by the ASC officers & the Engineer officers heartily responded. In all it was a brilliant success and was enjoyed much better than those that are held down aft. \n\nMileage 264.\n\n24th\n\nWeather still pleasant The sea is dead calm in fact it is like a sheet of glass the only movement in it being made by the wash of the ship.\n\nWe have run short of fresh water and have been using condensed water for about a week. We hope to reach Aden to-morrow where I believe we get Some fresh. I won’t be sorry if we do. as the condensed has a peculiar taste like lime & Salt and a cup of clear water would be very much appreciated by those on board. 259 miles.\n\n25th\n\nGlorious morning. Sea unruffled and there are thousands of jelly fish with a red cross on them floating about.\n\nOn account of water being short no one is allowed to do any washing until we reach Port Said where we will coal and get a fresh supply of water. I don’t think we will stop at Aden though we are very near there now.\n\nThe escort has gone ahead & last night there was an extra guard posted to watch the ammunition which was\n\nbrought up for the 4 inch guns, which are posted at the stern. \n\nThis was the cause of some rumors to the effect that the Turks were marching on Aden and the A.I.E. Force were to land there and prepare for action.\n\nLand in sight at 1 pm. Arrived outside Aden at 4.15. Dropped anchor at 4.37.\n\nThe rest of the fleet and two warships were waiting for us here Its coast is rugged but unique. On the top of one of the cliffs which towers high in the air is a lookout station. The rocks are jagged and like a saw. To me it seems inaccessible.\n\nThis is where the 3rd Grenadiers were sent when they mutinied some 13 or 14 years ago. We will only stay here for about 12 hours.\n\nCopy of wireless received Berbera Signal station to-day\n\nCathedral and other buildings set on fire in Argonne Violent attacks on both sides without result\n\nOn of largest German Sub-marines the U18 was rammed by British Patrol boat and sunk off North East Coast of Scotland Three officers and twenty three men rescued by our destroyer Carry.\n\nPersian Gulf enemy defeated on 15th and on 17th fled We captured 18th and occupied Basrah on","35":"\n\nGerman East Africa – Anglo Indian unsuccessfully attempted to Siege important terminus. Found enemy in much Superior strength. Casualties nearly 800 including 140 British Officers and men.\n\nMiliage 52 260\n","36":"\n\nThe fleet has formed again and we are ready to move again. The anchor was weighed at 6 am & we moved off at 6.35.\n\nAbout 7.45 we passed one of the Indian troopships which was returning from\n\nthe continent. She was travelling very fast.\n\nWe are now going through the “Gates of Hell\". Gee!! but it earns its name\n\nWireless message picked up. Indian troops gallantly re-take some trenches lost yesterday capturing three German Officers, 100 men, 1 motor and three machine guns.\n\nYesterday 2 British Battleships Severely bombarded points of military significance. Ziebruge French Government reports violent infantry attacks especially in Argonne otherwise no change.\n\nRussian Government reports continued fighting in Poland. One corps captured 5000 Germans and many machine guns Successful fighting reported from Caucausus. \n\nZepplin Airship factory at Frederichs Haven attacked by British Naval Aeroplanes and severely damaged one British Officer being wounded & captured.\n\nLater. Wireless from Berbera Union Jack hoisted at Basrah","37":" Estimated 2000 Turkish wounded brought these after occupation.\n\nDuring the day and practically all night there were numerous Indian troopships passing us outward bound.\n\nWe were in sight of land all day. \n\nMileage 60.\n","38":"\n\nMorning broke fairly warm, but fresh.\n","39":" am. We are now passing Some small islands which are called the twelve apostles.\n\nThe New Zealand ships are right out in front of the “H.M.S. Hampshire\". They are to be seen just on the horizon I do not know if there are any cruisers in front of them. There are plenty of porpoises and shoals of dolphins to be seen about here. It is dreadfully warm to-day, in fact the air is suffocating, and below decks is like a huge boiler. I think the cold\n\nweather will be welcomed? for a while.\n\nMileage up to noon 263\n","40":"\n\nWeather still same. Sea unaltered. There is a peculiar fever pervading the ship, with the result that several officers & men are in the hospital.\n\nIt is as warm now as it was where we were crossing the line, only it is a muggy heat, not clear.\n\nIt was announced to-day at dinner that we are to dis-embark early on Tuesday morning at Port Suez and entrain for Cairo. where we will finish our training. We are to take the place of the British Territorials who at present man the garrison there.\n\nEveryone is discontented at the Sudden change in the programme. I am for one just after dinner the top deck was like the Tower of Babylon. There were arguments everywhere.\n\nWe held the last concert to-night by the Glee Club\n\nLeuit Col. Dobbin presented the prizes for the rifle competion.\n\nMileage 257.\n","41":"\n\nVery windy but fresh Sea becoming very rough. The air is quite cold at night to-night being the coolest we have had so far.\n","42":"\n\nStill blowing very hard Sea a bit rough. Expect to land very shortly. \n\nThe wind to-night was very severe and during the night it blew a hurricane I was sleeping on deck and the wind cut like a knife in fact it was impossible to get warm\n","43":"\n\nSea choppy Air cool. Heavy wind still blowing.\n\nThere is land on either side of us. It is rough and sandy not a tree or bit of green stuff to be seen. But there are plenty of lighthouses and beacons.\n\nArrived at Suez 12 noon Dropped anchor at 12.35. There are two warships here. There are also to be seen plenty of sharks in the water near the boat.\n\nSome native craft came\n\nalongside this afternoon with fruit, figs, dates, chocolates, and Egyptian Cigarettes.\n\nThey did an enormous trade. The New Zealand troopships have gone through the canal. While they were in sight it seemed as though they were travelling through sand and not water on account of so many turns and twists.\n\n4.30. The Sun is now sinking and the scenery about is something magnificent In fact it is so great that it is impossible to describe.\n\nWe are at present taking in fresh water.\n\nTo-days order is that we will go on to Alexandra where we will disembark and proceed to Cairo by train.\n","44":" \n\nVery dull day. No further move yet but will enter the canal some time to-day\n\nThe Main Guard is now issued with ball cartridges the reason of which we are told is because it is expected we will be fired on any minute\n\nMoved off at 1 pm\n\nand passed the French Battle-cruiser – the crew of which sang out “Vive-le-Australie\" and “Vive-le-Anglais\" and when the first Battalion Band struck up “Le Marsellaise\" they cheered and cried “Hip, hip, le roi\" the nearest they could get to it in English.\n\nWe entered the canal at 1.10.\n\nOn our way we passed numerous British and Indian Outposts who were guarding the canal.\n","45":"\n\nArrived at Port Said at 5.10 am\n\nThe place itself is certainly pleasing to the eye. All the buildings are highly colored.\n\nThey have some curious customs. This morning I saw a native drive two cows along the street, stop at a house directly opposite to where our boat is moored, and when the woman of the house brought out her jug, he calmly sat down and milked the cow\n\ninto it.\n\nThere are plenty of English people here who gave us a cheer this morning.\n\nFirst uncensored mail sent away to-day. Also mail from home\n\nMoved into stream at 6.30 pm to make way for the remainder of the fleet.\n\n8 pm Are now anchored in Mediterranean. \n","46":"\n\nVery Dull day. Sea dead calm.\n\nI have been ill for past two days and am still feeling bad. Will be moving off some time to-day. We have been ordered to pack our kits as we will be disembarking to-morrow at 7 am.\n\nMoved off out 5.30 pm. Very cold. Another mail, one from \nindecipherable\n \n","47":"\n\nRaining steadey, Heavy sea\n\nArrived at Alexandia at 8 am Everything ready for disembarkation. Later :- As usual there is some hitch. We are not to land till Monday\n\nThere are innumerable sea gulls flying about here. The most I have seen so far. There are also plenty of small sailing vessells and fishing smacks moored near the town. From what I have seen\n\nof the city, it seems to be a very large one. All the buildings are painted a light yellow and are built very close to-gether.\n","48":" \n\nNice and fine, but cool\n\nNumerous skiffs, with Greek crews are to be seen moving about round the boats\n\nThe Khedive of Egypt has cleared out and I believe the Union Jack is to be hoisted in the city.\n\nA death occurred on board to-day. A chap from the Infantry died from Pleurisy and pneumonia. This is the first death that has occurred on board. He was taken ashore in the afternoon in a launch to the fort which is manned by British Territorials. \n","49":"\n\nVery Dull. Still on board No further move yet.\n\nA good few fellows from the Infantry scaled overboard last night and went ashore. They were missed and a trap was laid for them. When they returned eighteen of them were captured including Captain Swannell of the Infantry. They got 7 Days cells and lost seven days pay. I don’t know how the Captain\n\ngot on.\n\nThe funeral of the chap who died yesterday was to-day.\n\nTwenty four men from the A.S.C. attended besides his own company and the 1st Battalion Band. He had a very decent funeral.\n\nWe were paid to-night for the last time on board as we will be landing to-morrow some time. There were great preparations etc.\n","50":"\n\nIt is raining and altogether a miserable day.\n\nLeft moorings and came alongside about 9.30 am. The horses were the first thing taken off. There were only about half a dozen of them. All of them went off quietly except one which had to be slung\n\nNext came the ammunition of which there was a great quantity and then the general cargo.\n\nAll the goods were loaded on to the natives lorries, which are twice as long as an ordinary lorry and about three feet from the ground. The wheels being very small. They are drawn by two mules, who, nine cases out of ten are skinny looking beasts.\n\nThey look peculiar after the Lorries of Sydney. \n\nThe native policemen are also amusing. If a man does anything he does not run him in, but lams him with a big stick or anything that happens to be on hand. He shows no mercy either.\n\nThis afternoon they boys on board were throwing money to the natives on the wharf. Gee whiz, you ought to have seen the scramble. They dived down on it like hawks. It reminded me of a football scrum only they were lying down in the mud kicking, grunting and squealing. We nearly burst our sides when the policeman came up with a paling and started whacking them. Say! It was like a pantomime to see the scatter the natives are very frightened of the policeman and the soldiers A very good thing too.\n\nSmall four wheeled cabs are to be seen tearing here and there They seem to have no speed limit \n\nThere is a railway siding alongside the wharf and everything is in a bustle, all the natives talking\n\nat once makes it worse.\n\nAll round the wharf is filthy dirty though there are plenty of natives with brooms who are supposed to sweep it and there are a few dilapidated buildings in the vicinity.\n\nThere is a regiment of Imperial Army Medical Corps here also a regiment of Dragoon Guards.\n\nThe AM.C. uniform in khaki drill with peak caps (like our officers) and puttees. They some time wear short trousers just above the knee and puttees.\n\nThey cant come up to the Australian Soldier for neatness though. They are left far behind. \n\nMy opinion of the place is not overwhelming as far as I have seen. We are landing to-night at 6.30\n\nBall ammunition is to be issued as soon as we land on account of the Union Jack being hoisted to-morrow.\n\nIf the rain continues we shall have it wet for the disembarkation as we did when we embarked. We are going to a place called “Mena\" which is situated about\n\nten miles from Cairo.\n\nWe have a one hundred and twenty mile run in the train first. \n\nNot landing till tomorrow.\n","51":"\n\nLast breakfast on board at 6.30 am. All hands were on the wharf at 8 am except Jack Clark, Les Wall, Harry Hoghead and myself. Us four having to stay behind to swab the decks. \n\nWe stayed on board till about 9.30 am. We then went ashore and stayed on the wharf with the rest of A.S.C. (who were the last to leave) till about 11.30 am then we formed up and marched through the city (the streets of which were very sloppy) to a place called Gabbari where we camped in an old vegetable market which smelt strongly of onions. We also found that it was infested with cockroaches and other insects.\n\nThere is a terrace of old and very much dilapidated houses at one side of us from which the men and women lean from the windows to stare at us. They are a dirty looking lot.\n\nThe women wear a cloth over their face all you can see is their eyes. We are not allowed to look too long or stare at them as it is considered by them as an\n\ninsult.\n\nIt is very cold, but I suppose we shall feel it worse to-night. I do not know how long we are going to stay here\n\nLeave was granted (as I tipped it would be when we got away from Colonel Dobben) from 2 pm till 6 pm.\n\nScotty McIlveen and myself went all round the city. Great to my surprise I met Lambert Graham whom I used to know quite well in Balmain. He had two pals with him. All three were wireless operators and are returning on the","52":" (tomorrow) to Australia.\n\nAll five of us engaged a cab to take us round the city. We had him for an hour and when the journey was completed we gave him five piastres which is about 1\/-½. You ought to have heard him blow off but as that was the registered fare we walked away and took no notice. He soon shut up.\n\nCabs and in fact all travelling is cheap but the natives try to sock strangers if possible. It did not work with us.\n\nAll the supply section including Clark Wall & Johnson left for Cairo to-night. The transport section are not leaving till the “S.S. Hymetties\" lands the horses.\n\n10th\n\nBroke nice and fresh, but it was very cold during the night.\n\nThe native children in the nearby houses started yelling early in the morning. It was an uearthly noise. I hope they dont make a practice of doing this every day.\n\nAt present we are on very rough rations. All we got up to dinner time to-day was tea and a couple of extra hard biscuits. Gee they were hard. You could soak them in boiling water for an hour and it would make no difference to them.\n\nFor dinner to-day we received some cheese without ant taste and some bread. The tea had no sugar in it. This is where we begin to rough it.\n\nWe have done nothing yet as far as taking up the defencive but still mucking about as we did at Kensington.\n","53":"\n\nReveille at 4.15. Had a half a cup of tea with no sugar that was all. Started for wharf at 5.30 to unload horses from S.S.\"Hymetties\". Had more tea and dry bread at 10 am. All had to work like trojans. There were several mishaps. Up to 6.30 pm we unloaded 600 horses and trucked them. Gee but it was hard work especially on an empty stomach.\n\nHad bread and jam only for tea while the Sergeants went on board for tea Unloaded more till 9.30. Entrained at 9.45. Train left for Cairo at 10 pm Up all night.\n","54":"\n\nArrived at Cairo 2.30 am, shunted to a siding two miles on where we detrained and had some cocoa & bread & cheese at a stall There was only one thing wrong with it There was not enough. \n\nThere we unloaded horses, and proceeded to Kasse-el-Nil barracks which is about a mile from the station where we watered them.\n\nStarted for Mena at 8.45. It was the worse march I have been on but the scenery round about was gorgeous Everyone including officers were tired and exausted from want of food and sleep when we arrived at Mena a distance of 11 miles from Cairo, at 9.30 am.\n\nMore fooling about till 11.30 am. At 12.30 we had some dry bread and cheese. Plenty of work till 6 pm then bless me if I was not put on picquet. The horses were pretty bad and were continuously breaking loose.\n","55":"\n\n64 hours without sleep and only bread and cheese. I am dead beat Have till 12 noon to have some sleep, then get to work again.\n\nWe are now camped practically in the shadow of the pyramids. It is all sand but it is clean. There are 70-000. troops here now including the English \n\nWe are now on quarter rations\n\nwith plenty of work. Quite a contrast from the boat which was just the opposite though the food was bad. It is fairly warm during the day, but at night it is very cold.\n\nCamels are pretty plentiful and the horses shy like at them. If we stay anytime here I will soon learn the language. The French language is fairly prevalent here.\n","56":"\n\nBeautiful day but very cold early in the morning. \n\nPay day drew £ 6 00. On leave till 10.30 pm Went to Cairo. It is a fine city, but the natives are a nuisance they pester you to buy things. There is one hotel. The Grand Continental which is the Australia of Cairo.\n","57":"\n\nHeavy mist till about 8 am The pyramids were hardly discernable.\n\nAppointed for special patrol duty to keep natives in their place etc. I am mounted, and it promises to be a good job. I have been extremely lucky in securing good jobs all through. I start at 4.30 am.\n","58":"\n\nVery cold in morning but warmer in day.\n\nPatrol strenuous. In Cairo bought several views to send home.\n\nHome early.\n","59":"\n\nVery misty, in fact it was so bad\n\nthat I lost my way for a while. It was impossible to see 2 yds in front.\n\nRode over to the pyramids during the afternoon and round the sphinx. Had my fortune told by arab for 2 piastres (5d). He is right in one thing only all the rest was wrong.\n","60":"\n\nStill misty. Up at 4 am, very heavy day. Horses broken into harness and waggons. \n\nCalled out of bed at 8 pm to saddle up & patrol main guard, back at eleven. Very tired.\n","61":"\n\nAs usual misty. Natives very unruly and lazy. It took some time to get them to work. \n\nMet Reg Passo from Lane Cove, Sydney. He came with the 4th Battalion Infantry. Great surprise on both sides.\n\nMail in. None for me worse luck. Went into Cairo to register and post some views.\n\nAll the city was ablaze with lights and decorated with flags the Union Jack & French Flag being most prominent. The Imperial Force’s military band was playing on the verandah of the Continental Hotel. There will be a grand celebration to-morrow (Sunday) The New Sultans birthday.\n\nReturned to camp at 11 pm after a fairly good night.\n\nThere is nothing much to be seen at night except shops ablaze with lights. They keep open till they are tired then they close. There seems to be no specified time for closing Sunday is just the same to them.\n\nIt takes nearly an hour to go into Cairo from Mena and I am not going in again until I really have to. That is at night. I will go in the day if possible so as I can have a look at the mosques & temples.\n\nI am going to climb up the Pyramids some time next week.\n","62":"\n\nVery clear & cold: natives worked well so I was finished early. I have to turn out again shortly though.\n\nChurch parade at 10 am. It is hard to realize that Xmas is so near. I dont suppose it will make any difference to us.\n\nThe 7th Battallion left for Cairo at 4 am on duty.\n\nAll guards are armed with ball cartridge after 10pm.\n\nI have finished this book but will continue my diary in another which I have bought in Cairo.\n\n"}}