{"Document Name":{"0":"Diary_0188","1":"Diary_0188","2":"Diary_0188","3":"Diary_0188","4":"Diary_0188","5":"Diary_0188","6":"Diary_0188","7":"Diary_0188","8":"Diary_0188","9":"Diary_0188","10":"Diary_0188","11":"Diary_0188","12":"Diary_0188","13":"Diary_0188","14":"Diary_0188","15":"Diary_0188","16":"Diary_0188","17":"Diary_0188","18":"Diary_0188","19":"Diary_0188","20":"Diary_0188","21":"Diary_0188","22":"Diary_0188","23":"Diary_0188","24":"Diary_0188","25":"Diary_0188","26":"Diary_0188","27":"Diary_0188","28":"Diary_0188","29":"Diary_0188","30":"Diary_0188","31":"Diary_0188","32":"Diary_0188","33":"Diary_0188","34":"Diary_0188","35":"Diary_0188","36":"Diary_0188","37":"Diary_0188","38":"Diary_0188","39":"Diary_0188","40":"Diary_0188","41":"Diary_0188","42":"Diary_0188","43":"Diary_0188","44":"Diary_0188","45":"Diary_0188","46":"Diary_0188","47":"Diary_0188","48":"Diary_0188","49":"Diary_0188","50":"Diary_0188","51":"Diary_0188","52":"Diary_0188","53":"Diary_0188","54":"Diary_0188","55":"Diary_0188","56":"Diary_0188","57":"Diary_0188","58":"Diary_0188","59":"Diary_0188","60":"Diary_0188","61":"Diary_0188","62":"Diary_0188","63":"Diary_0188","64":"Diary_0188","65":"Diary_0188","66":"Diary_0188","67":"Diary_0188","68":"Diary_0188","69":"Diary_0188","70":"Diary_0188","71":"Diary_0188","72":"Diary_0188","73":"Diary_0188","74":"Diary_0188","75":"Diary_0188","76":"Diary_0188","77":"Diary_0188","78":"Diary_0188","79":"Diary_0188","80":"Diary_0188","81":"Diary_0188","82":"Diary_0188","83":"Diary_0188","84":"Diary_0188","85":"Diary_0188","86":"Diary_0188","87":"Diary_0188","88":"Diary_0188","89":"Diary_0188","90":"Diary_0188","91":"Diary_0188","92":"Diary_0188","93":"Diary_0188","94":"Diary_0188","95":"Diary_0188","96":"Diary_0188","97":"Diary_0188","98":"Diary_0188","99":"Diary_0188","100":"Diary_0188","101":"Diary_0188","102":"Diary_0188","103":"Diary_0188","104":"Diary_0188","105":"Diary_0188","106":"Diary_0188","107":"Diary_0188","108":"Diary_0188","109":"Diary_0188","110":"Diary_0188","111":"Diary_0188","112":"Diary_0188","113":"Diary_0188","114":"Diary_0188","115":"Diary_0188","116":"Diary_0188","117":"Diary_0188","118":"Diary_0188","119":"Diary_0188","120":"Diary_0188","121":"Diary_0188","122":"Diary_0188","123":"Diary_0188","124":"Diary_0188","125":"Diary_0188","126":"Diary_0188","127":"Diary_0188","128":"Diary_0188","129":"Diary_0188","130":"Diary_0188","131":"Diary_0188","132":"Diary_0188","133":"Diary_0188","134":"Diary_0188","135":"Diary_0188","136":"Diary_0188","137":"Diary_0188","138":"Diary_0188","139":"Diary_0188","140":"Diary_0188","141":"Diary_0188","142":"Diary_0188","143":"Diary_0188","144":"Diary_0188","145":"Diary_0188","146":"Diary_0188","147":"Diary_0188","148":"Diary_0188","149":"Diary_0188","150":"Diary_0188","151":"Diary_0188","152":"Diary_0188","153":"Diary_0188","154":"Diary_0188","155":"Diary_0188","156":"Diary_0188","157":"Diary_0188","158":"Diary_0188","159":"Diary_0188","160":"Diary_0188","161":"Diary_0188","162":"Diary_0188","163":"Diary_0188","164":"Diary_0188","165":"Diary_0188","166":"Diary_0188","167":"Diary_0188","168":"Diary_0188","169":"Diary_0188","170":"Diary_0188","171":"Diary_0188","172":"Diary_0188","173":"Diary_0188","174":"Diary_0188","175":"Diary_0188","176":"Diary_0188","177":"Diary_0188","178":"Diary_0188","179":"Diary_0188","180":"Diary_0188","181":"Diary_0188","182":"Diary_0188","183":"Diary_0188","184":"Diary_0188","185":"Diary_0188","186":"Diary_0188","187":"Diary_0188","188":"Diary_0188","189":"Diary_0188","190":"Diary_0188","191":"Diary_0188","192":"Diary_0188","193":"Diary_0188","194":"Diary_0188","195":"Diary_0188","196":"Diary_0188","197":"Diary_0188","198":"Diary_0188","199":"Diary_0188","200":"Diary_0188","201":"Diary_0188","202":"Diary_0188","203":"Diary_0188","204":"Diary_0188","205":"Diary_0188","206":"Diary_0188","207":"Diary_0188","208":"Diary_0188","209":"Diary_0188"},"Date":{"0":"unknown","1":1144.0,"2":1150.0,"3":1153.0,"4":1158.0,"5":1160.0,"6":1161.0,"7":1162.0,"8":1163.0,"9":1166.0,"10":1167.0,"11":1169.0,"12":1170.0,"13":1172.0,"14":1174.0,"15":1178.0,"16":1181.0,"17":1183.0,"18":1184.0,"19":1187.0,"20":1189.0,"21":1191.0,"22":1192.0,"23":1193.0,"24":1194.0,"25":1205.0,"26":1206.0,"27":1207.0,"28":1209.0,"29":1212.0,"30":1216.0,"31":1217.0,"32":1218.0,"33":1219.0,"34":1220.0,"35":1221.0,"36":1222.0,"37":1223.0,"38":1230.0,"39":1231.0,"40":1232.0,"41":1233.0,"42":1234.0,"43":1243.0,"44":1244.0,"45":1259.0,"46":1265.0,"47":1266.0,"48":1267.0,"49":1268.0,"50":1269.0,"51":1270.0,"52":1271.0,"53":1272.0,"54":1273.0,"55":1274.0,"56":1280.0,"57":1284.0,"58":1286.0,"59":1292.0,"60":1294.0,"61":1305.0,"62":1306.0,"63":1307.0,"64":1309.0,"65":1310.0,"66":1312.0,"67":1316.0,"68":1317.0,"69":1320.0,"70":1322.0,"71":1324.0,"72":1328.0,"73":1331.0,"74":1333.0,"75":1334.0,"76":1335.0,"77":1338.0,"78":1341.0,"79":1345.0,"80":1347.0,"81":1348.0,"82":1349.0,"83":1350.0,"84":1351.0,"85":1352.0,"86":1353.0,"87":1354.0,"88":1355.0,"89":1356.0,"90":1357.0,"91":1358.0,"92":1359.0,"93":1360.0,"94":1361.0,"95":1362.0,"96":1363.0,"97":1366.0,"98":1367.0,"99":1368.0,"100":1369.0,"101":1371.0,"102":1373.0,"103":1374.0,"104":1375.0,"105":1376.0,"106":1377.0,"107":1378.0,"108":1379.0,"109":1380.0,"110":1381.0,"111":1382.0,"112":1384.0,"113":1385.0,"114":1386.0,"115":1387.0,"116":1388.0,"117":1389.0,"118":1390.0,"119":1391.0,"120":1392.0,"121":1393.0,"122":1395.0,"123":1396.0,"124":1397.0,"125":1398.0,"126":1399.0,"127":1400.0,"128":1401.0,"129":1402.0,"130":1403.0,"131":1404.0,"132":1405.0,"133":1406.0,"134":1407.0,"135":1408.0,"136":1409.0,"137":1410.0,"138":1411.0,"139":1412.0,"140":1413.0,"141":1414.0,"142":1415.0,"143":1416.0,"144":1417.0,"145":1418.0,"146":1419.0,"147":1420.0,"148":1421.0,"149":1422.0,"150":1423.0,"151":1424.0,"152":1425.0,"153":1428.0,"154":1429.0,"155":1430.0,"156":1431.0,"157":1432.0,"158":1433.0,"159":1434.0,"160":1435.0,"161":1436.0,"162":1437.0,"163":1438.0,"164":1439.0,"165":1441.0,"166":1442.0,"167":1443.0,"168":1444.0,"169":1445.0,"170":1446.0,"171":1447.0,"172":1448.0,"173":1449.0,"174":1450.0,"175":1451.0,"176":1452.0,"177":1453.0,"178":1454.0,"179":1455.0,"180":1457.0,"181":1459.0,"182":1460.0,"183":1461.0,"184":1462.0,"185":1463.0,"186":1464.0,"187":1465.0,"188":1466.0,"189":1467.0,"190":1468.0,"191":1469.0,"192":1470.0,"193":1471.0,"194":1472.0,"195":1473.0,"196":1474.0,"197":1475.0,"198":1476.0,"199":1478.0,"200":1479.0,"201":1480.0,"202":1481.0,"203":1482.0,"204":1483.0,"205":1484.0,"206":1485.0,"207":1486.0,"208":1487.0,"209":1490.0},"Entry":{"0":"\n","1":" fine day Tuesday same. Wednesday it snowed. Thursday fine, Friday Taubes come over nearly every night, it being moonlight & bomb & shell us. Have been doing sanitary fatigue for the last week. Had a bath today. Saturday fine, went to a concert tonight.","2":" Gas parade and pay. Monday Fine though dull, met Arthur Elliott Saturday. Tuesday sick parade, still fine.","3":" fine Taubes came over every night Thursday same, met Carl Hopkins tonight. Friday we marched out of Albert through Contalmaison to Martinpuich. Where we billeted in German Dugouts, the one where we are in is a tremendous size. Dozens of small rooms in it, the main passages go in for about 40 yards or so. Though the village is terribly knocked about the dugouts are in good condition, though those dugouts which are not\n\nReceiving any attention are slowly falling to pieces. There is a Tank about ½ a mile away, abandoned. Saturday fine a few big shells came over, Taubes also, Sunday misty, heavy frost , heaviest yet, it looks pretty on the battered trees. There is a tree observation post outside the dug-out (old one) on night duty tonight, pushing trucks, wounded men on board, which run on light railway lines, from A.D.S. to \"Villa\" Station about 2 miles, we were lucky in getting pulled nearly the whole distance by the motor which uses the line.\n\nDuty from 7PM to 7AM ","4":" fine. Tuesday we left Martinpuich at 5.30 AM for A.D.Post, exposed position about 2 miles away, we have to carry during the night, nothing doing to night.","5":" still fine, snow is disappearing slowly. The dug out we are in is a good one fair size. Thursday 15 fine still quiet, no call for my squad last night, this last week we have been on shorter rations 1 loaf \n\nto four men for day. I was on water fatigue this morning before it got light. & on ration fatigue tonight, Taubes were busy this morning with machine guns. \n","6":" raining (light) as soon as it was dark we (7) went to relieve a squad at the Batts post, 5 in the squad & a Acting Cpl. & a Sergeant went with us as guides, but we lost our way, we had about a mile to go, The Infantry were changing over & Fritz was a bit jumpy, machine gun bullets kept whizzing by & two shells lobbed very close to us, we had to pick our way between the flares & having to repeatedly take cover in shell holes we had a rough passage & then we had a carry as soon as we got here, it being the first stretcher case for 6 days, though the going was heavy, Fritz left us alone. also on our return journey. The front line is two hundred yards away\n","7":" I was nearly sniped outside the dug-out. Relieved about 6.30 PM Fritz was quiet. Monday 19\n\nwe were relieved by","8":" & we all left the A.D.P. (Quarry Post) and went back to Headquarters (Martinpuich Wood) it was raining (L) about 5.30. I was on duty pushing the trollies tonight, it is very foggy.","9":" laid in bed all day (nothing unusual)","10":" dull. Thursday dull & foggy on night trollies. \n","11":" dull we were relieved by the","12":" at 4.45 PM & we marched to Albert about 5 mile, to our old camp at the old Hospital. Saturday sun came out for a little while. Sunday we marched to C.R.S. at Becordal. I was on stretcher bearing from the train to our receiving point, relieved at 8 PM.","13":" fine, also yesterday. We motored to Contalmaison about 3 miles at 12 noon, rumours are current that Fritz is retreating & then we marched to (Head Quart.) at Martinpuich. I was detailed with some others to go to the Quarry Post. Things are very willing plenty of carrying. Tuesday cloudy but fine, fairly quiet. \n","14":" Cloudy quiet","15":" fine, two squads & I went to the \"Butte\". Fritz is shelling us a bit he has gone back 2 miles. Friday easy day fine relieved tonight, we went back the Quarry Post. Saturday cloudy easy day","16":" fine, cold wind, frosty this morning the mud was fairly hard Monday snowing a bit very early this morning came out fine late afternoon, lovely night, moonlight, Taubes about.","17":" dull, on ration fatigue tonight.\n","18":" went up to Post about 1 mile or so the other side of the Butte (lately evacuated by Fritz) dull but came up a cold wind about mid day, easy times. Thursday we came back to the Butte Post, easy times, it snowed & was still windy. Friday not quite so cold, back to the Quarry Post (1 mile) bombardment tonight (I think a hop over.)","19":" sent up to Post dull and muggy, it rained a little. Sunday came back to Butte Post, fine though heavy clouds about, several\n\nplanes, both sides, were bought down ","20":" came back to Quarry Post rained a bit, had to back to big dugout (Headquarters) at dusk. Tuesday raining a bit on duty bearing.","21":" still bearing and still showery. Thursday rainy looking and cold wind, fine this afternoon, easy day.\n","22":" had a narrow escape last night shell burst 4 to 5 yards away & out of about 20 of us only one hit, another chap and I were hit by splinters. I was hit in 4 places just drawing blood on my leg. Foggy & Frosty today still day bearing fine this afternoon. Saturday on trolleys, received parcel we left big dug out at 7 PM & went with my squad to Le Sars via William Alley fine today.\n","23":" fine. Bapaume evacuated by Germans, road being repaired, heavy traffic on it, we have nothing to do & had great fun watching traffic go by, there is a Tank here. Monday cold wind nothing to do George and I walked into Bapaume about 4 miles, 3 mines have been laid in middle of road, but new road soon made. Bapaume is in ruins traffic on road still heavy. Tuesday 20 cold wind & rain. We set out for Bapaume at 10.30 AM but after going two miles, we \n\nturned back (O.C.orders (6th)) We set out again at 2.30 PM & arrived at Bap. about 4 PM. We running with the 6th a D.S. pretty busy. Sleeping in tents on muddy ground. Wednesday 21st March cold trying to snow, on bearing duty. We go for walks in Bapaume. Thursday showery sun warm & then heavy falls of snowy hailstones which melt on reaching the ground.\n\nFriday warm sun but windy. Saturday 24th warm but windy, \nwhere exposed\n we went through the Cemetery the Germans have buried their dead in it, also the French & British who died after capture, it is a nice little cemetery. We are still \"bearing\". Fritz has wantonly destroyed everything he could lay hands on, cut fruit trees down also other trees all left lying about, he left nothing practically of value. I went to see the Catherdral (in ruins) in the basement are hundreds of skulls (old) Fritz had ransacked the whole building. Sunday lovely and warm still bearing , but we have had nothing to do this last few days so we went for a walk. Made\n\nstew for supper, carrots & garlic growing in an old garden, it was very good, with bully & Pork & beans. Snowdrops are heavy in flower. Monday 26th March, stunt on, we are very busy, about 200 Fritz captured we captured a village. Bapaume Town hall & 7th Brigade H.Q. were blown up last night & this morning 9 men rescued from Town hall, which was levelled to the ground & debris in parts about 8 feet on the road, take a week to clear away. The Town Major & a company of Infantry had only left the building that day, the killed is unknown but not many. The 7th H.Q. was a dugout so not much can be seen, not many in it. \"Our\" dugs outs are out of bounds everyone sleeps in tents. It is raining pretty heavy today. \n\nAbout 9.30PM we were roused up to fall in & move up the line. we marched about 5 miles & took over a post at some dugout in the side of the road, which all the way from Bapaume is in good order, the other side of Bapaume also except in 3 places (mines) & two traps (trenches) there is a mine crater about 200 yards from our post, in the middle of the road, it is clearing up tonight, we are dog tired. Tuesday too tired for break\n\nfast, but got up for \nbreakfast\n dinner it is a little showery this morning (snowy hailstones) we were relieved by the 13th F.A. at about 4 PM we marched back ¼ mile to Caux where our H.Q. were, we all marched back to Bapaume (a party of 6th &","24":" F.A. we put in the night there. \n","25":" we (5th,6th &","26":" Field Ambulances marched out at 10.30 for Bazentin Le Petit about 7 miles or so, where we put in the night. Thursday we marched about 10.30 AM for Becordal about 5 miles, it rained very hard on the way.","27":" Fred Little, Macaulliffe & I we detailed to guard stores at Aveluy about 1½ miles the other side of Albert. we went by motor. We are camped in a marquee, close to the river, can draw on certain parts of stores (food) the chaps who we relieved left eggs & other stuff and so we are living like Lords, spring mattresses to sleep & every convenience we are short of a few food necessities. Saturday I made a sago pudding it was alright, showery today, having great times. A couple of weeks back when\n\nup the \"line\" the Prince Frederick Charles of Prussia, passed through our hands as a wounded prisoner.","28":" showery still enjoying ourselves, get up when we like etc. I made a treacle tart but the oven wasn’t too good, so Mac & Fred put the tart on top of the stove & it soon started to boil (we had no flour so I used Benges food) my tart was having a rough time, but later the stove (oven) went better so it eventually got baked, but it wasn’t bad. Monday very windy some of the tents are down, we got our new pay books today. Tuesday pay day fine but windy having great times","29":" raining & heavy fall of snow. Thursday fine & windy Friday heavy fall of snow. Saturday fine & windy in for rations. Sunday lovely day, a bit off color, we are laying in the sun. We only have two meals now, as we don`t get up till 10.30AM. the place nearly caught fire today. We are always making puddings, tarts or some thing or other. Monday (Easter)","30":" \n\nraining (showery) in the morning but windy & fine afternoon Tuesday snowing, windy. \n","31":" Fred & I went to Becordal for Rations, fine morning but drizzling afternoon. Thursday Windy & rain \n","32":" rainy looking, I went into Albert for the paper (1½ miles away)","33":" cold & windy a little snow. Sunday fine morning. Fred & I went for rations (Becordal) & found that all the unit had gone up the line & left no word about our rations, the same with another party of the","34":" who are at Senlis. The","35":" Field Amb. Had taken over from our unit 3 days ago, but they gave us some rations to go on with till we could make other arrangements. Rainy tonight very hard. Monday rain & wind, we seen the Town Major about the rations & he said he would ration us till things righted themselves. Tuesday drizzling I went to Albert for the paper, then seen Arthur Davies of the","36":" Field Amb. & asked him could we get put on their ration strength & he fixed things up for us right away. so we let the town Major slide. Cpl & Fred went for a night out tonight away all night\n","37":" Mac & Fred came back at 10 AM. The French are attacking on a big front (Rheims & Soissons) Drizzling but warmer Mac and Fred are out again tonight Thursday Friday lovely day, went to Albert for the paper & then went for rations, Saturday fine but windy.","38":" fine but windy went for rations. Monday lovely day, we are sitting in deck chairs in the Sun.","39":" lovely day, in for paper & rations, under orders to leave for the line. Wednesday up early to move off. We walked to just the other side of Pozieres (about 1 ½ miles or so) There is a memorial there to the","40":" Division &","41":" Battalion A.I.F. & a mile beyond is several tanks, some badly knocked about. We got a lift into Bapaume (about 7 miles) and then walked out to our C.Section headquarters about a mile or so out at Favreux. I received 17 letters on my arrival.\n\nFront quiet.","42":" dull & cold wind like yesterday. \n\nAeroplane doing some clever manouvers & tricks. We are playing football this morning, two matches were played near us yesterday Friday dull and cold wind. Aeroplanes doing tricks, played cricket. Fritz is putting a few over, a lot of them \"duds\" no damage. I was on Gas picket last night 2 hours on. Mail day 5 letters for me. Under orders to move \"up\" left at dusk & reported at Headquarters (about 1 ½ miles or so further up. Saturday 28 up at 4.30 AM moved out with A & B sections to the outskirts of Norieul, but had to turn back (Fred, Mac, and I) and report to D.S. about ½ mile outside Vaulx. Fritz is putting some over. On gas & wagon leading tonight. Sunday lovely day real hot in the sun. Gas & wagon duty to night. Monday lovely day on Gas and guard (all night shifts) Tuesday lovely day went for a walk to Longatte about 1¼ away. Left the loading post for a Reg.Aid. Post about ½ mile in front of Noreuile, through which we passed at 8 PM. At 11.30 PM Our chaps blew up a lot of Fritz’s wire by some mining process. We had to sleep under the stars in the sap (trench) We have great observation. we can see for miles behind Fritz’s lines. Wednesday relieved at 7.30 AM we went back to the loading post outside Vaulx. & then\n\non to Headquarters ½ mile the otherside of vaulx. \n\nWe were giving the opportunity of voting, but a lot of us didn’t as we were fed with tales of the Min party (Nationalists) and heard nothing of the other side of the \"House\". We marched out at 6.30 PM to go up the line for the Stunt, carried blankets & stretchers right up to the front line (about 1 miles in front of Novieul) arrived there safely. I went to sleep for a while, Fritz must have taken a tumble, he put a barrage over with gas shells and H.E.s he nearly got me with his gas as I was asleep. He kept it up for about ½ hour & about ½ hour after that (4 AM) we opened up. the fighting was terrible, we wasn’t too successful & suffered heavily. Fritz got a shell in a bomb dump just outside Noreiul killed 5. Thursday several bits hit me (spent) until about 8 AM when I was blown up, picked up unconscious, came to, was carried through Noureil to the loading post & driven in F. Ambulance to our H.Q’s. was dressed & put in a Motor (Bus) & driven to C.C.S. am sick as a dog over the Gas and can’t eat, spent the night there.","43":" sick & weak they made me a stretcher case. I had breakfast. they entrained (Hospital) me at about 4 PM & arrived at Rouen at about 8AM Saturday no food given to me only milk, tea, beef tea.\n","44":" under Xrays, raining a little Monday operated on, very successful a small piece taken out of my head, not feed till about the following Saturday, just on liquid diet, the weather up to","45":" was showery, have been feeling on & off. Monday Holy Communion, showery looking, rained very hard this afternoon. Australian Red cross Lady visited us, asked if we wanted anything. Padres come every day & are very nice. Salvation Army Ladies also visit us & give us oranges or choc. too much cannot be said of the kindness of our Sisters. I have had some bad headaches. Fine weather up to","46":" am expecting my Blighty tickets anyday. Doctors are very clever & jolly with us.","47":" thunderstorms after a sultry noon. \n","48":" Holy Communion, dull & rainy looking.Tuesday","49":" rainy looking, I am feeling well. I received my Blighty transfer papers late yesterday afternoon my injury is compound fracture of skull (severe) and something about concussion of brain. I tried to get out of bed on the quiet one afternoon about 5 days ago, while the\n\nSisters were out of the ward, but I was surprised as I collapsed being too weak in the legs and my head went round.","50":" and","51":" fine day (Thursday).","52":" lovely day & went out in the sun, carried out on the bed. Zeppelin over last night. Received my Field Medical card to take to my destination. \n","53":" fine, was evacuated at 1.30PM in Motor Amb. through Rouen to river & was put on board Hospital ship. The run through Rouen was lovely the avenue of trees along the road was at its best. Rouen looked a nice city and the cathedral magnificent. The boat is not marked as a Hospital ship, but fitted out as one. Her weight would be about 3000 tons her name is Western Australia. The river is narrow, we sailed about 3PM. I was sorry I missed seeing the trip, as I could only catch glimpses of the scenery, as I am one of the special cases in bed We are arrived Havre just before sunset about 9PM I couldn’t see anything portholes closed.\n","54":" we travelled very fast during the night & arrived at Southampton about 10AM where the Australians were separated from the Tommies & sent in Hospital trains we to Waterloo station. We \n\nhad dinner (Soup) on board train. We arrived at Waterloo at about 1.30PM & was put in Ambula. given tea & biscuit then driven with lady attendant through London to Richmond. It was a lovely trip Hyde Park looked very well, as well as Hammersmith bridge. The residences in the suburbs were very pretty with their gardens. Pink May, Pink and White Chestnuts were a blaze of blossoms. Arrived at Richmond at 3 PM. put in E ward & not allowed to sit up. The Hospital is a lovely place nice ground etc. Nearly all E wards patients are able to get up, they do all the orderlies work they being Tommies & Australians.\n\nThe staff are Australians, the sisters are different to the English Sisters at Rouen they appear to have different ways, a couple of these Aust. Sisters are hard cases.","55":" lovely day, plenty of food barring dinner time when I didn’t have near enough. Tuesday dull morning clear afternoon. Wednesday fine. Thursday fine. News of Battle of Messines Ridge. Friday fine Saturday fine.","56":" about a dozen little girls visited us under a Lady & a Padre & sang hyms. Monday fine. Tuesday fine, had a bath & my toe\n\nnails cut for me. A bed accident yesterday caused a joke. Wednesday fine, put out in the Sun. German Aeroplane raid today, a lot of damage done to East London & 97 killed 437 wounded.","57":" fine. Red Cross Lady came & gave ma all toilet requisites (razer etc.) Friday lovely day. Aunt Nell & Doris paid me a surprise visit & brought me 1 Doz. eggs, a bag of tomatoes & two bags or oranges also a tin of lollies. They were very nice to me.","58":" fine hot as usual, in the afternoon a very heavy thunderstorm broke out, while we were being entertained by seven ladies as Pirrotts it was very good. It gave me a headache which lasted till next day. Sunday, hot plenty of visitors here. Monday hot, thunderstorms. Tuesday , Wednesday, Thursday fine I received 22 letters today.","59":" fine Saturday received cables from Home, fine, had strawberries for tea with milk. Red Cross Lady gave us tobacco or lollies. \n","60":" fine \n\nplenty of visitors here, it made us Australians feel very lonely, I was allowed out of bed for a little while after tea. Monday fine, up again & a little longer. Tuesday fine, out of bed all the afternoon. Wednesday fine still out of bed, had a bath today. Thursday 28 fine, out of bed again, but took bad & was sent to bed. Friday raining, my temperature & pulse rather high, not allowed out of bed. Saturday drizzling feel real bad, temperature higher still. Sunday feel a bit better, though temperature still high. Fine day. Monday feel better.","61":" raining feel better. Wednesday raining, visitors here, not feeling too good.","62":" fine, feel better.","63":" fine. feel alright. Saturday raining got up today.","64":" raining , seen doctor about ears, had them syringed a lot of visitors here, I was introduced to some & quite enjoyed the afternoon\n","65":" raining, don’t feel too good under orders to go to Dartford. Tuesday 10 fine, feel alright. Left Richmond at 1 PM went to Richmond Station entrained for Charing Cross, changed trains & & took the Dartford train. I feel a bit groggy through walking. We arrived at Orchard convalescent Hospital at about 4 PM & was allotted to our Huts & were given tea.","66":" fine. I was sent to A40 Ward about my ears. Thursday fine, went for a walk to the Embankment, am being treated for my ears but I haven’t much confidence in them doing me any good. Friday fine, went for a walk to Dartford about 12 miles away, nothing of any interest in the town. Saturday fine, having a good time here.","67":" fine went to Church in one of the huts. Another chap & I go to the town every afternoon after tea.\n","68":" fine Tuesday raining. Wednesday planned to go to Bexley Heath but it was too wet. Red Cross chap shouted \n\nus to afternoon tea.","69":" wet. The bridge in the town is called Anzac Bridge because every afternoon it is never known to be without Australian soldiers sitting on it. Friday fine, went down town.","70":" Crayford Carnivol procession passed through Dartford, it was a very good turn-out, some very good characters. Mate & I went to Bexley Heath 3 miles nearer London (Crayford is 1 mile nearer London) Bexley Heath is a very select place quite a contrast to Dartford, we spent a good afternoon there. Sunday fine. H.Little (Fred’s brother) and his young lady came to see me today & I was very pleased to see them.","71":" fine went down Dartford as usual. Tuesday fine also Wednesday Thursday &","72":" went to Dford Saturday mate & I went to Woolwich, it is a fair sized town & very nice. We had a good time there. We left Hospital 1.30 PM & returned at 9.30 PM. Sunday \nfine\n wet \n\nwent to Church.","73":" raining, Tuesday headache","74":" one at Dartford) Mrs Holman visited us. We were paid today. Mail day yesterday. Wednesday raining hard feeling a little better.","75":" raining hard, feeling alright now. ","76":" raining hard Saturday rain easing off a little. Sunday fine though rainy at times. Headache.","77":" fine, headache. Tuesday fine, very heavy storm in evening. Wednesday fine, though rainy looking.\n","78":" Medical examination & a lot of chaps were evacuated. I have to have electrical treatment for (rumbling vibrations) in body & limbs also numbness of hands. Fine today. Friday fine, put in for London pass & received it for tomorrow, had my electric treatment which lasts for 5 days then I report progress. Saturday had treatment & then caught 10.43 train to London Bridge Station (about 20 miles) \n\nI had a snak in the soldiers buffet at the station & then went to the Tower where I spent a couple of very interesting hours. It is hard to specially mention any particular place. \n\nI then went to the \"The Bank\" to catch Richmond Bus (33) but was a bit off my track, but told by Policeman to take Hammersmith (9) & then change, which I did, but I had to change again at Richmond to go to Kew Gardens (27) where I found I was very short of time as I had to be back at 9PM to Dartford. I spent nearly all my time in the hot houses which were very good. A very good show of Antimnes (white, blood, velvety red, white marked heliotropes, & every shade of purple. A few orchids, fair carnations (a few) good, Date plum & oranges have a little fruit. A small but good show of Liliums (Golden Ray etc.) Ferns very good. Fushias good. The ground cannot be looked after properly as labor is scarce, a few stocks but very poor\n\nRoses are done, but no doubt were good, taken alround the visit was a great success & I intend going there again I will put the best part of a day there. Had tea at Hammersmith (fish 3 slices of bread & tea 6½d) was very amused at the odd halfpenny. I went from Hammersmith to Mansion House station & had a short walk & then went to London Bridge station & caught train back to Dartford. I arrived \"home\" at 8.15 tired but happy. Sunday fine, air raid late this afternoon at Southend.","79":" fine. headache. Tuesday fine, headache, marked for Weymouth & Board. \n","80":" fine, head still aches.\n","81":" fine, headache. \n","82":" fine, head still bad.\n\nSaturday I left Hospital at 8AM for London, it teemed with rain as the train was approaching London.I went to the Canadian War pictures at Grafton Galleries (soldiers half \n\nprice 6d). The pictures were very good though there wasn’t too many of them, it takes about ¾ of an hour to see them. I then walked round the City & had dinner at Peel House","83":" which was very good. Then I went to Hampstead Heath which is a very pretty place & a great view can be obtained on all sides, from the vicinity of Jack Straw’s Castle, there wasn’t very many people there. I had tea at the Heath & then went to Charing Cross then by ‘bus to London Bridge thence Dartford, I arrived back by 8.30 PM. after a good day. \n","84":" fine, went to church in the Hospital.\n","85":" fine, we (Weymouth party) fell in at 9.30 & marched to Dartford Station travelled to Waterloo Junct then we went to the buffet before proceeding to Waterloo Station, where we caught a through train to Bournemouth Central where we had to change. The trip down was fine, passing through fine country\n\nThe heather (purple) looked very pretty on the moors. We didn’t see much of Southampton as we passed through. We entrained into a slow train for Weymouth where we arrived about 5PM, we passed through the town on the way to Hospital (the place is alive with Australians) in Motor Ambulances. We had tea & had to parade at 7.45 PM. \n","86":" August, parade 6.45 AM then 8.30 we were classified as to what service we were capable of doing. I was classed C2 which means Australia & possibly home service. I then had to go before the M.O. to have my board papers made out.\n","87":" fine, mess orderly today. \n","88":" fine, went to Weyouth this afternoon & seen M.O. today. \n","89":" fine, went to backsheesh Dramatic show on the Pier, not bad. \n","90":" fine went to backsheesh picture show last night & tonight, I am picking up papers now. \n","91":" showery, picking up papers had sing-song in Y.M.C.A. \n","92":" raining hard still picking up papers. Concert tonight. Tuesday raining hard, on the papers lecture in the Y.M.C.A. tonight. \n","93":" clearing up for a good afternoon, sing-Song in Y.M.C.A. \n","94":" wet day, had 2 Bobs tournament in the Y.M.C.A. I was beaten in my heat by 4 (150 up) Prizes were 5\/-, 3\/-, & 2\/-. \n","95":" lovely day, still picking up papers. Cinema in the Y.M.C.A. tonight, they are \"rough\" as the machine or the operator is a \"dud\" \n","96":" Sept .1st bad morning but good afternoon went down Weymouth then to Y.M.C.A. cinema.\n\nSunday lovely day, church parade, Result of the board (Medical) came out last night, the Board (final) was held last Thursday, I seem to be alright for Australia, Australian Mail on Friday & Saturday.\n","97":" I was taken off the \n\nC2 roll & put on C1., which means home service, either in England or Australia. On guard today 4.30PM till 4.30PM. It is \"Keystone\" handling a rifle when I have never done so before. Lovely day today.\n","98":" lovely day guard duty is no bon. I put in for furlough Wednesday unsettled weather, done up last night after guard duty, doing casual fatigues today. It rained tonight & ten \ncollasped\n collapsed. \n","99":" Sept.6th on cooks fatigue solid work 6.15 AM till 3PM dreary weather, Good lecture at the Y.M.C.A. entitled \"The Tabby on the rocks\". \n","100":" fine, I volunteered as Mess orderly it may effect me going Home.","101":" fine, put in for furlough. \n\nThe orderly job is a good job in the receiving huts, fresh men come in every night, bar Sunday, pictures at Y.M.C.A. Sunday raining a little, met Arthur D’Arcy yesterday & went to town with \n\nhim tonight. I met Joe Palk today \n","102":" fine, lovely afternoon went to town with Joe.\n","103":" Changeable weather fixing up about furlough, was paid. head bad tonight, no arrivals tonight. \n","104":" lovely day, we left camp at 8.45AM for our furlough, caught 10 AM train to Waterloo arrived there about 3 PM then marched to Horseferry Rd & received our ration allowance (4\/- a day). \n\nWe were very disappointed at Weymouth as we put in for our 14 days furlough but was only granted 6 days, we may later on be granted the balance. \n\nAfter being paid at Horseferry Rd, I went to tea at the Y.M.C.A. (Victoria) & then to Victoria Station where I caught the 4.30 PM to Brighton, I then caught the Worthing train arriving there at 6.30PM. I went to Aunt Louie’s, had tea & went for a walk with Uncle Will. I met Cousins Lily & Ada\n","105":" lovely day, went for a stroll, I received some Ausie letters last night. Friday fine day, went for walk, head still bad, ever since I left Weymouth.\n","106":" Ada & Lily went Home, fine day \n","107":" fine, all the family went for a walk after tea, round to Lancing where I seen Thomas A’ Becketts place, I went to Aunt Sally’s in the morning & met Mr Pelley I also met some Cousins name \nd of","108":" as ours. \n","109":" changeable weather. I received my photo proofs, they are not bad, I went & bought the girls some presents. I met Mr Chipper an old friend of Dad’s last night. \n","110":" raining, getting ready to go back to Weymouth, have been receiving the best of treatment here, I caught the 5 to 3 train to Victoria, had tea at the Y.M.C.A. caught a bus to Waterloo and had to wait an hour or so for the 7 PM train to Weymouth, arrived there about 12 PM. I found an \n\nempty bed had a fair night. \n","111":" raining, having a holiday today, went for a walk after tea. Thursday dull though broken weather, went for a walk after tea. I am \nbeing taken\n wanted as I hear I am on the list of men to go to Codford, as this camp is overcrowded & it is to wet in the tents & they are being done away with. A corporal came & warned me at 10.PM to have breakfast 6.45, put kit bag near Garage at 7 AM then fall in at 7.15. \n","112":" Lovely day fell in at 7.15AM were given our dinner (1 tin of Paste and two slices of bread & butter) We were kept waiting as usual, then we marched down to Weymouth station and was halted in the road. I was standing outside a hotel & all the Boys around about was given a cup of tea by the hotel people, they were very nice. The train started about 9.30AM & after stopping at a few places we arrived at Codford at 10 to 12, was met by the Depot band and was played\n\nto the Camp, it looks pretty good. Interned German civilians are employed here at 7d per hour doing painting & odd jobs, some receive 9d. All men wear armlets here Purple on the staff, Blue A class Green Yellow unclassified Red C classes.\n","113":" fine, though chaps who came when I did had to go before the S.M.O. (Major) a lot of our papers failed to come, mine amongst them, expect they will be sent for then we will see the S.M.O. but it is only a farce. \n","114":" church parade, went for a walk.\n","115":" Lovely day, All C class men (1,2,3) & B.2.B. men are taken for a walk, both morning & afternoon when they are not wanted, we only go a couple of hundred yards & lay down. It is a real farce. Went for a walk tonight.","116":" dull morning but clearing away; went for a walk after tea & enjoyed it.\n","117":" raining, the chaps whose papers came with them were given there bands (red) mail came today.\n","118":" fine day, boat roll came out. I was in a physical jerk squad this morning, but this afternoon we were all taken up the lane, went for a walk.","119":" dull threatening to rain pay day, went for a walk after tea, was reclassified this morning, still C1.\n","120":" lovely day went to see two N.Z. football teams play, good game. Walk. \n","121":" lovely day, church parade. Walk \n","122":" very foggy but lovely afternoon, still taken for walks up the lane. \n","123":" very foggy, good afternoon.\n","124":" fine, though changeable, nearly every evening a lot (sometimes about 3 cases) of apples are put at the gate of a big house in the village, for the soldiers to take, usually they are no good, but\n\n tonight they were not too bad, mail day. \n","125":" raining hard, fine afternoon head bad today, went on special sick parade, more mail. For want of something to do, the Military have nailed wire netting over one of the doorways of the hut, thus only allowing us the use of one door. \n","126":" cold showery weather still have bad head, more mail today. \n","127":" October, cold showery weather went to football match (Rugby) N.Z. v Canada, N.Z.won easily, Canadians didn’t know much about the game. \n","128":" cold showery weather, church parade.\n","129":" dull cold day, we are still taken for our morning & afternoon walks. \n","130":" Oct, cold & miserable, better in afternoon, came on to rain at dusk. \n","131":" same weather as yesterday, was put on a boat roll this morning & issued with more clothing. \n","132":" Oct, cold, frosty morning. \n\nI have to report at 8.15 AM ready to march out to the orderly room. \n\nWe left camp at 9.45 AM, we marched behind a draft going to France, the band played us down to the station. We had to wait some time on the station, the band played tunes & when the train left the station the band played Auld Lang Syne, such a send off for such a small party only 36 of us. It was 10.45 AM when we left Codford, had nearly an hour to wait at Westbury where we changed trains. We are arrived at Weymouth about 2.45PM & marched to Westham Camp (about 1 mile) had tea, then I went into the town to do some business. Though lovely mornng it was raining a little here.\n","133":" dull & threatening looking. I left with a party for Little Moor Camp about 4.15 PM, it is about 3 miles outside \n\nWeymouth, it has only just been taken over from the Tommies, not bad place.\n","134":" threatening rain, went before the M.O. this morning, on fatigue this afternoon filling mattresses with straw.I went to Weymouth after tea across country over swampy land, seen Mr. Antill & received some money off him from Bessie.\n","135":" church parade, lovely morning. Before we marched out from Westham on Friday afternoon the wind blew the hat off one of our L. Corporals right under a road steam roller it was squashed. George & I went to Upwey Wishing Well it is nothing much the approach to it is disgraceful, all muddy. The villages round about are very unique & pretty, I thoroughly enjoyed the walk about 2 miles each way. We went before tea.\n","136":" lovely day, boat roll today. We have nothing to do all day though we are liable to, went to Weymouth after tea. \n","137":" wet day, pay day, I went to the \n\ncamp (free) pictures tonight, not bad,\n","138":" fine but prospects of rain, was put on R. Boat Roll (Supplementary) & warned not to leave camp, an hour later a couple of dozen were told they were on the roll & the rest practically struck off. All those struck off came from Codford with me. We are very unfortunate alway being messed about. Concert tonight. \n","139":" fine, was on butcher’s fatigue yesterday afternoon cutting up meat for the stew. K boat roll went today, the seat collapsed from under me & made my headache again.\n","140":" fine, on sick parade. M.O. wanted me to go to Hospital, but as it would affect my going Home I refused, he put me on no duty for 3 days.\n","141":" still have headache fine though at times look like rain, boat roll in but hasn’t been called\n","142":" cloudy but lovely afternoon church parade this morning. I went for a walk after tea.\n\nMonday Lovely day, put on guard but as I didnt know \nwhat\n the drill I was taken off & put on mess orderly for the guard, went to the pictures in the camp they were good.\n","143":" rain last night, off duty today, fine today Gen. Haig made his","144":" attack in Flanders, pictures again tonight (Apples).\n","145":" cold showery weather, rumours are about regarding Q boat roll, we got some Apples tonight in an orchard, not feeling too good tonight.\n","146":" cold showery weather, was called out with nearly all the Codford lot & told us to hold ourselves ready to go to Salisbury any minute for permanent work, but was told that any man could stay here if he volunteered for permanent guard, a few did, but I didn’t. I went to Weymouth tonight and took Mr Antill his parcel as all my hopes of \n\nreturning to Australia were shattered. \n","147":" weather, but turned out better at mid-day, we were warned this morning that we were to have a kit inspection prior to going to Salisbury, an hour later runners were sent out telling us that the Salisbury affair was cancelled rumours that we are all on Q boat.\n","148":" Lovely day on cooks fatigue, \"Snowy\" & I went to Weymouth in afternoon a small whale was stranded in low water on the beach, was roped by fisherman & was towed away, it was exhausted, had tea, waited nearly an hour for it then went to the pictures (Vaudeville) walked home lovely night. Heavy frost this morning & yesterday.\n","149":" lovely day, church parade, went for a walk to Upwey Wishing Well, after tea went for a long walk with \"Snowy\".\n","150":" very cold showery weather, O and P boat being fixed up, got some apples tonight \n","151":" lovely day, was paid, got some apples went to the pictures, rainy looking afternoon\n","152":" Oct, raining. O boat went this morning, concert tonight, I have to take seats over there. (Hall)\n\nThursday raining P boat went this morning. Q boat called out this afternoon, I am on it. I went to Weymouth & bought some presents to take home, it was funny at times, sent parcel to Fred. Seen Mr Antill\n\nFriday warned to leave Saturday morning & then everything cancelled, very rainy looking but keeping off.\n","153":" warned to leave at 8.15PM busy getting everything ready, threatening to rain. not leaving now, the boat is cancelled again.\n","154":" rainy looking but cleared up after dinner, went for a walk, fell in 4.30PM & had to fall in 9.30PM to move off. Had to wait about 2 hours, being issued with biscuits roll call etc. Marched to Upwey waited an hour entrained about 1PM, Red Cross chap gave us lollies & smokes. \n","155":" arrived at Plymouth about 5.30AM & the train waited about ¾ hour & then \n\nwas shunted down the Docks, the Dockyard was interesting, torpedo sheds etc. embarked about 8AM, had tea to drink, a light dinner but good tea & plenty of it, Lovely day. \n\nWe left the wharf in afternoon & anchored in the Sound.\n","156":" showery, good food, there are two other troop transports & 3 bigger transports.\n","157":" showery good food.\n","158":" threatening weather we left Plymouth at 10AM, there were 8 ships in the convoy, 3 with Aust, 2 Niggers (Africans) a Yankee patrol boat, a French steamer & a Auxiliary cruiser, also an escort of 7 destroyers, made slow progress passing Eddystone Lighthouse, running into bad weather.\n","159":" threatening weather, choppy sea head on, a good number are sick. Our boat is named \"Themistocles\". Rough sea tonight.\n","160":" calming down a little, was put on Submarine guard this afternoon, served with Ball cartridges.\n","161":" very calm, church parade, cloudy morning but turned out sunny after dinner, On the permanent submarine guard 6AM till 3PM next day 3PM till 6Pm, no night guard.\n","162":" fine day, calm, doing 3 guard shifts issued with a Red Cross parcel of clothing, 2 suits of pyjamas, 1 singlet, underpants, 1 shirt, 2 pairs of socks, 8 handkerchiefs, 1 towel & a pair of shoes.\n","163":" fine & calm day, getting quite warm now, only one shift of guard today 5PM to 6PM.\n","164":" fine, getting very warm, still on guard. Thursday same, but a concert given.\n","165":" hot day, raining a little tonight\n","166":" hot day, sports held on deck, a couple of whales were seen\n","167":" church parade hot day \n","168":" Hot day, still on Sub. Guard.\n","169":" Hot day, very close down stairs, nice breeze on deck of a night.\n","170":" sighted land breakfast time and ran into the Bay at \n\nFreetown (Sierra Leone) at 9AM, It looks very inviting on shore, thick tropical growth, the natives are a fine built lot & very good natured. The Bay is full of shipping, 3 other transports. We were not allowed ashore. Fruit was bought by the canteen. The town is built at the foot of a mountain range, it is a fair size though straggling. Tonight a chap went swimming over the side and was carried out by the current, it is a very strong one, (about 5 knots an hour) he was picked up by natives & taken to another ship. Another chap was sitting on the potato pack when it collapsed he had about 3 bags on him, but not injured.\n","171":" The officers gave orders to throw potato’s at the natives fruit sellers to hunt them away from the ship & then the M.P. Sergeant flourished a revolver at them they are not a nuisance. We left at 12 noon. The Auxiliary cruiser stayed behind but an armored Cruiser escorted us with the other 3 transports making 8 transports\n\naltogether, it is very calm. We mounted guard at 12 noon, it being disbanded when we arrived in port.\n","172":" a bit cooler, after the guard started today it was dismissed for good. Head bad today.\n","173":" warm day.\n","174":" raining. Church parade, windy night.\n","175":" threatening rain, though calm sea \n","176":" same weather, forced to sleep below. \n","177":" weather concert today. \n","178":" same weather. The final of games Draughts, Dominoes, Whist, Euchre & Chess to be played today. The fresh water supply on board is excellent, it is always turned on & the boys are enclined to waste it.\n","179":" weather a little better, was put on guard over a civilian who is insane, he lives in the guard room, at times he is much worse than others & wants to be alone, cannot get any sense out of him. Guard 24 or 48 off. \n","180":" relieved from Guard at 9.30 AM, there is a corporal & 3 privates \n\nin the guard, cloudy morning but lovely day. Sports were held this afternoon and prizes presented by the Y.M.C.A. sports were fair. Sunday a bit cloudy, Sun lovely at times Church parade.\n","181":" lovely day though windy, on guard today.\n","182":" lovely day, calm sea. Gun practice this morning, our boat done best, doing some fine shooting, some of the other boats made some very bad shots. The rifle firing on our boat was bad, it was said that the range was incorrectly given but a lot of the shots only went half way. The target was a \"stick\" towed by the battleship at about 1000 yds. The Coronel from the Bridge gave a fine exhibition of rifle shooting. We are only steaming at about 3 knots an hour, just hanging back till tomorrow morning. \n","183":" lovely day, Table Mountain sighted about 5.30AM, we entered Table Bay at 10 AM, The pilot came on board & we\n\nentered the Harbour, which is very small being a piece of Table Bay, built by breakwater leaving only a very small entrance of about 100 yards. It is very hot in the sun. Early dinner was allowed leave from 1PM till 10.30PM. The town is about a mile from the Docks, is a fair size & very nice. The Avenue (of Oaks) is very nice, also the Gardens, pier, Paliament House etc. We (four) went to Campo Bay, 11 miles round trip round the \"Lions Head\" it is a lovely trip winding up the Mountain by electric tram, travelling on the edge of the Cliffs obtaining a good view of the coast & a fine look out at Sea. The \"Table Cloth\" on the Table Mountain is very pretty we obtained a good view of it. There is not much traffic in the Town, about 6 different trams.\n\nThe people are very patriotic free buffets, tea & cake or bread and butter, everything is done for our comfort. We went to a orchestra concert on the pier tonight it was fair (free to us) We had a feed of fruit & returned to ship at 10.15PM being \n\nfairly tired out.\n","184":" Hot day on guard, four men were put in the cells for drunkenness at Capetown, busy looking after them. \"Charlie\" is pretty bad today.\n","185":" relieved at 10AM, Men in the cells were before the O.C. & he has stopped all their leave & fined one for overstaying his leave. The coast is practically in sight all the time. lt is raining tonight \n","186":" raining, miserable all \nday\n morning, better in afternoon, concert given by the Naval detachment it was pretty good.\n","187":" fine. We entered Durban Harbour at 9AM. A Miss Campbell who welcomes all troops, was semaphore signalling from the breakwater. The Harbour is nothing much to look at, though a lot better than Capetown. We moored along side the wharf, had dinner at 11.30AM. I was allowed leave from 1PM till 10PM. We were lined up to march off but we\n\nsoon broke up, I was detailed for the guard in the cells, to be relieved at 6PM but at the last minute the A.W.L. men at Capetown were sent to relieve us. The troops soon made for the few trams available, while a lot walked into the town, my mates & I took a Rickshaw (three of us in the one Rickshaw, Bill Godfrey one of our mates was at the last minute put on picket duty, we passed him in the town when our Rickshaw man was greatly fatigued we had run him to a standstill. The people of Durban are very patriotic more so than Capetown. We went to a Church Hall had free refreshments (tea, cake & sandwiches) & then went round the town & into West St Hut where all kinds of refreshments are sold very cheaply. \n\nWe got chummy with a couple of young ladies & they invited us out to tea. We had to meet them at 6PM when they came off duty, so we went for a train ride round the Ocean Beach & then round Marriot St & Musgrave Sts, it was a very nice trip, we all enjoyed it very \n\nmuch. We had a wash & brush up & then went to meet the Young Ladies, they took us Home at Stamford Hill, we had a good time there they are very nice people. They invited us out next day if we could obtain leave. We arrived back at 10PM & found the ship to be busy coaling.\n","188":" fine still coaling. We were hoping to be able to get ashore but was took that we couldn’t get it as we were leaving today. The men were very discontented being along side & not allowed off & after a long of murmuring they walked off about 150 of them, things were getting serious, the M.P. went after them, sentries were issued with Ball cartridge & posted at the gangway, The O.C. spoke to the men but was howled down a S.Major was assaulted through trying to take a man’s name. Things began to calm down about 11AM but when the Men returned about 1PM things grew lively, a sentry & an officer tired to stop the men from coming on board, but the Men rushed the gangway & came on board. While at dinner the\n\nthe Coronel bet one of the men that we would sail at the time he stated roll was called & absentees names were taken. At 3.30 PM we had to go to our Messes & the roll was called again to see if any were missing but only two were missing. We sailed at 5PM, Miss Campbell was there to bid us fare well, she is a real good sort, the Men think a lot of Her. We were all sorry to leave Durban as it is a very good place. The Promenade on the Ocean Beach is very nice, though it was knocked about through a very violent storm about 6 weeks ago. The Public buildings, Town Hall, G.P.O, etc were very nice buildings, The streets are fairly wide & straight though not a great deal of traffic run along them. Rickshaw men are very picturesque with their horns & plumes. \n","189":" raining all day, very miserable. \n","190":" fine though sea a bit choppy. \n","191":" fine, a bit choppy, head bad tonight. \n","192":" lovely day, calm, head bad. Started the games (Euchre, Crib, Bridge & Draughts) tournament today, lost the Draughts and Crib. \n","193":" lovely day head bad, on sick parade.\n","194":" lovely day, bad head. Church\n","195":" lovely day though a bit windy. We have been passing a lot of red streaky matter in the water & wondering what it is. I lost the Bridge in the second & Euchre in the third round of tournament. \n","196":" Lovely day, though windy. Voted yesterday.\n","197":" Lovely weather for the Rep.\n","198":" hot weather Friday same. \n","199":" cool cloudy weather \"chats\" have been very bad lately. News to hand that the conscription motion is being defeated.\n","200":" fine though Cloudy, Rottnet Island sighted about 9AM we arrived off Fremantle about 1PM & hung about outside till 2.30PM. Fremantle is a small harbour made by breakwaters, it is very narrow. We drew in to the wharf & we were given a fair reception by the people from the shore. A band played tunes on the wharf. Red Cross Ladies came on board with papers & eatables & goods were sent for our Xmas dinner. We had a nice large piece of sandwich for tea\n","201":" Dec.24 Cloudy threatening weather Land still in sight. Head recovering from a severe attack yesterday & previous afternoon, about 6 sharks were eating refuse round the ship yesterday while we were lying off Fremantle. \n","202":" weather lovely & sea very calm we are in the Bight Fried fish & chops for breakfast, fish is stale. Dinner Roast pork, cabbage & peas pudding & two oranges, lime juice to drink. The officers had a \"night out\" last night kicking up a row & throwing potatos at one another on Deck, if we had done any thing like it we wouldn’t have heard the last of it. Real good concert tonight \n","203":" lovely warm weather, a sailing vessel in sight first vessel seen since Sierra Leone.\n","204":" lovely weather, inspection to see if we are fit to go on leave from the boat. ","205":" lovely day\n We entered St Vincent gulf at midday and arrived off Adelaide at dusk & lay out. The Gulf is very wide & we don’t go close enough to form an impression.\n\nSaturday\n","206":" Lovely day we moved to \n\nthe wharf Outer Harbour at 6.30 AM. \"O\"boat being alongside also. We were allowed on shore at 9.30AM to 5 mile radius. Adelaide is an hour train ride away. Red Cross Ladies provided a lovely dinner. (Meat pies, sandwiches cakes & fruit) in one of the Customs sheds then entertained us during afternoon. also provided tea (same as dinner) we then had a good cinema show, till about 10.30PM. The district surrounding the Outer Harbour is very outlandish, it being only a couple of years old. We had a glorious time there, though we were very disappointed at not seeing Adelaide. \n","207":" fine we left for Melbourne at 8 AM weather turned out threatening, rained a bit. Sunday wet day, we entered the heads about 5PM & lay off Port Melbourne just at dusk.\n","208":" fine though threatening. We moored at the Port at 6.30 AM. the 296 Victorians and 42 Tasmanians disembarked at 10AM. A band played on the wharf to us same as Fremantle. We pulled out at 10.30AM & went up the Yarra to 4 Victoria Docks. We went ashore at 2PM were taken in cars by the Red Cross to a reception at Camberwell\n\nwent to Kings Theatre (Pantomime Alladin) we payed 4\/- but were taken to a good 6\/- seat we enjoyed the play which came out at 11.15PM. We then went back to the boat arriving there about 12PM, being 1½ hours late, we met the O.C. on Deck but he only passed the Seasons greetings with us. Tuesday New Years day cloudy. We sailed from Port Melbourne at 1PM about 6 missing the boat several were brought on board drunk during the morning. it is raining this afternoon.","209":" fine out of sight of land, passed the day anxiously waiting, went to bed with one eye open. Thursday up soon after dawn bathed & shaved, during the night we could see lighthouses on the horizon, at breakfast I was detailed off to roll up the blankets which the lazy ones \n\nfailed to do, all men are supposed to roll up their own blankets into bundles of ten. was annoyed as we were in sight of land & I wanted to see the boat entering the Heads. I set to hurrying on with the blankets & finished just as we were entering the Heads, Coogee & Bondi presented a fine spectacle from the boat, we were all more or less excited the air seemed electrified. We lay out at Watson’s Bay at 9AM & was inspected (medical) & very ragtime one. \n\nWe were then kept hanging about for an hour or so, all passing boats cock-a-dooled & every one would\n\nrush to see the passing Manly boats, at last we moved off to Wooloomooloo Bay. We we being issued with our furlough passes & tram passes (We have the option of a tram or train pass, men wanting Ferry or Coach pass being dealt with later on, we are mooring alongside the wharf, it is lovely being so near Home, we are all very calm now. How the whistles tootle & the kids yell from the Domain Baths, after being so long on the boat I must have been sorry to leave, as I waited for my mates, \n\nat last we went down the gangway, in a sort of dream. V.A.D.s cheered & stuck flowers \n\nin our uniform & gave us cigarettes, then we entered our Motor & was rapidly driven to the Anzac buffet at the Domain, there was a large crowd outside yelling and cheering. I seen Mrs Mac a friend of ours. \n\nWe got out at the buffet & felt lost bewildered in fact, didn’t know what to do, someone said go over there & pushed us, so we faced another yelling crowd, then I met Young Lady & a friend we had lunch on the lawn supplied by V.A.D.s. I went to a marquee & was payed, we were only payed £2.0.0. or £2.10.0. during the voyage. I then went outside to two friends of ours who had motors waiting for me, my\n\nMother was there she thought it would be too much waiting inside for me, my sister all of us entered the motor & went Home, where I had a quiet reception. after it was over I bathed got rid of all the chats and lived happy ever after.\n\n+ I didn’t go on leave to Cairo, because I never had the chance\n\n+ The O.C. at Tel-el-Kebir told us that we were not expected at the camp in fact we shouldn’t have gone there, he had no rations or accomodation (blankets etc) but he fixed us up the following day. A lot of us had no mess tins & after the first day one couldn’t buy a mug or plate in the town.\n\n"}}