{"Document Name":{"0":"Diary_0278","1":"Diary_0278","2":"Diary_0278","3":"Diary_0278","4":"Diary_0278","5":"Diary_0278","6":"Diary_0278","7":"Diary_0278","8":"Diary_0278","9":"Diary_0278"},"Date":{"0":"unknown","1":1245.0,"2":1246.0,"3":1249.0,"4":1297.0,"5":1320.0,"6":1321.0,"7":1343.0,"8":1395.0,"9":1486.0},"Entry":{"0":"\n\n","1":"\n\nHaving to reform in all sections we struck our tents & marched back for a long rest to a large village, Rubempre, about 12 miles from Amiens. It was the first place I had been in untouched by shell fire. All round, as far as the eye could reach, it was beautiful farmland. The agriculturalist in the Company told me it was as such a chocolate soil as he had ever seen. We had fairly comfortable billets & there was a decent hot shower bath place at the end of the village. The weather was\n\nin fresh eggs at 2d a piece. The French currency was a nuisance in this way. We were paid in crisp, clean 5 and 10 franc notes. Our change in dirty French notes ranges from 2 ½ (25 centimes) to half franc & so on. Some of these notes were patched together like the trousers of a mischievous boy’s pants. The everlasting \"two up\" I believed played havoc with the notes. There was also a wretched silver faked coin that looked like pewter, after the style of a cloak room disc at a theatre, for 25 and 50 ","2":" many\n centimes. The English penny had the same currency value as the French copper\n","3":" centime piece, as all the youngsters knew – to our cost. Day leave was given to Amiens where the Social evil in was plentiful, as some of our fellows found prior to an enforced retirement to the hospital.\n\nDuring this period I was a victim to French fever. It is really exhaustion – a man eats but has no appetite. He drags one foot after the other & has no energy at all for sport. A medical officer told me that many of the profession attributed it to the vermin & I think it is very feasible, especially during periods of damp dugouts &\n\nshortage of nourishing food. At one estaminet I found a wholesome red wine that was a good tonic. Nearly all these places were very cleanly kept, & the wife who is absolute boss invariably wears a cheerful face. The husband who \nis invariably\n is generally an old soldier is seen but not heard. He knows his pace as the under dog in the establishment & is supremely happy if he is allowed to sit in a quiet corner occasionally & discuss a glass with the local postman or gendarme. On one occasion, I saw an old warrior harnessing up his horse & cart in order \n\nto go to Amiens to get liquid reinforcements to cope with the unquenchable thirst of the Australians. The wife with a big strapping daughter on either side stood at the kitchen door giving orders, threats, warnings in a terrible screeching voice. We could n’t understand what was said. Perhaps the old fellow had got drunk or committed some other misdemeanour at the last expedition, but he deigned no reply, and when his job was completed he looked a debonair old scamp as, with his felt hat on one side, & he right hand twirling a stock whip\n\nMoustache, he beamed on the assembled Aussies as much as to say: \"It’s all right, my boys; You’ll come to this some day.\" As he mounted the cart & picked up the whip there was a final blast from the domestic battery, but beyond a jovial shrug of the shoulders, he drove away with a bland indifference to the household Riot Act.\n","4":"\n\nWe marched to a railway line that had been newly constructed to link up with the main line at Bapaume. We had the \n\nusual slow journey & as we proceeded we noticed a large number of Chinese labourers on the line. They had been imported by the French. We camped a few miles out from Bapaume, being classed as reserves, but there was no active fighting going on. During the period up to the middle of July we were trained at a new form of attack which was very trying. There was a good picture show at Bapaume & considering we were within range of Fritz’s shells it is astounding that the enemy did not make a target \n\nof the place. The Germans appeared more to concentrate their shell fire on ammunition dumps & munitions training. We had got so used to shells that it never worried us to be in their vicinity. The high explosives came over with a long wail & if it lands without exploding it is called a \"dud\", and a good many duds came our way. Some of the craters made by high explosives were big enough to hold a cottage. The marvellous fact is that so few people are killed by shell fire, & the expensive waste of severe shelling must\n\nbe something incalculable.\n","5":"\n\nOn a hot summer’s day we crossed \nacross\n the hill, past Bapaume along winding roads passing through country which had been stubbornly contested. There were some fine Chateaux in ruins and strong systems of dugout fortifications. The excessive heat caused a large number of men to drop out, & the Ambulance waggon was taxed to the utmost. Colonel Ralston got very wild & said it was the worst march we had ever\n\nbeen on, but we reached our particular station, & after a swim in a creek hard by & a meal we entrained for St Omer, leaving about 1 am on the following morning","6":"\n\nWe passed through fine country under cultivation & reached the fine old historic town of St Omer early in the afternoon. We were marched to a suburb called Arques & billeted in a small street. Just before the next pay day we were marched about 11 or 12 miles to the village of Quescourt. The Town Marshall of St Omer, it appears, did not want \n\nus let loose in the town with our pay, as a recent crowd had painted the town. So we had to pay for the sins of others by marching out in wet weather to a scraggy village where the only pastime to be secured was in drinking watered rum, queer beer & dubious wine.\n\nOne night when I was returning home from a neighbouring Tommy Camp I saw some strange lights flashing up the road about quarter of a mile from Camp. Thinking there might be some dirty work on I crept quietly along until\n\nI heard the grand old Australian language in its choicest blooms from the hot houses of profanity. There were playing \"Two Up\" & ascertaining the result by matches.\n\n\"Verily,\" I murmured \"these men will play on the Judgment Day.\" \n\nAny man who had been in the field will confirm my statement that the Aussies will play two up under severe shell fire with the bodies of slaughtered men close by – as I have seen at Bullecourt, & there is no doubt that properly played it is a fair game. Our Battalion Padre investigated \n\nthe game & said it appeared to him to be fair as between man & man on chances.\n\nWe returned to St Omer & shortly afterwards I was declared to be by the Divisional Medical Board a victim of exhaustion & marked for England.\n","7":"\n\nIn a motor ambulance I was taken to the 58th Scottish Hospital at St Omer. First of all my arms & equipment were passed into the Clearing Station, & I haven’t carried a rifle or bayonet since. The joy of getting a hot bath, a suit of pyjamas\n\nand then to be tucked in between clean, fresh white sheets, and a beaming nurse handing me a basin of beef tea! Was it a dream after all. H’m the doctor was examining me & saying \"You’ll be all right for England in a few days. I’ll pack you off with the next lot. You’ve lasted well for your age. What do you say you are going on for 46. Why man you look like 55.\"\n\nSweet tired sleep, no shell screeching. No raucous voices. Everything is quiet. Must be midnight. A nurse or is it an angel – brings me cocoa, straightens my\n\nbed clothes, pats me on the head & presently I drift away into dreamland.\n\nTwo days after a clean uniform & overcoat. I & my comrades are saying Goodbye to the nurses and old stagers at the hospital. There is a world of wistfulness in the tone of an old Londoner as he says \"Going to Bly-tee? Lor lumme I aint seen it for two years.\" We are unaccusingly styled lucky dogs to be bound for \"Blighty.\"\n\nThe world seems bright again as we motor over the Cobblestones of the old collegiate town to the station.\n\nSeated in a comfortable hospital train with bunks for the cot cases & attendants to bring round hot bovril & biscuits we travel easily via Calais to \nto\n Boulogne. For a while we are alongside a train going \"up the line.\" It is packed with all sorts – Jocks, Tommies, Aussies & Canadians who have finished their brief furlough & are returning to that awful arena \nafter a \n just as they were beginning to taste the delights of home & civilization. \nWe at\n They were however cheerful enough & offered to change\n\nus seats. We had the on them there.\n\nWe were soon aboard a hospital ship at Boulogne & made an easy passage to Dover Harbour where we entrained for Chichester Hospital. During the journey from Boulogne to Chichester we had plenty of bovril, beef tea biscuits & sandwiches. At 3 o’clock in the morning motors were waiting for us at Chichester, \n where \n & on arrival at the hospital the place was lighted up & the staff in readiness for us.\n\nAfter an enjoyable week here, during which we were shown over the\n\nCathedral, 800 years old, we went on to Harefield the principal Australian Convalescent Hospital The food, the nurses, Red Cross supply of necessaries were excellent. We were all this time wearing the blue uniform, our own military clothes being stored until we were to get furlough.\n\nMuch has been written and said of the cheerfulness & fortitude of the Australian wounded. But it has to be seen to be properly understood. At Harefield there were men blind of one eye, others totally\n\nblind. I saw one partially blind man followed by two others almost if not wholly \nblind\n sightless. They were holding on to each shoulders smoking \"fags\" & joking heartily. Cripples of every sort, men disfigured for life by liquid fire lounging about seeing the humourous side of everything.\n\nHere I was before a military board & marked for return to Australia. The presiding medical officer remarking that I had had a fair innings for an old .\n\nOnce more I was in London this time on sick furlough for 14 days, and this time I made up my mind to\n\nsee as much as possible in the time at my disposal, but the third evening there I was \"bonneted\" coming out of an oyster shop & my wallet containing a packet of notes taken from me. A sympathetic Constable asked if I could identify anybody. I answered in the negative & said I had determined it was a Case of \"Good bye, wallet.\" Fortunately I had a few pounds in my inside field dressing pocket. So I had to put in a modest holiday I was relieved from any actual shortage of necessities by an arrangement with Mr A.C. Barry, Superintendent of the War Chest. Since\n\nmy return here I published an appreciative article in the S.M. Herald concerning the good work done by the War Chest Club in London. Parents may rest assured that any of their soldier boys if stuck through misfortune or folly need not be derelicts if they like to consult the War Chest.\n\nThe last day in London I spent with two Sergeants – one from the Yorkshires & the other from the Coldstream Guards. They had both been in the retreat from Mons & belonged to that fine type of unassuming regular soldier which it \n\nis a pleasure to converse with. They both expressed a desire to have \"the honour of seeing the \nright\n thing right through.\"\n\nI arrived at Monte Video Camp, Weymouth, a day over leave, but owing to an orderly room oversight escaped punishment, which at that time meant a week’s \"Chasing the bugle,\" that it is to say that commencing with reveille a man has to report himself at the Orderly room so many bugle calls a day. It was a much detested punishment & practically meant confinement to camp. In this Camp there were a large number\n\nof shell shock cases. The disabled men – on Crutches & sticks – were known as the \"Flying Corps.\" The all absorbing idea was to get to Australia and every boat roll issued from Horseferry Road created the keenest excitement.\n","8":" to Nov.r 5\n\nA gang of us were moved to Littlemoor Camp on the other side of Weymouth which was supposed to be a good jumping off place for Australia. At this place I was clerk to the Depot\n\nSergeant Major & the allotment of fatigues to do the work for the Camp was a tantalising job instead. \n\nThe Sergeants & I were in constant turmoil. For the Sergeant of A Company had a certain number of men graded for hard work, others for light work; there were cripples, & \"exempts\" from all duties, shell shock nervous debility cases. A & B companies did the lion’s share of the work besides taking it in turn to find the guard – 9 men a corporal & Sergeant + \"A\" Company Sergeant said the exactions on his men were too severe. \"B\" Company Sergeant complained that he was being\n\ndriven mad by requisitions for men he couldn’t supply & so on.\n\nMy chief, the D.S.M., serenely told me to draw on the remaining make shift companies for stop gaps. For instance I could squeeze a corporal for the guard out of C. Company, & even rake up a few duffers out of D. Company to help the Quartermaster. If three men were told off to a job that savoured of down right solid work they would languish seat themselves, light a \"fag\". Each one murmuring \"No good to me.\" Coaxing might succeed but bluff or threats were of no avail,\n\nfor they would promptly march off to the doctor & get exempted from duty, & unless they were specifically graded for home service or return to the firing line they could always get exemption, the doctor’s decision being final.\n\nWinter was approaching & I was’nt sorry to find myself included in a boat roll for Australia. We travelled to Plymouth through the country in which Jeffreys conducted his bloody assize, commencing at Dorchester. It looked beautiful & peaceful enough \n\n now. The Mayoress of Exeter had refreshments ready for us at the railway station\n\nof that old town.\n\nIt was dark & raining when we reached Plymouth & board the hospital Ship \"Berrima\". In the morning when I turned out the Spectacle of about close on 20 ships like floating hieroglyphics the Camouflage painting of ships to disconnect the periscope of submarines. Some of the vessels were marked like zebras, others zigzagged or distorted in a manner as to suggest that some scenic \"Splodger\" had been at work with his paint brush to Create ??\n\nWe sailed for Australia after 8\n\nescorted by destroyers. Most of the men were in good health & we were a mix up of all units from Anzacs to men who had never got further than England. The latter were mostly men over age who had been blocked by the medical officers. Sir Douglas Haig had long previously estimated that men over 41 were not needed for the firing line. There are two great drawbacks to middle aged men & they are want of activity & liability to rheumatism. All the same a large number of elderly men were of great utility in many ways & \/or actual fighting they were, especially for\n\nholding positions, \nbetter than\n as good as young men.\n\nWe had an uneventful voyage to Capetown where we had a day ashore. About a dozen of our lads were left behind & we took on 50 men who had been left behind by another transport.\n\nOn the way to West Australia we \nwere\n voted on the referendum for the modified powers by which the Government could draw reinforcements for the line. We made a quick passage to Melbourne, calling at Fremantle & Adelaide to unload the local contingents. They were peremptory in refusing\n\nall shore leave, & at Melbourne we were passed from the Ship into the train waiting for us in the pier on","9":" At Albury, after a good Supper, we were placed in sleeping cars for a comfortable rest, arriving in Sydney on the last day of the old year. There is a mixture of joy & sadness about the homecomings. Many of us feeling fit & in fairly good health were scruffy looking forward to a joy expedition combined with a determination not to leave Sydney, again a hurry. There was one lad with me who confided that he hoped his mother \n\nwould wait at home for him instead of coming to the Anzac Buffet. He was afraid of his Mother’s & his own fortitude for his twin brother had been killed & buried at Polygon Wood.\n\n"}}