{"Document Name":{"0":"Diary_0465","1":"Diary_0465","2":"Diary_0465","3":"Diary_0465","4":"Diary_0465","5":"Diary_0465","6":"Diary_0465","7":"Diary_0465","8":"Diary_0465","9":"Diary_0465","10":"Diary_0465","11":"Diary_0465","12":"Diary_0465","13":"Diary_0465","14":"Diary_0465","15":"Diary_0465","16":"Diary_0465","17":"Diary_0465","18":"Diary_0465","19":"Diary_0465","20":"Diary_0465","21":"Diary_0465","22":"Diary_0465","23":"Diary_0465","24":"Diary_0465","25":"Diary_0465","26":"Diary_0465","27":"Diary_0465","28":"Diary_0465","29":"Diary_0465","30":"Diary_0465","31":"Diary_0465","32":"Diary_0465","33":"Diary_0465","34":"Diary_0465","35":"Diary_0465","36":"Diary_0465","37":"Diary_0465","38":"Diary_0465","39":"Diary_0465","40":"Diary_0465","41":"Diary_0465","42":"Diary_0465","43":"Diary_0465","44":"Diary_0465","45":"Diary_0465","46":"Diary_0465","47":"Diary_0465","48":"Diary_0465","49":"Diary_0465","50":"Diary_0465","51":"Diary_0465","52":"Diary_0465","53":"Diary_0465","54":"Diary_0465","55":"Diary_0465","56":"Diary_0465","57":"Diary_0465","58":"Diary_0465","59":"Diary_0465","60":"Diary_0465","61":"Diary_0465","62":"Diary_0465","63":"Diary_0465","64":"Diary_0465","65":"Diary_0465","66":"Diary_0465","67":"Diary_0465","68":"Diary_0465","69":"Diary_0465","70":"Diary_0465","71":"Diary_0465","72":"Diary_0465","73":"Diary_0465","74":"Diary_0465","75":"Diary_0465","76":"Diary_0465","77":"Diary_0465","78":"Diary_0465","79":"Diary_0465","80":"Diary_0465","81":"Diary_0465","82":"Diary_0465","83":"Diary_0465","84":"Diary_0465","85":"Diary_0465","86":"Diary_0465","87":"Diary_0465","88":"Diary_0465","89":"Diary_0465","90":"Diary_0465","91":"Diary_0465","92":"Diary_0465","93":"Diary_0465","94":"Diary_0465","95":"Diary_0465","96":"Diary_0465","97":"Diary_0465","98":"Diary_0465","99":"Diary_0465","100":"Diary_0465","101":"Diary_0465","102":"Diary_0465","103":"Diary_0465","104":"Diary_0465","105":"Diary_0465","106":"Diary_0465","107":"Diary_0465","108":"Diary_0465","109":"Diary_0465","110":"Diary_0465","111":"Diary_0465","112":"Diary_0465","113":"Diary_0465","114":"Diary_0465","115":"Diary_0465","116":"Diary_0465","117":"Diary_0465","118":"Diary_0465","119":"Diary_0465","120":"Diary_0465","121":"Diary_0465","122":"Diary_0465","123":"Diary_0465","124":"Diary_0465","125":"Diary_0465","126":"Diary_0465","127":"Diary_0465","128":"Diary_0465","129":"Diary_0465","130":"Diary_0465","131":"Diary_0465","132":"Diary_0465","133":"Diary_0465","134":"Diary_0465","135":"Diary_0465","136":"Diary_0465","137":"Diary_0465","138":"Diary_0465","139":"Diary_0465","140":"Diary_0465","141":"Diary_0465","142":"Diary_0465","143":"Diary_0465","144":"Diary_0465","145":"Diary_0465","146":"Diary_0465","147":"Diary_0465","148":"Diary_0465","149":"Diary_0465","150":"Diary_0465","151":"Diary_0465","152":"Diary_0465","153":"Diary_0465","154":"Diary_0465","155":"Diary_0465","156":"Diary_0465","157":"Diary_0465","158":"Diary_0465","159":"Diary_0465","160":"Diary_0465","161":"Diary_0465","162":"Diary_0465","163":"Diary_0465","164":"Diary_0465","165":"Diary_0465"},"Date":{"0":"unknown","1":988.0,"2":989.0,"3":990.0,"4":991.0,"5":992.0,"6":993.0,"7":994.0,"8":995.0,"9":996.0,"10":997.0,"11":998.0,"12":999.0,"13":1000.0,"14":1001.0,"15":1002.0,"16":1003.0,"17":1004.0,"18":1005.0,"19":1006.0,"20":1007.0,"21":1008.0,"22":1009.0,"23":1010.0,"24":1011.0,"25":1012.0,"26":1013.0,"27":1014.0,"28":1015.0,"29":1016.0,"30":1017.0,"31":1018.0,"32":1019.0,"33":1020.0,"34":1021.0,"35":1023.0,"36":1024.0,"37":1025.0,"38":1026.0,"39":1027.0,"40":1028.0,"41":1029.0,"42":1030.0,"43":1031.0,"44":1032.0,"45":1033.0,"46":1034.0,"47":1035.0,"48":1036.0,"49":1037.0,"50":1038.0,"51":1039.0,"52":1040.0,"53":1041.0,"54":1042.0,"55":1043.0,"56":1044.0,"57":1045.0,"58":1046.0,"59":1047.0,"60":1048.0,"61":1049.0,"62":1050.0,"63":1051.0,"64":1052.0,"65":1053.0,"66":1054.0,"67":1055.0,"68":1056.0,"69":1057.0,"70":1058.0,"71":1059.0,"72":1060.0,"73":1061.0,"74":1062.0,"75":1063.0,"76":1064.0,"77":1065.0,"78":1066.0,"79":1067.0,"80":1068.0,"81":1069.0,"82":1070.0,"83":1071.0,"84":1072.0,"85":1073.0,"86":1074.0,"87":1075.0,"88":1076.0,"89":1077.0,"90":1078.0,"91":1079.0,"92":1080.0,"93":1081.0,"94":1082.0,"95":1083.0,"96":1085.0,"97":1086.0,"98":1087.0,"99":1088.0,"100":1089.0,"101":1090.0,"102":1091.0,"103":1092.0,"104":1093.0,"105":1094.0,"106":1095.0,"107":1096.0,"108":1097.0,"109":1098.0,"110":1099.0,"111":1100.0,"112":1101.0,"113":1108.0,"114":1109.0,"115":1110.0,"116":1111.0,"117":1112.0,"118":1113.0,"119":1114.0,"120":1115.0,"121":1116.0,"122":1117.0,"123":1118.0,"124":1119.0,"125":1120.0,"126":1121.0,"127":1122.0,"128":1123.0,"129":1124.0,"130":1125.0,"131":1126.0,"132":1127.0,"133":1128.0,"134":1129.0,"135":1130.0,"136":1131.0,"137":1132.0,"138":1133.0,"139":1134.0,"140":1135.0,"141":1136.0,"142":1137.0,"143":1138.0,"144":1139.0,"145":1140.0,"146":1141.0,"147":1142.0,"148":1143.0,"149":1144.0,"150":1145.0,"151":1146.0,"152":1147.0,"153":1148.0,"154":1149.0,"155":1150.0,"156":1151.0,"157":1152.0,"158":1153.0,"159":1154.0,"160":1155.0,"161":1156.0,"162":1157.0,"163":1158.0,"164":1159.0,"165":1160.0},"Entry":{"0":"\n\n","1":" August. 28\/ 1916\n\nDull and cloudy all day. No rain. Shoeing mules in the morning and horses in the evening. at the school of Farriery South Camp. Romsey. \n\nAfter tea I saw a trashing machine trashing oats at a neighbouring farm. The trasher was driven by a traction engine & there were elevators to carry the straw to the top of the stack. \n","2":"\n\nDull & cloudy ,and showery at breakfast time which continued\n\nall day. Our class put on pair of front shoes on a mule before breakfast and another before dinner. In the afternoon our class was removed to forge 28 under Sargeant Cobele for more advanced work. Heavy rain fell in the evening. The ground was covered with sheets of water. The rain continued during the night. \n","3":"\n\nThe rain cleared away after breakfast & it was fine but cloudy all day. We put on 18 shoes to day, and were not over worked. \n","4":"\n\nA cloudy day but fine. Shoeing horses all day. After tea I walked into Romsey, and had look at Mr. Holloways flour mill. Mr. Holloway showed me all over the mill. There are two mills both worked by water wheels, and they are both of the stove pattern. The first is driven by a wooden water wheel of 20 Horse Power and the water runs under the wheel. This is called the undershot style. The other wheel is much wider and larger in diameter. It is made of iron and \n\nand steel. The stream of water strikes the wheel nearly half way up and this style is known as the brest shot. This wheel developes 80 H. P. In both mills the wheat or other grain is ground by revolving stones. The grain entering through the centre of the top stone and as it revolves the grain is crushed and works to the outside. The bottom stone remains stationary all the time. These stones cost about £30 each, are about 4ft in diameter and 10 in thick. There are a number of other machines in the mill for sifting the flour. \n","5":"\n\nShowery this morning no shoeing before breakfast. We put on 10 shoes before dinner and also had a lecture by Sgt. Cobele on the anatomy and diseases of the horses foot. The following disease will be cured or greatly relived by using for seedy toe cameral, or white mercury powder cameral is a very heavy white powder made from mercury. \n\nTrush, carbolic acid, put on with a feather. \n\nCorns, bran poultice, after poulticing, shoe ,and\n\nease the pressure, and also keep clean. \n\nThis morning there was an examination of those students who have been in the school some time. \n\nAfter dinner a medical inspection of the whole school, to see if all were in good health. Then an inspection of the tents. At 3. 30 pay for the English soldiers, and no work for all hands. We had the afternoon off. \n\nThere is a mail for Australia on Sept. 7 via the Suez. Another on the same day via Vancouver and another on Sept 8. via San Francisco. Correspendence to be forwarded by these routes must be specially so addressed. Published in the \"Times\" of today. \n\nI was on Fire Piquett tonight , dressed and answered the roll at 6 p. m. \n","6":"\n\nA very showery morning, No work before breakfast. Went to bed after answering the roll. Our class put on 17 shoes before dinner. I fitted 8 shoes on a light hack & nailed on 4. \n\nAfter dinner I with Pope & J. W. Dalziel obtained a leave pass and caught the 2. 45 train to Southampton. \n\nOn the way we passed through Nurseling, Redbridge, Millbrook. We stayed at 50 Portland Terrace Southampton, which is a small boarding house of 3 stories. At night we had a walk around the city and out on the pier and went to bed very late. \n","7":"\n\nGot up late this morning & had a walk round the city before breakfast. Then with A. Pope we went for a long walk past the gardens where there are some fine monuments. One recently erected commemorates the memory of the brave engineers who stood by their post when the S. S. Titanic struck an iceberg in the Atlantic Ocean on her maiden voyage to America. \n\nWe then went down the for above 2 miles. There is a forest of oak trees on both sides and an electric tramline down the centre of the road. Then we came back & sat in the park until dinner time. There are many beautiful churches near the park. Southampton is a very old town, In high st. there is a stone bridge\n\nacross the street called Bar gate, which marked the Northern boundary in olden times. The central arch is for vehicle traffic. The electric tram line also runs through it. The smaller arches on each side is for pedestrians. The rooms above the bridge are now used for police courts. . There is a long high wall on the sea shore which was built in the 14th century and used as a defence for the town against attack from the sea. In the evening I had a walk around another quarter of the city & saw a very big church with a spire. The church was surrounded by a high wall, out on the gate posts there were carved head in stone. The church yard was filled with graves over which there were many ancient tombstones. \n\nAt 8 oclock we caught the train for home, As there was no train direct to Romsey we took a train to Eastleigh or Bishopstoke. There we changed for Romsey which we reached at 9 p. m. passing a little station on\n\nthe way. This was a roundabout route, but the fare was the same viz. 8d. \n","8":"\n\nA fine day but cloudy. After breakfast we were (Australians) marched to the Veternary Hospital, and after considerable delay marched back again to our own camp. The arrangements to go to the Hospital being cancelled. We had to draw blankets ,boards & matresses, again for we handed them in to the store before we left. There was steady rain this evening, & there is every appearance of a wet night. \n\nThis evening a lot more Australians came into the school from other units. There were also a lot of English Tommies. \n","9":"\n\n A quiet day and not much work to do . After tea I walked into Romsey & posted Lizzie 3 dozen post card views of places I have seen in England and S. . Africa. I also wrote to Willie\n","10":"\n\nShoeing all day. \n\nWe shod 4 draught horses. l I was on guard tonight for the first time. My watch was from 10 to 12 and from 4 to 6. \n","11":"\n\nA warm beautiful day. Our class shod 1 horse this morning then we had a lecture by the Vet. Lieut. McNaut on the diseases of the horses foot. Seedy toe, , Sand Crack & corns also Laminitus or drop sole. \n","12":"\n\nA nice day but cloudy. Shoeing draught horses this morning. A lecture by the Vet before dinner on diseases of the horse’s foot that can be remedied by shoeing & questions on the lecture we had yesterday. A draught horse stood on my foot this morning& I got it painted with iodine this evening. Revallie this morning was altered from 5. 30 a. m. to 5. 45 a. m. \n","13":"\n\nA dull cloudy day but fine. On parade this morning new orders were read out. Revellie 6a. m. breakfast 7 a. m. Shoeing up to 11. 45 and a lecture by the Vet. on the horse’s foot, being mainly a repetition of previous lectures. In the evening went into Romsey for a walk. \n","14":"\n\nAt 10. 30 this morning we had a lecture by the Vet. on the structure of the horse’s foot and questions in previous lectures. I wrote to Gerard L. Henning Seymour, today. I also got two letters from Lizzie today dated June 7&21 & one from Willie. June 20. \n","15":"\n\nA cloudy day, but fine. Shoeing all day, but not many hooves shod. I fitted and nailed on 4 shoes. There is a concert tonight in the Recreation tent, which I attended. The programme was a long one. Many of the items were very good. \n","16":"\n\nA cool cloudy day. Shoeing all day. There was a lecture before dinner by the Farrier Major on the horse’s foot and questions on it. After tea, I walked to Totton by myself. It is 41\/4 miles from the south camp. I got some postcard views of the place. It is a fairly large village, and has a sawmill and a brewery. \n","17":"\n\nIt was fairly warm this afternoon, and windy after tea. Shoeing all day except for ¾ of an hour before dinner when the Farrier Sgt Major gave a lecture on shoeing and the structure of the horse’s foot. \n","18":"\n\nA fine day but cold at night. Shoeing horses in the morning&mules in the evening. The Vet. Mr McNaught gave a lecture this morning&asked a number of questions to prepare us for the examination which is ti take place tomorrow. \n","19":" \n\nThere was an examination today by the board of Inspectors for the School of Farriers. I was one of those who passed. The examination consisted of fitting one front shoe cold and nailing it on. Also answering a number of questions relating to the structure of the foot, the functions of the various parts and questions on shoeing, and sheing for various defects. \n\nTHE \"Daily Mail\" Picture post cards are now out. I got Series III No’s 17 to 24 at 6d. \n","20":"\n\nA fine morning but cloudy & threatening rain. After breakfast we assembled at 8. 30 roll call, & railway passes for Amesbury. We then marched into Romsey giving cheers for the Sergeants as we went. We passed the Vet Mr. McNaught & gave him a cheer. At 2 to 11 am we boarded our train for Salisbury & arrived there about 12. We changed trains here & arrived in Amesbury about 2 o‘clock. I started to walk out to the camp but got a ride before I went very far. I reported at Head Quarters soon after I arrived. \n","21":"\n\nA cloudy day. A lot of aeroplanes were about last night & this morning. I was helping the Pioneers this morning & after dinner went for a walk passed the 39 Battalion where I saw J. W. Dalziel, to the GERMAN Prison. This prison was recently\n\nconstructed and is made out of barbed wire & posts. Inside are huts and cook houses. There are close on 200 prisoners inside. They are all young fellows, and have been only about a week here. \n","22":"\n\nA very wet morning. At 9 o‘clock I was sent up to the shoeing forge with one of the Transport men, Driver with 2 horses to be shod. & put a set of slippers on one & set of shoes on the other. Also a slipper on a horse fromBrigade Headquarters, I had them all finished before dinner. I had nothing to do this evening . I was with the Transports talking. I saw Lieut. Hunter who was formerly my sergeant in D. Company . He made arrangements for me to report to the Transport Sargeant every morning. and examine the horses, & note those that require shoeing or removing. I wrote to Lizzie last night\n\nb\n","23":"\n\nBitterly cold and \n\ncloudy with a strong wind. No rain, Finer in the evening. I removed and altered a pair of hind shoes on a light draught that was brushing very badly . C. 339 bay mare. I made a good job of it & was congratulated by the Transport Sargent. \n","24":"\n\nA nice moring. No cold winds. I reported to the Transport Sargeant but there was nothing to do before breakfast. After breakfast I put on 2 sets of removes, and in the afternoon cleaned and sharpened my tools. There was a review march of the whole brigade this afternoon. I was out of it. My cousin Miss M. J. Gilmore was married today in Ireland. \n","25":"\n\nA beautiful day . In the morning I was with the Transports measuring horses feet for shoes. In the afternoon I was with B. Company & some of the Transports on the Range Rifle Shooting. \n","26":"\n\nA nice day but cloudy. All the Headquarters details went out to Beeches Farm to a Range there for rifle practice. We went past Figheldean, through Netheravon & thense on to the Range which is about 8 miles from Lark Hill Camp. Netheravon is a nice little village about the same size as Fighledean which is about a mile away. When we passed Netheravon we were quite close to the Flying School. We saw several aeroplanes loop the loop today. There is a fixed observation balloon floating every day now on the west side of Rollestone Camp. It is taken down every night. \n","27":"\n\nA fine day but cloudy. The Headquarters details with the exception of the Band went out to the Range this morning. We fired at 200 & 200 yards at disappearing targets. We had the gas masks on while shooting at these ranges. We also fired up 600 yards. We had dinner in the range & another dinner when came back. This is my\n\nbirthday today. I wonder where I will be this day next year. I hope it will be in Victoria and the war over, and all enjoying the peace & security of a successful & glorious victory. \n","28":"\n\nA cloudy day, but warm in the sunshine. I had to put on a shoe this morning, cold fitting. Last night a batch of German prisoners arrived by train to Amesbury. Most of them were wounded, and a great number were in stretchers. They were all recent captives and of all ages and looked very thin, They were taken to the camp in motor ambulances. Yesterday evening I wrote a descriptive article on Salisbury Plains which I will post home. At dinner time today a special edition of the \"Weekly Despatch\" announced that two Zeppelins were brought down in England – one official and one reported. It caused great joy and excitement in camp. The king is to visit Salisbury Plains on Tuesday to inspect the 10th Brigade\n\nand a lot of preparations are to be made tomorrow \n","29":"\n\nCloudy but fine, bright sunshine in the middle of the day. I was with the Transports all day measuring horse feet for shoes. There are 12 hacks and 12 light draughts. Last night at 7 o‘clock one of the men in C. Company died from measles and pneumonia, His name was a few days ago another man in company died from the same causes. Measles and Pneumonia are very prevalent just now and there are also a lot of innflueniza colds about. \n","30":"\n\nShowery all morning. All the Headquarter Details with the exception of the transports fell in with the companies that they are attached to for sleeping & messing, in full marching order for a rehersal of the King‘s Review tomorrow. On the Battalion parade grounds , the companies were sized up and afterwards inspected by Brigader - General \n\nMcNichol then marched to the Brigade parade grounds & fell in line with the other Battalions comprising the Brigade. Even the cheers led by the Brigadier were rehersed, then the whole Brigade marched to the Bulford parade grounds with other Brigades. There were estimated to be some 35000 troops on the grounds, and the review was a magnificent sight . There was a march past the saluting base, and cheers by all the troops, each Battalion in rotation. We brought our dinner with us & had a long spell in the afternoon. We arrived back in camp rather late. \n","31":"\n\nCloudy & threatening rain. The 37 Battalion moved off to theBulfordparadegrounds, the other Battalions of the Brigade following, early in the morning. Arriving there we had a long wait there were already thousandsofsoldiers lined up, and for fully an\n\nhour more continued to arrive. The King arrived after Eleven and with his staff and a number of officers rode down the long khaki line. A flag was hoisted when the King arrived and all stood at attention for a few minutes while the bands played a few bars of the National Hymn & I had a good view of the King as he rode past followed by the Royal Standard Bearer. When the inspection was over there was a march past the Saluting Base which took several hours. Here I had another view of the King. The march past was in column of line. Then we halted on the side of the road, cake was dinner. A light drizzling rain was falling most of the time. After a long wait in the rain the King and his staff rode down the road and each Battalion as the King rode past cheered his majesty the O. C. of each leading the cheers. Then we had a dreary walk home in the drizzling rain, arriving about 3. O‘clock. I had three good views of the King. He is looking much older than the photos show and his whiskers are tinged\n\nwith grey. He is only a little man, & in the evening appeared to be tired with the constant saluting. Just fancy saluting with the right hand every few minutes for at least a couple of hours on a stretch. The Australian troops assembled today day were the largest body of men I even saw assembled together. There were far more than yesterday. The total was something about and did not include all the Australians on Salisbury Plains. Major Storry announced that the right half Battalion ,A & B companies obtained 98 points in the march past. \n","32":"\n\nOn sick parade this morning got a bad cold & stiff leg. \n","33":"\n\nA miserable day. Paraded sick this morning, but the Doctor did not know what was wrong with me. Again paraded sick after dinner, when the temperature was 103 & the measles were showing on forehead & chest. Was sent into the tent hospital\n\nwhere I am waiting to be taken to one of the Hospitals\n","34":"\n\nIn hospital after a long motor drive too sick to write much. \n","35":"\n\nStill sick in bed on a milk diet only,feel very weak and tired. \n","36":"\n\nShowery day. Still in bed on a milk & soda water diet. Temperature down to 100. 2 this evening. Still have great difficulty in writing. Had a look at paper another zeppelin brought down last night near London. \n","37":"\n\nMy temperature is still up to 100,& should be going down. The measle rash is still very prominent & all over my body. The Dr. examined me this morning. \n","38":"\n\nmuch better today. Temperature again nominal 98\n","39":"\n\nFeel much better. Nominal temperature. Hope to be up tomorrow. The rash on my forehead\n\nhas disappeared. The name of the hospital is Brimstone Bottom and I am in ward 2. The address is Brimstone Bottom,Isolation Hospital ,Nr Ludgers Hall, Wilts. \n\nI wrote to C. Handock this evening. \n","40":"\n\nFeel much better today. Still on a milk diet. Wrote to Miss Gilmore today\n","41":"\n\nOn the mend. Read a lot today in Munseys Magazine. \n","42":"\n\nFeel very much better today. Was up for breakfast. Had a glass after dinner , the first since I came into the Hospital. \n\nGot a letter this morning from Victoria from my wife & was very glad to hear from her. \n","43":"\n\nA fine morning. Feel much better this morning. I was up early before breakfast. There are a number of patients going out of this ward this morning, convalescent. \n","44":"\n\nA dull cloudy day was up early, and helped to clean up & dust the ward. Feel pretty good today. I\n\nfinished reading a new book \"The Secret Service Submarine\" by Guy Thorne. \n\nIt is an interesting story but lacking in technical knowledge & in all probability there is not a vestage of fact in the whole story. \n\nThe chaplain from Peckam Downs again visited our ward to day and brought along some reading matter. I wrote a long account of the Kings review of Australian troops on the Bulford Parade Grounds on Sept 27. 1916. 34. \n","45":"\n\nIt is much finer to day but still windy. \n\nI feel alright except for an occasional pain under the pinney. \n\nThis afternoon there was a visit from the chief Medical officer who was on a tour of inspection. \n\nLater on the British Red Cross distributed tobacco and cigarettes. I got a packet of tobacco which was very welcome as I was out and had no money to buy any. We cannot draw pay while in hospital. \n","46":"\n\nCloudy weather. I was up early this morning. Had breakfast & helped to clean up the ward. I had a letter from V. Lightbody this morning. Just before dinner Captain (Chaplain) Davidson of the 37 Battalion paid us a visit & made kindly enquiries how we were getting on. He came from Lark Hill. I wrote to Lizzie today. 35. \n","47":"\n\na dull morning. I got two letters from my wife this morning before breakfast. No. 8. & 10. I was delighted to get them. I am to be sent back to Lark Hill tomorrow\n\nI had a visit from Victor Lightbody tonight. He was not allowed in so I went out to see him. It is over 5 years since I last saw him. He has not altered much. \n","48":"\n\nI was up early this morning, had a shave before breakfast and made preparations for leaving the Hospital this morning. At breakfast time I got a \n\nletter and bundle of newspapers from Miss Gilmore Ireland. \n\nI arrived by motor ambulance at Lark Hill safely after about a 10 mile drive reported to the office & to the doctor Drew my kit from the store and was put into hut 20 as 15 was isolated. \n","49":"\n\nA dull cloudy morning, but fine in the afternoon. Reported to the doctor for cough medicine. I was put on light duties yesterday by the doctor for 48 hours. . \n\nI saw Dave Mc. Kean this afternoon. He is now in the 37 Battalion B Company. Lewis machine gun section . I also saw Adden Pople of Meffigum & F. Spicer who used to work for Donald McLeod of Merrigum. I heard that Barney Cummins is in the 38 battalion and Newnham who used to be a Sargeant in the light horse at Seymour. He is now a private in the artillery. I had 3 doses of medicine today at the dispensary. \n","50":"\n\nVery frosty last night & cold. \n\nthis morning. A dull cloudy day. I went to the dispensary and got 3 doses of cough medicine today. I have nothing to do only keep out of the road. This afternoon a polling booth was held in the reading room of our camp for the purpose of allowing soldiers to vote on the conscription of slackers in Australia. The Australian vote will be taken on the 28. The majority of the soldiers are in favour of conscription including myself. Tonight an address was given in the dining room by Colonel (Chaplain) Crookston who is chaplain General on the French front. The address was a very inspiring one & was greatly appreciated by the large audience. The address was based on a passage from St John \" A sea of glass & fire\". The chaplain General of the Australian forces Colonel (Dr) L. Rentoul, \"Fighting lary as he is known in Australia presided. He was an excellent chairman and gave a splendid opening address, in which he touched on the need of unity, the high ideals we are fighting for, and the need of conscription to rope in the slackers. The\n\n37 Band was in attendance and played several airs before the meeting started. \n","51":"\n\nA dull cloudy showery day. The 37 Battalion went on a march this morning. The transports took blankets for them. They will not be back until Friday evening. I was left in camp to look after the hot water and keep an eye on the pioneers work to see that it is done right. I done some washing today. \n","52":"\n\nA dull cloudy day but scarcely any rain. Stoking the hot water boiler in the Bathroom. I done a lot more washing today. I wrote to Miss Gilmore last night telling her that I was to get my leave on Saturday and that it was my intention to go to Kesh Ireland. I also wrote to my wife letter 39. I got a letter tonight from my wife dated Sept 3 and numbered 14. Letters No. 10. 12. & 13 not yet to hand. \n\nNo 13 came Oct 21. \n","53":"\n\nI was stoking the boiler today. I also cleaned out all the bath rooms before dinner, and wheeled\n\nsome coal over to the boiler room. & took away the ashes to the tip. I had a busy day of it. \n\nI heard today that Toney Abrahamson died of wounds on the 28th of July in France & that Gus White was killed in action on August 20. 1916 in France. \n","54":"\n\nA nice morning & bright sunshine, the weather has taken up a bit. I was stoking the boiler again today . I have been my own Boss this week. The Battalion came back this afternoon about 4 o‘clock. I got a wire this evening from Miss Kithy Gilmore I should have got it yesterday informing me that there was no train on Sunday any further than Coaves & advising me to go on Friday but that was impossible because I did not get the wire in time also because the Battalion was away on the stunt, & there was no one here to give me leave. I tried to get 2 days indulgence leave in addition to the 4 days\n\nthe doctor recommended it, but there was no one in camp – not even the colonel – who could grant it unless it was recommended by the chief medical officer of the Brigade. \n","55":"\n\nA nice day but cold & frosty. I wheeled two barrow loads of coal to the boiler & helped to take away some ashes. I could not go to Ireland this morning as the trains did not run all the way to Kesh on Sunday from Belfast . \n\nI was paid £2 – last night & by waiting to next week, probably Wednesday, I will get 10\/- more – that will make £3-10-0 whith what I had previously. \n\nThis afternoon I with C. Hardock & J. Mathews walked into Amesbury. I got a few post cards. We had tea there. I got a letter from my dear wife today No13 and dated Aug. 27. 1916. Enclosed were some violets. \n","56":"\n\nDull, cold, cloudy weather. I was doing the usual pioneer work this morning. This afternoon\n\nI am writing letters \n","57":"\n\nDull cloudy weather. I with Mathews was shoeing this morning . We shod No 24 all round with size 6 shoes. We were measuring horses feet and tightening shoes this afternoon. \n","58":"\n\nDull & cloudy weather but not so cold. Mathews & I shod the Brushing horse this morning and examined some mules in the afternoon. This was all the work we done today. We urgently need a forge of our own, as the other forge is too far away and we cannot always get it. \n","59":"\n\nCloudy showery weather and plenty of mud about. We examined the transport horses this morning. \n\nI got my colours this morning. Most of the Battalion already has got them. They cost 2d per pair. The 27 battalion colours are Black and red in the shape of a football & sewn on the shoulder 1 in below the shoulder strap. \n\nI got my ticket or rather paid for it today to Belfast and a voucher to Kesh. I will get my pass in the \n\nmorning. I posted a post card (Christmas Greetings) to my wife tonight and a letter No41. \n","60":"\n\nA nice clear frosty morning. I got my pass before breakfast and am procceding to London enroute for Fleetwood and Belfast. I arrived at Waterloo Station at 12. 7 the train being 8 minutes late. From there I took an electric tube train, changed and went down a lift and took a tube to Euston arriving there at 20 to 1. Had dinner & then had a look around the station. I forgot to say that it was 20 to 10 when we left Amesbury. I was invited by the guard to travel in his van and get a good view of the country. \n\nWe passed through the following stations from Amesbury to London. Amesbury, Newton Tony, Grabeley, Andover Jn. Hurstborne, Whichurch, Overton, Oakly, Basingate, Hook Winchfield, Fleet, Farnbourgh, Brookwood, Woking. Byfleet, Weybridge, Walton, Esher, Surbiton, Malden, Raynes Pk, \n\nWimbledon, Earlsfield, Clapham Jun, Vauxhall, Waterloo. \n\nBrookwood is noted because it has the only cemetery in England that contain two public houses. \n\nAt 5. 20 I left Euston station for Fleetwood. The first stopping place was at Stafford which we reached at 8 o‘clock. There are large shell works here owned by a German firm Simens. It also has a large jail. The next place we stopped at was at Crewe which is the largest railway centre in England. We reached Preston at 10 p. m. where I had a cup of tea. Preston has the largest cotton mill in the world. We reached Fleetwood at 20 to 11. \n\nThe train steamed right on to the pier along side the steamer –Duke of Connaugh. It was the boat train from Euston to Fleetwood that I was aboard. There was no changing & it ran at express speed, passing through all small stations. \n","61":"\n\nAs soon as the baggage was all aboard the steamer moved off. The sea was calm & we had a good passage across the Irish Sea. No one was sick. I had no bed so lay down on the \"tween\n\ndecks. I had several drinks of Rum I think the best I ever tasted. The steamer arrived at Belfast at 7 o‘clock passing Harland & Wolfes dock yards on the way. There was a new ship on the chocks in the course of construction. At the pier we were met by a red cross man and taken to the red cross free buffet for breakfast. After breakfast I was put on a tram to the Great Northern Railway Station passing a monument of the Prince Consort and the city Hall on the way. The train did not go out until 9. 30 for Kesh. The ticket was 7\/10. While in Belfast I some formed an impression of the people of Ireland. I was not more than 10 minutes in conversation with the people until I knew their politics and religion At the barbers shop the barber like all others of his calling the world over was very talkative. He soon let me know that he was a strong nationalist & RC At the Red cross buffet the ladies were strongly imperialist. At the N. S. buffett the ladies their were imperialist. However they were all very kind despite their strong and outspoken \n\nopinions. An Irishman or Irishwoman is never divided or halted between two opinions. He or she is either on one side or the other, and apparently is ready to fight for them. \n\nIt was the same in the train. When I got to Clones I had to change trains. At Enniskillin I met my cousin Miss Kithy Gilmore at the Railway Station. She had no difficulty in picking me out. At Bundoim Junction I had to change trains again for Kesh where I arrived at 1. 30. My Uncle was on the platform and I picked him out at once from his resemblance to my mother. \n\nHis house only about 5 minutes walk from the station down the line. I had a great ovation on arrival. They had killed the fatted calf in this case a fat duck, and I had an excellent dinner. In the afternoon I had a look around the farm crossed over river on the sleeping stones which have been there during the memory of the oldest inhabitants and of which I often heard\n\nmy mother speak of. I had a good view from the top of a hill of Loch Gorn and saw the Bow Island . Lock Gorm is a large lake stretching to Enniskillen 12 miles away and beyond that there is Upper Lock Gorm. Enniskillin lies between the two . It has about 5000 inhabitants. \n","62":"\n\nThe next morning I had a look at the village of Kesh and got some Post card views . I also had a look through the Kesh Busher Factory . The manager Mr. Gibson showed me all the workings. In the afternoon with Uncle we took the train to Pettigo 4 miles away and from there walked 3 miles out to Anneslan to see my Aunt Maggie Mrs James Martin. It was a surprise visit as they did not know I was in Ireland. They were delighted to see me and in the evening they drove us back to Pettigo in an Irish Jaunting car. They are very comfortable to ride in. It was the first Jenting car I \n\never saw. The country at Anneselan is very hilly & from my Uncles house a good view can be obtained. Though the day was cloudy and threatening rain, I forgot to say that on Friday night Mrs Muldoon & her husband and Mrs Riley and her husband came to see me. And on Saturday night Kithy Gilmore came from Enniskillen. \n","63":"\n\nA showery day nevertheless Kithy and I walked to Crevenish Castle in the morning . We met Mr Gibson and he came with us. We saw the Spa well and tasted the water, which has a very unpleasant smell, being strongly impregnated with sulphur and other minerals, but tastes all right. It is regarded in the district as a cure for sore throats. \n\nThe castle is in ruins and covered with ivery the roots of which have penetrated through the walls causing them to crack in all directions. The castle is 3 or 4 stories high, but the roof and all the floors have rotted away, and there is nothing but the bare\n\nwalls standing . There are in the walls loop holes or narrow slits which do duty for windows. It is or rather was surrounded by a wall and doubtless this castle was the scene of many a fierce battle in the olden times. There is a cemetery adjoining the castle, the tombstones are laid flat over the graves, they bear various coats of arms and signs. One was a skull and a cross bone beneath it chiselled out of the stone. It is in an excellent state of preservation, but the lettering in most of the stones are not decipherable owing to moss and wear & tear of people walking over them. \n\nThe Spa well is only a few chains from the castle and the overflow runs into Lock Gorn at the foot of the hill. The rubbet Island is facing the castle and the Lake here is about 9 miles wide, and extends past Kesh to Pettigo which is a rather pretty village, and contains a large mill driven by water power. \n\nOn Sunday night in company with Mr. Andrew Muldoon I cycled over to Edriney \n\nto see Dr. John Patten with a view to getting my pass extended. As I had a cold he granted me 4 days extension of leave. Ederney is a larger village than Kesh, but as it was dark I could not see much of it. It is 3 irish miles from Kesh I was greatly deceived in Irish miles , as they are much longer than English miles. . 3 miles here is about equal to 4 english miles. We were an hour and a quarter away. \n","64":"\n\nA very wet day which continued all day almost constant. I walked over to Dromord to see my cousin Mrs Muldoon. Had dinner and then Mr Muldoon lent me his bike and I rode over to Coolaness S. School about 3½ miles from Kesh to see Mrs Riley after dark I cycled into Irvinestown with Mrs Riley. I saw a number of public buildings including the R. C. Church, Orange Hall and the church of Ireland. The Orange Hall is between them. I obtained some post\n\ncard views of the place and had several drinks of the best Irish whiskey I ever tasted. When we returned we had a great cupper and some music. . I left at 10. 30 and cycled into Kesh which I reached after some delay caused by the chain coming off and slightly getting mixed in the roads. However I arrived safely at my Uncles, had a cup of cocoa and slept until 9. 30 when I came out for breakfast. \n\n","65":"\n\nHallowe Eve. This is a well known day in Ireland and is a land mark in the seasons. The people doing their reckoning from this day . \n\nIt was showery this morning . I caught the 12. 30 train from Kesh. My Uncle came almost to the station with me, and my cousin Lizzie Gilmore came in the train as far as Inniskillen . I stayed here for a few hours and we went to the Post Office where we were joined by Kithy Gilmore and they showed me\n\nsome of the sights of Enniskillen including the Lord Cole memorial on the hill which is surrounded by gardens and also the Town Hall and the convent. Then we had tea at Mrs Creswells. At 4. 45 the Belfast train started so we made our way to the station in good time. I gave each of my two cousins my tunic badges (rising suns and bade them farewell. I reached Belfast 8. 15 caught the boat in plenty of time by taking a tram a lady at the station red cross putting me on the right tram and also very kindly supplied me with a cup of tea and some bread and butter. About 9. 30 the steamer Duke of Cumberland started for Fleetwood. There were a great crowd of passengers and sailor and marines. We had to sleep on the \"tween Deck . \n\nGoing down the lock which is a long narrow neck of water stretching from Belfast to the open sea and lined on either side with wharfs and shipping we passed Harlands Wolfes ship building works. I saw here the newest warship\n\nafloat H. M. S. Glorious just recently launched and built in Belfast. She has an enormous speed and is armed fore and aft with two 15 in guns. \n\nThe river Logan runs into the lock . We were soon out of the Lock and in the open sea, and out of sight of the Emerald Isle of which I will have many pleasant recollections. \n\n","66":" \n\nThe Duke of Cumberland arrived in Fleetwood about an hour before her usual time so we had a long wait before the Euston train started. A cup of tea and some meat pies were served out to the sailors & marines, and they did not forget the few soldiers aboard. \n\nWe left Fleetwood about 6 a. m. I forgot to say that there was a fresh wind blowing, and our steamer pitched a good bit but I did not get sick. but felt very heavy owing to the foul tobacco air between decks. However I soon was alright when I got on the top deck and in the fresh air. We passed through some big towns on our way to London, such as\n\nNuneaton, Rugby and through one of the longest railway a tunnells in England – Kilsbury tunnel 5 miles long. \n\nWe arrived at Euston a little before 1 o‘clock and I had dinner at the Red Cross Free Buffett E. R. S This is my third trip to London, but today it was raining nearly all the time and that made things miserable. At 3. 25 I boarded the train arriving at Salisbury at 5. 10 where I had to change trains and wait until 7 o‘clock for a train to Amesbury. I arrived in Amersbury at 8 . o‘clock walked out to the camp and reported to H. 2. office and was sent to the doctor to be examined. \n\nI forgot to say that from Euston I took the tube electric railway which is underground. In Euston Station I went down a lift, walked along several passages up a moving stairs and down another. Boarded the train and was whirled away to Charing Cross where I had to chain trains, there I took one that runs under the Thames to Waterloo railway station. As I had plenty of time I\n\nWalked over to the Union Jack Club and wrote a letter to \n\n","67":"\n\nA dull cloudy day but fine,\n\nI am at the same old routine work again. Measuring mules feet this morning. 22 draught mules came into the stables last night . Most of them are quiet, but there are a few rough ones. \n\nI am anxious to hear the result of being A. W. L. for 3 days. A lot will depend on what the Battalion doctor says\n\nI wrote a long letter to my wife describing my trip to Ireland & the first day there. 42. \n\n","68":" \n\nA very wet dirty day\n\nMathews & I were shoeing in the morning, and we had practically nothing to do in the evening. \n\nAt or about 2 O‘clock I was paraded before the colonel, accompanied by the warrant officer from Head Quarter Sergeant Robinson & two R. P. to answer a charge of being A. W. L. for 3 days on my recent visit to Ireland. As I had a doctors certificate signed by Dr. John Patton of Edinery\n\nAnd had a very good record. I was let off with 7 days C. B that is confined to camp. I answered the first call at 6. 30 together with others. There were 4 calls in all the last at 9 o‘clock. \n\n","69":" \n\nA much better day but cloudy. I was clipping horses in the morning, and in the afternoon stayed in camp writing letters, and also in anticipation of the Defaulters call being blown on the Bugle and C. B. s have got to answer it whenever blown. It is liable to be blown on any Saturday afternoon. I wrote a long letter to Willie 7 pages describing my trip to Ireland \n\nThere were only two defaulters calls tonight because it was so wet. I also sent to my wife 1 packet of 33 postcards mostly of Ireland & 6 cigarette cards. \n\nThere will be a general mobilization of the whole Brigade tomorrow and preparations were made\n\ntonight . Web equipment put together and instructions given for the rolling of blankets etc in the morning. \n\n","70":" \n\nA very wet day. Continuous rain all the morning. \n\nThe mobilization Inspection took place in the huts owing to the heavy rain. I was helping the pioneers and got my feet & legs wet through. I sent H G Kittson 3 London weeklies. \n\nI received two letters from my wife today. No 15 dated Sept. 10 and No 16 dated Sept 17. I sent to my wife a book \"The Travellers Guide to Life\" which my aunt Mrs John Gilmore gave to me when I was in Kesh Ireland visiting her. \n\nThere were some wattle blossoms in each of the letters I got from my wife today showng that there is an eary spring at Merino, Victoria\n\n","71":" \n\nFine with a few light showers. \n\nThere was a general mobilization parade of the Transports today before the Bridiger General & Col Woods. I with the other two farriers had to parade in full marching order\n\nand load a horse each. It only occupied less than half an hour. In the evening we were clipping horses. \n\n","72":" \n\nCloudy with occasional showers. Clipping horses in the morning and also in the evening. Sargeant Mc Nicol was in charge of the defaulters calls tonight. \n\n","73":"\n\nA general mobilization of the whole Battalion and an inspection by Bridiger General Mc Nicol in the afternoon. The dress was full marching order with everything we are taking to the front packed in the pack. Blankets were rolled up and packed ready for transport, and the boards and surplus blankets stacked in the huts. The kit bags filled with the clothes & other things that are not to go with us were also stacked,\n\nI saw in the paper this evening that the S. S. Arabic was torpored in the Meditterian Sea and that the passengers were saved but 2 engineers are missing. She had on board the Australian mail and presumably it is all lost. I got two copies of the Argus Aug 25 & 26 today from Aus . {?}\n\n","74":" \n\nA cloudy day, cold & frosty last night and this morning. I was clipping horses all day. \n\nI finished the 7 day C. B. to night and answered all the defaulters calls. It was a cheap price for the 3 days extra leave I took when in Ireland. There were from 3 to 4 calls every night. And the distance from my hut No 20 to the Battalion office is about yards so that would make from yds to 8 yards I had to go every night. Some nights when I did not hear the first call I had to go at top speed especially one night I went to the Y. M. C. A. to post a letter & when coming back I heard the call & had to run about a quarter of a mile, & was at the office in time\n\nI posted a Christmas card to my wife tonight. 44. \n\n","75":" \n\nCold & frosty and cloudy . Clipping horses all day. I wrote a long letter to my wife tonight \n\n","76":" \n\n A fine day for a wonder. We were branding horses this morning. This afternoon I walked into Amersbury to get my photo taken, but the two photographers\n\nhad such a rush of work they could not do it and had to turn a lot away. I was delightfully surprised to get another letter from my wife today. No. 17. and dated September 24. \n\nTonight the pioneers were issued with new rifles at 7 o‘clock. The number of my rifle is C. 4941 we were also issued with a Bayonet, oil bottle and pull through. \n\n","77":" \n\nThere was a general mobilization of the whole Battalion this morning Mathews & myself marched with the transports and led a couple of horses each. \n\nEarly in the week I sent to John Bull Newpapers ,London for two Fountain pens. They arrived today. One I got for C. Cunningham. \n\nI sent Mr. J Murphy of Merrigum a P. C. of the R. C. Church at Irvinestown. \n\n Monday November 13. 1916 \n\nA beautiful day with nice warm sunshine in the afternoon. \n\nThere was a general mobilization of the 3 division\n\nThis morning, comprising the 9th. 10th &","78":" Brigades for a 15 mile route march as a test of endurance & fitness. The 37 Battalion formed up at 9 o‘clock on the Parade Ground the Pioneers leading, and were joined on the way by the 38. 39. and 40 Battalions. The other 2 Brigades also joined up. The whole procession was about 14 miles long. The longest I was ever in I cannot say it the longest I ever saw for it was impossible to see either end of it. \n\nWe marched through Amesbury, Stonehenge, Shrewton, passed the sausage balloon, near Bustard and from there home to camp. It was the most strenuous march I ever experienced and the longest since I have been in the army. Many fell out on the way and had to report to the doctor at the rear of their own battalion. Some fell out when we were only a few miles on the march and others all along the route until we were near home. 2 of the pioneers, Jorgensen and Holland. We were in full marching order carrying all our things, with the exception of blankets) & the rifle. Our\n\nshoulders were sore with the weight of the pack and the rifle. When I got back to camp I had a bath changed my clothes both shirts being saturated with perspiration & put on fresh ones. There was only 20 minutes for dinner and very few spells. It was really a forced march. \n\n","79":" \n\nCold & foggy today especially in the evening. I shod the Bridigers horse this evening. \n\nI wrote to my wife tonight enclosing 3. Badges Post cards. 47. \n\n","80":"\n\nCool and cloudy all day. The pioneers attended a booming class today, and had practise in throwing dead bombs and a very interesting lecture on explosives and the Mills Hand Grenade by Maj. Toule. \n\n","81":" \n\nA cold bleak wind blowing all day from the East. \n\nIn the morning the Pioneers had practice in throwing live bombs – Mills Hand Grenade. In the afternoon I was shoeing. \n\n","82":"\n\nA bitterly cold and bleak wind blowing all\n\nday . This morning I shod a Brigade hack No 46, size 3. And another in the afternoon A. 3. shoe size 7. \n\n","83":" l916\n\nThere was a light fall of snow last night and again this afternoon & tonight. \n\nThere was an inspection of the Brigade and Battalion horses this morning. After the inspection I shod the Brigaders chestnut horse this morning . After dinner the pioneers were instructed for 2 hours in bayonet exercise. \n\nAt 4 oclock I walked to the Amesbury Railway Station and sent away to my cousin in Ireland a parcel containing 1 pairs of breeches, 1 pair of drawers and a drill book and a few other little things for safe keeping. I wrote to Lizzie Gilmore tonight enclosing a Christmas Card. \n\nI sent a New Year Card to my wife tonight and wrote on it several verses of poetry. \n\nWhile in Amesbury I was in a stationers shop. It is also a general shop and is kept by Soul Bros. It is a very old shop and Mr Soul showed me a \n\nfireplace that is 500 years old and gave me a postcard of it. I bought several post cards & Christmas cards and sent them away from there. It snowed all the way \n\nwhen I was coming back from Amesbury. \n\nToday we were issued with 1 extra blanket. 1 ration bag, 1 small tin rifle oil,1 pair of black boots, 1 pair of drawers, 1 pair of socks, 1 singlet. 1 cake soap, 1 steel helmet. \n","84":"\n\nIt snowed all last night and this morning, and it looks as if it is going to continue this evening. This morning despite the falling snow the Pioneers with a detachment from all the companies were sent out to the ranges for instruction in the Lewis Machine Gun. \n\nI wrote to my wife today letter 48\n\nI wrote to my aunt Mrs. James Martin, Annesclan, Pettigo. Ireland. Xmas and I wrote to Father a long letter enclosing a xmas card. I sent a postcard of \"The Spreading Chestnut Tree\" to John Cooper & Sons. I sent a packet of post cards to my wife tonight\n\nWe packed up our packs tonight with one blanket inside and the other wrapped in the water proof sheet bent round the pack in horse collar fashion. \n","85":"\n\nThere was a lot of drizzling rain last night which melted the snow except the large boulders of snow that were rolled together by the lads. \n\nThere was an inspection of packs this morning. All English blankets, boards, treshels and tables were stacked in heaps and carted away tonight. We have only our two issue blankets to sleep in tonight. I was shoeing this morning, and in the afternoon branding Brigade mules and 2 horses. \n\nTonight we were issued with 80 rounds of ammunition and a leather jacket. We expect to go tomorrow night. \n","86":"\n\nDull and cloudy this morning. I was helping Mathews to brand transport horses and mules in the morning and in the afternoon I shod a Brigade horse A. 7\n\nWhile we were at the Post Office\n\non our return from the forge this morning a military funeral passed with short step and slow. The coffin was on a gun carriage and decorated with flowers. An Australian band led the procession, but it was all Englishmen soldiers that followed the gun carriage. \n\nI slept in my clothes last night without any blankets on the floor rather than pull my pack to pieces. \n\nSaw Joe Carr – a student last night. He is in the 30 Battery 8 field artillery Brigade, 3 Division. He is a driver I often see Dolly Varden. I hear that Jack Brake is on Salisbury Plains and that he is now a Lieutenant. The whole battalion paraded this afternoon for instructions in embarkations and allotment of men to the different trains. It takes 3 trains to bring the Battalion I am in the 3rd train\n","87":"\n\nA fine day there was a slight frost last night. I gave away to 2 tommies last night some things I could not carry. \n\nThe first and second lots got away in good time this morning. The Pioneers are to go in the third train\n\nwith D. company. I was helping the transports to get packed up this morning. \n\nWe left Lark Hill a little after 12 and marched into Amesbury carrying everything with us. We were at the station in good time and left about 2 p. m. and arrived at Southampton about 5 o‘clock and after some delay went on board a small but fast steamer named the King Edward. We had some lunch in the train and also on board. We steamed out about 6 and arrived at a French port about 1 a. m. in the morning . The port was Havre. \n","88":" 1916\\It was a fine morning and we were up early and had breakfast on tinned corned beef and biscuits served out to us last night. Those who could get it had tea, the supply running out before we were all served. A few were sick, last night including our sargeant and N. J. Jorgensen,of the pioneers. There were on board a company of the 38 Battalion. There were 2 other steamers to take over the balance of out Battalion. Havre is like an English port. And there are a lot of English vessels in the Harbour which is well sheltered one. \n\nWe went ashore early in the \n\nmorning after a scanty breakfast and had a long weary march along wharves across brides and through long winding streets to No. 1 camp on the top of the Hill. We had several stoppages on the way and eat our lunch about 10. 30 on the side of one of the main streets. We were surrounded by swarms of French boys & girls , most of whom could speak enough English to ask for \"Biscuit, pennies, cigarette\" We were sold oranges for a 1d each. We passed many fine buildings 4,5 and even 6 stories high and some fine churches, in front of one was a large open space on which we rested for 20 minutes or so. The streets wound along the side of the hill to the top, in a very steep grade. One of the streets has been renamed Ave Edith Cavelli and another at the camp Ave Kitchener. We reached the camp at 1. 30 and had some tea & something to eat . We were too tired to have much of a look round but I went to the Y. M. C. A. & bought tobacco & biscuits. We had a late tea & got to bed early. \n","89":"\n\nWe were up early this morning had a breakfast of hot stew \n\nbefore daylight and marched to the railway station by a different and much shorter route by which we came. – the distance was about 2 miles downhill, a vast difference to the 5 mile uphill march of yesterday. \n\nWe were on board the train about 8. 30 and were put into cattle trucks without any seats. We had a long wait for the train did not start until 10. 45 and we had to draw supplies for the day and had a dixie of tea and bread & butter at a stand close by, for which a small charge was made. The cattle trucks were rather rough to ride in, but we soon became used to it. was our first stopping place, and as we journed south we passed through some beautiful country and many fine towns. \n\nPorvein was the largest and most important. It is built in a valley among the hills. There are many fine gardens around Porven and judging by the of small chimleys many factories. I had 6 feeds today . consisting of cheese French bread tinned beef & biscuits & jam\n","90":"\n\nWe travelled nearly all last night sleeping in the cattle truck as best we could. We had breakfast at daylight. I made a drink of hot soup. We reached Etaples this morning at 9. 30 which is on a river & is of considerable size, after dark about 6 we arrived at a large railway station called Balerple where we got out and was transferred to a covered in ushor lorry 30 men with their kits to each lorry. After an hours journey we arrived at our destination, and were quarted in billets for the night, on ground that had early in the war been fought over. We did not get into the billets without considerable delay caused by men loosing their kits and getting others. I was fortunate and stuck to mine all through. \n","91":"\n\nIt was 10. 30 before we had breakfast, and then we had to go to B. company to get it. At 3. 0‘clock there was a church parade. \n\nLast night and this morning we could hear the booming of the big guns in the distance. In the evening we saw a German areoplane and the\n\nallies shelled it but without result. We could easily see the smoke of the bursting shells around the areoplane. \n","92":"\n\nWe were up late this morning. All the Headquarters are in our billets and we are very busy cleaning it up and making it fit to live in. These came in 27 bags of parcels & some letters from Australia this morning. Some of the Pioneers got parcels but I did not. \n\nI wrote to Kithy Gilmore and to my wife this evening. 50. \n\nLater. I got 3 letters from my wife to night dated Oct. 11. 10 &11 also a letter from Willis Oct 11 & one from I. Ring. \n","93":"\n\nWe left our billets here at 8 o‘clock, formed up on the road and marched 13 miles carrying everything with us with the exception of the Blankets which went in the transports. We marched through several towns and villages until we came to Armienetries where we were billeted in a large convent almost every window of which was broken. The Pioneers were put on the second floor of one of the wings. There were several churches attached to the\n\nconvent and they all bore traces of shells as well as the convent. In the march we passed a large church in a town next to Armieneteries that was badly knocked about by shellfire – one end being blown clean out. All the buildings about here are of brick. \n\nThere are many shops open generally all fancy goods chocolates and soldiers requisities, With 2 others I got a bottle of wine for 2 franks and we enjoyed it. \n","94":"\n\nWe were up early but had a late breakfast. Then Mathews and I were sent to look for the transports about 1½ miles away, we were tired but we walked round for several hours, without success and on our way back we came across them by a fluke. There were only about half a mile from our camp at the square. \n","95":"\n\nMathews and I reported again to the Transport Sergeant, and were set to, to unload a waggon of tools & pack them in a heap. Before the war I am\n\ntold there was a population of 35,000 in Armeneteries but now it is only about 5,000. There are hundreds of empty shops with the windows broken and the goods looted. \n\nIn the afternoon all the Pioneers were marched from our billets in the convent at half past Eleven Square to another part of Armenetiers called Houplines about 2 miles away and put in billets about 1200 yards from the German lines. We are in a large 3 storied house I am on the second story in a nice little room with a stove in it. \n\nThere are two New Zealand Pioneers in it but they will be removing in a few days. I have a fine French Spring bed to sleep on, and on which I have already spread my waterproof sheet, 2 blankets and overcoat. It is the first nights comfort since I have been in France and the fourth place I have camped at. The only draw back is that my sleep is liable to be disturbed for the German machine gun bullets often play on the walls at night and at street crossings we have been warned to be careful in\n\ncrossing at night for the spit of the bullets can be heard and the flash seen as they strike the hard cobbled paved streets. As no food was sent down for us the N. Zealand Pioneers invited us to tea, which we heartily enjoyed and I went to bed early for I was very tired & foot sore. \n","96":"\n\nHow the time flies & the year will soon be out, and I have been a soldier since Feb. 28. Well it is a hard life and I would not again adopt a soldiers life from choice and yet those in the trenches have a far worse time of it. We are settled down in our new billet and like it very well. We have been making periscopes this morning for those in the trenches. Already some of our Battalion have been taken out of the trenches wounded and others sick. \n","97":"\n\nCold and frosty all day. I done a little Blacksmithing today; made a new D. for lock of tool chest. The New Zealand Pioneers removed from here this evening. Those of our Pioneers who were upstairs have gone below. I am now the only one upstairs in this part of the House. \n","98":"\n\nCold and frosty; much more so than yesterday. We are making more perescopes for the boys in the trenches. The wood and the silvered glass we obtain from mirrors and over mantles in the abandoned houses about here. It seems a pity to cut them up but there is nothing else for it. The people have evidently left their homes in great haste for the furniture, pictures, ornaments, cups & saucers , knifes and forks are in the houses. They come in very handy for us. \n\nI wrote to my wife today - letter 51. I also answered Iriene Ring‘s letter yesterday. Tonight I was guard with another pioneer over supplies at D. company’s dump for about 2 hours. Stray bullets were whistling around. Tonight the Pioneers get an issue of tobacco, matches and cigarettes for the first time. \n","99":"\n\nA fine morning. I was down to the trenches this morning with perescopes for machine gunners at Head Quarters. I was very lucky this morning, receiving 3 letters dated Oct 13,16,,& 20. and a parcel containing a \"Insto\" self filling pen from \n\nmy dear kind thoughtful wife. I am making these notes with the new pen. It was already filled with ink\n\nThis evening in the execution of my duty I saw another ruined church, practically totally destroyed, There was a large beautiful 3 storied house not far from it, evidently a Bishop‘s residence. \n","100":"\n\nCold and cloudy . We are still making perescopes for the trenches. I have been making stencil plates today. I saw two men bought in dead from the trenches this morning. There are now casualties every day. I had a good look round a number of ruined houses looking for coke this morning. There were beautiful furniture in most of them but nearly all smashed up. They were evidently well to do people who lived in this part of the city of Armentieries or Houplines as it is called. All the houses I have been in have been looted & furniture smashed & valuables taken away. \n\nTonight with B. Handcock I volunteered to carry a case of ammunition to the trenches. \n\nBut it was more than we bargained for. We had to carry it about a mile through the trenches into the firing line at one place we had to get out of the trench & carry it along a tram line for about 70 yards with bullets whistling around us, and mud and slush e very where and then through more trenches. Coming back there was a gas alert and we put on our gas masks but fortunately no gas came our way. \n","101":"\n\nAt 12 o‘clock last night there was another gas alarm & again at 1 o‘clock. , but no gas came this way. I saw Harry Jones this morning on his way to the hospital . He has bronchitis and neuomonia. He just came out of the trenches after being in 4 days. I made & put in a chimley bar fitted with hooks in the Doctors room this evening. I got a dose of cough medicine from him. \n","102":"\n\nDull & cloudy and bitterly cold. The front is very quiet today. Last night I wrote to Willie and Cis. I have not been able to post any letters since we came here, until today. \n","103":"\n\nDull & cloudy. We were at the usual work today also made a few wind vanes. \n\nI was up in the house last night, and again tonight. \n","104":"\n\nA very dull & cloudy day. Not much work to do. The 39 Pioneers came in to our quarters today and we will be removing soon perhaps Monday. I have got my things packed ready to move. \n","105":"\n\nThere was a lot of drizzling rain last night, and it is cold and cloudy today. The 37. B. . — are now all out of the trenches and in billets. I was up in the city this afternoon, and bought a post card \"Flowers of France\" to send to Victoria. Parts of the city was shelled this evening. A shrapnel shell burst over a party of D. company outside their billets and 11 men were injured. \n","106":"\n\nA fine morning. We moved out from this billet this morning to rooms a few doors lower down the street to make room for the new Pioneers. All day we were making things tidy. We cleaned out a room that had a lot of sand bags & planks in it, to make a kitchen. We put in a stove and got 4 chairs from abandoned houses. \n","107":"\n\nThere was snow this morning when we got up & occasionally through the day . \n\nThe Pioneers were resting today . We had practically nothing to do. \n\nI had a look through a priests house this evening. There was a small private chapel sadly in ruins, and the furniture of the house smashed. \n","108":"\n\nCold and cloudy today. The cold is very keen & penetrating this morning. We had very little to do today. The carpenters done a little work & I collected a lot of firewood. We had to stand to for an hour in case of an artillery attack. \n","109":"\n\nI got two letters from my wife last night. dated Oct 29 & numbered 28, & one numbered 29& of the same date with a cutting of the \"Argus\" containing conscription speeches. I also got another letter today number 26 & dated Oct 23. 1916\n\nThis morning we were detained to act as fatigue for the engineers who are \n","110":"\n\nLast night we were 3 hours in a shell proof ? room – from 5 to 8 as our artillery was bombarding Fritz, but he did not reply. Today we were\n\nup at 5. 30 had breakfast and paraded at Little Mary dump to report to the engineers at 6. 15 We put on gum boots and went out into the front line of trenches to repair them . Our job was filling sandbags. We were only 60 yards from the German lines. But they left us alone. We had to walk through mud, slush & water to get to our work. Forgot to say that yestedday we had the gum boots on for the first time. They reach up to the thighs. The germans yesterday fired rifle grenades & many of them fell close to where we were working, but no one was hit. I saw one explode & it sent mud & dirt up to a great height & it fell in all directions. On another occasion a piece of shrapnel hit a tree alongside us. To day we were back from work at 12. 15. and the Sargeant & two cooks who were left behind, were not to be found. They afterwards turned up. \n\nSaturday December 16. 1916\n\nCold and frosty this morning . The 39 pioneers moved out this morning and we moved back in again to recommence our usual work. I have been writing letters this morning. I wrote to my wife. 53. and enclosed a P. card Flowers of France I received a letter last night from Kithy Martin Annerelan,Pettigo ,Ireland. \n\nI saw a copy of the \"Daily \n\nExpress\" last night of the 14 inst and it was full of the German Chancellors Peace offer and the dire penalties threatened if the allies refuse peace. All the Neutral papers ridiculed Germany and regard the offer as a sign of weakness & that Germany is feeling the pinch & has no hope of winning by force of arms. The \"Express\" says the Kaiser is imitating Napoleon and to accept his officer now, would enable Germany to renew the war in a few years as Napoleon did in 1842 when his truce was accepted, only to be broken before the year was out\n\nI saw one of the 39 Batt. carried in this morning badly wounded in the back near the shoulder. He was bandaged up but exposed to the cold. \n\nI received my second pay in France on the 14th. I was paid 40 Francs equal to £1-8-8. my first pay on the 5th inst was 15 Francs equal to 10\/9. I was with C. F. Cunningham in the trenches for 2 hours 4 to 6, taking up a floor & bailing the water out of a dug out at Headquarters. . \n\nSunday December 17. 1916\n\nA very quiet day, scarcely any bombarding. The Pioneers were working all day making direction guides for the\n\ntrenches. I was drawing the letters and sign writing. We have a lot more to make tomorrow. \n\nMonday December,18. 1916 \n\nIt is only a week to Christmas, How the time flies? The year will soon be out, and I will be 10 months a soldier. It is almost mid-winter, and Christmas at hand. It is a new experience for Victorians Christmas in the winter, but ever since I have joined the army it has been a series of new experiences and most of them unpleasant , but there were a few pleasant ones which more than balances the rest. I do not regret joining the army, but will be glad when the war is over and still more glad when I get back to Victoria among my loved ones, and see my wife and mother again. Yet with all my longing to get back – and we have a song I want to get back- I do not wish to get back until Germany cruel treacherous Germany is thoroughly beaten and brought to her senses. I believe that happy day will not be long, probably in a few months time, perhaps early next summer. We were at carpenters work all day, flooring a dug out for ammunition. \n\nTuesday Dec. 19. 1916. \n\nVery cold & frosty all day. In the afternoon, when we were in the trenches, it started snowing and continued until dark. Every night at the Engineers store we have been unloading the Transport waggons. To night we unloaded 7 waggons\n\nWednesday Dec. 20. 1916\n\nCold & frosty today. There are 6 of the Pioneers sick with dysentery , today . Some have been bad since Sunday. I wrote to my wife today letter 54. also to Miss Kithy Martin ,Iniselin Fermanagh. This morning I received a letter from Cis dated Oct 20. I should have received it a fortnight ago. \n\nThis afternoon the sky is blue and clear, though the air is frosty. It is an ideal day for aeroplanes and as I write, I can hear our guns shelling, and see the shells bursting around an enemy aeroplane that flew over our lines into Villa de Houplines. With what result I do not know but I saw one enemy aeroplane hurriedly get away\n\nThursday Dec 21. 1916\n\nWe left our billets in Houplines before dinner and marched to the convent near the Half Past Eleven Square, and camped in a ground floor in a different part of the convent to where we were before. \n\nI had dinner in a French caffee, 2 eggs & chipps for 1\/4d. We have only a little heating stove totally unfit for cooking. And we are served out with our own rations which means that we have got to cook them. More than half of the pioneers are sick with dysentery, or a mild form of ptomane poisoning. Some of them are vomating. I had only a very slight attack & no vomating. I did not have any tea, only a piece of dry bread. \n\nFriday Dec. 22. 1916\n\nAs we had no cooking arrangements. I had only bread & jam for breakfast. It is raining this morning – a cold & miserable day. A lot of the Pioneers are still sick , paraded sick but could not find the doctor so again paraded before dinner, I was not among those who paraded sick. This evening I bought an electric torch for 4½ Francs 3\/9. \n\nI had tea outside tonight. Eggs & chips price 1½ frances 1\/3d\n\nSaturday December 23. 1916\n\nIt is showery this morning & yesterday I met Lieut Herring of Merrigum. He is in the 38 Batt. And looking very well. \n\nWe are now getting the London papers regularly. The Daily Mail Chronicle, Express & the Mirror are sold by French boys in the street who can speak very good English, & come into the convent, or rather barracks as it now really is, every morning with the papers. These are all ½d papers in England but here we have to pay 2d for them. The Daily \"Mail\" heads a vigorous reply to President Wilsons Peace note to the Allies with this quotation from Wordsworth. . \n\n\"We must be free or die who \n\nspeak the tongue \n\nThat Shakespeare spoke, the \n\nFaith & morals hold\n\nWhich Milton held. \"\n\nIt also quotes with approval President Lincoln‘s reply to well meaning people who called for a premature peace during the American civil war. \n\n\"The issue before us is distinct, simple, and inflexible. It is an issue which can only be tried by war and settled by victory. This war will cease on the part\n\nof this Government whenever it shall have ceased on the part of those who began it…. We accept war rather than let the Nation perish. \"\n\nIn that war Great Britain understood the gravity of the issue and steadfastly declined to intervene or to press on the United States ill – timed suggestions of peace. When another European Power did make such suggestion this was Mr. Seward‘s reply on behalf of Lincoln:\n\n\"This Government has not the least thought of relinquishing the trust which has been confided to it by the nation under the most solemn of all political sanctions, and if it had any such thoughts it would have still abundant reason to know that peace (so proposed) …. Would be immediately, unreservedly & indignantly rejected by the American People. \"\n\nThat is our position today . We could not better these words: and as in 1862 they conveyed no discourtesy so they carry none now. \"\n\n\"Daily Mail \" Dec 22. 1916\n\nI wrote to Cis to day. I also wrote to my wife letter 55 I also posted to her 2 post cards Verdun and a factory bombarded by the Huns, in a separate envelope. \n\nSunday December 24. 1916\n\nA nice day with beautiful clear sky. We are evidently going to get nice weather for Christmas. The sick Pioneers are much better today. J. R. Mathews had to report to the transport this morning for shoeing. \n\nIn an adjoining catahedral St. Vaust, there was an R. C. military service for 5 soldiers at 9. 30. Part of the cathedral is in ruins from German shells but it can be easily repaired. Today with N. J. Jorgensen I had a walk through some of the principal streets of Armentieres, as far as the Y. M. C. A. and canteen situated in a large French college part of which is also used as barracks for troops. They are capable of accomodating over (shorthand). On the way we passed many fancy goods shops and all seemed to be doing a good trade with the soldiers. \n\nTonight we received our Christmas parcels from the comforts fund in Victoria. My parcel contained a note from my wife dated Sept. 10. 1916. The parcel contained the following :-\n\n1 tin chocolates\n\n1 tin butter scotch\n\n1 tin ham & chicken paste\n\n1 tube tooth paste\n\n1 tin Lucey Hinton tobacco\n\n1 pipe\n\n1 packet pipe cleaners\n","111":" tin Plum pudding\n","112":" pocket handkerchief. \n\nThis is Christmas Eve but it does not look like it, There are very few signs of Christmas, except that the shops are doing a good trade and there was services in some of the churches. In the army the Christmas boxes reminded us of Christmas. \n","113":"\n","114":" Day:-\n\nA fine day. We were up late his morning as we had nothing to do. We had breakfast of bread & fried bacon, cooked by ourselves, and some of the dainties out of the Christmas boxes from Australia. In addition to that we had a packet of Nestles chocolate from the colonel and a Christmas pudding for dinner. It was an excellent addition to the stew. \n\nIn the morning I had 4 drinks of wine after breakfast at a neighbouring Estaminet with a soldier in B. compay. The landlady shouted cigars & a drink. Before dinner with the same soldier Sgt Major McFarlaine of A. company we drank 3\n\nbottles of champagne costing 6 francs a bottle, that is 5\/-. It was splendid and we thoroughly enjoyed it. After dinner with E. Handcock we went to the Y. M. C. A. in another part of Armntieres and enjoyed a free concert and a cup of tea and cakes. Coming home we had several drinks of French beer and wine, reaching home at 7. 30. Christmas day in France was very quiet, but on the whole I enjoyed myself occasionally we could hear our guns straffing the enemy in their trenches. In the morning a few aeroplanes were about, but our guns soon made them clear out. \n","115":"\n\nBoxing day. A fine day and not much doing. The sick Pioneers are now almost better. Our front was very quiet judging by the absence of noise. \n\nI bought a cigarette case this evening – a suvenier of Armentieres price 4 francs and 25 centimes. - 3\/6½. In the evening \n\nThere was a very good concert commencing at 5. 30 in the Y. M. C. A. but I did not go to it. Those who thoroughly enjoyed themselves. \n\n","116":" \n\nA dull cloudy morning but otherwise fine. I was not up until 8. 30. There was nothing to do, as we had another easy day. I went for a walk around the city in the morning with N. J. Jorgensen and saw many fine buildings and several factories whose tall chimley stacks were belching out smoke. We could hear the whir of machinery inside but could not get in. We also saw a church, or rather a cathedral that was badly damaged by shell fire. The spire was knocked off, the windows broken, and the roof badly damaged in places. We could not get in, but looking through a broken door we could see that the inside was badly damaged. \n\nIn the afternoon we had another walk around in a different quarter of the city . We visited the Y. M. C. A. had a cup of tea and inspected a comparatively new church of modern design, and was touched by shellfire. Services are regularly held in . It was beautifully fitted up inside, The stations of the cross common to all catholic churches were\n\nnot pictures but bold relief in plaster beautiful executed there was also a model of a manger with the infant saviour Mary Joseph & the two shepperds on the platform near the alter. All the churches & large buildings in Armentieres are of brick set on stone or concrete foundations. \n\nWhen we got back to the billets about dark the Pioneers that were in had left for Houplines leaving a note behind to that effect. We had some hot stew that was in a dixie packed up our kits when the two handcocks turned up also Sgt. Robinson, and marched down to Houplines in the moonlight. As the 39 Pioneers had not moved out we camped in another room had some Australian cocoa and went to bed. \n","117":"\n\nIt was very cold last night and when we got up this morning there was a thick white frost all over everything. \n\nWe removed into our old rooms, as soon as the other pioneers moved out. This was all we had to do before dinner and I took the opportunity to do some writing and reading. \n\nI forgot to say that yesterday afternoon I bought another souvenir of Armentieres – a silver neck chain - in a shop at 56 Rue Sadi Garnot\n\nopposite half past Eleven Square, and kept by the wife of a French soldier who is attached to out battalion as interperator – Georges Desercher. \n","118":"\n\nI got a letter from my dear wife last night dated Nov. 5 and numbered 29. also another this morning dated Nov. 12. and No. 31 & No 30 is not yet to hand . \n\nI was making wind vanes this morning, I was down in the trenches before dinner with a box of oil bottles to Head Quarters. . After dinner today there was a terrific bombardment by our artillery on the German lines. It is said that since Christmas, a new party of Germans – the Prussians – are in the Hun trenches, and we have no love for the Prussians. \n\nI wrote another letter to my wife today 57. I was on a new job this morning . I was in the drying room stoking three braziers to dry about 60 rain coats. The fuel was broken up furniture and pieces of old houses. \n","119":"\n\nA wet morning. There was a lot of rain last night. I was stoking the braziers in the drying room this morning to dry rain \n\ncoats. The Germans sent over several shells before dinner, and one of them fell in the back room two doors from the drying room. Evidently the smoke attracted them. I then let the fires go out, as per orders. After dinner I was doing a little blacksmithing making pointers for the gas alarm. Tonight I had a hot bath in a tub, and a clean change of clothes, the first bath and change since I came to France. Afterwards I washed 3 shirts 1 pair socks and a pair of underpants. \n","120":"\n\nNew Years Eve. \n\nThe old year is nearly out and the war is not yet finished but prospects of its early & successful ending are bright. The past year has been a very trying one and a momentious one in the history of the world and in the lives of the individual units of the waring nations. \n\nI have been a soldier for over 10 months now and have seen many and varied sights and travelled half way round the world, and they are probably many more sights , some pleasant no doubt and others reeking of war in store for me. \n\nOur artillery gave Fritz a very severe straffing last \n\nnight and again today at dinner time. No doubt they will fight the old year out and the New Year in. \n\nI got a letter from my wife this morning dated Nov18. No. 30. We were reveiting a trench today at the ammunition depot and when going to work after dinner 5 or 6 shells passed over out heads and landed near Port Arthur dump Those of the 39. who were in the vicinity were wounded. Our Artillery heavily shelled the German lines, putting in some hundreds of shells in quick succession. I watched them from the top of a trench and they ploughed through the enemies trenches throwing up mud, earth and timber to a great height. This was continuous all along the line, and systematic the shells dropping every half chain or so. \n","121":"\n\nNew Years day on the front is not a pleasant one, for there are many sad surroundings, such as dead men and wounded ones also. I saw one soldier taken away this morning dead. \n\nI sincerely hope that I will be spending my next New Year in Victoria. \n\ntogether with my wife and friends. It will be a pleasant change from here away from the strife and storm of battle. I saw the Daily Chronicle this morning and judging by all accounts the war will be over early this coming Summer: There is heavy shelling of the enemies trenches by our artillery as I write, the boom of the guns shaking the building I am in. \n\nThere was a raid by a section of our Brigade on the enemies trenches last night, but it was not successful. I hear that the raiding party could get no further than the barbed wire entanglements, which our artillery had failed to cut away. Artillery is the principal factor in this war and it will be won: and is being won by the artillery. Without preparation by the artillery the infantry has no hope. \n\nI paraded sick this morning & got some medicine for my colds & also to get my toe dressed. The nail is coming off it, caused by a horse tramping on it while at Romsey and the new boots I have got are too light. The only work I done this morning was to hang up some rain coats to dry. In the afternoon the Pioneers\n\nwere working in the trenches, repairing the sides near headquarters. We had a plum pudding for dinner today, - a gift from Australia, and there was ample for all and we enjoyed it very much. . \n","122":"\n\nA dull cloudy morning. Very like rain. About 10 o‘clock the sun shone out and it became bright and clear affording opportunities for snippers on both sides, a man in a working party of the Pioneer Battalion was shot through the head early this morning about 9. 00 we went down to the Head Quarters to finish repairing a trench. We were not there very long when the Boches sent over several shells falling very close to where we were working. One shell wounded a man in a working party of the 39 Battalion quite close to us and at a place where we were working a couple of days ago. As we could not finish our work, in fact I was ordered down off the bank of the trench where I was levelling a place for sand bags, we decided to go back to our billets until dinner time. \n\nWe got another issue of tobacco this morning. I forgot to say that we all got a tin of lollies yesterday. We were not in the trenches this afternoon and done a few little odd jobs at the billets. C. Handcock and I carried down to Head Quarters two boxes of Veri Lights. \n\nThe Germans continued to send over a lot of shells this evening, and as some of A. company were coming to tea caught the fire and 11 men suffered casualities. This was our unlucky day for the 37. Battalion. There was a total of 17 casualities for the day 5 of whom were killed, some of them being blown to pieces. Others suffered severe casualities. \n","123":"\n\nThe 39 Pioneers came in this morning and we moved out into another room. Today is very dull and cloudy. Our artillery is harassing the German lines. The 37. Battalion moved out this morning. We helped to remove Head Quarters baggage from the trenches to their position in the billets. \n\nThere was a terrific bombardment by our artillery tonight of the enemies lines. The Germans sent over a few tear shells. \n\nOur transport was down when the bombardment was on and they were in a terrific hurry to get away. \n","124":" A dull cloudy morning with some rain. The Germans last night with their shells caught some of the transports when they were returning to Armentieres. One man and two mules of the Pioneer Battalion transport were killed. Our artillery before dinner again severely bombarded the enemy. \n\nI got a copy of the \"Argus\" of Oct. 28. 1916 from my sister this morning. We are resting this morning as there is nothing for us to do. These notes are written with the \"John Bull\" fountain pen with tablets in dissolved in water. \n\nBetween 12 and 1 today during the bombardment the Germans started to shell our billets. One shell burst behind out billet the concusion smashing the glass in the up stair window at which I was sitting reading the \"Argus\" Other shells fell each side and over. I thought it was time to go below. A few chains down the street in front of the Engineers depot a few shells fell\n\nkilling two men of a working party. One of them being Lieut. Bruce & was a South Melbourne footballer. I witness the explosion and went round the corner for the doctor, when told that some of the men were hit. The 39 doctor went to render aid and had a narrow escape as at least 2 more shells fell about the same place narrowly missing the motor ambulance which was on the scene when the shells fell the view was entirely blocked with smoke and brick dust & falling dust. A few gathered on the scene, when one of them was hit with a flying misile and ambled back into the engineers depot crying out they have got me . A piece of flying brick hit me on the side the face although I was fully 3 chains away. The Germans kept this up for some time landing their shells further over to get some of big guns in this vicinity. We got into a strong room but hunger drove us out to the kitchen for dinner. Needless to say there was no rush to the kitchen, and as each one got their stew they made back for the dugout or the street. While I was\n\nin the kitchen a minney exploded out side . All had to help themselves as our cook was in the dugout. \n\nI heard today that the 40 Battalion had 39 casualities last night. While the 39 had none. Evidently the Boches have brought up some new guns for their fire is now more accurate numerous and continuous. This afternoon things have again assumed their usual quietness, except for the occasional booming of our guns. What makes our position so dangerous is that our artillery is placed behind us and are almost continually barking at the enemy. We are between the guns & the trenches and all shells friends & foe alike pass over our billets. If the Germans fall short they land in our billets. \n","125":"\n\nThings were very quiet last night. This morning is bright & clear and an artillery duel is expected. At 11 p. m. a few of our guns, as I am writing have started to speak at the enemy with no uncertain noise. \n\nLast night our transport had orders not to approach our lines with supplies as our billets were too dangerous. So we had to meet them further up the street, and carry our provisions down. \n\nWe had a visit from our O. C. this morning Mr Toule, his visit was to read an order from Head Quarters relating to signals & telephone wires, and also to enquire if we got enough to eat. \n\nInterior of the Basilic after the bombardment. Guerre 1914-15\n\nThere was intermittent artillery activity this afternoon. Tonight the Pioneers were on a fatigue party to carry rations, fuel etc. for the 40 Battalion in the trenches. It was supposed to be only an hours work but it took 3 hours from 5 to 8 o‘clock. There trenches fortunately were very quiet, no shells or minnies landing only rifle and machine gun bullets. The 40 Battalion have suffered so many casualities that they are very short handed. Hence the reason for calling upon Headquarters details for a fatigue party. \n","126":"\n\nA dull cloudy day. There was a lot of rain last\n\nnight but it is fine this morning. The front is very quiet this morning. \n\nBefore dinner we went up to Nieppe on the other side of Armentieres to the Baths. When we got there we found that we could not get in until 3 p. m. so we had dinner in the town at a neighbouring café, of chips & egg costing 1 franc & 30 centimes 1\/3. Then we had a look at a cotton mill where they were weaving cloth stout calico and a kind of light canvas. It was a very interesting process to watch the looms at work each in charge of a man or a woman. The threads running lengthwise were all fixed on a roller which unwound more thread as required. The cross threads were runs akross by a large wooden shuttle that ran backwards and forwards by a being knocked at each end by a rocking arm. the threads being raised alternatively by an ingenious device. The machinery was made in England. \n\nAt the baths we were casually examined by a doctor, and then proceeded to the Bath room. There there were large tubs of hot water 3 to 4 ft. deep and each capable of holding 12 men. Those who had dirty or worn out clothes got them changed. As mine were all clean & in good order I only exchanged my towel for a dry one. \n\nI heard yesterday that David McKean of B. company who accidently or otherwise shot himself in the foot was tried by Court Marshal and sentenced to 60 days field punishment. \n","127":"\n\nWe were up about 6. a. m. this morning, had an early breakfast and proceeded to Waitangi dump and awaited instructions. We found that we were fatigue for the trench mortar Battery and with the stretcher bearers had to carry up 40 plum puddings 2 per man to the front line of trenches in the sector occupied by the 40 Battalion. The plum puddings weight about 50 lbs each consists of a big round ball filled with alemite and to which is attached a long iron spindle about 2ft x 2 in. to fit the mortar. \n\nWe had a long weary tramp through the trenches to the front lines and in places where the trench is damaged had to walk at a stoop carring the missle in our arms. A few bullets whizzed over our heads at these low places and were unpleasantly close. Evidently the Germans saw us, As we could only carry one at a time, we had to make two trips of it. We were back early and got a cup of hot cocoa at the Brigade canteen This cocoa is ready every morning and is issued free. \n\nYesterday I got the Portland \"Observer\" & the Hamilton \"Spectator\" supplement from my brother. Yesterday afternoon we were paraded to the Breweri (Brewery) to be paid. I was paid £1. 8. 8 40 francs in French money. \n\nWe are always paid in French paper money. l got 4 ten franc notes. \n","128":"\n\nWe were again up early this morning to act as a fatigue to the Trench Mortar \n\nBattery. We put on gum boots and assembled at the Waitangi dump. There were only 5 pioneers required . We drew lots who were to go\n\nI was among those who had to go and carry trench mortar ammunition to the front lines. But in a different sector to yesterday. We had a worse road through mud and water. That part of the trench which goes through an orchard is badly knocked about. In some places it is completely blown away. As some of the fatigues disappeared after they had carried up the first one, the remainder had to go back again with more shells. All this time the germans were either shelling the billets, or the trenches contrary to their usual practice, they opened fire first thing before our artillery started. Usually they keep quiet if let alone. Our artillery took up the challenge and intermittent artillery activity continued all the forenoon up to dinner time. This morning was the most unpleasant time and also the most riskey that I ever had in the trenches. It was after eleven when I got back to the pioneer billets being the only pioneer who stuck to our job until it was completed. The others were already at the billets and said they got lost\n\nthe guide not knowing the way, and eventually disappeared. It is significant that the lost pioneers did not report at the ammunition dump when they got out of the trenches, but cleared off. The stretcher bearers and machine gunners constituted the remainder of the fatigue party. The machine gunners were game, particularly Fanagele, who showed not the least sign of fear. In fact he was fool hardy and took unnecessary risks . On our way back we had a cup of hot cocoa at the Brigade Canteen. \n\nThis afternoon our bombardment continued of the German lines for several hours. Part of our Batttalion went back into the trenches today, the remainder goes in tomorrow and the 39 comes out. Already 2 of our men have been killed. \n\nWe received our stored rations for two of our companies tonight. I saw Sgt. McNicol yesterday, It is the first time I have met him since I have been in France. \n","129":"\n\nA dull cloudy morning . The front is very quiet only a few shots to be heard. Again we carried up\n\nammuniation to the trench morters in the front line without any mishap, to L. section through Wessex Avenue. I was one of the lucky ones and only had one to carry up. Our Battalion went into the trenches this morning. After dinner the Pioneers had to remove H. Q. stuff from chatto row to the Battalion Head Quarter in the trenches . When we were coming back several shells fell near the two handcocks. \n\nThe London papers of yesterdays date announce that the Portuguese are now in France with a strong force and after some training in modern trench warfare will go into action. \n\nI got a letter from cis last night dated Nov. 10. 1916. \n\nThere was a terrific bombardment of the enemies lines by our artillery tonight soon after dark. The bombardment lasted about an hour and fully 1000 shells were fired. The Germans retaliated by throwing minnies into our trenches. The London papers of Sunday and of Monday announce the floatation of a new British loan of £500,000,000\n\nthe prospectus of which will be available next Thursday Jan 11th. \n","130":"\n\nA dull cloudy day. During the past few days the weather has been very cold and frosty both day and night. \n\n6 of the Pioneers last night had to get up in response to a call and go down to the front line of trenches and repair them where a shell had blown in the side blocking communication. I had not to go and knew nothing about it until this morning. \n\nThis morning I saw one of the Dookie students named Williams. He is in the Engineers and has been in hospital lately. While there he met Harry Ryle the former gardner at Dookie college. \n\nThis evening we had to carry up to Head Quarters 10 boxes of ammuniation, 10,000 rounds When we got half way we had to put the boxes down and turn back owing to the heavy straff that was going on. Later on we got them up without mishap. This afternoon there is intermittent artillery activity by our Batteries\n\nAt Chateau row - Battalion H. 2 when out of the trenches – a shell fell making a big hole \n\nin the ground and killing Captain Tyrell of the 40 Battalion, this morning. \n","131":"\n\nIt is very cold and frosty here as a rule, but this morning there is a light fall of snow, and therefore the front is very quiet. But in clear weather it is almost continuous activity, with shells screeching overhead and sometimes bursting around us. Our work takes us everywhere sometimes in the fornt line of trenches, sometimes in the rear of the trenches but generally speaking the trenches are as safe as anywhere, It usually takes about an hour to go up to the front line and back, and when one has carried up a plum pudding weighing about ½ cwt, through winding tenches and frequently through mud and water up to the knees, he has got up a good sweat, and two trips is a good mornings work. Usually there is flying schrapnel and minnies, and whisbangs coming through the air, and they prevent loitering on the way. But we are not always on this kind of work. Our duties are variable and covers\n\neverything from making crosses to shoeing horses and mules. We are soldiers , mechanics, repairers, engineers and labourers. The pioneers are expected to do everything and anything and so far have always come up to expectations. In the course of our duty we have had some narrow escapes but so far have been very lucky. We can usually hear the shells coming and generally have time to duck. It is when there are a number coming in quick succession and falling in all directions that the times are strenuous and puts the fear of God into the most hardened sinner, and the army has more than a fair share of callases and brazen sinners. \n\nThis morning Jorgensen and I took up some parcels to Headquarters. When we came back all hands cleaned up the billets as an inspection by the Bridiger is expected. \n\nI wrote to Cis this morning\n","132":"\n\nA dull cloudy morning. There was a light fall of snow last night, and again this afternoon. It is exceedingly cold. There was very little\n\nartillery activity last night and today. \n\nThis afternoon were in the trenches fitting up a dug out in the side of a trench to store jars etc in. It got too late to complete it so we came back to our billets. Tonight our sector is very quiet but north of here towards Ypress there is a concentrated bombardment enormous in intensity and lasting several hours, followed by a great silence, as is usual after a gigantic bombardment, when hardly a shot is heard . During these periods of bombardment our heavy guns have thrown high explosive shells upon the enemy‘s positions previously registered as centres of traffic or as places where enemy working parties take advantage of the fog or the night. The results of the firing is not known at the time, but later our aeroplanes get up & can see the effects of these explosions, the destruction of strong points, the upheaval of gunpits, the flattened trenches, and the destruction of communications. But the awful casualities are not known. The distance and the fogs and mists prevents us taking toll of the dead and the wounded. \n\nThe enemy strong in trench mortars, replies by concentrating this form of artillery upon short distance targits – our front line trenches & supports, but our strong arm of defense and attack our heavy artillery & he is powerless to injure or to silence. Fair weather or foul, the enemy has no rest and our guns are constantly hurling forth death and destruction. No wonder Germany wants peace. These sudden bombardments are often followed by a raid upon his trenches, quickly carried out. This makes him nervous, and he fires spasms of rifle & machine gun fire, for no reason except that of fear. \n","133":"\n\nA very dull morning, with cold sleety rain. Things are fairly quiet after the heavy bombardment last night, but tonight about 4. 30 it recommenced \n\nagain but only continued for a little while. We had very little to do today. All I done was to carry up a box of Verie lights to Headquarters. \n\nI finished reading a book called \"Hard Luck Hamilton\" by Allen Dean. It is a capital story of hairbredth escapes and adventures of a famous footballer. It is interesting from start to finish. \n\nOnly one transport limber came down tonight bringing rations only for headquarters as the company is going out tomorrow. Tonight about 9. a. m. our guns commenced a terrific bombardment of the German lines which lasted about half an hour. \n","134":"\n\nA cold frosty morning. The 37 Batt. came out of the trenches today & the 39 went in. The Pioneers moved out to day to Half Past Eleven Square to our old billets in the convent. I was 4 times down to the trenches this morning removing H. 2. Stuff and it was 2. O‘clock when I got to our billet and then I had to get dinner. \n\nIt is exceedingly cold this evening. I saw by the papers today that the New War loan is a brilliant success and that the allies reply to Germany has created a very favourable impression in America. \n\nI got a letter today from my wife dated Nov. 26 No 33\n","135":" \n\nA cold morning but fine. There was no rain last night or today. We were all up very late about 8 o‘clock. We are supposed to be resting, nevertheless we expect to get some fatigue work to do. Today I bought a table centre 4½ francs and a cushion cover 22 francs and posted them to my wife through the shopkeeper who will get them censored and registered in the morning. The shopkeepers name and address was ;\n\nA. Dervailly – Rolland\n\n33 Rue de Dunkerque\n\nArmentieres\n\nThe table centre was linen and the cushion cover silk costing in English £1-0-10. \n\nBefore dinner I went up to the quarter masters store & got my boots 8\/4 changed as they were too narrow for a size wider 8-5. \n\nWe are to stay here until the 39 Battalion comes out of the trenches - then we are to go to a place called Steenwerck for a further period of training in bayonet drill & other specialities. I heard tonight that our Battalion has had about 100 casualities including 10 killed. I wrote to my Father tonight. \n","136":"\n\na dull cloudy and misty morning. Very like rain. There was a little snow last night. We again had a very late breakfast this morning, between 8 & 9 o\t‘clock. \n\nHead Quarters details got paid this morning. I was paid 40 francs in two 20 franc notes. £1-8-8 in English money. To our great surprise we got a packet of \n","137":" presents, marked \"With Christmas Greetings from Citizens War Chest Fund N. S. Wales Division of the Australian Comforts Funds. A. I. F. 1916. B. E. F. \n\nThe box contained two packets of Barratt & Co‘s Peppermint Bulls‘ Eyes lollies, 1 packet spearmint, 1 pipe, 1 tube toothpaste, 1 tooth brush, two boxes matches ,1 match box case, writing paper and envelopes, & our Australian comic Post cards 2 kharki handkerchiefs, and two packets cigarettes. \n\nTonight I received a letter from Miss Irene Ring dated Nov 19 I sent her a post card \"Souvenir of France\" I also received another letter from my wife dated Nov. 24 and numbered 32. and sent her a silk post card in answer. I also sent a silk P. C. to my mother and another to Cis. I also sent a P. C to\n\nEileen Ring (Nel)\n\nMarionvale school\n\nVictoria. \"Souvenir de France\"\n\nWednesday Jan 17. 1917. \n\nIt is snowing this morning. There is 3 or 4 in of snow on the ground. I sent a post card to my little niece. Maggie Hittson \"The Cross of the Allies\" I also\n\nsent a Post Card to my Father. \"The Star of the Allies. \" That is 7 silk post cards in all. \n\nToday I received a copy of the Portland Observer dated Nov. 9. 1916. giving a report of the Exemption Court held at Portland. \n\nThere has been very light fall of snow all day until about 4 o‘clock when it was almost imperceptable. I bough a silver neck chain & a small cross for my wife today from Georges Devarcher 56 Rue Sadi Garnot Armentieres, price 6 \n\nTonight I signed an army form for a new book to be issued in 8 parts and entitled \"Australia in the Great War\" price 5\/- The Publicity Department of the High Commissioner‘s Office will make arrangements for the packing and posting of each part to my wife. \n","138":" \n\nWe were up about 5. 30 this morning, had an early breakfast & were ready to march off at 7 o‘clock. The trasnsports carried our packs. Our blankets we carried horse collar fashion. We marched away from Armentieres, across the bridge over the river Lys, passed\n\nthe baths, through Nieppe and to the rest camp near Steenwerck. Before we got to the camp we had a long weary wait on the road to allow other Australian soldiers to move out. We reached the camp easily before dinner which was stew cooked by the H. 2. cooks. It was inferior to our own cooking. \n\nThe Colonel who has been away indisposed, turned up at the camp at dinner time. Last night several of the pioneers had a gay time at one of the Estaments drinking French bottled beer at 6d per bottle. It is a great improvement on the draft beer. \n\nAs J. R. Mathews is now on the strengtrh of the transport, a new man was put in his place, Earnest Carter, he came over in the third reinforcements. \n","139":" \n\nWe slept very comfortable & warm in the huts last night. They are like a round tank on its side being constructed out of curved galvanized iron which serves for sides & roof. They are about 18 ft wide 30 ft\n\nlong. They would hold 25 mean. There are 20 in our hut. 11 pioneers and 9 sanitarymen including their corporal. Too good. \n\nNo one can go out of this camp without a pas and we must be in not later than 9. 30. Three of us were out last night. We went to an Estanment on the cross roads to Steenwerck and had a few drinks. Todoay we put up a new cook house for the officers mess, and pulled down the old one. It is only a small affair 4 posts in the ground, curved iron for a roof, and lining boards for sides. \n","140":"\n\nThere was a very heavy frost last night. The mud is all frozen hard on top , and there is ice on the water in the drains. It is much better than the mud and slush. \n\nThe pioneers had a new experience last night. The new recruit Carver, went out early in the evening and came home late very drunk and quarrelsome. He first started in the Sanitary section, and then started reciting a doggrel rymes. We counted him out whereupon he turned\n\nupon the pioneers and praised the Sanitary Section. He talked for a long while when suddenly he warned the Sargeant that he was going to be sick, and was subject to fits. He wanted to get up and was helped outside and immediately had a fit on the duck board. When he came to he was carried inside and had 4 more. The doctor was sent for, gave him some medicine and wanted to know what he had been drinking. He replied \"coffee\". He was so bad that the doctor ordered him to be sent to the hospitale. Before he went he made his will in his pay book, the sergeant writing it out for him. I believe he is to be removed from the pioneers as he is no use to us. He had an operation performed upon his head, is fond of the drink and is subject to fits. \n\nToday we could hear the big guns booming in the distance. We had not much work to do today, a little carpenters work and repairing duck boards. \n","141":"\n\nIt was very cold and frosty last night. The mud is now frozen hard. I got a letter from Kithy Gilmore last night and 2 fresh papers. I also got a letter from my wife today dated Dec 1. And written from the Lakes. They have a good season there and at the time of writing there were hot winds. \n\nThis morning we put up a new latren for the officers with an iron roof and canvas sides. Tonight I got a pas and went out and had a feed of beefstake, eggs and chips costing 2 francs and 2 ct. \n","142":"\n\nCold and frosty last night, but otherwise fine. There was heavy artillery straffing of the enemy last night. The boom of the big guns could be heard and their flashes in the sky could be seen from this camp. \n\nLouis Raemackers the Dutch cartoonist writes in the weekly dispatch of yesterdays date expressing his fears of a German invasion of Holland by way of Flanders in quest of good stuffs, and in the hope\n\nof gaining another strategic victory and using the dutch ports as submarine bases \n\nfor an attack upon England. The dutch are well prepared and have a number of 420 millimetre (16¾) guns held in readiness on the frontier near Maastricht. \n\nThis afternoon there was a prolonged artillery activity of the enemies position, within hearing of this camp. This evening Private Knox from Dookie received a letter telling him that Paddy Shelton one of the farmers on the college died from wounds received in France. \n","143":"\n\nThere was a very heavy frost last night and this morning the ice on the drain where we wash will bear the weight of a man on it without breaking. The heavy straffing of the enemies lines by our artillery continued last night until a late hour. \n\nThere are several rumours about today. One is that part of Hoaplines has been shelled by the enemy and that Wessex Avenue has been partially destroyed and the German front line trenches blown out of existence and prisoners\n\ncaptured. Also that the Colonel and a number of officers of the 36 were killed in the trenches by a shell. \n\nI got a copy of the Weekly Times from my father yesterday\n","144":"\n\nThere was another keen frost last night. The ice is now strong enough to walk on it on any of the drains. It is now 236 days since I left Seymour camp, the day we left and today inclusive. My deferred pay now amounts to £11=16=0. I have drawn £14\"19\"9 up to the last pay day, including 10\/- from the Romsey school of Farriery, and 15\/- forfeiture A. W. L. \n\nToday is nice and bright and there are a number of aeroplanes about, and this afternoon the guns can be distinctly heard, bombarding the enemy. We were shifted from our hut in the third line to No 6 hut in the first line. \n\nPresident Wilson in a speech to the Senate formulated his views on the war and the terms of peace. He thinks there should be no victory. The London papers do not agree with him, and think that Germany should be put in such a position that she\n\nwill not again be a menace to the world. Peace without victory, would leave the old Germany on an equality with the allies, whereas we want a new and humbler Germany with loftier and saner views. \n","145":"\n\nFor the past few days there has been presisent rumours out our Colonel leaving us and going back to Australia owing to indisposition. Yesterday after dinner he left here to go to England. He has insomnia and bronchitis and although he is a very big man, it appears that he is not a robust man. I hope he will soon get better and come back to our battalion, for although he had his faults his bark was always worse than his bite. We might get a lot worse, He was a capable man and a fair man. He was outwardly rough and very stern but had a kind heart. \n\nLast night Headquarters details were paid by Lieut -----. I received one 20 franc note 14\/4 in English money. We were also issued with pallaises which we filled with straw. It is a \n\ngreat improvement on the loose straw as we can keep out huts cleaner. As it is our hut gets dirty enough for we use it as a work shop and also eating room, as well as bed room and living room. There was another severe frost last night. The ice is over 3 inches thick on the drains, and there is not a trace of mud to be seen anywhere. Everything is frozen hard and solid and the roads and ground have every appearance as if it was the middle of a hot summer. The rattle of vehicles can now be heard where a week ago the roads were a quagmire. The intense cold has made a wonderful transformation on the whole landscape. Canals, ponds and drains are now skating rinks and one can walk about anywhere dry shod. Our boys often go skating and there has been many falls on the slippery ice one fellow getting a broken arm and another a broken nose. \n\nToday we painted the wheels and wood work of the water carts and cookers with wood preserving oil, while the carpenters were\n\nBusy making latieen seat and fitting up a canteen. \n\nAll day long from early morning until late in the evening French girls are on the road and on the edge of the lines selling chocolates hot buns and lollies to the troops. They seem to take no notice of the cold but of course are well wrapped up. French boys are in the lines at breakfast time selling the ½d London papers. They charge 2d for them and they are a day old. \n\nOur doctor Captain Yule went away a few days ago to a base hospital to get a share of the practice and experience to be obtained there. He is relieved by captain \n","146":"\n\nExceedingly cold and frosty last night and today. General Semack inspected us today, He was accompanied by the Bridiger. Soon after we got instructions to pack up. Fold our blankets in marching order ready to move. We had a hasty dinner and got ready. As I had very sore feet I was put on the baggage guard so as to get\n\na ride. By tea time we had no instructions when to move, so we had tea. The Lewis gunners & bommers had moved off early in the evening & there was a rumour that we had to relieve another battalion in the trenches at 12 o‘clock. During all this time my feet were getting worse & I could not stand on my right foot after tea. So the Sargeant had me carried to the doctor, who prescribed whale oil, as it was a case of trench feet. C. Handcock was put on the baggage guard. Instruction came through that we were to move off at 9 o‘clock. As my foot was now badly swollen the pain intense & I could not get the boot on, the Sargeant saw the doctor, & he decided to send me to the hospitle. About 8. 30 the motor ambulance arrived and with two others I was taken to the hospitle at Steenwerck when I got there I had a long wait in the receiving room before being taken to the ward & put in bed D27. My feet were dressed with whale oil and wrapped in cotton wool. \n\nWhen I was I the receiving room a man was brought in whom the driver of another van found on the road. He was badly cut about the head and had been missing\n\nall day from A. company. He was dressed & bandaged later on when taken into the ward. \n","147":"\n\nI feel much better today my feet are not so painful. I am in bed all day and was given a small bottle of Guiness Stout at dinner time. \n\nToday is the Kaiser‘s birthday & according to the papers there will be no celebration in germany. And a dinner in honour of the occasion in Berlin will consist of the usual ration allowance, no wine will be permitted only beer. It will be a very sombre affair in accordance with the prevailing distress and misery there. \n\nThere is a gramophone in this ward, and it has been going all the afternoon . Most of the patients in this ward have trench feet. \n","148":"\n\nVery cold & frosty all day. The sky is clear & bright. My feet are much better and I rub them with whale oil 3 or 4 times a day. Of course I am in bed, as rest is essential to a cure. \n\nI saw one of the 11th field ambulance men who came on board the Ferrie at Cape Town. He is in this hospitle with sore\n\nfeet but goes out this evening to his own hospitle. He was fined £2 and 7 days detention for missing his units boat at Cape Town. \n\nNear this hospitle there are a number of anti air craft guns. Yesterday they got 2 german aeroplanes one fell near Armentieries. \n","149":"\n\nThe cold last night was arctic in severity. Some nights 20 degrees of frost have been registered. Today is fine but intensely cold. . This morning 13 patients were discharged or transferred to other places from this hospitle which is known as the 3rd Division Rest Station A. I. F. \n\nA platform was rigged up in one corner of this ward and a concert held this afternoon. The programme was a good one and consisted of songs, duets, pianoforte selections and ventriloquism. The officers were present & the chief M. O. was chairman. \n\nThe cold weather makes us all eat well,& we are always ready for our meals. I had a bottle of Irish stout for dinner today\n","150":"\n\nThe cold wave continues, the \"Daily Mail\" says all\n\nEurope is in the grip of the front, & the weather has been the most continuously cold & severe for 22 years, and the bitter East wind chill persists. In Holland the waterways are blocked with ice. A number of Danish & Swedish harbours in the Cattegat & Baltic are ice bound. The Southern end of the Sound was completely frozen over. The Paris canals are covered with ice 1 in thick. An icy Eastern gale swept over th Eastern Counties of England freezing up the ponds & rivers and driving the wild fowl inland. The swans left the frozen waters & sought food at the houses. The lakes in the London Parks were frozen over & skating the first time for 5 years was prevalent. The greatest snow storm known for 25 years swept over Ireland being particularly severe in the West & centre. Some towns were completely isolated from the country & even trains were stopped. Such is the severity of this European winter, the worst know for many years . The war goes on all the same. The\n\nground is frozen iron hard, & the walls of the trenches that a week ago were in a plastic state oozing water are now as solid as rock, and as dry as they are hard, while no mans land is a white mantle of snow frozen hard. \n\nThe shells are now more deadly, instead of burying themselves in the mud, & much of their energy expended in throwing up geysers of mud, they explode on the hard surface spreading death & destruction in all directions within their range. \n\nIt is considered marvellous that the Australians stand the cold so well. All day long the temperature is never above freezing point, but there are numerous cases of trench feet for it is not possible to keep them warm, though all wear two pairs of socks, but with the continual contact with the cold ground the boots get icy cold. \n\nOn the 25 another white star liner the Laurentic used as an auxiliary cruiser was sunk by mine or torpedo off the\n\ncoast of Ireland. 125 of the crew were saved. The Russians have met with some successes near Riga & on the Rumanian front, It is now the turn of the tide & I fully expect that there will be a continued series of successes for our allies on the Eastern front until the Hun is brought to his knees. \n","151":"\n\nThere was a fall of snow last night, & it continued to fall lightly until dinner time. The doctor put another forment this time on my left foot, as it is now worse than the right one. He also got another doctor (an English one) to have a look at it. \n\nSgt McKaphie of the Signallers came into this ward this evening suffering from boils. Joe Carrol of the signallers is also in this hospitle but in another ward. \n\nBrigade Major is now in charge of out Battalion in place of the colonel who is in England indisposed. A raid a few days ago by our Battalion was not an unqualified success for we lost \n\n20 men two sargents & Lieut Power who used to be a sargent in B. Company . They however inflicted considerable punishment upon the enemy. \n\nThere is not much war news in the papers today . An old french lady comes in every morning selling papers. She charged 2½ for the \"Morning Post\" a 1d London paper. When I asked for a reduction because I was a regular customer she replied \"No compree\"\n","152":"\n\nA bright clear day, but very cold. The snowing has ceased. About 1 o`clock there were several enemy aeroplanes about. Our guns fired innumerable shots art them but they failed to hit them. They were so high. Our shots had the effect of keeping them high & so preventing them observing. They were dispersed by our own aeroplanes coming on the scene. \n\nToday I went for a walk for the first time since I entered the Hosphile. I went round to the canteen. It is opposite a very big church with a high spire. As the door was open I went in and had a\n\ngood look around. It is beautifully fitted up inside and is capable of holding I should judge close on a thousand people. It is fitted with chairs instead of seats ,& they were all placed facing the wrong way round. It was fitted with many fine statutes & the usual pharnaphela common to all catholic churches. There were also 4 confessional boxes 2 on each side, and also a life size model of our Saviour in the manger, with his mother, Joseph, & the sheppards, and in the stalls were a donkey & a cow. It would attract more than passing interest. \n\nBefore I went back to the hospitle I had a good feed of eggs and chips & a cup of coffee costing 1½ francs. \n\nI met Sargeant now Lieut. McNicol, I congratulated him on his promotion. He wishes to be remembered to friends when I am writing home. I met Joe Carrol who is in another ward suffering from bronchitis & rhumertism. I forgot to say that Lieut McNicol is attending a school in Steenwerck. \n","153":"\n\nIt is icey cold today. But the sky is clear & the sun is shining brightly, but it is yet so low in the heavens that it has not much effect on the temperature. \n\nThe papers announce today that Germany intends to sink hospital ships alleging that they are used to convey troops & munitions. She also boasts that she has sunk over 4 million tons of allied shipping over 3 million of it being British. \n\nThe woman & a man have been arrested in England on a charge of conspiracy to murder the Premier & Mr Henderson. Mr Long in a speech at a war loan meeting said England intended to hold the captured German colonies. The \"Daily News\" thinks the announcement was ill timed. Its omission in the note to President Wilson was the in America for some previous tributes to the disinterestedness of Great Britain. \n\nI had dinner in the large tent or marque today for the first time, because I was able to walk about with the boots on. Then I went over to a neighbouring Estaiment, had a good warm at the stove and a few beers. I then went to the Canteen and bought\n\na quarter lb tin of Three Nuns Tobacco for 2 francs 7½. Also a small bottle of ink for 3d. It was frozen hard and I had to melt it on the stove before I could put it in my pen\n","154":"\n\nIt was cold as usual last night, but today the sky is clear and sun is shining brightly. The papers are all filled with horror at the announcement of Germany`s war on the world ships contained in a note to America. Neutral vessels are to be sunk at sight, and neutral countries threatened with ruin & starvation. All the allied waters in Europe to be closed to all sea traffic. Mines will be used as well as submarines, an insulting concession is made to America. Viz. a passenger steamer will be permitted to ply weekly between Falmouth & the United States, arriving on Sundays and leaving again on Wednesday. It must take a specific course and be painted a specific design. Holland is given the privilege of one paddle steamer a week to England. American opinion is ablaze irrespective of\n\nparty or attitude towards the war. The New York \"World\" declared that the note is \"in effect, a declaration of war against the United States. \" New York Harbour was sealed throughout Wednesday night by American war ships. Vessels were allowed to leave yesterday at their own risk. All the newpapers are unanimous including those that were pro-German , in denouncing the german intentions, and demand at once a definate announcement of U. S. attidude. \n\nI had another walk around today, and visited the Y. M. C. A. I brought back a loaf of French bread and a tin of sardines, which we had for tea, in addition to our ration of ham and bread and beetroot. This is the first time we had ham for tea. \n\nWe were served out with an additional blanket tonight. A gift from Australia, by the Red Cross. The blanket bore a ticket, cotton & wool made in France. This is only an instance how money and energy is wasted in the army, and by well intentioned folk. Had the money been sent to\n\nFrance to purchase the blankets, the freight to and from Australia would have been saved . \n","155":"\n\nA beautiful day. I had a warm bed last night. The extra blanket made all the difference. There was another heavy frost last night. The old lady with newspapers has not turned up this morning, although it is long past her usual time. We fear that she is not going to come. After dinner I had a walk around the town discovered a watch maker and got a new glass and a hand on my watch costing 6d. \n\nI tried to get a newpaper, but failed. I was told there were no trains this morning. We had no papers last Sunday. \n\n I bought a small book of French & English words price 4d. \n\nTonight Sgt. McKay and another patient from the 11th machne gunners and I went out to tea. We had chips, 2 eggs and beefsteak, bread & tea . A good feed for 2 francs 1d\n\nWhen we came back Charlie Cunningham was in the Hospital suffering from a frost bitten toe. He informed us that the pioneers are in the front line trenches on another sector on the right of Hooplines. The companies are away at raiding school, & the trenches are held by Head Quarters Details. In a raid by our Battalion before leaving they lost a number of men that I knew very well. Fred Neal formerly of the pioneers is dead or missing and Pte. Hooper of D. Company died at the dressing station. \n","156":"\n\nA dull cloudy morning with a little misty rain. C. Cunningham is to go on to another hospital at Balieul as he is likely to loose his big toe. \n\nThe papers this morning say that America has suspended diplomatic relations with Germany . War is likely. I expected to go out this morning but the doctor said it was better to stay another day. . I had a walk around after dinner today. \n\nWe went out again to night and had a tea of beef steak , eggs & chips which we thoroughly enjoyed. \n","157":"\n\nA cool frosty morning but the sky is clear and the sun is shining brightly but it is so low in the sky that its rays has little effect on the temperature. \n\nThe Sunday papers from London arrived this morning. They announce that the United States have severed diplomatic relations with Germany and that war is imminent. The next few weeks will be momentous in the history of the waring nations. Washington has decided to hand passports to Count Bernstorff and to recall Mr. Gerard. Whether there will be an actual declaration of war depends upon Germany`s conduct. Coming events will be fraught with the most important consequences in the progress of the world war. The decision of other neutral nations , especially Spain and the S. American Republics will be watched with the greatest interest. It is\n\nstated that U. S. A. is prepared for any eventuality. \n\nI was greatly surprised that I had not to go out this morning to the reinforcement camp, but the doctor, the major, said to leave in another day. I am not sorry. \n\nI had tea in the marquie this evening of boiled rice, bread & butter & hot tea. The tent is frightfully cold and their is no tempetation to linger over one`s meals. \n","158":"\n\nVery cold this morning, the sky is clear and the sun is shining brightly. There is a cold E. N. E. Wind. Yesterdays papers confirm the news of America`s \"break\" with Germany. Vast preparations are being made in the event of war. America intends to carry on the war on a vast scale if forced to join in. \n\nAt 2 o`clock I was paraded with others and marched to a rest camp about half a mile away. Here I will remain for a few days before rejoining my unit. The rest camp consists of wooden huts with two decker beds I received a single bed on \n\n top. There was a very heavy frost last night and the hut was very cold despite the stove. Each hut holds 56 men. \n","159":"\n\nVery cold this morning. I was up about 7. a. m. paraded to the doctor as my heel was very sore. At 10 o`clock we were paraded to the baths. I thoroughly enjoyed the showers, the first for over a month. \n\nThere is not much news in the papers this morning. I went out at dinner time and had 2 drinks of beer at an estaminet near railway station. \n","160":"\n\nIt was exceedingly cold last night and this morning. There is 1 ft. thick of ice on a pond near the camp. There is a whole made in it with a pick to get water for washing. \n\nI paraded sick this morning & got some whale oil for my feet and a dose of medicine for my cold. There was an inspection this afternoon, and we had to clean up the billets for it. The food is very poor here, caused chiefly by poor cooks being on the job\n\nThere was some very heavy straffing last night and again this afternoon by our artillery. We can distinctly hear the boom of heavy guns in the distance. I have not been able to get a paper today anywhere. Tonight I paid a visit to the hospital to see my mate Sargent McKay and others. They will not be out for a few days yet. They are getting on splendid. I brought them a few chocolates. \n","161":"\n\nVery cold this morning and today. We had an early breakfast and a poor one. We then packed up out kits and at 9. 30 about 20 of us marched into Armentieres, arriving here about 12. 30. It was a long weary march for those coming out of the hospital, especially those with sore feet. I had my full pack to carry. We had dinner at the Quartermasters store about 1. 30. and we, ,this is the other man from the 37. Battalion. Private Kidman thoroughly. Those who marched into from the hospital comprised men from several other Battalions. \n\nHouplines is 2 K7. from half past Eleven Square and Frelinghen 5K. 3. \n\nSunday Feb. 11. 1917\n\nLast night Lieut Cerity asked me to stay the night as he had some work for me to do. I did so, & was glad of the chance to stay . My company came out of the trenches last night. I went up to see them this morning, and got one letter from Kitty Gilmore at H. 2. Post office today I got a letter from Willie dated Dec7. & written from Military Camp Maribyrnong. Also one from Cis dated Dec. 8. and two from Lizzie dated","162":" and 7. and numbered 35 & 36. I was cleaning out the Q. M. store today. \n","163":"\n\nThere was a light fall of snow this morning when I got up about 8. 30. Last night there was a heavy and continuous artillery activity by our artillery commencing about eleven o`clock and continuing for several hours. There was a raid on, and I heard this morning that it was successful, prisoners and a german officer being captured. \n\nI done a little fatigue work this\n\nmorning. Kito of D. company who came out of the hospital with me left after dinner to rejoin his unit. \n\nThe \"Weekly Dispatch\" of yesterday says that German U. Boats have sunk 81 ships since the first of this month. \n\nTonight I received another parcel from my dear wife containing 2 plugs of dark Havelock tobacco and 2 plugs of light Havelock tobacco. I very much appreciated them as they are a delightful change form the issue tobacco, which is generally of inferior quality. \n","164":"\n\nA dull cloudy day looks like rain. This morning I cleaned up the billets here and the store. \n\nI have received up to the last payment Jan 24\/17. £14-14-1 less forfeiture 15\/- for being absent 3 days without leave. In the afternoon I was helping H. Quarters cook. \n\nWednesday February 14. 1917\n\nA nice clear day but rather cold. In fact it is freezing again. Last night I wrote to Kithy Martin and to Cis. This morning I was agreably surprised to get 5 letters from my dear wife, dated Dec. 10 numbered 37. ","165":" No 37. \n\nDec. 17. No 38. Dec. 21. No 39 and Dec 21 No 40. \n\nI was very sorry to learn that Lizzie`s mother passed away at Merino on Dec. 17. \n\nIt was not a surprise to me as she had been in very indifferent health for a long time, and Lizzie was constantly telling me that she was continually getting worse, though rallying occasionally, but only again to get worse. I wrote to Lizzie today. a letter of sympathy 3 pages. Also a short description of the place. \n\nOur Battalion is out at present, being in various training schools for some time,. A section of our Battalion mostly H. 2. details and some men from the 38 Battalion have been in the trenches as one unit and known as X Battalion or company. Some of them are going back into the trenches tonight, and some tomorrow. The Pioneers are in hopes that we will not have to go in this time, unless it is as Pioneers. \n\n"}}