{"Document Name":{"0":"Diary_0441","1":"Diary_0441","2":"Diary_0441","3":"Diary_0441","4":"Diary_0441","5":"Diary_0441","6":"Diary_0441","7":"Diary_0441","8":"Diary_0441","9":"Diary_0441","10":"Diary_0441","11":"Diary_0441","12":"Diary_0441","13":"Diary_0441","14":"Diary_0441","15":"Diary_0441","16":"Diary_0441","17":"Diary_0441","18":"Diary_0441","19":"Diary_0441","20":"Diary_0441","21":"Diary_0441","22":"Diary_0441","23":"Diary_0441","24":"Diary_0441","25":"Diary_0441","26":"Diary_0441","27":"Diary_0441","28":"Diary_0441","29":"Diary_0441","30":"Diary_0441","31":"Diary_0441","32":"Diary_0441","33":"Diary_0441","34":"Diary_0441","35":"Diary_0441","36":"Diary_0441","37":"Diary_0441","38":"Diary_0441","39":"Diary_0441","40":"Diary_0441","41":"Diary_0441","42":"Diary_0441","43":"Diary_0441","44":"Diary_0441","45":"Diary_0441","46":"Diary_0441","47":"Diary_0441","48":"Diary_0441","49":"Diary_0441","50":"Diary_0441","51":"Diary_0441","52":"Diary_0441","53":"Diary_0441","54":"Diary_0441","55":"Diary_0441","56":"Diary_0441","57":"Diary_0441"},"Date":{"0":"unknown","1":610.0,"2":635.0,"3":709.0,"4":735.0,"5":740.0,"6":741.0,"7":742.0,"8":743.0,"9":744.0,"10":745.0,"11":747.0,"12":748.0,"13":749.0,"14":750.0,"15":753.0,"16":754.0,"17":755.0,"18":757.0,"19":758.0,"20":759.0,"21":760.0,"22":761.0,"23":762.0,"24":763.0,"25":764.0,"26":765.0,"27":766.0,"28":767.0,"29":768.0,"30":769.0,"31":770.0,"32":771.0,"33":772.0,"34":773.0,"35":774.0,"36":775.0,"37":776.0,"38":777.0,"39":778.0,"40":779.0,"41":780.0,"42":781.0,"43":782.0,"44":783.0,"45":784.0,"46":785.0,"47":786.0,"48":787.0,"49":789.0,"50":790.0,"51":791.0,"52":792.0,"53":793.0,"54":794.0,"55":795.0,"56":796.0,"57":797.0},"Entry":{"0":"\n\nEnlisted ","1":" 11am.\n\nIn Moore Park from","2":" to","3":"\n\nThence to Casula camp Signal School. Left Casula camp on","4":" & straight on final leave until","5":" Leave Sydney for Melbourne on ","6":"\n in 7.25 Express \n","7":"\n\nAt 11 am we reported at Moore Park depot & were granted leave until 5 pm. Hop & I went round town & then to Her Majestys Theatre & saw \"So long Letty.\" At 5 pm we were paid up to date & leave given to 6.15 pm. I met Cousin Mabel in camp so went home with her & reported to camp at 6.15 pm. Sergeant Stewart took charge & we took a Kitcheners car to railway station. \n\nOn the station met the family Madge & Chloe Browning. There was a special car for the sigs & in our compartment were Hop, Eric, Duncombe, Holmes, Daniels & self. The platform was crowded with friends & confetti was thrown over all of us. Parcels of cakes & other good things were crowded on us. As the train drew out cheers were given & that was the last of Sydney. My first job was to remove the confetti that Chloe\n\ncrammed down my neck. It was as hot as L & the carriage was in a bit of a mess with rubbish but after clearing up somewhat & making ourselves comfortable we began to have a feed - & what a glorious banquet it was. Cakes, fruit, drinks, sandwiches, cocoa sweets in galore. Eric as usual began to think of home .\n\nAt Goulburn I met Mrs Cox & Ivy & was given more cakes & fruit. After this we doused the glim & all slept except Eric who stoned the crows all night. Hop as usual spread his big plates all over the shop. At Albury at 8am we were given breakfast & transferred to a Victorian train that left at 8.30 am. The accommodation here was very good & in our compartment was Serg Stewart Eric Hop Pierce & self . The Victorian train certainly could show us points in running & ran on time well.\n\nWe arrived at Spencer St Rwy at 2.30 & met with the usual amount of chaos. Nobody knew anything apparently but at last we were marched up to the Domain camp. On the way we passed down Collins St & into Swanston St over Princes Bridge. Eric was much amused with the old cable trams & said that he used to play with those things once, also it was a dingdong city on account of the continual clang of bells\n\nof the tram cars .Immediately on arrival at the camp we were granted leave until 11pm. We had a tidy up & went into town & had some fine amusement. On the tram cars the boys said they felt like Kids on a merry go round. We returned to camp well after midnight","8":" Took French leave early or rather late morning as we did not get up until 10am, & went to Port Melbourne to see the Afric tied up at Railway Pier.. \n\nThat night I went to Fullers Vaudeville show","9":" During the morning Eric Hop & self went to the library & Museum. The Library reading room is a magnificent room circular, with beautiful furnishings & a high well lighted dome. At night we went to the Tivoli Theatre & saw the same show as we had previously seen in Sydney.\n","10":" Cruised round town again without asking anyone for leave & visited the Cathedral Hotel for dinner. Then went to the Library with Hop.3\/1\/16 The O.C. got us out of bed at about 10am & gave us fatigue work in the way of cleaning out drains & so forth. As every one thought this not good enough, we walked out of camp & went to the Library with Hop\n\nWe then went to St Kilda for a ride & at night went to Mother Goose Pants – a splendid & gorgeous show. Hop raved for days after on the principle boy","11":"\n\nWe all walked out of camp again & went to town. Having no aim in going out Hop & I went to the pictures – I went to sleep in them. At night I went alone to Under Fire in Theatre Royal. This was our last night in camp so we were not too particular what time we returned","12":" \n\nAt 7.30 we left camp after a breakfast consisting of 1 sausage. The food throughout had been the worst we had ever faced & was absolutely uneatable. We arrived at Pt Melbourne by train from Flinders St & crowds lined the way down to the Town Pier where the Afric lay. After two hours of waiting we embarked on the Afric right aft, over the screws almost. Whilst the Heads were looking round, we had to sit at the mess tables in full uniform, nice & crowded & hot as L. However when the whistle was blown as a signal to come up we rushed the stairway & covered the decks there being over 1500 troops aboard. I climbed up the rigging of the mainmast\n\n& had a splendid view with Charlie Williams, who was alongside me. The people had been kept off the wharf by a barrier extending away up the wharf but they were let loose when the gang ways were drawn in. \n\nThe crowd, mostly women, surged down the wharf waving flags & handkerchiefs & soon the wharf was packed with them. The band on the wharf was playing popular airs to brighten things up. The tugs came alongside & slowly the Afric drew out of the wharf, The people were by this time a seething mass, many crying & others yelling out, trying to rise above the din, \n\nWe noticed a young girl on the wharf with no particular aim apparently other than waving to all, so we attracted her attention & tried to drop her our addresses, but owing to our high position it was blown away so I threw the only thing I could afford – my matchbox which she got & threw kisses – vain ones at that as there is little possibility of ever meeting her again. As the Afric drew away the band struck up Auld Lang Syne which was answered by cheering . Soon Melbourne faded away & every one settled\n\ndown to making themselves comfortable in the small space available. This was at noon we left, \n\n Dinner came on at 1pm but there was nothing to eat so we left it. All the way down the harbour we sat on the deck & for the greater part of the time we sat quiet ; as the remark is always being made – thinking of home? We drew up at the heads at 5pm & anchored, to everybody`s dismay as we thought it was to be an indefinite delay. Boats of people then came out in motor boats from Queenscliff & cruised around the Afric securing curious in the way of beer bottle caps, coins, anything in fact that would serve as a memento. Soon after the boats began to take visitors at 1\/- each round the troopship & back again. Dense crowds gathered at the wharf waiting, & the boats made a great trade. Hop managed to get 16 notes with my address on, on the various boats. – one curly haired girl promising to write, As darkness came the men had a sing song on the poop. A thunder storm then came up but \n\nno rain fell. We all then got blankets & hammocks & put the hammocks up. This was a screamer as the mess holds 246 men for sleeping and 253 men for mess. Each man has the length of a hammock & fifteen inches breadth in which to sleep, certainly not too much judging by the swearing. This is how some of us lay swinging from the roof.\n\nEric , \n\nSelf Length ’6\"\n\nHop width 15\"\n\nWild\n\nJ.S.Hop\n\nPierce\n\nFrewin\n\nDuncombe\n\nScotty\n\nEach man has but 15\" in which to lie as the hammocks all touch one another. Numerous Heads were bumped, & owing to the heat one can scarcely imagine the din & the laughter caused by the struggle to get into bed.Lights out at 10pm –I was asleep long before this.\n","13":"\n\nI woke at 5.30 & found we were on the move once again, but simply turned\n\nover & slept again. Everybody also was asleep & next time I woke it was 7.30 so we all got out. Owing to the crowded decks & washhouses it was impossible to get even wet at the time. All the morning was spent upon deck in the sun, as Eric put it, a job he could well hold, so long as he had nothing to do. The sea meanwhile began to get choppy & the men developed bad heads etc. Dinner was absolutely uneatable again. During the afternoon the sea rose slightly & evidently the barometer was falling as orders were given for all men to be below & ports to be closed as soon as we went to roost.\n","14":" Instead of rising at 6am we left it until 7.30am. The sea still a swell on & one by one the men rushed up on deck, those who had false teeth just getting them out in time to save them following last nights tea. Soon after a breakfast of fish & porridge that was like pollard. Hop rushed up & let fly. At dinner time Pierce did likewise. Many of the mess gathered round the hatch entrances & as the sick ones rushed up they sang amid roars of laughter I’m coming –I’m coming ! See my head\n\nis bending low. I hear those gentle voices calling, poor old Joe.\n\n2pm the sea had a big swell on & owing to the Afric being well down she pitches somewhat but nothing out of the ordinary.8\/1\/16 during the morning great amusement was provided by the men compelling those with long hair to have it cut off. Forcible haircutting certainly is funny & those who refuse to come up & have it done have two straight grooves cut across their head like a hot cross bun & were left thus for a couple of days. Others submit themselves & are let go with a solitary curl or wisp hanging from one side, not knowing it is there for some time. \n\nThe sea by now had risen somewhat & at 3pm a heavy sea was running, into which the Afric plunged at times sending showers of spray over the decks. The wind too was very stiff & cold. Some amusement was caused by the \n gulls\n albatross that hung over the poop. Occasionally a gust of wind would catch them whilst on the wing & almost upset them, to the amusement of the onlookers. During the afternoon the Queensland \"Fatty\" took sick & all he could say was For Heavens\n\nsake stop the ship. Brother Pierce getting the meals dropped the stew & rushed to the rail but it beat him easily & fell on the deck. Hop not too well. Lee trying to decide whether to jump overboard or to die. Eric soaked to the skin & shivering, someone sick on him. Retribution for enlisting. Afric pitching down to her rails & shipping seas. Chief Steward says it rougher than ever seen in 32 years. Feeling well myself and rather enjoying the expressions. One by one they rush to the side & let go. No sooner down below than up again .9\/1\/16 Mess orderly today with Ivers. Wash up with scrubbing brush & wipe on washing up cloth. Lee (AC) doubtful if ever will see Sydney again & says he never appreciated a good job in Sydney. Eric will never enlist again .\n\nChurch service on boat deck at 9.30 am lasting ten minutes during which time the men sing Nearer my God to Thee – Lead Kindly Light & the National Anthem. The food so far has been absolutely awful & nobody could eat it. I have been living on tins of salmon & tinned Pineapple but find it growing expensive.\n\nAt 7.30 pm the Chaplain gathered the men round him & we sang a few hymns. He then delivered a short address on Temptation ending with a few more\n\nhymns.","15":" Today the sea is very high & washing over the foc’sle at times. The Afric is rolling badly & many of the men are sick. Today the bread is sour &is enough to disgust anyone. The porridge tastes like flour & water paste whilst the remainder is beyond our appetites.\n\n Charlie Williams secured position as seventh engineer this afternoon & took up his watch from 4 - 8 with the second engineer. Holmes also made MP his hours being 10 – 2","16":" At 6am land could just be seen out of the \"window\" as Fat Wild says . The sea is much calmer but still with a ground swell owing to our proximity to land.\n\n Hoppy takes mess orderly today & certainly looks well with a bucket of water & a scrubbing brush. At meals there is often a wild grab to catch the plates & other articles as they shoot along the table & off the end. Holmes was greatly distressed owing to spilling curry in the scramble which swamped down over his equipment. The men made some diversion from the monotony of lolling about by throwing coal & spuds at the albatross. One old bird called Dirty Dick, because of his brown mottling, was the target made most of & on being hit on the neck he displayed unusual discomfort by almost losing his balance, \"Scotty\" a Scotchman whom Eric said was too mean to whistle went on sick parade today – not for\n\nseasickness but because he was in mortal dread that the boat would upset in the rolling. He spent two days in agonising suspense waiting for us to upend. Land fades away at 7pm with a steamer`s smoke showing away in the distance. This being the last of Australia. Eric & I have a confab on the poop until almost 9 oclock. Hop joins us towards the end & as usual argues over some things through pure habit. Eric in disgust says he would argue the point with a snail for 2d & then tread on it & kill it.","17":" Lovely morning, with fair wind & sea. Banker is played for large sums on the poop & seemingly the man running the bank makes a fair sum in a short time. About a score of little parties of a dozen or so can be seen close up together heads down laying 5\/- on this & 10\/- on that, as Eric says \"making the money laugh\". We all fall in for parade & fall out again to\n\ndisappear in about half an minute . The orders for transports are read out by a sergeant amid peals of laughter & jests because of the direct breaking of them. Dogs not allowed on transports, letters not to be posted outside the censor, criticism & complaints not to be made & no letters to be sent to the press etc. No wonder a good appearance is kept up to encourage recruiting, but it can honestly be said that the food is the best procurable, but in the cooking it is foully murdered & is beyond the limit absolutely. The smells are abominable on deck & in the wash houses .Without wishing to grumble, it must be said that the issue of stores is most unsatisfactory . For the last four days the bread has been bitterly sour & turns one inside out & rations are being cut down so as to enable someone to \"Make\" out of it. If one gets up at 6am one can get a good cup of hot coffee for 3d but what is left is filled up with hot water & used for breakfast. When the tea runs short it is filled with hot water to make up.\n\nOur practice is to \"go\" one another in tins of salmon, sardines & pineapples, I myself accounting for a tin of salmon & a tin of pineapple daily in addition to the eatable rations such as cheese, pickles & potatoes.\n\nDuring this afternoon the sigs were called for guard duties. Our watch being 8 to 10pm & 2am to 4am. I was given a deck chair & told to keep the men under a sergeants rank away from a water tap that gave most delicious, icy cold water. Needless to say when possible, they were at liberty to take as much as they wanted as far I was concerned. How can a man reasonably refuse his mates a drink of water when they are crowded up in the lower decks like sheep.(2 am) called out again for shift till 4 am but with some head work managed to evade it &\n\nreturned to sleep 2.15am\n\nIt being necessary to sleep on one`s back in a hammock it causes many dreams & recently it has been the first topic to discuss on waking, what a time one has being having at home (in their sleep) I dreamt of a woman trying to kill everyone with the mess table`s french knife & fork, also that all the sigs were killed by iron boulders falling on them from Strathfield Rwy Station & many other equally stupid dreams. Eric often wakes up with a taste in his mouth as he says like the bottom of a cocky`s cage. I quote him pretty often here but his sayings are so original & practical that they are well worth hearing.\n\n8am on watch again until 10am on boat deck. Sun very hot but sea smooth. This afternoon the old game of the stewards & others concerned in the issue of stores is exploded. For the past few days it has been possible to obtain a cup of hot coffee with milk & sugar at any time up to breakfast for 3d a cup. The same applying from 4pm to tea time. It is now exploded, the fact being that this\n\ncoffe is our stores. What remains after this sale is filled with hot water &is given at meals. The chief steward wanted a whack in what the cooks were making out of this but was refused so he cut down the stores to them as follows. Less two tins milk, three pounds each of sugar & coffee. Those stores he sells himself. This may not seem much to those unacquainted with their methods but taking sugar for instance it is possible to buy a tea cup full of sugar for sixpence. Considering the price of sugar, there is some profit in this work.\n\nThe jam too is not coming too freely as yet, although it is impossible to say where it goes at present. The issue to each man is two ounces per day, but so far we only get two teaspoonful somewhat short of the correct allowance. \n\nThe O.C. (Lieut Col Stephens VD) reported to the troops that numerous losses of equipment & private articles had been reported to him. Much of this is \n\nsupposed to be sold to the ship`s crew & we are all warned against anything of this kind. The first flying is seen today\n","18":"\n\nMore daylight robbery – lime juice procurable at 3d a mug - stores again.\n\nThe Afric is being painted a dull leaden grey colour to make her as invisible as possible from any distance, the same as warships are painted. After roll call it was our usual custom to vanish as quickly as possible. For half an hour Fat, Eric, & myself spent an agonising time to find a place to hide in - in the shade & at last we found a good place in the shadow of a lifeboat. The O.C. warns the troops against selling equipment or stores to the crew & yet with this notice pasted in their quarters the greasers are selling our lime juice at 3d a mugful.\n","19":"\n\nToday the sports club opened by a boxing tournament . At 2.30 P.M. the boxing began & blood flowed freely at times. Several of the men tore into one another like windmills in a storm.\n\nAm mess orderly with Hooper \n\n& get into trouble for not wiping up as well I might have done .Since someone did our washing up cloth & drying towel in I was forced to use a scrubbing brush & the canvas back of an old deck chair. Naturally these did not suit Gertie, because it only made them worse. I then got a lecture on cleanliness & Godliness being told I was far from Godliness & also that a servant girl would scream with laughter at the way I held my towel . Perhaps so, but I was quite willing to have given place to one if possible. \n\nConcert held tonight. More rations cut down according to the cook who said that he is only getting 112 lbs out of 400 lbs of prunes, troop stores.\n\nTonight I slept out on the poop in hammock vibration bad but sleep well & dream of home. \n","20":" \n\nSunday . Church service at 10.30 am & address on Morals Trouble brewing amongst troops because of short allowances. Jam not\n\nbeing served out in specified quantity, so the O.C. is acquainted of this fact & he promises to make enquiries.\n\nHave a glorious loaf all day & attend a short sing song & service in the stadium after tea. It was a glorious night with moon about half, & fully a thousand must have gathered to hear an address on Bad Language. The C&haplain stood in centre of ring & men crowded around singing the general favourite hymns \"Abide with me\"\n\n\"Lead kindly light\" \"Oh where is my wandering boy tonight \"\"Onward Christian Soldiers\" etc. etc.\n\nThe weather so far has gradually been getting warmer & tonight we were stopped from sleeping on the poop because six men encroached on the isolation quarantine quarters, where a case of diphtheria lay. Sleeping below was anything but pleasant & with some 250 men cramped up in between decks with no breeze to replace the heated atmosphere. However it had to be done & that ended it. As the\n\npoop is now blocked to the troops, it is a case of come below & hang about as there is no cover over the decks now open. The deck is horribly cramped now & one cannot even find a place in which to lie down, so the alternative is to come below where it is also stifling & for this one gets fatigue work.\n","21":"\n\nMore trouble as breakfast goes bad leaving bread & butter to eat only. At 4 pm a general hooray went up so we all rushed up to see Cocos Island away in the distance on the port side, only visible from ( 25 miles off) the rigging. To see this Holmes & I climbed the mizzen mast & through a pair of glasses could just be seen the palms.\n\nLater on another hooray this time the capture of a brown sea bird with beautiful eyes & a large beak. The first cry was to give it a biscuit & a drink of water, which the bird angrily refused & was then set loose. \n\nThe weather is unbearably hot & humid like a turkish bath, The troops cannot\n\nfind places enough to get away from the sun.\n","22":"\n\nGuard again from 8 pm to 10pn.\n","23":"\n\nGuard 2am 4am. Glorious night with cool breeze & beautiful moonlit sea moon being almost full .Guard 8am to 10 am & 2pm to 4pm. At about 4 pm we pass on the edge of a thick rain squall about a mile away\n\nScones now procuralble at 2\/ doz. Presumably our own rations. Sergeants subscribe 2\/6 a week to stewards & get 4 course meals – we get what is left .\n\nAbout tea time have a row with Pierce over my seat. At lights out Eric, Pierce & self have an argument on life mind & matter & then to the stellar constellations. Eric gets hopelessly over whelmed by the distance of other worlds, their size & magnitude & enquires with awe what the result would be if an inebriated star bumped the joint. . Possibly transformation into a nebulous body etc. – yes says Eric as he turns over I know all about it .Dad Perry then starts an argument over\n\nthe food & says the soup is very salty as thin as threepence & tastes like stove polish.\n\nRaining like fury & cold stiff wind blowing. Awnings taken down & of course no shelter. The best tea so far came tonight – sago & raisins. Breakfast this morning was but a sausage & a quarter each, & I was fit for a small ox.\n\nThe lads amuse themselves over my attire, it being pure & simple (very) & such a remarks as Oh mother! Look at that child! are quite common \n","24":"\n\nMess orderly again with Gertie Hooper – more agony . Glorious breakfast of curry & rice. Rice not been soaked, meat honestly all fat & the curry part is grease which set like yellow wax when cold. Washing up this with luke warm water is quite a contract. Not bringing my domestic qualification into use too well disgusts Gertie & he agrees to scrub the floor, wash up, wipe up, scrub the table etc & all I\n\nhave to do is to clean the knives & the silverware – tin coated to keep the silver from wearing out too soon. I seal the bargain to Eric`s amusement & such remarks as loafer, peaker. So evidently warm the cold water to wash up in someone upsets a mug of mustard into the water & the result is darned hot water & a pretty yellow colour, but no good otherwise. Use Fat Wild`s toilet soap to get a lather up in the water consequently the plates & other utensils smell sweet violets. Pinch someones face towel to dry up with. End up by falling over a big dixie of greasy water & making an unholy mess of things. \n\nWeather quite cool up above but darned hot below . Salt pork for dinner – all salt & fat. Dad stands over the carcase & operates on it with carving knife & fork, the pig grunting each time the knife goes home. Everyone disgusted so visit canteen & buy tin of stewed peas for 1\/-. Open same & find two pears in it, the rest\n\nthick brown junket stuff. Pierce goes back to swap same but meets with someone who busts up the joint . I start a rumour that we have to go down the stoke hold & trim coal & the result is that the men parade before the sergeant & swear by all that is holy they won`t go down. Dad Perry prefers gaol to coal trimming. \n\nFat Wild & Eric do their blocks over mess orderly & cause a small riot . Scotty put on fatigue to do the steps scrub the floors & sweep out. Nobody will give him a cloth so he tells the sergeant - ? ! ? ! ! ? amid roars of Good Boy Aberdeen Scotty. Scotty then only half cleans the knives – more bad language. Parade officer over food but he still is looking it up. Nobody ever comes our way during meals but always at 11 am when everything is cleaned out & going well. Soon as this inspection starts, the pumps squirt water through the showers & water to wash in is there in\n\nplenty .immediately it is over there is no water anywhere. Marvellous.\n\nMy word you should see the cook serve out the tucker. If it is wet stuff it comes out in a dipper on the end of a pole. If it is hard stuff it comes out on a poker, finger, or anyhow. Not having an officer over us we are getting more than our share of dirty work. Technical units according to the Army Manuel are exempt from guard work & general fatigues but according to optimistic Hopkins – \nWE –ARE-THE –ENGINEEER SIGS\n so we are, worse luck, His Calathumpian piffle regarding what we do & what we don’t do is all Rats. We do what we are told, whether or no. Great makes O.C. just inspected our deck & says he is more than pleased with it fatso told the Adjutant to note it, & we would get leave at Colombo first of all – I knew \nmy\n washing up would do the trick. Gertie thinks he deserves it.\n\nMy opinion is that he tells the same tale to each deck, otherwise known as Kidstakes. At 8 pm cross equator in peculiar weather. Hop & I sit out & listen to a sing song.\n","25":"\n\nEric marks today by having his hair off properly & looks quite nice. Hop then follows sui & looks decent too.\n\n During the morning I saw the Wireless Operator to find out what prospects there were of obtaining a transfer to the old position. He was a very kind old fellow with a corporation like an old alderman.\n\nFire drill takes place at 4pm & is heralded by a furious clanging on the big bell, with bugles blowing all sorts of weird tunes. Everybody rushes about laughing & passing such remarks as \"Hey, Bill get your pay book\".. Fat Wild runs amok loses his lid & nearly shoves Eric & I over the side. We three were hiding under the shadow of the spuds & enjoying the cool breeze. Anyhow we scrambled down below, donned a lifebelt & sat down waiting for the fire to be put out.\n\nbut all that was done was to close the ports. \n\nFor tea we had rice & stewed heaven knows what – looked like banana skins to me, & tasted like paste & bad fruit. The latest news is that the steward is running short of flour – no wonder when we can buy it at exhorbitant prices ! He says that the men eat too much bread & jam before breakfast. How can we when we only get one small loaf each & about two teaspoons of jam. Consequently we cannot come below until breakfast. \n\nThings are now at a very nice stage as follows. 6am Get up & go out on the poop deck, have roll called, lie about. 8am allowed below for breakfast. 9.30 am sent up on deck, poop deck closed . Must not sit on hatches, must not sit on deck in way of others, must not stand in way of others, must not go below. The only things remaining is to stand in the sun where honestly the men are cramped like sheep. It is absolutely impossible to find a place to sit in. Roll call then takes place & we crawl about – or WE get under the spuds. At 12 noon we can\n\ngo below once more until after dinner. 2 pm All out again as before until 4pm.Allowed below once again. Hammocks cannot be taken out of the rack until after 6.30pm & cannot be slung on deck before 8pm. All must be below by 8.30pm & all must be in bed by 9pm & must not talk. Between 10am & 11am all baths washhouses & showers are closed so that everything is ready for the O.C. when he inspects. As soon as he goes by, general disorder rules, but it takes several hours to get a bath \n\nThat night the OC the Chief Doctor give the men an interesting lecture followed by a boxing contest in which fists go hard at it. The O.C. promised to do what he could for the men regarding leave ashore\n\nproviding of course that the authorities in Colombo passed the ship with the scarlet fever patient on board. Pt Aghul lighthouse & few stray lights seen at 8pm.Speed reduced to practically nil & in the bright moonlight we pass several tramp steamers outward bound.\n","26":"\n\nJust before daybreak the sky around the east was of a beautiful pink & golden colour that showed off the land well. At 7 am we drew into Colombo Harbour which is recognised by its lighthouse that shows three successive beams at about three or four seconds interval. A pilot came out from the pilot station on the breakwater & at 8 am we entered the Inner harbour & anchored to two buoys\n\n\t\t\t\"Colombo\" \n\n(Ceylon pop. 7 million)\n\nThe water & coal barges soon came alongside & began filling the tanks with water & the bunkers with coal. Bumboat men too, like a lot of crows gathered (Took 2, 000 tons coal 900 tons water)\n\nin swarms & pestered for \"one penny master\". Others dived for silver, many diving inadvertantly for pieces of tin & halfpennies covered with tinfoil . The result of such swindles brought forth torrents of abuse & bad language, which in its turn brought a hail of spuds on the diver.\n\nThe Cingalees or Senhalese as sometimes spelt are a dark chocolate colour naturally, but many are slightly lighter in colour. They are a lot of cravens at hear. They will not show fight & cower under threats. Begging & pestering becomes second nature to them & to them English money is their god, they beg, steal, & rob to get money.\n\nThey are very shrewd in dealing & unless one is very careful, he is the loser; They name absurd prices for trumpery articles that one would not stoop to pick up at other times. Their silk wares are good & their novelties many. Fruit, pineapples, bananas \n\n(small sugars) cocoanuts & mangoes are dear to buy. Such a lot of their goods are swindles, that one has to be very careful in buying\n\nImmediately we entered the inner harbour the yellow flag was hoisted to the foremast & until this flag is taken in, the ship in not passed by the doctor, & therefore no one is permitted ashore. At 9.30 am the O.C., who had done his best evidently to get us leave, called the men to the stadium & gave out what conditions there were to be observed, These conditions I may say were not very enticing as they stood but were very acceptable as we took them later.\n\nFirst of all he began \"I cannot let you go ashore independently owing to the behaviour of previous troops but one half of the troops will be taken ashore for a route march around the town this morning & the other half this afternoon & possibly again tomorrow. The route march will end at the garrison canteen at the barracks where you can all get as much drink as you need & more if you want it. Please don’t take the lemonade bottles away he continued as I have had to pay a deposit already to cover losses & this will be foreited if the\n\nbottles are taken away.\"\n","27":" much for the main instructions. We all adjourned to our decks & proceeded to get ready. The first lot to go ashore were the A.S.C.Artillery & some Infantry – no mention of H deck, Signallers who were promised first ashore. Anyhow we butted in with the Artillery boys as our uniforms are the same as theirs except for badges which we removed. Fatty Stark suddenly flashed into view with a beaming smile on his face & F.A.on his shoulders. He took no chances. There was a great scramble around the gangway where we pushed slowly for nearly an hour before we got there. From there down the gangway over the coal barges & into the bumboat. On the way over I was threatened with being thrown overboard by the native because I only had a pound & he had no change. We landed on the breakwater in dribs & drabs & collected a few of our own mates together & strolled into town past the barriers & into the main street. The G.P.O. (3, 000 employees) was the first\n\nplace we came to & here we could only buy stamps & post cards being Sunday. Here Hop & I also met Eric & after posting our letters that we hoped would pass the censor we strolled out into the street again. & met a Cingaleee Hotel Porter dressed just like a woman who mentioned a good dinner, which was followed by Lead on McDuff! Walk, ° how we walked to keep up with him but after a round about trip through a part of Gordon Gardens we arrived at the British India Hotel. In Gordon Gardens where we passed was a large marble statue of Queen Victoria & at the base was a large pond with fountain & near by two coal black boys who were evidently employed there.\n\n Anyway the B I .Hotel was our mark, The Porter bustled around & soon got us going well into the good stuff & for 2\/- we had an excellent dinner composed of Tomato Soup – Salmon & onions, Bacon & Eggs Steak & onions\n\nBread & Butter & Bananas. The waiters are all dressed in a skirt affair & white coat & bare feet. Many of the men wear a hair comb.\"back to front\" & the real Cingalees have long hair tied at the back in a bun. It was here that we saw\n\nthe first white woman since leaving Melbourne.\n\n We also noticed that there were no native women about & on enquiring why, we were told that last June there was a rising amongst the natives & that the volunteer force was called out & by the help of machine guns, principally, the rising was put down but some three thousand had been killed & wounded. Consequently all the women had been sent out into the interior. \n\nAfter dinner we felt decidedly better & met Bohm & Holmes – the latter being a MP & who was supposed to arrest us. Bohm Hop Eric & I then got into a rickshaw & told him to run! run! run! hard! & so we jogged down town sitting in a one seater, like a minature\n\nsulky with a long thin native pulling in between the shafts. It was peculiar to us & we had to laugh at one another. \n\nThe first place we went past that was recognizable was the YMCA, a large red building on some spare land. This society has done some marvellous work in Colombo. From there we went on to a restaurant where we had some light refreshments & also where they charged such a high price that we walked out without paying anything – the native chasing Hoppy`s rickshaw down the street. Next we visited the Buddhist Temple down one of the back streets, the building being a mass of carved stone & wood. One must take off their boots in order to enter here. We then visited another restaurant for more refreshments – we were genuinely hungry after 3 weeks of sop - & here Hop thought he made a bargain by buying a box of cigars cheap thanks to Bohm`s Hindustani & other lingo Hop was saved & his money returned.\n\nA great argument then took place regarding cigars & caused roars of laughter. \n\nSome soldiers were being tattoed by natives in a glorious profusion of colours & emblems such as red hearts stuck with daggers. All said to represent love signs !! It was good work in the drawing especially those of the snakes, but causes much pain. Hop almost had a try at it but was again saved.\n\nWe then paid off the rickshaw men whose charge is one shilling an hour, but who take as much as they can get. Immediately we came out of the restaurant we were besieged by a perfect swarm of natives plying cigars, cigarettes, & curios, but on refusal to buy, they simply lower their price & pester on! Youngsters salute & salaam numberless times for \"one penny master\", They give the soldiers a trumpery piece of foliage & then beg for money. Their success was poor, for all they got was a rough & ready Jow! We then walked about a little & then got into\n\nanother rickshaw & went for more rides around the town – all the time we should have been in the route march, part of which passed us when we were in the G.P.O. but we were perfectly satisfied .\n\nHop & I then did some pricing & we all then adjourned to the British India for more refreshments. Hop & I then left the others & went down town to buy some curios. We visited several ships where curios are stocked in endless variety but at amazing prices, that will soon sink to a much lower level. Some shops had some good stuff & others very bad . \n\nAt last we came to a decent place .Immediately we slowed down in front, two natives of somewhat higher education besieged us with \"Come inside\" Come inside. We walked in, through cases of wonderful silk work – a kind they are very proud of, being Chicon or embroidered the same both sides there being no inside & outside – until we reached a table covered with a cloth embroidered with gold tinsel etc. We both sat down & they\n\nturned on the electric light & the fan – good kidstakes- We asked to see some shawls & scarfs, silk, good & not dear in price. Out came endless shawls & scarfs of various colours & qualities, some magnificent work & other cheap . No amount of trouble is objectionable as they empty box after box & explain each ones special points. How much ! is the most important question & as expected out comes 25\/- . No good & up we got to leave. Hey sir! Sit down don’t go yet .We sat down again & by dint of alternately feigning to leave & sitting down again we beat him down to 10\/- at which price we snapped it. Everywhere one goes it is the same, knocking prices down down & down. There is no fear of him refusing to sell so long as he can make a fair profit. He will always call one back to try again. \n\nHop then tries his hand at buying cigars but as a rickshaw man afterwards told him – plenty good leaf outside, plenty bad inside. Anyhow Hop was quite satisfied & \n\nwe contented ourselves by buying a few post cards & elephants. On our jaunt round the back streets we saw some natives making jewellery with old fashioned tools such as bow drills. It was interesting to see them set the stones & make the brooches\n\nThe electric trams are similar to Australian only somewhat different in construction & driven of course by native drivers, the conductors often calling us to \"come & have free ride\". The police are very obliging & wear blue uniforms & brass letterings that are always polished up well. The natives all fear the police & run for their natural on their approach. Europeans are very scarce & we only saw a few all day. \n\nDown all the streets are natives with a brass plate on their coats showing what hotel they belong to, & they pester like the rest to – come & have good dinner 2\/- or so much, even saying the menu off on the spot, They parade the streets all over the town & to take one may mean a long walk to his particular joint – the natives live in their own quarters\n\ngenerally at the back of the town, but the real native quarters are well out of town &; are interesting in a way . Squalid buildings with rough & broken furniture & youngsters quite naked crawl all over the floor & into the streets where as soon as they can walk & talk they begin to beg for money. All, or most of the natives carry their money in their mouths & their capacity in this respect is wonderful. \n\nThe Australian pound note is exchanged for 19\/- at the GPO but some natives will give 19\/6, but one wants to make sure that he does not get any Ceylon money, some of the coins resembling English money but are worth very little. A golden sovereign brings over its worth by exchange.\n\nDown one of the main streets in the centre of the city is a tower with a clock on the top. Above this is the lighthouse that guides shipping into the harbour. The famous cinnamon gardens are well worth seeing, they are simply long pathways through the Gardens, plenty of palm-trees to\n\nshade the rickshaws. Palm trees are very plentiful along the foreshores & down the main streets are many trees planted so as to offer shade to the street. One thing very noticeable is the continual cawing of a species of ravens or as I believe are called Holy Birds because they are protected by the religion of the natives. I asked a rickshaw man why not kill them & he said his religion told him he would go to Hell if he killed one. I felt like killing some as they are very brave, & fly anywhere without being molested. They are much the same as a raven, with large bills and live on scraps that are thrown about, \n\nThe G.P.O. is a large building in Queen St & employes 3, 000 men, showing the enormous amount of mail matter to be dealt with. There are several first class hotels, the principle one being the Galle Face, on the edge of the sea, where most tourists stay. A great thing for waiters at the end of a meal is to collect the 2\/- & in a whisper – something for me master\n\nEverything in the form of ale has to be paid for on the spot, when the waiter buys it over the bar. When buying goods that one really wants the ;procedure is thus. Ask the price & if too much offer less but if he does not agree take it by force & then give him your price, & walk away . He will follow & try to get it, simply turn round & take your money back too. He will then take the money rather than lose both. Otherwise threaten to throw it down & smash it to bits. He soon agrees to any price.\n\n Just outside the inner harbour of Colombo lies a wrecked steamer of no small size lying right over on her side.\n\n The natives were very fond of singing for money. Their songs were Ta – ra-_ra – boom- de- ay & it`s a long way to Tipperary – both accompanied by a jig & acrobatic steps. \n\nThe method of coaling is slow but sure . Old barges come alongside with bags of coal. These are picked up & passed by groups of Awo natives along the barge &up stages on the side of the boat & so on to the bunkers. The breakwater is a great \n\nNB Continued on page 55 & onwards \n\nThis follows after \"Colombo \" (page 57)\n\nOn our way back to the B I Hotel for tea we met Frewin, J S Hopkins.\n\n& we returned to have tea, which was a repetition of dinner with two lovely cups of tea extra. The native who waited on us this time however had lost his nose & the absence of that feature did not by any means improve his beauty, & news had also reached us that the MP`s were about to form a picket to arrest those on shore so we hurried through tea & got into rickshaws.\n\nOn the way down naturally the streets were almost deserted so we yelled to the men to \"Chelow\" or get a move on & this ended in a great race. As we slithered down the street we suddenly remembered there were letters to post so we drew up at the GPO where the \"waiting official\" licked the stamps & I think added a few pence postage to a parcel, for himself. However we mounted our perambulators & made a rickshaw go like mad until a policeman standing in the shadow of a pole stepped out with a baton in his hand & ordered us into another street as\n\nthis street was evidently closed to traffic. His sudden appearance from apparently nowhere almost caused a spill owing to the natives being scared & afraid of the police. For a few seconds there was a mess up of who`s who but we soon got them moving & mine ended in the last lap by coming second . For that ride we gave them 6 each, & then went on to the wharf, which is a double decker affair, steps at intervals leading to the lower whard where the bumboats come. \n\nEight of us got into the one boat & had a three mile row. As we drew near the gates of the breakwater, the natives got away from the course & for some minutes we had a bit of a toss that threatened both Hopkins with losing the fine tea they had just wrapped themselves round, but we got there at last, or rather nearly there when one of the natives asked for the money as their custom is. We made him pull alongside first & then gave him 3\/- for the eight of us. He did snort but it was his\n\ncorrect fare – he swore it was 1\/- a head but we knew otherwise. We went straight up the gangway & Hop ran into an officer who towelled him up for staying ashore, - we went for our lives whilst they argued. \n\nDown below on our deck were men with a great variety of curios from all sorts of shops, laughing and explaining how they managed to get them & their experiences & all the peculiar sights they saw. This went on until late when Eric arrived. Pierce naturally thought he would be better off for volunteering for guard during th morning & thus make sure of being allowed off during the afternoon. H e got off certainly on a route march but he missed the best fun. My experience tells me to get what I can go when I can, & return when I have had enough - then ask if necessary. Sometimes it means trouble to do so & may mean a fine – but look at the extra time we had & the free leave . Why it was worth the risk, & we got off Scot free in the end. We had arranged\n\nto remain at the B.I all night if it had not been for the MP`s (Military Police) but we were very tired of walking especially as we had been confined on board for three weeks.\n","28":"\n\nNext morning a roll call was taken & arrangements were made amongst the men for going ashore again. However the authorities had sent out the police to keep the bumboats away, yet there was a rope ladder hanging temptingly over the stern.\n\nThings dragged on thus until just after dinner when there was a rush down the gangway by some two hundred men who got on a coal barge & yelled to the bumboats to come & take them ashore but the presence of the harbour police frightened them lest they lose their license. The police were then pelted with coal from the barge & they scampered off in a great hurry. The barge was then cast off from the Afric & gradually drifted out into the harbour. Previously the men had got some native coal wallahs on this barge & now forced them to row. Another barge load followed next \n\nminute & both drifted away until a tug boat came alongside evidently with the intention of towing them back to the Afric but the soldiers swarmed over the tug & ordered him into shore, where they lined up & marched into town. A little later another barge of coal & men followed & landed at the iron works. \n\nMeanwhile a signaller was requisitioned on the bridge to send semaphore signals to the naval authorities saying soldiers rushed gangway & were breaking leave. Back came the order to order out the Artillery section with fixed bayonets & also the garrison on shore would be sent out, both actions however being mere threats as nothing was done after all. \n\nThe ships warrant officer then left the boat & was hooted & had some very unpleasant remarks made to him as he was rowed past. He had just kicked up a row over the men diving overboard & had them stopped so that the men were just about \"fed up’ as the saying goes. The guard had been left on for five hours without\n\nany relief & the whole ship was just worked up to that pitch when it is better by far, to avoid trouble to try & pacify the men rather than provoke them until they take the law into their own hands, as at present seemed imminent.\n\n My own sympathy was with the men to a great extent although they did not go about things as they should have done. They had acted up to it last night & all had turned up so that to be turned down when they had come all this way under most trying conditions was most dissappointing, consequently they were hardly to blame. The whole cause of the trouble had been the food on board. & the number of restrictions placed on the little liberty they had. Certainly the time had been anything but pleasant, As they all say – there is plenty of money to be found in Australia for races & for other purposes, but when it came to the soldiers it meant bare, specific rations all round, that had been sold to us, & they were not to object\n\nI won`t attempt to discuss the opinions of the men & their ideas of rights & wrongs. Only I leave it to the reader to judge for himself. Anyhow by 7 pm everyone was on board & some time during the night the Afric steamed away again.\n","29":"\n\nMess orderly again with Hooper & more trouble over washing up. Knife polish off so have to use a brick. Sugar now procurable at 6d a lb & tinned fruit gone up to 1\/4 a tin, tinned salmon up to 1\/- a tin. Sardines up to 6d a tin something cruel as there are only 9 sardines to a tin. Scotty afraid of submarines & torpedoes. He spends most of his time waiting for death. I believe & eagerly discusses the possibility of trouble & the cause of anything strange. Our course now due N.W. making us dubious as to our destination – a persistent rumour going round that we are heading for Persian Gulf & thence by shallow draught steamers to Messopotamia, This rumour began in Colombo & seems possible although hardly probable.\n","30":"\n\nCourse almost due W so any chance of going other than towards Aden seems improbable. Put on fatigue work today & expected in fact the sergeant thought I was, cleaning out the scuppers & drains, washhouses & the showers etc. His mistake because Hop & I were up in our old place near the spuds. Hooper & Dad Perry get 7 day`s fatigue for pinching ashore at Colombo – lucky. Eric swears that if ever his children play at soldiers he will crack them with a shovel, before they get any silly ideas. Dad Perry & Gertie Hooper get 7 days fatigue for staying ashore all night at Colombo.\n\n27\/1\/16\n\nGertie Hooper goes on sick parade to avoid fatigue. Dad scrubs the tables. Since leaving Colombo the canteen prices have risen considerably. Little limes, a fruit as big as a walnut & like a very small lemon, were bought in Colombo for 1\/3 per hundred. At the canteen they cost sixpence per dozen – good profit.\n\ntinned fruit has risen to 1\/4d a tin & salmon as","31":" a tin. Sugar sixpence a pound & so on. A deputation waited on the Colonel & told him that the soldiers were not getting a fair deal. He said he did not know who got the profits of the canteen so it ended in the deputation practically saying that he had an interest in it. This tuned him up & things got busy & now things are down slightly although still over the original prices. Limes still 6 a doz. Every time one visits the canteen there is the usual snivel that they are losing money. \n\nFor breakfast the sausages ran out, & to make up, those who had had none were given a joint of cold mutton. Soon after it was tied to a string & taken to the doctor . Naturally he said it was good, It certainly tasted bad & the smell was enough to give its state away, apart from the look of it. We are again turned off our own deck & cannot parade now, so we simply get away out of sight. Tonight out come some amazing instructions regarding a submarine alarm, which will be six\n\nshort blasts on the ship’s whistle. On this alarm sounding the men will take up their allotted positions – some on deck & the sigs to sit down at out tables & await instructions. The quartermaster will then get some ammunition from somewhere & each man will be issued with three (3) rounds ( that is, three shots each.) The submarine will then be pointed out & on the order, will be fired at. How nice! By the time we get rifles & ammunition we shall probably be on the bottom of the sea. As for hurting the submarine with a .310 bullet – why it is ridiculous. If the crew came up on top & waited long enough for over a thousand men to be armed, well we might hit a few . A heated argument takes place after tea over the two cities Sydney & Melbourne the result being a small edition of a riot.\n","32":"\n\nBreakfast this morning consisted of a block of absolutely disgusting stuff called fish. It had not even been cleaned or scaled, & was nothing more nor less than vile. \n\nWireless news that Germans get a doing on the western\n\nfront. Same old story evidently that people swallow with some doubt. When the smoke clears, it generally shows a far different result to what the press are allowed to publish with intent to mislead the people. \n\nPass numeros brown snakes with yellow bellies, swimming on surface of the water. They are about two feet long & I swear I am sober as there is not an ounce of liquor on board. Another thing that will in all probabilities lead to trouble in case of the unforseen happening. Should we be torpedoed for instance the Wireless is inoperative owing to the Master having a master switch in his cabin. Until his switch is closed the set is unable to transmit. The emergency gear is also under lock & key so that there is at least time wasted if we get into trouble. All this is nonsense as surely the operator can be trusted not to transmit unnecessarily & the master switch should be in the Wireless cabin, under lock & key if necessary but at all events should be \n\nContinued on page 58 & onwards.\n\nfrom page 43\n\npiece of work & on the sea side of it are hundreds of blocks of concrete about 65 feet square placed in all positions generally with edges outwards in a confused mass. These blocks in their irregular positions break the force of the waves & so save the breakwater itself. Natives fish off the breakwater with varying successes. Bumboatmen ply their boats constantly across the harbour & make enough to keep them for weeks. It is stated that a native only requires 1 Rupee (1\/4d) to keep him a month. They eat a thing like a coarse pancake & a few bananas. This appears to be their only meal, but between meals they chew betel-nut. This stuff is composed of a leaf, some lime & other mixtures that people say is not too ad when one acquires the taste. The Cinnamon gardens are magnificent & a ride through there in a rickshaw is well worth taking. It only costs 5\/- to have a good meal & then three\n\nhours in a rickshaw. \n\nIf one shouts a drink to the rickshaw man, he appreciates it & runs harder. On asking him what he drinks, he generally says beer – naturally because it costs more & he pockets the money & drinks another cheaper. They are smart & take some watching & it is safe to treat them all as \"bad eggs.\" The better class in the higher class shops however will give a fairer deal to anyone although they aim high too in prices & use bluff–stakes. Kidding to them also brings their prices down. They are very dense occasionally & persist in bringing in their cheap wares. In a case like this it is better to throw it on the floor – he understands one’s sentiments. \n\nThey won`t fight, they haven’t the pluck to, but snakes how they yabber at one another & pull faces & threaten blue murder until they get blown out. They then \n\nwalk off, each ignoring the other, The youngsters even won`t fight. The natives make good profit by exchanging their money for British coinage often charging 3 for a coin worth one tenth of a penny. Taking out coins too – don’t try it. They come out, certainly, but judging by their faces it would seem that their teeth were also coming out. If they were not such a pestering, pleading, pinching putrid crowd they would be amusing but the eternal one penny massa, one penny massa drives one dotty.\n\nA crack over the melon is the only way to appeal to these men.- thank goodness the women were away. A blind man led by a boy followed me down the street crying one penny massa – Blind man, I only had silver so told him I was sorry etc but he pestered until he made me tired, so I put a tin disc in his box to get rid of him \n\nNB \n\nContinued from page 55\n\nHandy as this delay may mean the destruction of the instruments that otherwise could have sent out a distress call.\n\nAt 3.45pm the whistle gave six blasts & there was a great scramble to take up position. Operations took exactly ten minutes to be carried out. Seventy five men on either side of deck were issued with 3 rounds each. We sat down below waiting for orders. In a few minutes there was a rattle of rifle fire – up we rushed just as I thought - & saw bullets raining all over the ocean. Shortly afterwards on the starboard side another rattle of rifle fire rang out. It was only necessary for us to look out of the port to see the result. Bullets ploughed up the water like fountain jets some close to the ships, others at various distance away out as far as could be seen but such a scattered fire I never saw. Eric has been feeling very unwell the last few days & has been up to the doctor. Someone poured out his \n\nmedicine & took his bottle to get theirs in . He certainly looks bad, & is as irritable as a teething child. Driven to desperation we have been forced to rob the cookhouse & now when all is quiet we pinch up & get a mug of dripping. It is pretty poor stuff after it has had several days meals fried & boiled in it but with plenty of pepper & salt it is not too bad. To anyone really hungry anything is acceptable & we can honestley say that we are ready to eat anything.\n","33":" Just been inoculated with 250, 000, 000 baccili against enteric fever. First a touch of iodine on the arm & then about an inch of needle & a syringe. The baccili then run around your arm like lunatics until it gets tired & you feel too lazy to lift it. Marvellous. Next time we get 500, 000, 000 baccili. We shall be eaten alive by this army of grubs. Snakes ! a man will be alive when the dingbats start on him too. All the lads have been growing or trying \n\nto grow moustaches. Mine is rather scattered & Eric`s wants weeding. Hops`s wants annihilating altogether. Pierce`s is a late bearer, Scotty`s face fungus is so long that he will soon want a haircut, instead of a shave. 9pm Eric begins to feel sore where inoculated & provides much amusement by groans when he turns on his right arm.\n","34":" Mess orderly with A.C.Lee. Have no hot water to wash up in, no dish cloth, no drying towel, no soap, no scrubbing brush. Use queer methods to overcome the difficulty better left unexplained. Serg Carmody O.C. of our deck, complains about table not being scrubbed & in return gets some nasty things said about him. He has absolutely no right whatever to wear the stripes in the first case. Secondly he knows less than the average & thirdly he is disliked by all. He tries the \"bounce\", & gets\n\ncounted out amid peals of laughter. Consequence more fatigue scrubbing the floors twice a day. His head is too big for his hat, but when he loses his stripes & he probably will he will find his correct depth (deep down below). Roast & boiled pork for dinner – sounds nice but, oh snakes ! It is like lumps of fat swimming in boiling oil & is past my standard of eating & that has been sinking slowly & surely until I eat almost anything. The fat & oil used to cook our meals is amazing. Everything is dripping with grease & one gets a taste in one`s moth that will even let dry bread slide over. Three cooks have the cooking of the meals for 750 men, a rather big contract, but for eighty officers & non coms combined there are twelve cooks . It appears that some of our jam finds its way into the sergeant`s mess to serve them with morning & afternoon tea\n\nsnacks. This may not be true, but - detectives –( our own of course ) are on the track & woe betide them if correct. The butter is coming down too in rations.(This appears to be an unusual ration so we are wrong perhaps in complaining her) each man gets one ounce per day. Lime juice has put in an appearance now that we are going practically north. Each man`s ration in this article is one table spoonful per day. Just enough to make about one third of a mugful. This ration may be right but surely it was intended that we should get it earlier on the trip. The whole fact of the matter is that nobody knows what rations we should get & nobody seems to care.. We have paraded time & time again about the food & still nobody will inform us what we are entitled to. Order at last issued (nearly time too) that we may address parcels free of duty & the censor will pass them, \n\nNo mention about postage on parcels. It really is sickening to try & get news from anyone. The first order on the transport rules is that officers shall see to the comfort of the men before attending to themselves. We certainly do not need tucking in bed nor our hands held till we go to sleep, but never once has an officer voluntarily come to ask if we were getting on alright. They are all too self centred & perhaps it is better so. Here, for instance are the sigs. We have nowhere to parade or even to sit down on, unless we get away from our own deck. If we do this we are crimed – that is we are given fatigue work for certain time & a note returned to base records. Melbourne was a bad mark against us. Isn’t it enough to turn anyone against enlisting? At 3 pm we suddenly run into rough weather that causes the old Afric to roll somewhat . A big sea is shipped through the\n\nopen port holes that drenches every thing out as far as the centre of the deck. Mess tables are swamped & every one soaked to the skin. I happened to be above & felt the stern rising unusually high & a moment later there was a great row down below as the wave came in & swamped the deck. Previous to this a great number of the men were holding their heads & feeling queer (you know) after the pork dinner. Brother Pierce gets quite angry when we say he looks bad.He was as white as a sheet & said he felt crook, but when antone says he is seasick he gets quite annoyed & swears it is only the pork. An hour later the men rush to the side & let go. One fellow made a terrible rush & ran into the railing with such force that it assisted him nicely. Laughter from the \"old sea dogs\" rang out everywhere & I must say that I felt as lively as a cricket\n\n& found plenty of amusement. For tea only five turned out of ten because of the pork, & also because there is cheese for tea. I did not object, as it meant more for us & less washing up. After tea an amusing mystery is cleared up. Ever since Ivers, Houston & Symons entered the troop they have stuck together like glue. \n\nThey always walk down for meals, never say a word to anyone other than their little band – called the three angels by the rest – but simply eat their meals & then walk out again, one never seeing or hearing of them throughout the day. Through a peculiar incidence caused by stray papers we find that they get away together & write effusions, some example of the stuff being found by one of our troop, evidently written by Houston. Fat Wild was let into the secret & at an awkward moment bursts out\n\nin front of everyone – \"At last \n\nLand, Land, Land \n\nOh India !India ! India !\n\nOh Land of dark faces \n\nCinnamon trees \n\n(This is the opening verse of their piffle)\n\nStone the crows you should see the look on Iver`s face. He looked very uncomfortable. Such stuff as this is very nice – but it is unnatural for a soldier to burst out into such heartrending wails, especially on a transport. Soon it may be a case of Oh Help : Oh Help - & so on when the business begins.","35":" Sea still a little heavy but moderating. Riot over the breakfast which consisted of boiled fish that absolutely was the limit. The proof of this\n\nstatement is in the fact that the whole ship refused to even draw it from the cooks. It was neither cleaned nor scaled & was disgusting, A burial service was held over a plate of the fish that had a cross in the centre & a tablet marked. Born 1864 died 1870 AD. First of all the procession, dead marched it to opposite the officers quarters & there knelt down & taking off their hats they sang\n\nFor poor old Jeff has gone to rest \n\nWe know that he is free\n\nDisturb him not but let him rest\n\nWay down in Tennessee\n\nThe procession then rose & holding the plate of \"Fish\" up sang \n\nStand up Stand up for Jesus & so on\n\nA prayer was then offered\n\nduring which time several fainted from the smell. It was then counted out & the procession moved on to opposite the Chaplain`s cabin where the service was again gone through ending up with :-\n\n\"Ashes to ashes & dust to dust!\n\nThe officers wont eat you but the privates must\"\n\nThe last service was held on the poop deck & on the last count out, it was gradually lowered & on \"TEN\" it was dropped plate & all into the sea where it sank amid howls & groans. Not an officer showed up during the disturbance & the only thing done was to tip it out on deck & shovel it over the side. The Chief Steward gave this order, his knees knocking together with fear.\n During the afternoon a medical parade was held . On our medical papers that are supposed to show our medical\n\nexams & other particulars there was nothing consequently we had to show the marks & also to make a statement as to the actual vaccinations & inoculations. Those who could not show any good marks were done again – naturally when near the end of our journey so that those done will be sick just as we disembark. As far as we know, Suez is to be our destination. \n\nSerg Carmody again sinks in the \"bluff stakes\" but finds he has spoilt his own little game. He has been seen slightly on the booze, that he gets for making us carry stores for the stewards. He was caught nicely in the cookhouse with doors locked, mopping up whisky. He consequently finds the wind out of his sails.\n","36":" Another month begins. Nearing Hell`s Gates. Eric gets a fit & does exactly four minutes flag wagging & then gets tired .Limejuice drops to ½ a tablespoonful per man, It is wonderful how quickly these\n\nitems drop. The amusing feature each day now is the criming of the men. Each day the men to be crimed are sent up to the orderly room to receive sentence. This is about the rate of criming.\n\nSitting on the hatch & thereby blocking ventilation. 7 \ndays \n fatigue.\n\nTaking a hammock out before time. 3 days \n\nTaking bucket of water from fresh water tap 3 days & so on until a fellow cannot even open his mouth. They treat us like a lot of school children -\n\nAt tea time Houston gets very annoyed with Holmes whom he accuses of reading his effusions & having them put in the Sigs`s paper called the Furphey. In this paper skits are made at all the occurrences daily. Here Freddy gets some satire thrown at him & consequently he loses his head & reports it to everyone & only gets laughed at . Holmes presents\n\na fine picture standing besides little Freddy who with his hands in his pockets indignantly makes vile threats. A case of dignity & impudence. \n\nSubmarine alarms take place every afternoon now at 3.45pm. Wash up at tea for the three \"Graces\" – Faith, Hope & Charity. ( Ivers, Symons & Houston)\n","37":" Birds around showing presence of land. Mess orderly with Pierce. \n\nAnother Medical Parade called up but dismissed as the doctors suddenly you know what a shock it must be when military men \nsuddenly\n awake found they had no baccili or grubs with which to inoculate us . \n\nLearn to warble – whistle & drive everyone mad. Iver`s occupation found out to be an artists. No wonder he dreams. Eric says he probably draws for a comic paper. Pass Perim 11.30\n","38":" Awake to find that we are passing the Twelve A;postles. Pass them with Jebel Tiere Island & light house on starboard. The other on the port\n\nIn Bold Sea\n\nside is of considerable size, of a dark brown colour with many deep ravines running down from the top crests that are much like volcanic mountains, evidently washed there by many rains. The shores are steep & no visible signs of life. \n\nPass several steamers & at dinner time the transport Borda from Adelaide SA caught us up & passed on port side. She left Fremantle on 17\/1\/16 & had already caught us up & passed us. Naturally the sigs got into communication with the other troops by means of flags & found out all the particulars about her very soon, & were stopped by a snivelling officer who cries that we had blocked an official message twice – Rats he could not read it, is more like the truth . Some of the sigs on the Borda however sent all the news, one even climbing a ventilator & signalling with one arm & holding on with the other. She had 1500 troops on board. A naval man then got upon\n\ntop of the Borda`s flying bridge & sent the \"official message \"& he sent it at a very fast rate indeed in semaphore as the navy men do. Its speed knocked out the majority of sigs, but the angles were so well made that I could read it.\n\nIt was-\n\nFrom Colonel Rowell\n\nO.C.Troops Borda\n\nTo O.C. Troops Afric\n\n\"Compliments to Colonel\"\n\nHow official ? How sympathetic? An interesting thing occurred however that I noticed & that was her transport number that was covered by a screen, but on passing us, she raised this screen & thus showed her number. After she passed us, the screen was lowered over the number ( A, 30.)\n\nCook apparently gets a stroke for at 4pm free soup & coffee was issued to all (free) - Glorious sunset.\n","39":"\n\nBeautiful sunrise. Holiday all day on account of sports. Sea as calm and smooth as a pond & rather hot. The offices amuse themselves during the dinner time by shooting first at two sharks & then at jam tins & other articles thrown overboard.\n\n Mock trial held on \"H\" deck that causes roars of laughter .Scotty tells an amusing tale about his rifle shooting. He spent all the morning, whilst at the range in trying to hit the bull`s eye, but never even hit the target at all. After about thirty shots that all missed, the officer yelled out to him fix bayonets & see if he could stab it. This tale, told in the real Scotch tongue brought forth roars of laughter. Sunset of lovely golden colour that drew the troops to the side in wonder. The colours are impossible to describe. Some kind person nips my hammock & the only course open to me is to nip somebody els’s. Another peculiar incidence noticed during the last few days. No accusations are \n\nmade however & the reader can judge for himself. \n\nThe barber on board who by the way has been making an enormous profit out of the troops has been selling brand new books to the troops for threepence each. Now these books are marked 15 cents in America & yet they are new. It is unreasonable to expect him to sell, say sixpenny books for 3d. Also I may say that absolutely no red cross stores have been issued. These books only came out after leaving Colombo & when all the reading matter had been read. Before this he swore that he had neither books nor sweets & yet immediately on leaving, he can find some. It may be ok, but taking into consideration the recent way things have been going they many not be ok. Salmon & other articles have been reduced, now that we are nearly there. This is open to comment. Dinner today consisted of stewed rabbit, stewed to bits, Pierce say it tastes \n\nlike lobster – Drunk again. \n\nThe sea is promising a bit of a roll, so Fat Hart gets down on his back so as to keep it down. How marvellous it is to notice how many fellows felt sick previously so that when the time comes, there is always an excuse. Down below, when the boat is rolling, there certainly is a peculiar feeling as there are no articles to sway about & thus show that we are rolling. As it is the whole deck appears to be swaying rising & falling in all ways, until one wonders where he is. On making enquiries, the men who serve in the canteen, which is alongside the barber`s shop swear that case after case of Red Cross goods are sold by the barber. Whether this is correct or not, I cannot say, but I will say that he has a smart way of making money. Whenever he runs out of goods he says he is quite out of stock, but a few days later he can\n\nalways find more. Nestles chocolates are a favourite item & he has \"sold out\" many times. Films for a camera cost 1\/- each (7d on land) A reasonable profit is expected, but the prices are fabulous. Blankets are taken from us today & only hammocks left to lie on. I hid mine until all was quiet & then got it out & it was quite acceptable. Hammocks are to go in today but I am hiding mine again. This is only done to save the stewards any trouble. Sunday today & I start by having to appear before the doctors who have lost my medical papers - my luck again.\n","40":" At lights out, the military police came round unexpectedly & began searching for blankets, so had to be quiet. They passed me however & I passed the night in warmth. 7\/2\/16 First thing to do was to dump the blanket out of the port – farewell to it. All day is\n\nspent in passing the Wilderness of Sin on the starboard side & great rugged cliffs of rock & earth on the port side. The formation of this wild & desolate land would be too hard to describe, It consists of great peaks of volcanic rocky strata that has great fissures running down from the apex to the desert, ending in the sea.. Land is quite visible on either side. Their rugged & inspiring appearance is a sight enough to strike awe into one`s mind. Their gigantic majesty (poetical, but descriptive words) is amazing, but if that is the land of Milk& Honey – me for Cascara.\n","41":" Extra Sunday\n\nChurch service was held in the stadium & the Farewell hymn sung \"Till we meet \"etc. The evening service was very interesting & instructive & less on the actual application of the Scripture. Lead Kindly Light sung for the last time together & the Chaplain farewelled\n","42":" Continued\n\nMt Sinai was passed at 10 am away on the starboard side. All the afternoon was spent in standing on the poop deck in full dress waiting for the inspection that as usual never comes off. All our hammocks, blankets, & eating utensils have been taken away to save the \"HUNKS\" (Stewards) any trouble. Today there was a great fall off in butter. The men paraded before the orderly officer who is responsible. He, as usual didn’t know why it was so, but he \nthinks\n it as because we go ashore tomorrow. Now what can one \nthink of this\n. They absolutely don`t care a d-----! as long as they stuff away in the saloon. What the stewards give us is good \n\nenough whatever it is. It must appear to the reader that if the men were all grumblers like me that we were no \ngood\n. It is not this at all . We were prepared from the start for anything in reason, but when we cannot even find out what we are entitled to nor why we are cut short, it is enough to warrant the bad language used. Lime juice has now stopped & on totalling up I find each man has had issued to him for the whole voyage the magnificent total of just eight tablespoonsfull. What we are short of we do not mind providing the \"HUNKS\" don`t get it.\n\nTHE ABSOLUTE LIMIT.\n\nThe crucial point reached at last. On the eating utensils being counted, there was a deficiency – naturally & of course we are told we must either find them or pay 6d a head – but the prices run the total up to over 80 pounds, Fancy\n\nbread bags at 2\/9d each. In the first place none of ever saw them. \"They are not worth 2 ½ d each let alone 2\/9\/ Anyhow the unanimous & rather decided answer is \nwe won`t pay for them\n .Naturally a deficiency is inevitable & would have been paid for only for the way we were treated. The Chief Steward has the matter in hand & all the men want is to bring the Chief Steward along & judging by their tone he had better stop away. The officers say it \nmust\n be paid or it will be docked. When they were confronted with the high canteen prices, short weight in jam etc – all they had to say was \"Don`t know anything about that \"– No, they don`t know anything like that. Well the question simply is that the men refuse to pay & the money cannot be stopped legally & moreover there will be a far greater shortage in other ways if they do so. \n\nLights out was blown\n\nat 9pm but as we had nowhere to sleep we turned them on again & began to read. I turned in on the table. At 11.30 pm we anchored in Suez. All night long however the men talked & sang keeping everyone awake until about \n","43":" 4 am when it became practically necessary to arise. It was a rotten night & as cold as a frost. At daylight we could see over thirty various ships & several warships, all held up waiting their turn to enter the canal.\n\nBreakfast of Bully Beef & biscuits were served out .- I managed to get a big tin of Brawn into the bargain. We expected to land soon after but we are now told that we shall be here for several days. Just after breakfast there was a deep boom of guns evidently some distance away. Every few seconds there would come a dull, sickening rumble that shook the air. Everyone began to wish they were \nright in it!\n Away in the distance could be seen a warship\n\nof an old type blazing away at some object inland, every shot making the sand fly in clouds. There were 5 cruisers & one battle cruiser, Three stood at the mouth of the canal, long slender masts & like grey wasps . \n\nDinner consisted of pea soup, that without a word of lie set like candle grease as soon as it got cold. This is an absolute fact, so one may guess the \nsoup\n it was .I had a biscuit & a cup of water, the biscuits being hard enough to stand a brace & bit. \n\nAfter dinner the warship began firing away, as we afterwards found to find the range of several points where an attack is expected at any moment. HMS JUPITER she now stands off the shore with her guns trained, a dark smudge of black, grim death ready in an instant to send an iron foundry of shells into the enemy. Two other cruisers & a big battle cruiser stand right in the mouth of the canal, also ready to reply to the attack. Two\n\nmore cruisers are also standing off ready. On shore can be seen the camps that hold thousands of the Gallipoli soldiers. There are stated to be 250, 000 soldiers on the canal.\n\nS.S.Arabic (P&O) mail steamer leaves for London during afternoon, the people on board cheering us as they pass. The Colonel stood on the poop too & to jig him, the men yelled out – \"So they take your blankets & hammocks from you – Do you sleep on the floor- etc. He had nothing to say as usual . \n\nPractically the worst case of utter disregard was shown tonight when our blankets were re-issued, & amongst them were the blankets of the diseased & sick in the hospitals. \"H\" deck refused to take them, so we are without. This was the cause of the senior medical officer losing his head over it.& rightly so .Downright criminal negligence, to say the least of it. Fat Wild`s birthday. Hammocks again issued & a good night`s sleep obtained.\n","44":" Cold, bleak\n\nmorning. Move our position to nearer the wharf. Loaf about all day in the sun, Kiwi Scotty`s face & douse water on him whilst asleep. He swears blue murder on everyone. Guard 6pm to 8pm.\n","45":" not wake up in time for guard & therefore miss it – hooray - someone does my breakfast in when I come off guard (6am 8am) at 8 am we move into the wharf & start disembarking . Eric buys a paper a month old & does not know it until I show it to him. He was not going to be taken in either. Instead of doing guard I amused myself watching the goings on, on the wharf. An instructive sight was an Egyptian with a throw net. The artillery left by the first train, then the infantry & after dinner at 3 oclock we went for a walk around the wharf & on the transport.- At 4 oclock we mounted the little train cars hat hold but 48 each & are as bare as possible. The wheels creaked & groaned & with an awful squealing noise we drew out of Suez bound for Cairo. Things \n\nat first were interesting until we got into the desert. Numerous huge camps were passed on the way & also a trainload of N.Z. returning soldiers. We passed & at present are passing the canal quite close, but it is blocked from view by huge mounds of earth that have been heaped up as a protection. \n\nAs tea time came we set to a very plain meal but it is marvellous what a fellow will eat & enjoy when he is hungry. First of all we had a slice of dry, stale bread & an onion. with a little cheese & a mouthful of water, followed by a dry biscuit. The onions I pinched from the cook, & although they brought tears into our eyes they were very good, the cheese we nipped, so that I can honestly say that I enjoyed the feed. We often used to growl at home because the meat was tough, the bread stale or the pudding not nice. Yes! & how often we were told that we should be thankful. We naturally never thought\n\nthat a crust of stale bread & a mouthful of water would be considered good. \n\nWell ! experience is a good teacher.\n\n As I write this, we are sitting in the tiny dirty carriage, smelling of onion & feeling as cold as Charity - the song says when the sands of the desert grow cold - .There are two tiny lights burning & the men are huddled up trying to sleep, whilst the train noisily drags on. We should reach Cairo by 11pm. As soon as the sun sets over the desert, the cold becomes bitter & one cannot get warm. Judging by the amount of singing however the men are happy. We have just passed a huge camp of Australians & the cheering that followed as the men rushed down to the train shows the brotherly feeling existing. As we steamed along at an easy pace we passed fields of irrigated land & old water wheels etc until at 11.30 pm we drew into Ezbet –Zeitoun. Here we all had to fall out & in remarkably quick time the","46":" Sig troop was told to fall in for another sixteen\n\nmiles` journey. The rest of the sigs were marched away – where to we do not know but we never even had time to say good bye. We then drew a blanket each. & marched back to the station & at 11.45 the train took us on to Cairo. Here we turned out & could not get a tram & had to carry our full equipment & overcoats with both packs that nearly strangled us, for two miles through the city. \n\nOn arrival at Bab-el-Louke railway station we had missed the 12.45 am train, so we had to doss on the station. I pulled down two boxes & turned in & slept till about 3 am when it became bitterly cold & I could only shiver. At last the \"Hopeless dawn broke\" & I found that a native had been piling blocks of ice alongside that certainly did not warm things . At 5.30 am the train drew out & we arrived a few minutes later at Ma`adi where we again turned out & had to walk another mile with the packs & gear arriving at the Ma`di Light Horse Camp at 6.00 am\n\nAway to our rear could be seen the great Pyramids of Cheops & the cities. We soon found our quarters (it was just dawn) & after a cup of cold tea & a hunk of dry bread that was lovely we were put in tents with the other sigs that had left Melbourne six weeks before us. They soon gave us the news – horses & fatigues all day - & we could see that things would not be too easy. Anyhow we were here for a purpose & must make the best of it. At 9.30 am we fell in for parade & were dismissed till 2pm when leave was given till 10.15pm since we had been up for two days without sleep.\n\n Peirce found a brother in the camp not a hundred yards from here. The camp is very large & holds all the Light Horse Brigade & extends away over part of the desert. Camels come continually into camp & most of the dirty work is done by natives. Leave is given occasionally & discipline is very strict.\n\n At 2pm we went to Meadi Station & took train to Bab-el- Louk Rwy & thence walked into Cairo. On the way we passed \n\nFrewin. A quiet \"domesticated \"fellow who prefers a quiet life of playing cards to anything lively. Our best church goer.\n\nNicknamed \"Gus\" or \"Gussy\"\n\nSee A.C. A rather selfish fellow but perhaps unintentionally, that may make him more self centred. An enormous eater. Bad sailor & gets seasick easily\n\nAlong the Nile, past the Pyramids in the distance & past all the dirty hovels that abound round Cairo. In Cairo we went to the Y.M.C.A.tent & had afternoon tea. Inside the YMCA is a skating rink & every amusement .\n\nOn passing the Sultans Palace we saw the guard fall in & all the soldiers in their perfect uniforms of blue with red braid & facings saluted & the bugles blow. This is done whenever the Sultan goes out, & the way they drill & do sentry go is absolutely the prettiest sight one can imagine, They are perfectly uniformed & it is a magnificent spectacle. The mounted soldiers sit at attention on their horses like statues & the horses shine as though polished. Every button glitters & the bayonets glitter like flashes of fire. It is the most glorious sight one can see. We then saw the native quarters by night until we were that tired that we could not go any farther, so Eric & I got in a garry & drove to Bab-el –Louk & thence home. \n","47":"\n\nReveille was\n\nat 6.00 & we had to turn out. It was so cold during the night that I had to get up & put my leather vest on. I then had on a singlet, cardigan, sheep skin vest, & overcoat & even then it was cold. The water to wash in was like ice & numbed one, but the air was glorious. \n\nThe first parade was stables, when we had to clean them out, feed & water the horses. When \"feed up\" is blown on the trumpet a ( bugle is only used in infantry & others, but bugles are used for the mounted troops) all the horses in camp neigh & stampede. They know every call. All the work we get is horses ! horses! Horses! \n\nThanks to the Egyptian Govt we get a decent feed here, The Govt allow each man 8½ (eight pence halfpenny) worth of rations every day. This must be in rations & we get butter, pineapples, sugar condensed milk, treacle, etc, etc, allowed to us at the rate of 8½ per man per day. This is in addition to the usual rations. Life is worth living now & today I had the best feed I ever had in camp & I feel - full, to be polite. Two letters have already arrived for me from the girls I dropped notes to, in Melbourne\n\nEverywhere are horses, horses. They are a nuisance & need more nursing than a baby.\n","48":" Mess orderly today with Holmes, Washing up is no light task when there are over fifty & all these things have to be done in one`s own time. A soldier has no set hours. He is on for as long as needed & no wages board nor unions to appeal to. It makes one keep on thinking what a lovely place home is. We are much the better however when our minds are occupied. Pierce goes for a ride & gets a fall.\n\n14\/2\/1 Get two bracelets from Abeiba & a pair of ear rings off another native girl. Go for a ride into the desert leading a nag. The one I rode would persist in jog-trotting until I was sick to death of it. After tea we move the whole kitchen & camp further away, to have more room. 10 pm I go on stable picquet & have a pleasant time with the fifty horses in the dark. They get astray at times & give me a busy time. \n","49":" Wake up at 12.30am & go to sleep. Awake at 2.45am again. Get Faith out of bed to take his watch, & I sleep under a wagon. It rains & I get wet. Drizzles all day. Feel very tired at night after having been up for two days & then carrying bags of food all day. Put\n\n in for a transfer to the Navy.\n","50":" Eric, Hop & I get some navvy work today in digging a sump for the water tap &in filling in the sump with big rocks by tea time my back ached & my knees began to rock. After so long a spell at doing nothing, this kind of work hurts considerably. After tea I relieve Gow at HQ orderly & write a few letters.\n","51":" HQ orderly all day & only do two trips to Maadi P.O. when the Brigadier General comes into the office, he chats with us & Capt Straker the staff captain becomes quite sociable. I spent all day writing & censoring my own letters – some going through that would be dumped if the censor got them.\n","52":" old stables all day, shovel, dig & sweep until one feels disheartened. Have a buzzer test during the afternoon with a terrible thing called a buzzer. The note lags about ½ a second, but manage to get R2 & pass. After tea, there was a great row in the hotel de Comfat. Some soldiers had been run in for being drunk & were handcuffed to keep them quiet. An extra armed guard was posted & at times things looked as if something would happen. Two of the worst cases, that were nearly mad with the bad whisky sold here, cursed & swore at the officers like maniacs & appealed to the men to help them get out, \n\nto kill the officers & equally absurd things. Some were so persistent in their behaviour that it was necessary to \"Spread eagle\" them – that is they are laid on the ground face down & tied to four pegs so that they cannot struggle. During this however there was unusual violence on the part of the MPs & one fellow was stabbed with a bayonet. This increased the uproar for a time, but the men dispersed on the request of an office. The drink here drives the men mad, but they have only themselves to blame.\n","53":" Make application for special leave, Hop peaks on it & I have to cancel it .In the morning we go out to the desert to get some sand. On arrival there the native boys offered to unload, so naturally we did not object. They then loaded with sand & came their cry for backsheesh ! but, alas, they had struck a \"broken \"party. Whilst there, a limber wagon with natives in it, & driven by soldiers, bolted & the expression on the nig`s faces was glorious. Over the mounds of rubbish they tore, swinging from one side to the other, & almost upsetting. One soldier with less sense than the rest jumped off & performed a series of Catherine wheels & mothballs that was splendid. The nigs yelled & howled with fear, & we shrieked with laughter. It was great, & when the wagon stopped they \"hopped \"it quick & lively. After dinner we stole\n\na walk down to the native city at the back of the camp. The sights here are not much. First of all, on our approach, as with other strangers, all the native women bunk for their lives. Immediately they see us they skin out & hide. Those who cannot get away, cover up their faces so that we cannot see them. It is the custom of the native women to hide their faces to all unbelievers in their faith, therefore the majority wear a shawl over their heads ready to drop it. They will answer \"backsheesh\" however. \n\nThe \"houses\" are simply stone & sand walls with reeds & bamboo`s thrown over the top. The whole conditions are awful & cramped beyond description. The dirt & filth in and around the native city is amazing & how the inhabitants do not die of disease is a problem. Nine out of ten of the natives suffer with some affliction to their eyes & are generally blind in one. The youngsters gather all the rubbish they can collect & wear all the worn out clothes & other things are thrown away. The youngest youngsters all cry for the usual \"backsheesh\". After return we feed up & then we have a siesta for the rest of the day.\n","54":" – Spend all day printing photos & then end up by spoiling half. \n","55":" Called upon to wire up a lamp on the flag pole for\n\nsignalling purpose. This turns out a failure owing to the unsuitable material. After tea I am called up with the rest as a probable reinforcement for the signal troop that is to leave for action in a few days. My only opinion is that if I go, I go, but in all probabilities it will turn out in smoke. \n","56":" Take over horse \"Dolly\" & receive full equipment. Hop & Eric left in \"Details\". By all appearances then, the troop may move off soon now. \n","57":" Pay day at last & we are richer by far than he others. Feel very queer however & decide to go on Sick Parade even though it looks very bad, considering the fact that I am supposed to leave for the front. Anyhow feel too bad. Report at the Bungalow & find that I must go to bed immediately. Tell no end of lies to the doctor to avoid it, but the thermometer showed 102º & that settled it. Go to bed in No 3 ward with Influenza. In the ward is Macdonald a horse dealer who was hit behind the ear with a cricket ball & knocked silly. Also Considine with 17 boils on his neck, the latter being called \"Sore – neck\", He had been\n\n"}}