{"Document Name":{"0":"Diary_0174","1":"Diary_0174","2":"Diary_0174","3":"Diary_0174","4":"Diary_0174","5":"Diary_0174","6":"Diary_0174","7":"Diary_0174","8":"Diary_0174","9":"Diary_0174","10":"Diary_0174","11":"Diary_0174","12":"Diary_0174","13":"Diary_0174","14":"Diary_0174","15":"Diary_0174","16":"Diary_0174","17":"Diary_0174","18":"Diary_0174","19":"Diary_0174","20":"Diary_0174","21":"Diary_0174","22":"Diary_0174","23":"Diary_0174","24":"Diary_0174","25":"Diary_0174","26":"Diary_0174","27":"Diary_0174","28":"Diary_0174","29":"Diary_0174","30":"Diary_0174","31":"Diary_0174","32":"Diary_0174","33":"Diary_0174","34":"Diary_0174","35":"Diary_0174","36":"Diary_0174","37":"Diary_0174","38":"Diary_0174","39":"Diary_0174","40":"Diary_0174","41":"Diary_0174","42":"Diary_0174","43":"Diary_0174","44":"Diary_0174","45":"Diary_0174","46":"Diary_0174","47":"Diary_0174","48":"Diary_0174","49":"Diary_0174","50":"Diary_0174","51":"Diary_0174","52":"Diary_0174","53":"Diary_0174","54":"Diary_0174","55":"Diary_0174","56":"Diary_0174","57":"Diary_0174","58":"Diary_0174","59":"Diary_0174","60":"Diary_0174","61":"Diary_0174","62":"Diary_0174","63":"Diary_0174","64":"Diary_0174","65":"Diary_0174","66":"Diary_0174","67":"Diary_0174","68":"Diary_0174","69":"Diary_0174","70":"Diary_0174","71":"Diary_0174","72":"Diary_0174","73":"Diary_0174","74":"Diary_0174","75":"Diary_0174","76":"Diary_0174","77":"Diary_0174","78":"Diary_0174","79":"Diary_0174","80":"Diary_0174","81":"Diary_0174","82":"Diary_0174","83":"Diary_0174","84":"Diary_0174","85":"Diary_0174","86":"Diary_0174","87":"Diary_0174","88":"Diary_0174","89":"Diary_0174","90":"Diary_0174","91":"Diary_0174","92":"Diary_0174","93":"Diary_0174","94":"Diary_0174","95":"Diary_0174","96":"Diary_0174","97":"Diary_0174","98":"Diary_0174","99":"Diary_0174","100":"Diary_0174","101":"Diary_0174","102":"Diary_0174","103":"Diary_0174","104":"Diary_0174","105":"Diary_0174","106":"Diary_0174","107":"Diary_0174","108":"Diary_0174","109":"Diary_0174","110":"Diary_0174","111":"Diary_0174","112":"Diary_0174","113":"Diary_0174","114":"Diary_0174","115":"Diary_0174"},"Date":{"0":"unknown","1":1592.0,"2":1593.0,"3":1594.0,"4":1595.0,"5":1596.0,"6":1597.0,"7":1598.0,"8":1599.0,"9":1600.0,"10":1601.0,"11":1602.0,"12":1603.0,"13":1604.0,"14":1605.0,"15":1606.0,"16":1607.0,"17":1608.0,"18":1609.0,"19":1610.0,"20":1612.0,"21":1613.0,"22":1614.0,"23":1615.0,"24":1616.0,"25":1617.0,"26":1618.0,"27":1619.0,"28":1620.0,"29":1621.0,"30":1622.0,"31":1623.0,"32":1624.0,"33":1625.0,"34":1626.0,"35":1627.0,"36":1628.0,"37":1629.0,"38":1630.0,"39":1632.0,"40":1633.0,"41":1634.0,"42":1637.0,"43":1638.0,"44":1639.0,"45":1640.0,"46":1641.0,"47":1642.0,"48":1643.0,"49":1644.0,"50":1645.0,"51":1646.0,"52":1647.0,"53":1648.0,"54":1649.0,"55":1650.0,"56":1651.0,"57":1652.0,"58":1653.0,"59":1654.0,"60":1655.0,"61":1656.0,"62":1657.0,"63":1658.0,"64":1659.0,"65":1660.0,"66":1661.0,"67":1662.0,"68":1663.0,"69":1664.0,"70":1665.0,"71":1666.0,"72":1667.0,"73":1668.0,"74":1669.0,"75":1670.0,"76":1671.0,"77":1672.0,"78":1674.0,"79":1675.0,"80":1676.0,"81":1677.0,"82":1678.0,"83":1679.0,"84":1680.0,"85":1681.0,"86":1682.0,"87":1683.0,"88":1684.0,"89":1685.0,"90":1686.0,"91":1687.0,"92":1688.0,"93":1689.0,"94":1690.0,"95":1691.0,"96":1692.0,"97":1693.0,"98":1694.0,"99":1695.0,"100":1696.0,"101":1697.0,"102":1698.0,"103":1699.0,"104":1700.0,"105":1701.0,"106":1702.0,"107":1703.0,"108":1704.0,"109":1705.0,"110":1706.0,"111":1707.0,"112":1708.0,"113":1709.0,"114":1710.0,"115":1711.0},"Entry":{"0":"\n\n","1":"\n\nThis diary, the 7th since enlistment, opens at a period critical & momentous. The great hun offensive has been directed upon us in full force & has gained quite a respectable success. We expected to give a little at points but our leaders apparently underrated his offensive powers. A second effort has been made north, over ground I know like a book & so far has been successful, his advance reaching 7 miles into country of extreme value. Armentieres, Sailly, Bai St Main , Merville, Estaires, all old friends have now passed to the enemy. Altho’ temporarily the enemy is in the ascendant I feel sure he will be checked & this feeling of confidence runs throughout the whole army.\n\nIt was a very quiet night altho’ there was heavy gunfire from surrounding batteries Those just behind us consist of 60 pounders 6\" howitzers & 6\" Naval & firing over heads as they do we receive the full blast.\n\nLarge sick parade in the morning from the 13th Brigade. Midday our planes brought down a Fritz & had the Pilot, a sgtmajor & the observer in as patients. The observer died during the afternoon but the pilot was not badly wounded & was sent on to the C.C.S. later. Both spoke good English. Also had in several wounded from around the village as he was putting several shells over. Out transport moved out for safety about a mile away for the sake of the horses. Several tanks passing through during the evening so it looks as if something is expected.\n","2":"\n\nA very quiet day Our village was shelled a little during the night also today but casualties were very few. More tanks passing through & it is noticeable how much easier they are manipulated than formerly. More hockey in the evening and won again. Major Beard told me today that I had been recommended for the Meritorious Service Medal (M.S.M.) to come\n\nout in June. To know that this was done is very gratifying even if it does not come off, as of course all recommendations are not acted upon. For the sake of those at home I hope it does. Not much news from the North except that they have advanced about 4 miles. Curious that the fighting now is over country I know so well.\n","3":"\n\nRather a quiet day but had a couple of bad cases in from the neighbourhood. Felt off colour in the morning. Just about 10 PM a fellow in the D.T.’s was brought in & we had a lot of trouble giving him the Stomach tube. From then on I had a bad time, diarrhoea started so badly that I was unable to go to bed, so sat up in the Dressing Room the whole night. All the morning I was bad & it was not until evening that I began to improve\n\nbut feeling very weak. Quite the worse bout of its kind I have ever experienced. The cause I know not but it is very rife at present. Our Amb played the 8th today Australian Rules & won, also a tug of war to finish off with. Further news from the north rather serious, Merville captured amongst other places which means an advance of 7 miles at least. It would at least be interesting to know beforehand what will happen in the next few months\n","4":"\n\nA quiet day with a tense feeling in the air of something about to happen. More tanks going through. The 15th Field have left Aubigny & are now in this village so something is going to happen. My diarrhoea much better tonight but feel very weak.\n","5":"\n\nTurned in at midnight & was up at 4 A.M. with the old complaint. Had a bad time for a couple of hours and during the day felt very off colour & the major\n\nwanted me to go off duty. Nothing much doing during the day, so did not overwork myself\n","6":"\n\nMy birthday. Today I reach the 30 year mark & certainly feel it at the moment. This is my fourth birthday in the army & I sometimes feel that I’m tired & would like a spell. Just at the moment I am feeling very weak & ill. Last night was another bad one, I was up several times & then we were shelled, one falling within 10 yds of our cottage & breaking a window only. Between my sickness & Fritz I was feeling anyhow. Slept in until 10 AM. to make up for the poor night but found as soon as I turned up at the Station there was plenty to do. Several gas cases were coming through & our new officers were fresh to the treatment. It appears that the sector has been heavily shelled with mustard & we have had hundreds of casualties, about 600 went through from this sector during the day.\n\nWas kept fairly busy during the afternoon & began to feel better towards evening. Turned in about 10 P.M. into the best bed I have had in the village am now in a cottage with the W.O. & 3 other Sgts & have it all to ourselves just as the people left it. Each night the others cook a substantial meal for supper, there being potatoes & onions in the house, other things being obtained by a little fossicking. Of course coal & fuel is plentiful & the fire is a good one. Rhubarb & a few such things are also plentiful but they are not for me as my condition will not allow it.\n","7":"\n\nSpent a fair night being up once at 2.30 AM but several times after 6, slept in all the morning without breakfast. Got up for dinner feeling weak & ill. Found things rather mixed up at the Dressing room so had to set to. Made out a requisition for drugs & sent off for them also issued some drugs.\n\nThe Major approached me again about going off duty & will have a spell tomorrow at least as I am afraid of getting weak & having to be\n\nevacuated. Things in general fairly quiet even in the air as the offensive up north is still going strong. We are still going back up there & it hurts to read that Baillieu & such places are now in the hands of the enemy. \n\nB section will in future attend to all gas cases so things will not be quite so heavy.\n","8":"\n\nStayed in bed all day under orders & the Major came down to see me. Felt much improved in the evening so got up had a wash & shave but fear that I overdid it as I don’t feel as well now. Will try & get up tomorrow. Still no mail, yet most of the others have received them. Fritz still pushing up north & I believe that we have lost Passhendaele & Messines Ridge. What lives we lost taking those places last year heaven only knows & now they are gone in a moment. Gas casualties still heavy mostly through our chiefs being careless or their officers and for which they will be hauled over the coals.\n","9":"\n\nHad a bad time during the night. Got up for dinner after the Major had seen me. Watched a football match during the afternoon & about tea time had a recurrence of abdominal pains. Left me weak & sick, could not even read my mail which I had been longing for for a month past. Eating only a little toast & some arrowroot. Luckily have a good bed & am comfortable otherwise.\n","10":"\n\nHad a fair night & decided to start work again. Went up to the Dressing room & just as well as we were to be converted into a Main Dressing station & there was a lot to do. The Major was glad to see me back although still wishing me to take it easy. Had to increase my staff & make arrangements to deal with more cases, all of which I did during the day, 4 extra cars being attached for evacuation. The village shelled during the day with several casualties, one French soldier being killed, very unlucky as he was helping some civvies to shift. The 15th Field Amb left the village so we took over the place their\n\nSgts had, rather a nice place & we made a comfortable mess out of it, in addition to getting good beds. Richtofen, one of Germanys leading airmen was brought down during the day by one of our machine gunners, the news spread very rapidly & was in everyones mouth. We held sports during the afternoon but I was too busy to see much of them, there was good competition, B section winning with A second. During the afternoon one of the shells landed right amongst the spectators but did not burst. It was a miraculous escape as it is strange that noone was hit even by the shell itself apart from the burst. The sports went on without check. Altho feeling dogged tired at night felt much better in spirit.\n","11":"\n\nVery busy again. Started by fixing up a Café opposite in which to do sick parades so as to relieve the dressing room of a lot of work & leaving space for wounded. The French soldier was buried during the morning we lending a Ford Car & providing a Guard. First the body was put into a coffin\n\n& then carried into Church for a service then to the cemetery followed by French soldiers ours & a number of civvies. Completed arrangements for handling of wounded during the day. Had to shift our quarters again. The A.P.M. had the wind up about his place as a shell had landed in front & he decided on ours with the result that we had to shift. Picked on a house close by, quite a good place so all was well except for the trouble it caused. We will have a trouble to hold it as the Area Command ant has his eye on it. Received a small parcel from Dwa today for my birthday.\n","12":"\n\nHad a quiet time in the morning very little doing altho. he shelled our village & we had a few casualties in. Our Gas centre was busy however as he was sending a terrible lot over. Prepared a requisition for drugs & dressing & during the afternoon had a fine trip collecting them. We had to go to Picquigny a town on the Somme a long way past Amiens\n\nIt was wonderfully interesting as I saw large numbers of French troops moving up to the line amongst them being the famous Alpine Chasseurs, France’s crack troops. The were dressed in dark blue & wore tamoshanter caps, being a smart & young looking body of men their officers also being a fine looking lot.\n\nI listened to their bands for some time which were playing as the troops marched by, they using a step much quicker than ours. The trumpeters were particularly good, brandishing their instruments with great gusto. \n\nIn equipment they much resembled the German, in such things as entrenching tool in particular & their machine guns appeared to be the same, they being carried on light mules. A few British troops in the neighbourhood did not compare well with these fine fellows & it was distinctly cheering & heartening to see such fine men available at this stage of the war. Bought some papers, U.S.A as well ,also\n\na few things at the Canteen, collected my drugs & reached home about 7 P.M. Saw a few Italian troops, labour corps I believe these being the first which I have seen. Passed through Amiens on my return and lately it has been heavily bombarded. Not a street seems to have escaped & all is gloom, desolation & destruction where once was fashion & amusement. Started getting busy after I got back, both wounded & gas & apparently a stunt is in close proximity.\n","13":"\n\nWent up to the Dressing room before breakfast as cases had started coming in freely by daylight. All night long a heavy bombardment was going on & the enemy shelled our villages at intervals of about 15 minutes putting over about 10 shots, a second between each. I slept fitfully through it all half expecting to stop one at any time. Had no time for breakfast simply had to tear into it. Everything went well fortunately, I had ample\n\ndressings etc, the Cars evacuated well & promptly & we also had several lorries which we commandeered. At dinnertime had just cleaned up the bloody dressings etc from the floor & I had started on a round of bread & butter when in they streamed again, my dinner having to go.\n\nSo it was most of the afternoon but by tea the situation was well in hand & I was able to have tea with a cup of tea which eased a bad headache. Gassed cases were again plentiful & the gas centre also had a busy time.\n\nWe were shelled nearly all day. Our mess was knocked about by a shell bursting in front, the mens billet was hit fortunately all being out at the time & hardly a section of the village escaped. Three of our cars were hit yet only two of our Amb men were hit, truly a wonderful escape. We have prepared a dressing station out in the Fields\n\nin case we do have to clear out. It is now definitely established that it was the genuine Baron Richthofen of 80 planes credit which we brought down, the men responsible being two machine gunners of the 14th Brigade artillery. \n\nWe gave him a big military funeral. \n\nA sad case was a baby of about 6 months old which was wounded during the morning. It cried bitterly whilst being dressed the mother joining in, really it’s a sin for people to hang on as they do especially where there are children.\n","14":"\n\nAnzac day and once again a day of blood for me. The enemy attacked us & managed to gain a footing in Villers Bretonneux but our counterattack was very successful & we recaptured it with a lot of prisoners. The Cases came in to us slowly during the night until about 4 A.M. I was called & had a busy time until 8 A.M. when the rush was settled for the time being.\n\nAfter breakfast the stream, of wounded continued including a lot of Germans & we were going strong until midday. I then obtained 6 men from C section to relieve my tired men whom I sent off until 6 P.M. for a spell & later increased the staff by 3 men night & day as more men were now available. Had to send stores to the line & prepared a requisition for more but before doing so obtained a signature on a blank form from the D.D.M.S. the first time to my knowledge for it to be done, the rush being responsible. \n\nVarious duties kept me at it until 10 P.M. when I turned in after a day of 18 hours on my feet all the time. We have 10 men to bury, two being Germans & one unknown tommy, he having no identification of any kind. Most of the huns were fine big men, a few youngsters being noticeable but no more than our own. Some were very talkative & one told us that Japan was going to take Australia.\n","15":"\n\nA much quieter day, cases coming in very slowly which gave me time to get everything square which included the burial of 14 men who had died during the last 3 days. Was much worried by the Padres as to the religion of the men as they wished to officiate only on their own men. It is not often that they care much about this especially if they have been at the war any length of time. At No 2 General I know that 3 Padres C of E, RC & Methodist take each days burials in turn & look on the matter as a routine being lucky or otherwise according to the number they strike.\n\nCollected drugs & dressings during the day from Picquigny also a supply of stretchers. Our crowd(Aussie) received very flattering congratulations from the heads today over the stunt, which from all accounts proved very successful indeed. Our total put through for the stunt Gas & wounded total about 1300, about half of each, which shows how successful\n\nthe Gas is. As a matter of fact the Gas problem will continue to get more serious as men become gassed through their carelessness & in some cases deliberately as they see that it means evacuation to England with little pain if carried out well. Of course some die but it actually is, what is known as, a safe blighty. Heard today that Major Metcalfe was killed in his dressing station, he was a particularly fine man & one of the best officers we have ever had.\n","16":"\n\nHad a very busy morning.\n\nThe 60th Btn hopped over to straighten out the line & copped very heavy although. The operation was a success. The remainder of the day was quiet & ordinary & I even had time to wash a couple of shirts & socks and write a letter in the evening. No papers though or news so things must be very quiet.\n","17":"\n\nA very quiet day for wounded. Very busy in the morning arranging two rooms so as to be able to carry on operations\n\nwhen necessary as men often come through with tourniquets on which often causes gas gangrene etc if left on too long. After dinner went in the car for drugs & had a very long trip. First went to ‘Picquigny’ but found the depot had closed & was moving to ‘Crouy’ so had to go on to Longpre only about 8 miles from Abbeville. Reached the No 18 depot here about 4 oclock & had trouble with the Sgt in charge. It being Sunday he objected to get me the stuff so perforce had to demand it with forcible language. He proved amenable under this & gave me what I wanted & even went a long way to please me by giving me more than I had asked for. It was a scandal that he should even demur at supplying me, seeing that we had come so far & Sunday was the same as any other day with us. It is always the same however the nearer we get to the Base the less consideration we receive. Had refreshments in the place which was fairly large & then set off home calling at ‘Crouy’ to pick up some\n\nstuff from the other depot was partly successful here, the Major in charge proving very obstinate until I stood up to him. It is often the case with these infernal men, they treat an Australian with a consideration refused to one of their own, simply because we speak to them more as equals & are not backward in arguing with them if necessary. \n\nPassing through Amiens the damage was more noticeable than before, as each day it is shelled. One street was almost destroyed as a fire occurred & several houses were dynamited to check it. Arrived back at Daours about 7 feeling very tired & turned in about 10 P.M. Did something over 60 miles in the car but saw nothing of note on the roads bar a few Yankees, their stirrups being of the pocket cowboy style & several French Howitzer guns mounted on Rubber wheels drawn by motor lorries. It is noticeable that a lot of their artillery is moved in this fashion, the lighter guns going right inside the lorry.\n\nSundi","18":"\n\nAgain very quiet with wounded. Apart from routine work I was engaged preparing indents for issue to Battalions, of Panniers, Haversacks, Watertester etc. I am issuing our own where possible & will keep the new ones for ourselves as we look after them better than the Battalions. It is very difficult to obtain them or any such equipment as so much was lost in the retreat that all supplies were exhausted & fresh, in sufficient quantity have to yet arrived from England.\n\nRather bad news from up north Dranoutre, Kemmel mont & Locre being lost but Locre has since been recaptured. French troops were mostly concerned. Strange to read of heavy fighting in the Hospice at Locre where we spent a very enjoyable month about November last.\n","19":"\n\nA busy day. Started off by adding more instruments to the operating theatre. Then prepared a requisition for equipment wanted by Battalions & went along with Q.M. to get it.\n\nThe Depot No.13 had opened at Vignacourt & they gave me most of the things being very obliging. Then went on to \"Canaples\" near where they had the Australian Reinforcement camp & collected two of our men then returned to Vignacourt. Proceeded next to where we looked over some gear belonging to a C.C.S. which had been salvaged from Edgehill near Albert. Picked out some of the things & then set off home bringing with us some Dental gear to enable the Dentist to start work again, he being idle since we left up north. A long & tiring trip, it raining most of the time. \n\nA good number of French troops in the neighbourhood. Very few wounded in during the day. Learnt that we had lost about 138 motor lorries in the retreat also cars but could not get their numbers. The retreat was described to me by a man who was in it, today. The greatest optimism was shown before hand by our troops & all longed for\n\nthe offensive to start. Large numbers of guns were everywhere & as tanks were expected to be used 8 ft wide trenches were dug to block them. All known precautions were taken, all of which were frustrated by the enemy going one better. He used the mist to hide his approach & he shelled the back areas more than he did the front, thus preventing supplies coming forward etc. 4 hours of gas shelling preceded everything else. Proper precautions for retreat were not take by the","20":" Army, they being so confident, but the 4th Army had been more cautious, the result being that they did much better. Saw a Hun brought down yesterday & it was very exciting. He came over us fairly low under heavy fire, when three of our planes appeared to his left. He turned off & then appeared undecided, at which moment our fellows spotted him & one instantly attacked him, it being noticeable how much faster our plane was. He emptied his machine gun & then looped the loop out of the way\n\nthe second machine at the same time taking his place. It was then that 3 more of our planes appeared on the other side & poor Fritz simply gave up the struggle & landed a couple of miles away, being simply driven down. The observer only was wounded. Later another one was driven down but I did not see the scrap. We appear to be King of the Air more now than at any other time .\n\nMercredi Mai 1st\n\nA quiet day in the Dressing station. Spent most of the day fixing up Surgical Haversacks, Waterbottles etc for issue & preparing indents for new owing to losses in the retreat we are doing much more of this than usual. Owing to the good effect of ammonia in gassed cases we are now issuing 4 Ampules to all the artillery personnel to be followed probably to the other units. This is all additional work & in addition the Q.M. is leaving the care of all medical equipment to me & as this has been neglected\n\n \n\nI have a busy time before me to get it all square.\n","21":"\n\nNot much doing in the way of wounded but a few sick ones coming through.\n\nTook over the supply of anti-Trench foot supplies to the Division today & ran it across to Bussy for C section dispenser to do as he was having nothing to do much. Sent off to Medical Depot for supplies as we are supplying a large number of different units. Didn’t feel too bright myself so took it easy & looked over routine orders etc. Cough pretty bad brought on again with the Gas.\n","22":"\n\nGot up with a bad pain on the R. side & generally feeling very unwell so decided to get Major Parkinson to give me an overhaul. He did so discovering that I had definite appendicitis, sufficient to call for an operation if circumstances would allow. However decided to let it go & see how\n\nI got on. Very few patients coming through, so rearranged our system to allow of better working should anything develop; this meant taking over two more rooms. Turned in early feeling very dopy.\n","23":"\n\nFeeling anyhow but pain has disappeared from side. A few more cases in than usual the line becoming active. Did a lot of issuing of drugs & arranged a special place for officers as per A.D.M.S. order. Had the good luck today to purchase some oranges at the Y.M.C.A. 5 a franc; it seems years since I had one & they were a real treat.\n","24":"\n\nA quite day all round and no news or incidents of any kind to narrate. Still feeling off colour. Wrote a couple of letters before turning in. Mail in yesterday.\n","25":"\n\nExtremely quiet on our sector, practically nothing doing. Our 3rd Div. had a very successful stunt a glorified raid & for some 50 odd casualties inflicted about 150 & brought back 200 prisoners. A few Yanks showing up mostly engineers however. Large number of guns going forward and extra ammunition also tanks very active so something may be in the wind. Weather beautiful, rain at night. Another good mail in.\n","26":"\n\nVery quiet, weather good. Had a cleaning day. Washed my greatcoat which I have had for 2 years in constant use so it needed it. Then did some sewing & had a bath myself.\n","27":"\n\nStill nothing doing. Made improvements in operating theatre. Installed a large sterilizer which was salved from the C.C.S. at Edgehill also constructed an apparatus, a\n\nmodification of Shipways, for giving hot Ether for anaesthetic. Heads much bucked over it. Still a few things to do mainly for purpose of eyewash, in case A.D.M.S. etc come round inspecting.\n","28":"\n\nVery few cases coming through. Prepared the weekly requisition in the morning. Alterations carried out that I wished in my section so that it will be stronger in the future and easier for me as I now have a full corporal who knows his job well. Major Furber now with his unity, rather strange as we came away on the same boat together from Australia.\n","29":"\n\nA few extra cases through as the result of raiding otherwise line very quiet. Weather beautiful. Engineers have now completer making the cellar gas proof & are doing same with Dressing Station. Completed fixing up of operating theatre, it now being very up to date.\n","30":"\n\nWent for drugs today & it developed into a big trip. Had to go to No 14 which was at Crouy & then had to go on to ‘Longpre’ as No.14 could not supply all the stuff. Obtained all I wanted so it was a successful day. Roads very free very few troops on the move so we must be ready for the next push. Our C.C.S. also are now definitely settled, so we are certainly well off for the next phase of the battle. Trenches are still being constructed further back & today I saw great numbers of French soldiers on the job. Umpired a game of hockey at night as I feel too tired to play & my indisposition has come on again. We now have 16 proper hockey sticks the pioneers having tired of the game, gave them to us.\n","31":"\n\nWet in the morning fine after. Practically nothing doing. My staff reduced again, 6 men of C section\n\nhaving been withdrawn. Posted away a book & some papers. Hockey again at night.\n\nSundi","32":"\n\nRaining most of the day. A little more doing than usual 30 coming through during the night and about 50 during the day. Assisted at a couple of ops. during the day otherwise just the usual duties.\n","33":"\n\nHad a fairly busy day issuing drugs and preparing a requisition. After tea had my first game of hockey since I have been unwell. B & C sgts challenged A & we won by 6 to 2 I felt O.K. & scored 3 of the 6 goals. Then had a strenuous night. About 10 P.M. some cases came in for operation, one, a bad one, an abdominal case & I did not finish up until 2 A.M. Slept in until 8.30\n","34":"\n\nA very busy day. operation cases especially during the morning & sent someone else for the drugs.\n\nHad a regular hero in at midday. He had a frightful wound & the M.O. at 2 P.M. told him that he was dying. He received the news quietly & gave me the address of his mother & girl for me to write to them. After that he never complained, just simply awaited the end which came at 6 P.M.\n\nHad a man sent up from the 8th to help in the theatre so will have an easier time in the future I hope. Several taubes over during the morning & one tonight. Another push must be eminent. Received a parcel from home for my birthday.\n\nJeundi","35":"\n\nA very hot day, our first real summer day & everyone is feeling the affect of it. Saw a scrap in the air today in which our chaps droved down a Fritz & some hours later the smashed machine went past our station. \n\nHad a strenuous game of hockey, scores 7 all & then had a lovely bath with clean changes. Very noticeable how thin I\n\nam, my legs like matches. I’m afraid that I’m in need of a spell. A few shells falling close tonight & something may develop later.\n","36":"\n\nA fairly quiet day. Our abdominal case getting on well. He has a wonderful heart & is making a great fight for it. Learnt today that a case we had who died suddenly a couple of days ago had meningitis. He was brought to us at 8 P.M. collapsed at 10 P.M. & was dead at 12 P.M. after we had given him oxygen & artificial respiration for some time. It is indeed a deadly disease. The P.M. was done at the C.C.S. \n\nPlayed hockey ay night & won. Had a swim after, my first for the season.\n","37":"\n\nVery hot day with a cool change & little rain during afternoon. A quiet day with a few shells put into the village about 10 P.M. More hockey. \n\nHad a visit from Major of Depot of Medical Stores.\n\na new idea & a good one as his duty is to see if there are any drugs lying idle & if so to take them back.\n\nHad a visit from a man named Ede who enlisted with me in 1914.\n\nDimanche 19 Mai\n\nCollected drugs from Crouy, a very warm & dusty trip yet withal pleasant. \n\nHad a little excitement last night about midnight. Fritz had been putting a few shells over very close to us during the evening & About 12, landed one about 50 yds away right alongside the officers mess, killing a tommy who was seeking shelter behind a wall. It was an extraordinary burst, throwing the man \naway\n 20 yds away & a huge stone weighing 98 lbs right over a large 3 storey building to crash through a roof & fall between 2 men who were sleeping on the floor, one of the men receiving only a superficial graze, an extraordinary escape.\n\nA gas alarm was also given but that was unnecessary & I only lost about ½ hours\n\nsleep altogether. This is just a taste of what we may get at any moment as all round the village are guns & an exceptionally large ammunition dump 100 yds from us\n\nSundi 20th Mai\n\nThe expected has happened & we have been shelled out of our Station. \n\nShells had come over at various intervals but at 1.45 A.M. one hit the corner of our dressing room, smashing the end of the building & covering everything with a deluge of bricks & dust. I was getting dressed at the time & then received orders to evacuate so proceeded to pack up & send off the stuff to Bussy about a mile away. C section in the meantime had opened up a station on the road to Amiens as had been arranged for if necessary. Then came the climax. At the other end of the building was the operating room & they had just finished taking a mans leg off, when a 9 inch hit the place & filled the room with bricks dirt & broken glass & here I had a remarkable escape for which I thank\n\nmy maker. I was standing in a direct line with the shell which burst on contact the nose cap only penetrating any distance. It tore its way through the staircase, missed my back by a fraction & penetrated through a brick wall into the room in which I slept. The place was filled with flying bricks & dust but I was untouched & came out of it unrecognisable owing to the covering of brick dust I had. The man who was being operated upon was rushed away to a cellar & there finished off & will I think recover. \n\nThe nose cap was huge affair & weighed several pounds being quite hot when I picked it up some time later.\n\nThe packing up was proceeded with & before an hour was passed all gear dressings & drugs had been sent off & I marched away with my men to Bussy. It was an extraordinary escape for all as only two of our fellows were hit & they were only mild, but\n\noutsiders suffered more, 3 M.P.s being killed. \n\nOn arriving at Bussy I proceeded to sort out & arrange the stuff, sent over necessary dressings to the new Station & in general put matters square. This was all finished before night the Colonel arranging for B & C sections to carry on the M.D.S & my section to have a spell. I had sent men back to sew up the bodies which were buried about 5 P.M. It’s now close on to 10 P.M. & I’m tired after a strenuous day so will turn in.\n\nSeveral of our own chaps down to an attack of fever like trench fever, 10 being in a temporary hospital we established. We have never had so many ill before. The big offensive is surely due.\n\nMardi 21st Mai\n\nMore excitement to write of & surely unique. As my last entry shews I turned in just before 10 P.M. & had hardly been 10 minutes between the blankets when\n\nenemy aircraft came over & I could hear some of our chaps discussing them as they were fired at but I was too tired & go & look myself. Then I heard one man say – here he comes now & is going to drop his eggs – said jokingly but it was only too true. Within a few seconds there was a tremendous explosion followed by 5 others at rapid intervals & the place was full of dirt & brickdust & shaking as by an earthquake. For a few seconds it was impossible to light a match, then I lit a candle & groped my way into the next room which was fitted up for dressings & I could hear men calling out, if anyone was hit. \n\nOnce more we were extremely lucky as only one man was killed, Saunders an original man, & four others wounded besides numerous abrasions not serious enough to be evacuated. He had attacked our building direct, dropping 3 one side & 3 the other at about 10 paces between each. The 3rd fortunately missed the building which was packed with men, dropping 3 ft\n\nfrom the side & made a hole over 16 ft wide & about 10 ft deep, smashing in all windows & doors of the building besides tearing the wall itself about. The 4th dropped right into a cottage the Dentist was using, & razed it to the ground the 5th &","38":" hit the road. The smoke & dust rolled up as from a fire & it was several minutes before one could see, even with a light. We dressed the wounded & sent them off, then hustled the men into the fields for safety & evacuated our sick.\n\nAbout 1 A.M. I turned in again but this time under the balmy moon as we had had enough of buildings for a time. A merciful providence surely watched over us as the narrow escapes were many. The Colonel then decided that the open field was best, so next day I had the same old routine of packing up & shifting to the M.D.S. It was heartbreaking & I was dead beat by the end of the day which was hot enough for an outback\n\nheatwave. By 8 P.M. all my things were transferred & then I had to fix up a possy for the night, this I did in company with others, as there being no tents or buildings we had to dig in & make bivouacs in the open amongst the growing corn. I slept well despite all troubles however. I can quite understand civvies being terrorised by bombing attacks, it being nerveracking even for soldiers to have bombs dropping in such a way, worse of course in our case as we had had a fair issue from the mornings shelling.\n","39":"\n\nThe task before me was once more to unpack all my stuff & carry on the work. First I dug down with the help of the men, about 2 ft, both protection from bombs, coolness & to enable the tent to hold more. Then I erected a bell tent, arranged boxes inside, sorted out the drugs & by the afternoon was able to issue out to two units. Then went\n\nthrough & checked my 8, G.S. panniers so that we could move off at a moments notice & open up in another place if necessary. It was a hard days work but was completed by 5 P.M. & I went for a swim in the Somme after tea. \n","40":" far the enemy has let us alone in our new position. We have 10 tents up for hospital needs all the men being dug in, in the immediate neighbourhood, some about 6 ft deep other a few inches, designed with the idea of being safe from anything but a direct hit from shell or bomb. From where we are we can see the shelling of the line & our own & the huns star shells going up. These have improved in the last 12 months, many being very spectacular, being masses of fire in some cases, others strings of lights & so on. Some keep suspended in the air by some device & burn for lengthy periods. \n\nB & C sections are conducting the M.D.S. whilst my section\n\nis resting, I still carry on requisitions & supplying outside units with drugs & am looking forward to a quieter time with the prospect of writing a couple of letters & reading some papers I received the other day.\n","41":"\n\nA steady day of hard work Had my 8 G.S. panniers checked & all contents cleaned up, also my medical & surgical panniers. All are now ready to load on the wagon to move off at a moments notice. The day started hot but changed to a little rain with cold wind. Fritz was over bombing last night again but left us alone. He dropped bombs near the place we evacuated & also set fire to a large dump of some kind & it made a splendid sight, blazing up fiercely & dying down every few seconds, lighting up the country for miles. Report says that one of the raiders was brought down near Corbie.\n\nVery few wounded coming through.\n","42":" \n\nMatters very quiet the last 3 days, nothing to recount except a sudden drop in the temperature of 30° & is now very cool again.\n\nRestarted hockey tonight & was in good form (Left off here reason given below) scoring 5 out of the 7 goals of my side, we won 7 to 1, so apparently my sickness has not weakened me, merely caused me to lose flesh.\n\nSundi","43":"\n\nLast night whilst writing this diary I had reached the word – \"form\" when the presence of enemy aircraft overhead made me put my light out & events were then so exciting that there was no lighting it again. For safety sake I lay down on my bed on the floor of the tent & listened to bombs being dropped in all directions, the whole neighbourhood receiving attention & incidently I did not feel in the cheeriest mood after my late experience. Then hearing one of the men call out – look at the incinerator blazing up, I went outside to see & sure enough it was making a splendid mark. It was so\n\ndangerous that I decided to go & put it out myself but had hardly started off (it was only 100 yds away) when I heard a plane approaching. That settled it I said, the damage is done & turned off at right angles & started to run but had only gone a few yards when I heard the swish & whistle of a falling bomb. Down I went to it altho in line with his approach & then bang, bang, bang, went 3 bombs one side of me & bang on the other, only earth falling on me. Five were dropped in all one being a dud. Once again the Good God was looking after us, only one man was hit & he had his arm fractured. My tent was penetrated by several pieces & one bottle being broken, whilst some of the cars were hit, one radiator being put out of action. I was wild at the men responsible for the fire being left as undoubtedly that was his mark. Our latrines were shattered but fortunately no one was there. I then proceeded to complete my job & put out the fire. Everyone\n\nhas the wind up to a certain extent as its becoming a habit now for us to be a mark. One of the bombs in particular was of a deadly variety as it burst on the surface making no hole, the flying fragments leaving marks on the ground like the spokes of a wheel. During the day great industry has been shown by the fellows deepening their dugouts & they are now spread all over the fields.\n\nCollected drugs today at Crouy & also went to ‘Longpres’ for some oxygen. It was not a bad trip, roads being very quiet there being no large movements of troops on so apparently we are ready for the hun to start. His artillery is more active also his planes, all pointing to an early resumption of the offensive.\n","44":"\n\nA very ordinary day, simply supplied several units with drugs & fixed up my dispensing box. I have had a box made with a lot of compartments which will enable me to carry a little of everything\n\n& be able to open up for sick parades & pack up again at a moments notice. Word through that the offensive has started again, in two places Locre & between Rheims & Soissons. He has made progress but we have had no further news. More hockey tonight also received mail today from Australia.\n\nMercredi 29th Mai\n\nOur present position is apparently a good one as tommy tunnellers with our help have started to dig a tunnel in order to make an underground dressing room, work goes on day & night & is making good progress. The chalk stone taken out has been utilised to make a huge cross on the green for Fritz’s edification.\n\nWent along to a show at the Mill in Daours at night & it was first rate being composed of boxing, wrestling, & comedy turns with blindfold boxing to end up with. A Yank also gave an exhibition of Hypnotism making a couple of fellows dance & sing etc. A real good show & one to do the men good.\n\nWe scored 3 M.Ms out of our Daours stunt one going to J Sturrock, a man who never had a chance until I took over the section, being in fact up before the O.C. twice, one to an 8th man who was helping us & one to a Motor Driver. Sturrock well & truly deserved his for previous good work but the actual deed for which he & the","45":" man got it for, was being in the operating theatre when a shell landed outside, it was the one which nearly got me. All they did was to carry the stretcher away to a neighbouring cellar whilst I held the door open for them to go out, so, that decidedly their luck was in. Methinks that the M.S.M. supposed to be coming to me was deemed my reward for which I am glad as I would hardly be satisfied to get an M.M. for such a trifle. However my section is very bucked up over it & I, for one, would not have it otherwise. There is more than a suspicion abroad that the two officers who were present at the same time, were making sure of M.Cs\n\nby recommending the men for M.Ms, time however will tell. One of Fritzs Searchlights was very prominent last night, it remained in the same position for hours probably as a guide to his aircraft, who were over bombing.\n","46":"\n\nA very quiet day & bright sunshine, very little news though of the offensive, the nearest we can get is that he has advanced about 12 miles but it is not authentic. A game of hockey at night & a sponge down after left me feeling well. We are about to move but only for a short distance in about 3 days time.\n","47":"\n\nFine warm day. Very little doing. Went over to Querrieu & saw the 13th which Amb we are relieving tomorrow. I wanted to see the place & see if they were leaving any drugs for me to take over as on that depended whether I would take any from here. They are leaving a lot so will not have much packing up\n\nto do. Put all my stuff together, pack etc & had a shave before turning in so as to be ready for the morrow. Latest news of offensive is that he has advanced 15 miles and we have lost Soissons.\n","48":"\n\nUp fairly early & packed a couple of boxes, the rest of the stuff being handed over to the incoming ambulance, the","49":" They arrived about 11 A.M. & we marched out at 1.30 P.M. to the Bois le Mai, a beautiful wood where we will be resting for about 10 days. It was only about 5 miles but being a hot day it seemed more. We were divided up into parties, skirting a road","50":" coming the officers then the sgts & A B & C sections in turn, the woods be so grown that there was a slight partition between each party. We all began to dig in on arrival & soon bivvies were everywhere.\n","51":"\n\nA beautiful day. We are apparently going to have a complete rest, only collecting the Brigade sick by\n\ncar, so that I’m going to take every advantage of it. Opened my French books again so may be able to make another start.\n","52":" ","53":"\n","54":"\n\nnothing of note doing the last two days except that I went along to the 5th Field Amb to see some old friends, one being John Crane with whom I worked at Parkers & Jack Foster of Lemnos days Had tea with them & a good yarn & after tea watched them win a cricket match against the A.S.C. \n\nNews of the offensive not of the best, Fritz advancing close on 40 miles. - Made up my req during the morning & cycled to the A.D.M.S. to get his signature. During the afternoon I was engaged collecting the stores & had a splendid outing as I took the Ford & drove myself about 50 miles altogether. I also called at the No. 47 C.C.S. for a Major Ellis to make a test on me for any amoeba or parasites which might be present & making me thin. They are taking a \n\nlittle interest in me & recognise that I’m not quite as fit as I might be, having lost a lot of weight lately. The result has not yet come through. Had a singsong at night.\n","55":"\n\nSent off by car the drugs required by battalions & had a game of hockey at night after tea. Weather good. Offensive still going strong but is being held now to some extent.\n","56":"\n\nNothing of interest happening. We are just having a rest the men doing a little revetting during the day. Gave a couple of lectures to my tent subdivision on practical subjects. \n\nHonours coming out now think Major Metcalf (deceased) D.S.O. Capt Fay M.C. (gained for same thing the two M.M’s were given for at Daours) Major Close & Sgt I. Watkinson \"Mentions\". The Colonel now making our transport something decent,\n\nsacked one sgt & put I. Watkinson in his place. Waggons all painted etc & in good nick. Went to the","57":" Brigade sports this afternoon, they were very good & the antics of two Chaplins & sundry other wags made the day happy. A little rain but not enough to spoil our bivvys, fell during the night. Had a bad turn again but feel better tonight.\n","58":"\n\nInoculated this morning with T.A.B. – (Paratyphoid) it being 12 months since our last prick. Later on decide to take the day off & go to see some renowned caves at Naours about 8 miles away. Set of about 11 oclock with the W.O. & Q.M.S. & walked all the way, having dinner at Villers-Bocage A good omelette of 3 eggs, 3½ francs also some decent beer & coffee. The caves were very extensive having innumerable passages vaults & rooms all being cut out of lime stone. It appears to me as partly natural & partly the work of man &\n\ndate back to early times, but we could not get any literature on the subject. There were two main air shafts & one shaft which was used for a chimney & it was so constructed that the smoke came out through the chimney of a neighbouring cottage, so designed to mislead the enemy.\n\nVarious bones coins & other relics were on view, also monuments placed\n\nto commemorate the visits of different genealogical societies.\n\nWangled some afternoon tea from some Tommies (2 francs) & it was most welcome as the circulation was turning me up. Rested in the shade until about 6, then walked back to Villers-Bocage & had tea. Here we were fortunate enough to pick up a lorry which took us to within 1½ miles of home so we finished fit. Had a sponge down & turned in feeling well. Weather good.\n","59":"\n\nHad more inoculations to do in the morning. In the afternoon took a car for supplies to Crouy & Longpres & while waiting for tea at Picquigny, had\n\na look at a ruined castle on the top of the hill. It dated back to 800 & is about the finest of its kind I have seen in France. Walls etc were massive but the dwelling was in ruins. Tea consisted of Veal, potatoes, white bread & butter, with beer, cost 3.75 Francs. A good day with fine weather.\n","60":"\n\nHad a busy day messing about. Loaded up my section waggon & fixed up partly my gear for moving as we are due to trek again, this time to the A.D.S. \n\nGermans attacking heavily again & successfully, they claim 75,000 prisoners now for the third offensive. Situation very grave but am still confident, altho, we have not yet bumped their main offensive.\n","61":"\n\nDefinite orders for move so packed up my stuff leaving most of it for the 6th Field Amb which was going to take over from us as we were from them. Finished my dispensary box which I have had specially prepared. It consists of a case (kerosene box size) with 3 trays\n\nall divided into compartments which enables me to carry 500 tablets each, of all tablets, also tinctures, powders etc, in all 100 different drugs besides instruments, serums, syringe, stethoscope etc etc sufficient to run any sick parade or minor dressings without the trouble of unpacking etc. In addition it enables me to carry comparatively rare yet valuable drugs which are only asked for at intervals.\n","62":"\n\nReveille 4.30 Breakfast 5 move off 6.30 A.M. At 5 A.M. the Q.M. wanted me to go with him & take over the A.D.S. so had to put my stuff on the car & go without breakfast. Arrived there, but they were not having any until later so had to wait until later in the morning. The A.D.S. situated in Happy Valley at F & we had another one 1000 yds away, an A.A.D.S. in a valley alongside Heilly where our C.C.S’s used to be in by gone days. Ran up to the A.A.D.S. with the Colonel in the Chat to see what they had as a guide for me to know what was required as my section\n\nwas supplying the whole show with equipment B & C sections gear remaining on the wagons in case of a hurried move. I took over the station at 11 A.M. with B & A’s personnel, most of the bearers going forward to the posts. During the day we do everything in the tents which are dug in a little & at night we repair to a fine dug out designed to hold 42 stretcher cases with a trolley arrangement for bringing them up & down, it’s one of the best I have met & will be used exclusively in case of heavy shelling. \n\nWe are all in dugouts, my own being a splendid one being lined with curtains taken from the village and it also has leadlight windows from the same source, so that conditions allowing, we will be very comfortable.\n\nHeavy guns are fairly thick in the neighbourhood but the front is very quiet.\n","63":"\n\nAbout 30 through during the night, several being sick. Matters very quiet during the day so was not very busy. The forward A.D.S. has been cut out so the\n\nwhole ambulance is now together which will mean new arrangements in regard to carrying on this place. Weather fine and a large number of our planes were about, a couple of the enemy also across. Very little shelling apart from some salvoes of heavy stuff about 1½ miles away. Fritz’s balloons have us under direct observation & also a portion of his lines looks down the valley at us\n","64":"\n\nVery few wounded coming through but there is a lot of influenza about. Tis a type of French fever & probably spread by the louse, the matter is now being investigated by a special commission. Had a busy day myself fixing things up at the Station, arranged a buffet, blanket store & so on.\n\nArrangements of hospital not altered. I still carry on in charge C section being employed on digging etc.\n\nWeather fine & beautiful. Had a mess meeting Sgts in which my stand for a better mess was backed up. I am trying to get it on a high class basis, as it not only keeps all members up to the mark but is more enjoyable & prevents us from\n\nfalling into bad habits.\n","65":"\n\nFine weather, very few wounded but more sick. A Fritz brought one of our balloons down towards evening. He dived out of some clouds & the two observers jumped out with their parachutes but one, through some accident failed to open & he fell like a stone. The enemy shelled the batteries rather heavily in our neighbourhood also Franvillers, 300 yds up the road & another village a bit further away. So far he has not shelled our station but we hear them passing overhead quite often.\n","66":"\n\nRained during the night & the roof of my dugout proved faulty, result being that my blankets were wet. Quiet during the day but had a few gas patients in. Mud in terrible state, the old Somme variety. Rain at intervals during the day & I repaired our roof & made a mattress to sleep on so hope for a better night. Mail in today & tells me that Syd has another daughter\n\namongst other news.\n","67":"\n\nVery quiet during the day but had 50 through last night. Spent some time fixing up a blanket store etc so had a busy day myself. A little rain later in the day kept the mud going. News of Austrian offensive fair, the Italians are doing well & holding them which also points to the fact that the Austrians are not fighting well which looks hopeful\n","68":"\n\nWet & fine throughout the day. Very little doing except sick. Italians holding well & claims 9000 prisoners not bad for the defensive. But I wish that we also had the Austrians to deal with\n\nSaturday 22nd June\n\nVery quiet & wrote several letters. One of our best men Harry Fleischmann D.C.M. was killed yesterday, one of the bravest of the brave & we had two men wounded. Had word through that I have received the M.S.M. but it has not come through officially.\n\nSunday 23rd June\n\nA fine day again. Had a busy night 57 cases coming through as the result of a raid & a minor stunt. Buried Harry Fleischmann today in Franvillers cemetery. My M.S.M. has come through officially & reads – \n\nHis majesty the King has been graciously pleased to approve of the award of the Meritorious Service Medal to the undermentioned Warrant Officers Non-commissioned officers and men in recognition of valuable services rendered with the Forces in France during the present war.\n\nExtract from The London Gazette Supplement No. 30750. dated","69":" \n\n War Office 17the","70":"\n\nNo 1751 S\/Sgt H.E. Gissing","71":" Australian Field Amb.\n\nI am very pleased about it, mostly on behalf of those at home. \n\nHad arranged last night to take a trip up the line but the heads forbade it later, so had to give up the idea.\n","72":"\n\nVery quiet still and weather cold, not at all like summer. Latest\n\nnews of the Australian offensive good, they have had to retreat in disorder leaving many prisoners & guns. Saw a bomb hole near by of extraordinary size, about 40 ft wide & nearly as deep, it was dropped in the open fields & did no damage. \n\nA large number of sick through, P.U.O’s & influenza and the supplies of asprin is very low, we could only get","73":" of what we ordered. An epidemic is apparently raging. \n\nApplications for 1914 men for leave to Australia has been called for & has been rushed, it’s a good sign. Leave to Paris has also opened to a limited degree. Am now wearing my ribbon, a maroon with 3 white bar.\n","74":"\n\nFine weather but cool. The A.D.M.S. on a visit to the Amb. sent for me & congratulated me on the medal, gave the usual kidstakes etc as he had heard all about my good work etc etc.\n\nFritz over after dark bombing but although, he hovered over us for some time bombs were not dropped within our camp. Great aerial activity & several scraps of an indecisive nature. One of ours just managed to escape four huns.\n","75":"\n\nFine weather. Confirmed that 10000 shells have fallen into Amiens, one in seven houses having been hit. Tis indeed a wreck. A smart piece of hun work at dinnertime. He dived from a cloud & set one of our balloons alight then flew over us quite low. Not one of our planes was in sight at the moment so he chose his time well. Fritz over again at night & this time his bombs were closer. No casualties however but he set fire to a tractor.\n","76":"\n\nHeard today that the Hun who brought down the balloon came to grief later. Matters still quiet.\n","77":"\n\nNothing doing. Prepared reqs. For the week in quantities large enough for a stunt as there are persistent rumours of one.\n","78":"\n\nSet off to Crouy to collect the drugs. Roads very quiet. Had a swim in the Somme whilst waiting for the things & on the return had lunch at Picquigny.\n","79":" \n\nNew dressing station almost finished so will hand over to the nursing duty Sgt tomorrow\n\nas the W.O. back from leave. Very hot day, had a recurrence of my Daours trouble being up in the night. Met & yarned with Cyril Booth.\n","80":"\n\nHanded over Dressing Station to Sgt Kennedy & will confine myself to the Dispensary. Shifted & rearranged the dispensary also issued shell dressings to the 14th. Brigade so ‘tis dinkum about the stunt. It has been so advertised that I fear ‘tis a demonstration only & they are generally costly. We have made every preparation possible, extra men & cars & dressings sent forward. Infantry have a hot meal at 11 A.M. & hop over in the morning. Weather good.\n","81":" American Day of Independence & ‘tis being celebrated everywhere as a compliment to the Yanks.\n\nAt 3.10 A.M. the guns opened up right along our front & instantly flares of all kinds were sent aloft by Fritz. It was a great sight as we are high up & can see the line, the flashes of the guns & the flares making the night bright. Towards 6 A.M. the cases started to arrive & for a time we were very busy, I took on the walking cases, giving them all A.T.S. Eased off at 10 A.M. & I had breakfast. Our section was the\n\neasiest, about 200 cases through. It was an Australian Corps stunt & so far prisoners number 1060, 27 officers 100 machine guns besides trench mortars & a field gun. Had a sponge down during afternoon & clean change, feeling rotten as had another bad night.\n","82":"\n\nGreat celebrations in England & Paris to kid the Yanks somewhat. The King, Queen etc went to see a baseball match. The Huns heavily counterattacked last night commencing early in the evening. The bombardment was one of the heaviest I have witnessed & continued for several hours. He was repulsed everywhere but our proportion of dead was heavy to total casualties Great aerial activity & 3 of Fritz’s balloons were brought down in flames together. Lord Rhonda the food controller, a great Englishman, dead, one of the most successful of the war leaders.\n","83":"\n\nApplied for leave to NICE but do not expect it for some time. The front quiet again. Prisoners in last stunt totalled 1500 & we captured Hamel Village & a couple of woods.\n\nDid my washing & started on the weekly requisition.\n","84":"\n\nExtremely quiet. Received a good mail from Australia, 9 letters latest date being 12th May, just 2 months old which is now the average. Made of weekly drug requisition.\n","85":"\n\nSent off my offsider to collect the drugs & suffered for it. First he left all the returns behind & managed to break the axle of the car. Fortunately it happened near the workshops & he was given a lorry to complete the trip. Weather very changeable, rain & sunshine\n","86":"\n\nA very heavy day. I do all my issuing on this day so all the details come in which means going hard all day. Got through a lot of stuff.\n","87":"\n\nVery quiet but on our right our 4th Div. had a couple of minor stunts. Weather cool & rainy. The","88":" Div at Menin also stunting so papers are free of Australians with a commendation from Clemenceau\n","89":"\n\nNothing doing in our\n\nsector but the French have hopped over on our right on a 7000 yds front. The guns opened up at 5 A.M. & continued all day. Major McCubbin V.C. D.S.O. M.C. M.M. our crack airman has been killed accidentally, has credit of 54 planes. Fritz nabbed one of our balloons.\n","90":"\n\nA very quiet day fine & cloudy. Towards evening had some excitement in the air which I will describe as I saw it. - The hour is 8.30 P.M. & already night draws near bringing thoughts of bed. Outside all is quiet save for an occasional gun firing and overhead to right & left are the balloons watching the enemy’s lines, to pick out gun flashes in the gathering dusk & so locate their batteries. Suddenly a shot rings out in the sky & I look up for the enemy plane which has occasioned it. Bang, Bang, bang other guns have picked up the mark & I wait for the bursts to see where he is. Ah! There he is two of them, just coming out of the lowering clouds & both are diving at the nearest balloon.\n\nNow the machine guns take up the song & all round us is the noise of the guns. The observers & balloon crews by this time have seen the danger but too late. Hardly does the balloon commence to descend than an enemy plane is spitting out bullets in a fiery stream. Two objects fall from the basket, they are the observers jumping out with their parachutes attached & until each opens, they fall rapidly to earth. He’s got it! A thin wisp of fire appears, then the whole balloon bursts into flame & commences to fall leaving a thick trail of black smoke. The enemy wheels round to attack the next. ‘Tis a foregone conclusion & the observers jump out just before their balloon also bursts into flame. By this time the remaining balloons are being rapidly hauled down but the observers from the next in line also jumping out & we see no less than six men with parachutes & two burning balloons falling together. The successful enemy disappears amidst a hail of shot & shell over their own lines whilst we breathe normally again. We give the enemy\n\ncredit for a smart piece of work & thank our lucky stars that each parachute opened. ‘Tis excitement only to see a burning balloon but a man falling headlong to earth is stunning in its sorrow.\n","91":"\n\na fine morning & Fritz sent several of his balloons up, but each had a plane patrolling in front of it. None of ours went up. Hun planes also over in the morning Rain during latter part of day. Had a game of cricket. Wrote home.\n","92":"\n\nSent off for drugs. Did a little French during day & minor jobs. About 2.30 P.M. Fritz again managed to get a balloon, one which had replaced the one he destroyed on Saturday. It was all over in 5 minutes but the barrage put up by our anti aircraft guns saved the next balloon in line. Its observers however jumped out & all landed safely. ‘Tis wonderfully exciting while it lasts.\n","93":" \n\nA very busy day as\n\nAll the units sent in for their supplies. I was issuing hard all day. About midday we made a great demonstration in the air about 36 planes went over in one flight & later we brought two of his balloons down in flames. Undoubtedly we are supreme in the air, the most pessimistic of our chaps admitting it. Word through that the enemy has started a fresh offensive on the French front round Rheims on a 45 mile front & has crossed the Marne.\n","94":" \n\nHot close & muggy after rain of last night. Very little doing. Brought down more enemy balloons today, I believe two on our sector but I did not see them. Very scanty news of offensive through & as usual during one, the papers are very scarce. It is understood that the French are holding him. We expect it to extend to us. Only two cases through last night, very few sick now coming through, the Flu epidemic having practically passed off. They tell us that the huns have it badly.\n","95":"\n\nShowery & close. Had a few shells in our neighbourhood but not dangerously so. News from French front very good, they standing their ground & counterattacking.\n","96":"\n\nA fine day & very quiet. Fritz raided the 29th last night & captured a few men, we had a few patients through both gassed & wounded. Had the pleasure today of seeing two Hun balloons brought down, one of which had nearly reached the ground but our flyer followed it down. There is also good news from the French front, it so far being official that the ordinary line troops attacked on a 24 mile front & captured guns & a few thousand prisoners advancing some 6 miles, very cheering news.\n","97":"\n\nPapers scarce again as is usual during the fighting so have not the good oil of whats doing, we know however that the French have taken 23,000 prisoners which is very good. At 9 A.M. this morning we brought down a Fritz balloon much to the lads gratification\n\nThe airservice absolutely delights our chaps now it being so decisively in the ascendant. Rain late in the afternoon.\n","98":"\n\nMade up requisition for weekly supply of drugs. Very quiet.\n","99":"\n\nCollected drugs at Crouy. Took the Q.M. W.O. with me & made a day of it by going to Dados as well. Had great difficulty in getting dinner at Picquigny\n\nowing to the new French rationing scheme. At last we met an old dame enamoured of the Aussies because of our work on the Somme & she made a special effort & gave us 3 eggs potatoes & peas for 2.75 Arrived back at 4 oclock & a splitting headache. Whilst away the huns had brought one of our balloons down & we brought two of his down.\n","100":"\n\nWet nearly all day. Issued supplies all day. Air service quiet.\n","101":"\n\nQuiet & rain. Nothing doing. Rather an important event in the history of the unit was the arrival of our 1st Yanks. 36 of them belonging to the 129th\n\nProvisional Field Ambulance 33rd Division joined us for experience. They were soon surrounded being still an object of curiosity. These Yanks are a fine crowd, being fresh with plenty of spirit & will do well. They are proud to be with us. One infantryman said to me, They ought to put us over the top straight away as we have plenty of spirit being fresh & having been talked into it are now at our best. \n","102":"\n\nA very quiet day, rain at odd intervals. In the evening we now have a hand at cricket.\n\nFridau","103":"\n\nNothing doing. Had a splitting headache. Rain during the day. Expect to move in a couple of days now. Just been published that the British Gov. is going to pay gratuities to Australians who possess the V.C. M.C. D.C.M. & M.S.M. so I’m included. The idea tickles me a lot, it will be a connecting link with my army days after the war. Our 3rd largest liner has been sunk.\n\nJusticia, 33,000 tons off Ireland.\n","104":"\n\nVery quiet. Had a visit from the 12th Fld Amb who are taking over. The line is being strengthened as we have handed over a piece to the Tommies.\n","105":"\n\nEverything normal until midday when we had word through of a stunt to come off in the morning. By night we had everything ready, extra blankets & stretchers sent forward besides dressings etc necessary.\n\nAlso another surprise that the Tommies are taking over from us so that we have either been fooled or else events have transpired which call for the alteration. Personally I think ‘twas intentional as secrecy is tried hard for nowadays. I expect that we will be relieved on Wednesday but the Colonel himself didn’t know. ‘Tis very hard to keep things secret & from being talked about as the men can now judge\n\njudge so easily of what is coming when they see the slightest preparation & then it passes from mouth to mouth with a rapidity extraordinary. \n\nI have been busy during the afternoon getting my part ready & will probably be doing the evacuation tomorrow. Also prepared the weekly req. but do not know yet when we will collect it.\n","106":"\n\nThe barrage opened up at 12.30 A.M. but not a heavy one. The stunt itself was small, on a 4000 yd front & was an advance of 500 yds. By 5 A.M. they started to come in from then till about 10 A.M. we were busy, passing through about 160 cases. All arrangements were perfect & worked very smoothly. We handled about 30 prisoners & I understand about 100 or so others were taken. My souvenir of the day was a Fritz tin hat, camouflaged, the owner being a sniper, which I sent home. We used lorries & cars for the evacuating. One Fritz officer was a perfect specimen of a man & some of the Americans, who enjoyed themselves hugely, were very useful as interpreters\n\nSent of for the drugs in the afternoon things being quiet. We expect to leave on Wednesday.\n","107":"\n\nHad a busy morning issuing drugs & preparing to pack up, at which I was busy until 9 at night. I had all my G.S. panniers as well as the medical, my dispensary boxes, then make an inventory of the drug stores which I am handing over. All went well & I am ready to load my particular wagon in the morning. C. Section moved out during the afternoon & the incoming ambulance arrived & will take over in the morning at 10 A.M. when I will be able to withdraw the remainder of my equipment.\n","108":"\n\nHad a very busy day. Up early to complete packing & by 10.30 A.M. we had handed over to the 54th Fld Amb & had our wagon loaded. Motor lorries were provided to move us & A Section went to Rivery on the borders of Amiens to run a small station whilst the remainder of the Amb went to near Poulainville. We treat local sick, brigade sick and\n\nmen requiring treatment after being in Amiens. So long as Fritz refrains from bombing or shelling the place it will be ideal. I am running the place again being in the place of the W.O.\n","109":"\n\nPractically nothing doing all day bar a few cases of sick. Our Q.M. evacuated today owing to too much liquor. Last night the planes bombed the town I believe but I did not hear a sound all night. More drunks in the neighbourhood than anything else.\n","110":" \n\nWe are unfortunate. For the first time since the 25th June Fritz shelled Amiens again putting up some heavy stuff during the night & early morning. The guns could be heard, then the whine of the shell followed by the burst the sound of which reverberated through the empty streets like several houses falling down. No wonder the place is empty. Our Colonel decided to send everyone not absolutely necessary away so we cut our\n\nnumber down from 70 to 20 & we will carry on as before. Busy all the morning getting them away also extra gear otherwise nothing doing. Rain nearly all day. Had a swim in the baths, which are first rate, after tea & enjoyed it thoroughly, the water being quite warm. Started on French again. Fourth anniversary of France declaring war today.\n","111":"\n\nThings very quiet & I appreciate it. Made up a small requisition for the brigade & sent it along to the A.D.M.S. for signature. Rumours are about of something doing and I have had several requests for shell dressings which points to us soon being in action again. Had a swim after tea again and enjoyed it immensely. The baths are about 100 yds long & 14 ft deep with spring boards, etc & dressing cubicles\n","112":"\n\nAnniversary of our declaration of war and still going strong. Went to see the Colonel about collecting our \n\nstores at once instead of waiting until Monday, the usual day. Set off about 10.30 the major at the Depot being very wrath at my going on Sunday. He did a great growl saying that the Australian Corps use more stuff than the ordinary corps whereat I replied that it was not my fault that the Australian Corps was given so much to do, which silenced him, as report gives it that we do have more line work than ordinary divisions which is a sore point.\n\nHowever I obtained most of the stuff & also called at the C.C.S. for some vaccine. The laboratory there is run by Canadians & they are a fine crowd. On reaching Camp I apportioned out the wants for my brigade & sent it off by car so that part is satisfactory. After tea had a short cricket match then went for a swim, on my return found the 14th Artillery in for dressings. Fixed them up & then went round to some civvies to buy a paper, some eggs\n\n& milk. They are much excited at the good news, Fritz now having retired to the Vesle under heavy pressure. It certainly appears as if the initiative has passed to us & we see every indication of a big push being made on the Amiens front. I passed dozens of heavy guns today going up, from 60 pdrs to 9 inch & tonight we saw a lot more.\n\nTomorrow I am to equip an Ambulance with dressings & supplies likely to be wanted in a big advance so something is truly afoot, I hope so as a definite victory this side of Christmas will show the world the winning side. The Canadians are appearing in strength & will probably be used as they have been resting for some months. Hundreds of tanks are forward. Our 4th Division have relieved the French on the Eight but I hope they don’t use our crowd too much as we are not too strong in numbers.\n","113":"\n\nHad orders to pack up & close down our station about 10 A.M. which I did. Also issued some drugs. At midday received orders to arrange for moving out & then to report to the other camp in order to equip our bearers with extra shell dressing, tourniquets, gas ampoules, bandages, splints, waterbottles etc for mobile warfare & had a car placed at my disposal to save time. Set things in motion for moving & then wisked off to H.Qs Camp where I saw the Colonel & satisfied him that I could supply everything then back to the other camp to load my medical store waggon.\n\nThis done marched all men out to return to H.Qs & returned there myself & had a busy couple of hours getting the gear ready. We sent out 27 squads each fully equipped with 27 stretchers blankets & water proof sheet, Thomas splints backleg & arm splints, 500 shell Dressings\n\n& various lots of wool bandages besides shell dressing, haversacks & waterbottles. They all marched off at 8 P.M.. The few left proceeded to the M.D.S. at St Acheul to join up with the 6th Field for the stunt. About 10.30 the Colonel & I left by car for St Acheul where the 6th Field are running an M.D.S. in a huge building lately used as a French Military Hospital. Turned in in the dark no lights being allowed. \n","114":"\n\nUp at 7 A.M. for parade but ordered to stand by. Another parade at 10 A.M. when the men were allotted to jobs but there will be nothing for me to do until the stunt starts as there are plenty of dispensers. Mooned away the rest of the day & wrote a letter, went for a stroll in the evening. The Sgts live very well here, the mess being first rate having plenty of vegetables etc.\n","115":"\n\nParade at 7 A.M. Still no duties. Washed some clothes and wrote letters during the day. At 6 P.M. went on duty giving A.T.S. as the stunt is imminent.\n\nHad a very quiet time until about 6 A.M. when they started to come in. All night long thousands of cavalry were passing. First tanks went up, a hundred of them and without ceasing the stream continued. It was an inspiring sight to see such forces going up at speed to the line, all the crack regiments being included. At 4.30 the stunt started & was wonderfully successful. It was a dull misty morning and the surprise was complete. Exactly which frontage was attacked we do not know but all our Divisions are up, also the Canadians & the Tommies & French are included. A wonderful effort indeed & a worthy finishing effort to this diary. Went off duty at 8.30 feeling fit, not being unduly tired. The whole affair has the Foch touch & our men are as keen as mustard to be in it, although they have had such a long time in the line.\n\n"}}