{"Document Name":{"0":"Diary_0124","1":"Diary_0124","2":"Diary_0124","3":"Diary_0124","4":"Diary_0124","5":"Diary_0124","6":"Diary_0124","7":"Diary_0124","8":"Diary_0124","9":"Diary_0124","10":"Diary_0124","11":"Diary_0124","12":"Diary_0124","13":"Diary_0124","14":"Diary_0124","15":"Diary_0124","16":"Diary_0124","17":"Diary_0124","18":"Diary_0124","19":"Diary_0124","20":"Diary_0124","21":"Diary_0124","22":"Diary_0124","23":"Diary_0124","24":"Diary_0124","25":"Diary_0124","26":"Diary_0124","27":"Diary_0124","28":"Diary_0124","29":"Diary_0124","30":"Diary_0124","31":"Diary_0124","32":"Diary_0124","33":"Diary_0124","34":"Diary_0124","35":"Diary_0124","36":"Diary_0124","37":"Diary_0124"},"Date":{"0":"unknown","1":1314.0,"2":1315.0,"3":1316.0,"4":1317.0,"5":1318.0,"6":1319.0,"7":1320.0,"8":1321.0,"9":1322.0,"10":1323.0,"11":1324.0,"12":1346.0,"13":1347.0,"14":1348.0,"15":1349.0,"16":1367.0,"17":1368.0,"18":1377.0,"19":1387.0,"20":1392.0,"21":1395.0,"22":1396.0,"23":1402.0,"24":1403.0,"25":1492.0,"26":1501.0,"27":1519.0,"28":1521.0,"29":1533.0,"30":1534.0,"31":1546.0,"32":1552.0,"33":1567.0,"34":1568.0,"35":1572.0,"36":1574.0,"37":1578.0},"Entry":{"0":"\n\n","1":"\n\nOn shift from 4 till 8 this morning. Very quiet day on again at 4 till 6. Left this position for new one tonight. This possy is below Messines & in some rough country. Spent a busy time getting lines tc fixed. Worked till 2 am.\n","2":"\n\nHad a bit of a sleep & awoke at 9 for breakfast. Tried to fix up one of Fritz dugouts to sleep in. Left the battery at 2 for the Brigade. job. Fritz very active here tonight.\n","3":"\n\nRained all night & had a wet time. No sleep. Fritz very quiet today. Left the post & made way back to battery. Fixed up the Fritz dugout for sleeping. On duty at 8 till 12. Received letter from \n","4":"\n\nOn shift from 8 till 12. Last night Fritz shelled some of our teams with the result of the killing of horses & wounding 3 drivers. Poor old Billie being wounded, not very severely though. Very quiet day. Fritz’s planes were active & succeeded in downing one of our balloons. On shift again at 6 till 8.\n","5":"\n\nOn shift from 4 till 8 this morning. Very quiet day. On shift again at 6 till 8.\n","6":"\n\nOn duty from 4 till 8 this morning. Day dull & raining. On again from 4 till 6.\n","7":"\n\nOn duty from 12 midnight till 4 & 12 till 4 this afternoon. Fritz shelled us for a few hours this afternoon. Damaged 2 guns, but none of the boys were hurt. On shift again at 8 till 12. On this shift Fritz pelted us with big shells & also gas shells making things hum for a few hours.\n","8":"\n\nOn shift from 8 till 12. Fritz left us alone today, but shelled around about heavily. Day warm and bright. On duty again 6 till 8.\n","9":"\n\nOn duty from 4 till 8. Fritz got us in the home run again today, making it very uncomfortable for us. On duty again at 4 till 6.\n","10":"\n\nFritz shelled heavily with HZ & gas shells the whole night. Woke at 8 for breakfast. Left the battery at 2.30 for the brigade OP a 24 hour job. Hun shelling around Messines all day.\n","11":" to","12":"\n\nDown and out in Ronan Hospital, gassed. I was caught at Messines on the night of 22nd in the OP dugout. Had a tough time with eyes Cannot speak too highly of the attention & kindness of the nurses & doctors at the American hospital at Rouen.\n","13":"\n\nLeft the Rouen Hospital for Blighty. Travelled to Havre by ambulance and then on the hospital ship Southampton.\n","14":"\n\nLeft Southampton by track for our hospital. After a comfortable run in the ambulance train, arrived outside Birmingham at 5. Got to the hospital at 5. It is a beautiful place & is some swank suburb outside outside Birmingham. Harborne Hall Auxiliary.\n","15":" to","16":" \n\nAt Harborne Hall getting on the road to fitness again. Had a good time here, and was sorry to leave.\n","17":"\n\nTransferred to Dartford Hospital in Kent. 17 miles from London. Pretty rough after Harborne.\n","18":"\n\nLeft Dartford for Weymouth Con. Depot.\n","19":"\n\nLeft Weymouth this morning for Park House Salisbury Plain as a case for Australia. Hope to be on a boat very soon unless I come the proverbial \"Girtzer\"\n","20":"\n\nStill on this famous Plain. Have come this \"Girtzer\" in as much as my medical papers are missing, and so far see myself being left behind with a few others here. I hope anyhow to be lucky enough for them to turn up before the boat sails.\n","21":"\n\nPapers turned up today. May have the luck to be with the boys after all.\n","22":"\n\nName came out on the boat roll today.\n","23":"\n\nLeft Park House today for AIF Headquarters London to work on a special job. Dont know how it will last or the outcome of the affair.\n","24":"\n\nFixed up at Horseferry Road to start work tomorrow. Also got diggings close handy. \n","25":" to","26":"\n\nOn 10 days leave to Scotland & to Carlisle & Manchester. Had a fairly good time.\n","27":"\n\nLeft London for Plymouth to get on the boat for home.\n","28":"\n\nLeft Plymouth at 12 noon on the Balmoral Castle for home. Our Convoy consisted of the \"Morea\" as escort with 12 destroyers. The Argylleshire Euripides with troops. The Ionic with soldiers’ wives. The Khyber & a Holt boat completed the fleet.\n","29":"\n\nArrived at Sierra Leone (Freetown) at 7 oclock this morning, after rather a pleasant trip from Plymouth. Its terribly hot here, though Freetown looks a decent sort of town.\n\nIn the bay is the Marathon & a P&O Branch boat with troops for the fronts.\n","30":"\n\nLeft Sierra Leone this afternoon at six oclock. Our fleet this time consisted of the Argylleshire Euripides Ionic & our boat escorted by the \"Brittania\" a predreadnought.\n","31":"\n\nSighted Capetown at 6 this morning. Came into port at 12 & after the passengers disembarked we went on shore leave at 3 till 11 pm. Went out to Camps Bay.\n","32":" \n\nLeft Capetown this afternoon at 3 oclock after spending an enjoyable 3 days leave in and around Capetown.\n","33":"\n\nArrived Fremantle this morning at 8 oclock tied up at wharf by 10 and went on leave to Perth till 6 oclock tonight. The people treated us with every hospitality.\n","34":"\n\nLeft Fremantle this morning at 6.30. Passed the Ionic coming in.\n","35":"\n\nArrived at Adelaide late this afternoon. Got into the bay at 6 oclock. All the South Australian Victorian & Tasmanian troops left at 8 for the city. The balance of the troops aboard were entertained by the people with a good feed & concert.\n","36":"\n\nLeft Adelaide tonight at 10 oclock after a pleasant 2 days with the people and their hospitality.\n","37":"\n\nArrived Sydney at 7 oclock today. Got to Anzac Buffet at 9.25 and \"Salutations\"\n\n"}}