{"Document Name":{"0":"Diary_0239","1":"Diary_0239","2":"Diary_0239","3":"Diary_0239","4":"Diary_0239","5":"Diary_0239","6":"Diary_0239","7":"Diary_0239","8":"Diary_0239","9":"Diary_0239","10":"Diary_0239"},"Date":{"0":"unknown","1":1489.0,"2":1529.0,"3":1530.0,"4":1531.0,"5":1532.0,"6":1533.0,"7":1534.0,"8":1535.0,"9":1566.0,"10":1580.0},"Entry":{"0":"\n\n","1":"\n\nWe are still here waiting orders, we are taking things easy too. We rose at 7.30 & breakfast at 8 o'clock. It seemed ridiculous to get up half an hour before breakfast, because we have no water to wash anything. We can get enough for a shave from the water cart, but that is all. The people who were in this camp \"got the wind up\"& blew in all the wells, burned the disabled planes, & left nothing for the enemy except the accommodation. Consequently we have a drought. But it is raining heavily tonight. We may catch a little from the roof. We fell in on parade at 9.30, our rifles were inspected & then we were detailed to wash the tool-carts & limbers. These cursed things are more nuisance than they are worth. We did not take long to do it owing ot the scarcity of water, & what we did have was muddy. We then examined an aeroplane left in one of the hangers. An aeroplane has wonderful workmanship in it, everything built for lightness & strength, but nevertheless the planes built at present are huge & heavy. This plane was a single seater, & had a Lewis & Vicars machine guns in it. The Lewis gun was fixed above the plane & the Vicars was inside worked & timed by the shaft as it fired between the blades of the tractor. But this plane is by no means the best I have seen. After lunch at noon, we had permission to visit the village. We went, but there was absolutely nothing but empty houses & filth. Some of the froggies were left but they were packed up ready to move. We soon left it. On our way home, we had a look at two tanks which were lying near by the road. I shall not attempt to describe a tank inside, beyond the fact that it is a mass of machines & guns. There is absolutely no room to move once the crew is inside. The mere look of them is an emblem of strength. We have heard from the Tommies that the Tommy divisions which were opposed by Fritz, first just took to their heels. They left everything & in one place, they left over 200 stretcher cases outside a dressing station. There was apparantly a stampede& for miles back, we have met Tommies, who have lost their battalions. The enemy is checked now & it seems that it will be a repetition of last years battle of the Somme. The place where we are now camped, is known as Clairfait. We had an issue of bread to-night, five men to a small loaf, which pans out to less than two slices for 24 hours. We are now in the Somme, known for its scarcity.\n\ntotally different to that wh. we have just left around Ypres. Here it is hilly with beautifully cultivated fields on the undulating country. There is very little water here, in fact we have to walk about 600 yards for it, & then haul it up in a bucket from a well. At Ypres, we had only to go to a shell hole. I had the best sleep last night that I have had since we left the trench at Wytschaete.\n","2":"\n\nWe rose at 7 o'clock to get ready for the road again. The whole division is on the move & it really is an eye opener to see the roadsofonecontinuous stream of men, horses and motors. Where do they all come from is the main question, because we all know where they are going. We vacated our quarters at 9.30, to allow another unit to enter. We started to move at 10.30. It was dull & cool, wh. seemed very promising for marching, but before we had gone very far it began to rain. All along the road were groups of Tommy A.S.C., anywhere where it was temorily possible to dump their stores & camp. This last move has been quite different to what we have seen yet, consquently no provision of any kind has been made. We came along six miles nearer to the line, but we are in no particular village. We first landed in the blacksmiths shop of the R.F.C., & the filth was awful. However the rain came thro the roof in several places, so now we are in a hut wh. the Tommies have just left. This came belongs to the R.F.C., but they have deserted it. We have received biscuits for rations to-day, wh. I presume is the beginning of them until we get more settled. We are not far off the line now, & ready to move anywhere. This is a true phase of olden warefare where we have to rely on the rapid movement of troops.We had a hot dinner to-night, wh. is always welcome; it is a boisterous night, wind, rain & cold & have to thank our lucky stars that we have a roof over our heads. This & next month are usually wet, & suppose more will follow. We managed to get a paper five days old, wh. was the beginning of the offensive & we devoured it. At present, we have had no news at all & people in Australia get every detail within 24 hours. The country is more open here & it is possible to see for miles over beautifully cultivated fields, & sprouting crops. Many of the crops have been destroyed owing to the necessity of having to dig trenches. You will notice that my writing varies considerably but that is only due to the varied positions in wh. I have written this. At present, I'm in the prone.\n\na6664007.html\n\nabsolutely filthy after having marched thropowder like dust on the road. Whenwe wanted a wash we found that we had to walk half a mile for some water. We have had a cup of tea & we are expecting to have some stew later in the night. We have a rifle inspection at 8.5 pm, & so far we have been carrying our rifles loaded. We are to be ready to move off within half-an-hours notice, but it has started to rain since we arrived, & goodness knows what effect that will have on the advance.\nTo-morrow we go up the line. We are camped in a lecture hall, belonging to the officers corps school. When the offensive started, all school broke up as well as clinks,bases & other places were fit men were living in order to get themto the war. Every available man has been needed.\n","3":"\n\nI managed to bring a little ink in an oil-bottle so that I could write in ink when the opportunity showed itself & it has done so now: pencil is soon obliterated with much rubbing of the pages. We are yet in Vauschelles on the Somme area awaiting orders. Orders were read out last night when we were about to turn in,that everybody & everything had to be on the road with half an hours notice & and so we have remained all night and & all day. Rumours have been flying around as to where the Boche is, but we shall see for ourselves before we grow much older. It teemed with rain all night, but fortunately it cleared this morning. I don't think Fritz can be too far as people leaving their homes passed by here this morning. All their belonging in carts & any wheeled conveyance that will take a load, women pulling cows & pigs by ropes, & in all a ptitful & distressing scene. Of course there are no men-folk now, women and children have to do all the work. We had a parade this morning merely for rifle inspection. Then we had a few fatigues roundthe tool carts, cleaning & sharpening tools. We carried on with the same work this afternoon. Somebody has just reminded us that it is Good-Friday. But am afaid that to-day has been like any other day of the year. The three divisional field companies are here together. I saw Wilkinson to-day who is in the 58th Battalion. He is supposed to be in the band but with times like this everybody has to stand to his fifle. The country round here is\n\ndinner followed by rice. At 2.0 pm we had a gas helmet drill, wh. lasted about 45 minutes. Since then I have been wondering how to pass away the time to keep warm. There is a miniture facsimile of Fritz trenches here, wh. was laid in preparation for the advance here in Ypres & Messines \nwood\n​.The ground has been excavated to form the ridges, gullys etc. just the same as the natural surface of the ground in the area to be taken. We move off to-night at 7.0 pm, & hence to our destination, \"somewhere in France.\"\n\n28.3.18\n\nDuly at 7.0 pm we left the camp at Reninhelst . We left as a field company leaves when on the move. Officers mounted, cyclists of section led off, followed by section sappers & tools carts: Headquarters brought up the rear. We left 240 sappers and drivers, 30 bicycles, & 71 horses and limbers, pontoons etc. We occupied about 600 yds of road. We marched to Houputre & arrived there at 9 o'clock. It was a fair distance & we did it on one spell of ten minutes. We entrained at the latter place. A part of pioneers loaded the train with the waggons & carts, & the drivers, the horses. We were packed into cattle trucks, 32 men in each. It was a frightfully cold night, & we dreaded the journey. We had a cup of tea at 10.30 & left at 11.45. The floor of the truck had spaces of half an inch between the boards. We had an awful night, & my feet were like two blocks of ice the whole time. We made a cup of cocoa by getting some hot water from the engine. We arrived at Mondicourt at 12 o'clock; it was blowing a gale of cold wind.Had a cup of tea wh. we managed to make behind a shed, & left for the road at 1.45 am. Everything & everybody was in a bustle. Cars of wounded & lorries with all sorts of stores lined the road. We passed Americans digging in & deserted villages & eventually reached Vauschelles where we are camping for the night, we arrived here at 5 o'clock. My feet were so sore that I could hardly stand after our 9 mile march. We were\n\n\n\nlined up at 9.50 & we were marched in front, & the whole parade was drawn up before the Major. The orderly officer read out routine orders, then the Major read a letter from Major General Hobbs, to the effect that we were entering the most decisive battle of the war, &that it was everybody's duty from commander down, to do his utmost to uphold the reputation of the division wh.had a record of divisions etc. etc. The Major then spoke of the reputation of the company, wh. had taken two years to win, and not to lose it etc. We were then broken off to clean up the camp,& thetransport moved off. It looked fine & like a new transport, & the horses were very fresh. We had lunch at 11.15 and moved off in shell fire formation at 12.30. We waited for the light railway at Kemmel wh. was to leave at 1 o'clock but nobody ever dreamed of it coming before it did, at 2 o'clock. We bundled into low, open trucks, and set out for Reninhelst. It turned out a beautiful sunny day & to see all the troops being taken from this front in the railways, seemed like a south coast line in holiday time. Trains passed along all night & all day, & it has been one huge exodus. All motor lorries have gone, and the place seems quite forsaken. We passed thro ploughed fields & sprouting crops. It is a new order that every unit must plough an area ofland & cultivate grain. This applies to the transport lines mostly, as they have the horses to do the work. The first operation is clearing the barbed wire, & it is wonderful how the place can be cleared of this treacherous material. There are piles of wire lying all over the country. When we arrived at Reninhelst Terminus we had to walk for half an hour to this camp. We are here, apparently comfortable, for the night. We arried at 3.30, had dinner at 4.0 pm. Then I had a wash in a neighbouring dam & settle down for a rest. We have heard that the French have out-flanked the Boche, but the news is very scanty and indefinite. \n\n27.3.18.\n\nI had another wretched cold sleepless night. I had little or no sleep after 12.30 a.m. We had reveille at 8 o'clock, and breakfast 15 minutes later. There was a strong cold wind blowing, & has kept up all day, & besides it has been dull and miserable. We rolled & packed our blankets on the carts by 9 o'clock. Then the polishing of guns & equipment took place in preparation for the 11 o'clock parade. We had company drill by the Major until 12.30. It was comfortable marching about, but cold starting. A very insipid aqueous curried stew for\n\n25.3.18\n\nI was up early this morning as I had to pack all my belongings. We had breakfast at 7.15 - rolled our blankets & placed them on the cart by 8 o'clock. Our section was duty section to-day, naturally we were the last to leave camp. The other sections left from 9.0 until 9.30 am. When men leave the vicinity of the line in daylight, they march in small parties of a few men, with several yards interval. This is the method adopted under shell fire. However the cleaning up was not serious, & we left our home at Wytschaete at 10 o'clock. Fritz was still sending over his hourly shell into the dump when we left, but we passed thro unmolested. We were setting our watches recently by his shelling, & it became a everybody habit to look at his watch to note how far off time he was, in fact there were always bets on it. The men at the dump have a 15 minute& 5 minute bell,& when the 5 minute bell goes they all rush for a dugout until the shell lobs. We arrived at the horse lines at 11 o'clock. The horse lines are just out of Kemmel. Our officer kept nagging at us all the way in, but he is quite new,& will soon learn better. The topographical section has been disbanded,& Green has returned to the company. We were given a bunk for the night, &very soon we rid ourselves of all equipment. We had a cup of tea at noon. At 1 o'clock we had to unload the motor wh. brought up our po\no\nntoons from the \"park\", oil every piece,& load our own pontoon waggons. This task occupied our afternoon. When we were about finished some men strolled along, drunk as lords: one of them has been placed under open arrest. I met Bate in the driver's section, who is a brother of Mrs Warlow-Davies. We have not heard where or when we are going. The Somme is our destination but that is all we know. Everybody's gear, officers included have had their luggage cut down, so that they shall travel as light as possible. We each received an Xmas parcel from the 7th& 14th F.C comforts fund, containing a tin of coffee, a tin of ham paste, sweets, chewing gum, a handkerchief, paper& envelope, tobacco& cigarettes. Of course this parcel was given to us, just when we did not want to receive anything. Most of us gave the coffee to the cook who had it dished up for tea. It has turned very old,& it has started to rain to-night.\n\n26.3.18\n\nI passed a very cold& uncomfortable night,& was quite glad to get out of bed at 7 o'clock. The rats, cat-size, rushed about all night \nnight\n. Beyond reveille at 7 o'clock we knew nothing. It was a cold morning but not raining. The transport was\n\n28:3:18.\n\nI slept in the orderly room last night. I was awakened by the picket at 4.0 am to say the phone was buzzing. I leant out of bed& answered it. A voice from the other end announced all line correct. We have a phone to Brigade for the purpose of announcing a hop over by Fritz,& the picket is not allowed to answer it,& consequently we have to be awakened. At 7.30 the artillery rang up to find out if the phone was O.K. Fritz shelled the dump hourly the whole night: one shell per hour. Work has gone on smoothly to-day,& we have been kept going with the weekly work reports. No sooner had we finished our work than a message came thro to say, \"Pack up& move out at once.\" Now the work began in the orderly room. Handing over maps had to be drawn, & handing over reports written out. We have kept going until now 2.0 am,& the Major tells us that we shall have to start at 8.0 again. The phone has been going continously. Am dead tired now.\n\n24.3.18.\n\nAt 3.45 am, wh. seemed shortly after turning in, the picket woke us& said \"Gas - Get your helmets on\". Dog tired,& half asleep, I made a dive at my mask, and as I could not smell gas, I said, - the gas,& turned over,told the picket to wake me again if gas came in,& I went to sleep. At 4.0 o'clock, the cursed phone rang again. Everybody was up early ready for the move. Blankets were rolled& winter clothing collected by 7.30.Commenced work at 8.30 on handing over reports. The sections have been having parades this morning. We were exempt from parades. News has come that we do not move until tomorrow. The 1st Division is taking over from us. All leave has been stopped. We did not do much work after 11 o'clock, just waiting for orders. Rush of work began late this afternoon. Had a rushed tea at 4.30& no time to prepare our own belongings as all orderly room stuff had to be packed first. The orderly room sergeant was stopped from going on leave,& arrived back at 8.30 pm. He went as far as Calaise . I quitted the O.R. to have a go at some of my own belongings. All men proceeding on leave have arrived, owing to this huge German offensive on the Somme. It seems as though things are approaching a crisis. I have cut a foot of length off my overcoat to make it lighter, had a shave& am now turning in, 10.30 pm. \n\nwhich require care for efficiency. We sent over some new gas last night, the result of wh. we have not yet learned. But this gas really belongs to the Americans,& they set,& released it. One night last week all our available infantry were carrying stuff to the supports, both gins & ammunition. They were all set waiting for a favourable night. I have not heard any official reports concerning the release of the gas, but, that the guns are similar to our trench mortars,& that the charges are fired electrically& simultaneously is fairly correct. There were bunches of 2000 shell let go. Fritz has been shelling all the back areas to-day& even at poor old Ypres. There have been more gas casualties to-day, most of whom were charged with S.I.W. as the rumor has it. S.I.W. will be explained at a later date. It is not 11.30 pm& not long finished work. A severe bombardment has started in the Passendaele area. It is a beautiful moonlight night.\n\n21:3:18\n\nThe bombardment lasted all night, far& near. We had a raid arranged for 11.0 p.m. when we go over on this sector, there is no difficulty in finding out where the bombardment is going on. I was awakened several times in the night, but the worst was the 4.15 am bombardment. I have learned that Fritz made a counter attack at stand to, on one of our outposts. I saw a runner from the line& he told me that our wire is like a clothes line with dead Fritzs. He was cut up completely. The machine guns on the outposts had the joy of their lives. Fritz could not have chosen a more advantageous time for us. The Orderly Room Sergeant expected to get away to-day,& owing to his disappointment has done very little work, naturally I have done more than usual. Frtiz has been shelling the dump, one shell per hour as regular as the clock. He has been shelling Bailleul with naval shells,& in fact he has been putting them everywhere. I have finished early tonight, 10 pm.A shell has cut our phone wire.\n\n22:3:18.\n\nEverything was very quiet last night after the previous nights episode. Gas is still lying about this place,& very unpleasant in the forward areas. Started this morning in the orderly room in earnest: The sergeant left on UK leave this morning. I have had an easy day but a long one, as it is now 11.30& my bed to make. I have spent most of the evening at the phone sending wires. Fritz is very busy with his shelling,& shelled the dump here, the whole day long.\n\nbusier to-day,& kept going. The Captain gave me an O.P. to design, one which I took dimensions of a week ago. Our omnicient Capt. has apparently been unable to do it, & has handed it on to me. I presume he will produce it at C.R.E., as his own work. Gormly has been made a Lance-Cpl to-day, prior to taking over the Sergeant's work. We received a message to-night to say that gas was going over at 8.30, but it is now 11 pm& nothing has happen. Fritz has been shelling our back areas again to-day & the dump as well. He set alight to one of our ammunition dumps to-day,& the explosion thereof was terrific. The cordite& fuses then flared up. I have just noticed that one of Fritz dumps is burning to-night.\n\n19:3:18.\n\nIt was raining when I woke this morning& has continued all day. In fact it has rained heavier to-day than I have ever seen it in this country yet. It was very nice to think that I had no occasion to go out in it. Everything was very quiet this morning until about noon, when Fritz took it into his head to shell the dump again: he shelled it last night too. He has been sending over a great deal of gas lately,& last ngiht he gave the artillery a dose. There were thirteen casualties in one battery. One shell went thro one roof of a dugout& thro the bunk into the ground. They have been unable to go near the place to-day. Fritz was also sending over some naval shells, wh. travel at a very high velocity, with a low trajectory, wh. makes the whizz very near. I have been drawing O.P.s for the Captain nearly the whole day until now, I'm just sick of the sight of them. I have an hour off at present to do a little writing, but an hour is nothing where there is a pile of correspondence to answer.\n\n20.3.18\n\nFritz was busy all night, shelling the dump, & firing gas shells over. The ground about the lines is saturated,& very bad for human life. I arose at 7.30,& had a bath before starting work. A bath in a kerosene tin is better than nothing. It was raining early morning, but has since cleared up. I have amused myself to-day by drawing isometric sketches of gas-proof doors for dugouts& pill boxes. They are simply made by wrappping the timber in a specially manufactured gas-cloth,& then constructing the fame. A closely fitting curtain of the same material forms the door. They are things\n\nto lay the track. I went down immediately& did it, while I had the time,& it took me no longer than the first trip. I have been doing odd tracings to-day,& various other trifling jobs. The Topo section was paid to-night at 8.0 pm then we had a clear run. More Australian mail arrived to-night, but there is more to come. Fritz has started to put his shells over here to-night. His latest craze is armour piercing shell sinking well into the ground& bursting. They do less superficial damage, but if they were to strike a pill-box or other dugout, that would be the end of the dugout. One of our officers was saying that he was in a pill-box when it was struck by a whizz-bang (44 mm). The result was that the whole pill-box lifted bodily into the air for about six inches. There are instances here of a heavy shell striking the side of the pill-box or just under the side, resulting in the complete displacement of pill-box, hence the name. The company amused themselves to-night by hunting rats from their holes with cordite: we have rats in this trench the size of dogs.\n\n17:3:18\n\nBeing Sunday,& breakfast late, I slept in until 8 o'clock. I took my time& arrived at the orderly room in due course. The section was not working to-day& besides having a parade at 2 o'clock, they did nothing. I have been busy all day& had little time for myself. Fritz has had a great dislike for our balloons. He has been \nhaving\n firing shrapnel at them all morning, but most of them were miles off. He has also been shelling the dump below our camp. He struck the dump, but apparently no damage done. In fact he has been firing his shells all over the back area. It has been a beautiful day, & Fritz has had several balloons up since before sunrise as is his custom on fine days. I received more home letters to-night, also a parcel from E.C., wh. was squashed to nothing. At 9 o'clock to-night Fritz sent over gas for half an hour, mixed with high explosive. The men down the front line had a very warm reception. It was a very weird noise, something like a rising wind wh. never came along. We could hear the shells dropping all around us but that was all. A favorable wind sprung up later, &we now have every prospect of having an undisturbed night.\n\n18:3:18\n\nI am getting very efficient on rising at a late hour. The weather is much warmed now& far more pleasant for getting out of bed. I have been\n\ncloud even after the Fritz has disappeared it was not long before our planes were dodging round the mystery trying to find out what they could. I have been picking up orderly room work to-day.\n\n14:3:18 \n\nThere was a very heavy bombardment at 3.30 am. The noise awakened me at once, but when I knew that it was our guns at work, I was asleep within five minutes. Fritz was giving our lines hell early in the night, & probably heard that there was going to be a hop over. Artillery activity has been acute during the last week, & there is every probability of it continuing or even becoming worse. It started to rain early this morning, & I did appreciate the fact that I did not have to go out to work. I started on the Orderly Room at 8.30. There has been very little doing to-day, as I'm still being introduced. The pay rolls have to be done to-night, wh. will take some time. The balloon wh. floated over two days ago contained nothing in the way of papers & instruments.\n\n15:3:18\n\nThe paybooks took time to complete last night as I suspected & managed to roll into bed at 10.50. The inmates of my dugout were well dead to the world. I crept in without disturbing them. As I do not start work until office hours now, I found it quite convenient to shave before appearing at the orderly room, polished books, looking quite spry? I fooled about all day, doing odds & ends. Among the spare minutes of the day, I looked up the exact location of Hill 60, the famous Hill 60, wh. was the great objective in the early days of the war; if the place in question were a hill & not a hollow, we could see it quite well from here, as it lies between Ypres & ourselves.But the unfortunate Hill has been mined & countermined so often that it is no different to the surrounding country. It gets the name 60 from the fact that it is 60 metres about sea level, in others words from the contours. At present the 1st P.C.E. are camped there. I received the beginning of the Australian mail leaving on 30th Jan. My parcel containing the jersey has arrived. We were paid to-night at 8 o'clock wh. is quite a laborious job in the O.R.\n\n16:3:18\n\nI had to do a survey of a decauville track in Wytschaete wood, wh. is not far from here. The job took me about ten minutes, & readily returned to plot. When Lt Best asked me had I done the survey, I shewed him the plan. He then said that he also wanted the portion surveyed where they had cleared\n\n\n\n\n\nit over, trying to destroy it, consequently our planes kept well out of the way. Our anti-aircraft started to pelt at it, so Fritz kept off. The balloon gradually came overhead, & our planes took possession. Smoke began to issue from the balloon, & after a few minutes it was a huge blaze. The canvas did not burn entirely, because it fell like a limp rag, basket foremost. Our planecircled round it, did nose dives at it until it landed on terra-firma. One plane landed near it & came to grief. The Q.M. came along to-night & told us that the balloon landed in our horse lies near one of our observation balloon. The basketcontained a dummy man stuffed with straw, so very likely that explained the aeroplane manoeuvres. The R.F.C. took possession of the basket & its contents, but every man in the neighbour was after souvenirs. It has been a glorious day very much like one of N.S.W. spring days. I received a letter from Davies to-night, who has just arrived in France. I have to go to the O.R again to-night, & see some of the days reports etc.\n\n13:3:17 \n\nIt was a beautifully mild morning, rather foggy. Since the clock has been pushed forward, I have had a great difficulty in getting up from bed, but no doubt shall get accustomed to it. I carried on with my work undisturbed until I had nearly finished up near Ypres, when I was arrested for a spy.An officer, artillery Tommy, cross examinedme, asked a bundle of questions, examined my books, maps etc, & when he was apparently satisfied, I left. I answered all of his questions, & coolly enjoyed the joke whilst he seemed more or less flustered. I happened to pass an artillery guard & sentry, & it was the latter whose suspicions I had raised. At first I thought it was some poor Tommy looking for Blighty leave, for having found a German spy. I did not bother to go that way home, but took a cross country course. I came by several skeletons all over the place, this particular spot was at one time the battlefield of Ypres stunts, wh. accounted for the remains. I arrived home for lunch, went to the orderly room to enquire whether my suspicious friend of the guard had rung up to identify me. He had not. I spent the afternoon drawing & later did a little survey near the camp. Our artillery here were busy this afternoon, & for that matter, Fritz was too. A very interesting incident occurred with a Fritz plane at noon. The plane circled round a huge area at a great height, leaving a train of white smoke behind it. The trail hung in the air like a\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\na6664017.html\n\ndirection. Our anti-aircraft guns are fixed on motor lorries, & run round the country in a very cocky fashion. I arrived at the topo section at the appointed time, & found Fry out. I met Wright the draughtsman, & went ahead with the checking. The former gentleman came in later, & after passing a few comments on the work I left for home. On my wayI took a short cut by the batteries, & just as I was passing a gun began to fire. The camouflage caught fire & began to blaze very quickly. After a great deal of beating with bags, & a stay dish of water thrown at it whilst one man pelted dirt, the fire was extinguished, & the good work carried on. I was expecting to see a colossal conflagrationof cordite & detonators, & I kept well out of the way. I met one infantry man who was very eager to have a yarn, so let him continue. He seemed pleased because Fritz bombarded the front line for three hours last evening, & there were only four casualties, and those he termed as \"bonza Blighties.\" Several dugouts were blown in, but were at the time unoccupied. As my jubilant friend said, it is marvellous howmen escape. Came home just in time for tea, wh. I always manage well. I saw the Major to-night & reported my work etc. He was quite satisfied with the work done. He also told me that on the 22ndinst, I shd be helping Gormly in the Orderly Room, whilst the Sergeant goes on leave. It means hard work & late hours.\n\n12:3:18. \n\nI reported to the Captain at 8.30 as ordered last night. He explained that he wanted to build an O.P. in a pill-box behind the supports, & that I was to go & measure up everything in & outside. I started out & arrived at the spot to find the place so dark that I was unable to see anything. I borrowed a candle & matches from a neighbouringdugout, & then continued with the work. I found the place quite empty, & solely inhabited by huge rats. I finished in an hour's time then set out for home. I came home & drew a very pretty little picture & took it to the Captain. I was very taken back when he asked me how do you look at it. It just shewed? I completed a drawing for Lt. Burrows & some plotting for the Major, & this constituted my afternoon's work. I was dodging up to the Orderly Room to see if there was anything to learn, as the work will have to be picked up gradually. Whilst we were having dinner to-night, a Fritz observation balloon came floating over;there were two Fritz planes piloting\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\na6664018.html\n\nI arrived home in time for lunch. I found the section \nwas\nin camp, having a holiday. Sunday is being observed as a spelling day now, & it seems as though the Boche is doing the same. At one time Sunday was the busiest day in the week, the day for stunts etc. My work did not finish until 3 o'clock. I then did a little washing, cleaned up generally. A letter from\nAustralia\nDwyer came to-night telling me that he is bound for Australia. Lucky man. It has been a glorious day and extremely mild.\n\n11:3:18\n\nI shewed my work to the Major last night & he gave me orders to check the company's work, with that done by the topographical section. I saw Lt. Fry last night whilst he was up here, & he then told me to call in the afternoon. Seeing that I\nhad\ncould get on with my work as usual, I started out at 8.30 to surveysome of the Light Railway tracks. It seemed very awkward to pace, as the sleepers were not at regular & convenient distances apart & the sides of the track were stony or slippery, so I had to make the best of the job. The cold wind was getting at my fingers wh. did not improve my ardour for work. I had not gone far when some old Tommy stretcher bearer came along, quite amused at my actions. I spoke to him & he seemed more amused, until eventually he candidly told me that he could not make out what I was doing. I can't say on whose side the joke lay. But every time I take a reading, I have to throw my \"tin hat\" on the ground, as the iron close to the compass hasvery disastrous effects, so presumably the old boy thought me a maniac. Several times in the the last week, I have been taken for an officer. I have often thought what the reason may be, but can guess at none, except it is the apparent importance with wh. I stroll about.One Sergeant came to me to-day, saluted & asked me if I were the officer he had to report to. I worked on undisturbed until 11.30, when I thought it time to retire. I arrived home in time for lunch, had a shave, cleaned my boots, & away to the topo section. On my way, I heard three sharp whistle blasts & looking in the direction of the sound, I saw the anti-aircraft crew buzzing round the guns at the double like a swarm of bees. It was not long before they were spitting shells at a Fritz almost out of sight above our heads. \"Our Archies\" is the nickname given to the anti-aircraft people. It is a fluke if they hit, it is excellent if they shoot in the right direction & it is usual if they fire in the opposite\n\n\n\n& old S.G.S. boys, most of whom are over here. I did not stay long as I had to do a little more work before I left. I arrved here in time for 4 o'clock dinner. Then the drawing business started & finished up at dusk. It has been a perfect day & rather hot at mid-day. I have been having a few games of draughts tonight.\n\n9:3:18\n \n\nStarted out at 8 o'clock. A nice nippy frosty morning. Surveyed the road by the camp, then to the supports to check survey. I carried on undisturbed until I reached Company Headquarters. Then I could not expose myselfabove the trench as it was too clear & bright a day. It was then 1.30 & I retired. It has been a glorious day, hot at noon. Everybody was basking in the sun where possible & leaving their dugouts. The \"chats\" were having a bad time. The trench mortars were busy this morning. Fritz has a scheme of finding out information from prisoners, not by asking them any questions, but by putting two in a room alone & using thoselistening instruments to pick up the conversation. I arrived home at 2.30 & started drawing. Had dinner at 4 o'clock as usual. We have a change in cooks, starting to-day. Daylight saving goes on one hour. The third division has gone out to spell & the second is in the line again.\n\n10:3:18\n\n\nIt is sunday night & for once I am in the dugout alone, the others being out. However I began the day early. I intended going out this morning before the sun rose, as I was to do some forward work, but the daylight saving hour made me one hour earlier on the start & half an hour before that, gave me a good lead. A heavy fog helped me considerably & by 9 o'clock it was impossible to seefurther than one hundred & fifty yards. I moved about at ease with no chance of being seen by the enemy. I walked for three miles \nduring\nover wh.distace I only met two men. It seemed weird, something out of place but nevertheless it was the same track. There was very little straffing going on & with the exception of a few shells from Fritz bursting in the next sector, there was nothing doing: even the artillery were silent on our side, wh. is rare & worth making a note of it. I pushed thro my work & made as much of the fog cover as possible. I was pleased because I unravelled a puzzle of hedges wh. has been a source of mystery to us for the last month. I finished my work by 11.30 & the fog was then beginning to clear.\n\n\n\nLt. Eric Biden. He was busy at the time, but I promised to meet him tomorrow. I continued my work & arrived home at 12.30. Had a little lunch & started to draw. I finished early. Chopped a little wood, had tea, shaved after & then settled to write. I have just had an interview with the Major about incorrect previous plans & non-coinciding surveys. I have to go & check some forward work tomorrow.\n\n8.3.18\n\nI was awakened early by another bombardment. Our artillery was going for all it was worth. I started out to work at 8 o'clock & took a short cut across country by way of interest. I really marvelled at the number of our guns & more especially their positions. It took me some time to even imagine how they were placed in some of the most out-of-the-way posies. I arrived at my job & started. The Major wants the maps drawn as the ground shews, not accurate trigonometrical surveys but apparent & obvious pictures. I was quite successful & carried on until dinner time. I had lunch at Rose Dump. Fritz was bombarding our front line continuously this morning, with all sizes of shells. The most popular sort were the naval piercing shells wh. would dive into the ground a considerable distance, burst with a thud, quite the reverse to the ordinary H.E. shell & throw the dirt perpendicularly into the air like a geyser. I had to go in the direction of theshelled area,but I did not wastr too much time there. I saw an officer & a Sergeant with some carrier pigeons, making for the front line. Later on, I saw one of the pigeons released. It is probably a brand of the secret service. I left the job at 1.45 & made my way to Prince Rupert's Dugout. It is 70 x 36 feet, walls about 9 feet thick & a roof 6 feet. It has windows 12 x 18 inches, the air emerging thro sloping flues. The door is facing Fritz present line, but when built of course, it had the door to the rear. The outer door has a gas-proof curtain, & the innerdoors are felt-covered. The rooms inside are similar to the other dugouts, with the arched corrugated iron. The walls inside are panelled with timber for three feet from the ground & the remainder is covered with a kind of cloth material. I saw Biden. He is signal officer. He shewed me a diagram of a Fullerphone. The Boche has reached the perfection of overhearing all our telephone conversation from the front line. Naturally we have to be very discreet in what we say, & how we say it. He has some instrument whereby he picks up all electrical waves. So the Fullerphone is an instrument wh. makes it impossible for anyone to cross the line & overhear. Biden & myself talked of old times\n\n6:3:18.\n\nI had a bottle of stout last night wh. is quite a luxury in these parts; we imagined the oysters, & we imagined having them in Sydney, but it was all so mythical, that I went to sleep as soon as I put my head on the pillow. Gormly came round late last night, although I didn't know it, to tell me that I had to do some work for the Major, & leave Lt. Burrows survey stand by. After breakfast I went to see Gormly & found him in bed at 8 o'clock. However when he woke up, he told me that I had to survey all duckwalks & railroads. I started off right away & got to work. It is a very nice clean job as the duckwalks are quite free from mud.Aeroplanes were very busy this morning, Fritz was reckless, & our planes forced two down. One of our planes was flying about a hundred feet above the artillery lines. I don't know the reason except perhaps the aviator was taking photographs of camouflaged guns. Very often the airmen come to the gunpits, & point out the errors in camouflaging. I was surveying in a place, not far behind the line, & the guns were so well camouflaged that I did notsee them until I was alongside of them. I arrived home at 12.15, feeling moderately tired after my morning's continuous walking. After lunch I started to draw on the O.R. map, wh. did not take me very long. I then continued \nto\n with Lt. Burrows work & finished up at 4 o'clock. I had several games of draughts to-night wh. were quite enjoyable & a good break in the evening monotony. I received a letter from Wilfred Evans to-night. I have omitted to note, that we have supper every night on toast & coffee, since we have been in the line this time.\n\n7:3:18\n\nA heavy bombardment woke me early this morning, in fact it was well before daylight, but rather a good distance away. It has been a case of raids along this front every night. It will end by either one or the other hopping over to stay. The third divy hopped over & took Fritz front line position. The following night they made another raid from there, but more definite information we have not received. The Major & Captain who were captured from the first divy when attacked by Fritz, were killed by our own counter-attacks. We counter-attacked immediately. I started out to survey at 8 o'clock. Began from Wytschaete, & worked down to Pioneer Lane. On my way I passed Prince Ruperts dugout. It is a huge dugout, covering a large area, & well covered with earth & grass, so that very little is showing above normal surface. Whilst there I met\n\nEvery shed is hidden among the trees, so that it is very difficult to locate them. The train line runs alongside these sheds so that there is a minimum of handling, & an easy approach. Kemmel is will be very pretty when the trees begin to leaf, but at present there is very little beauty about the place. The Belgians are very particular about having their trees cut down, & they claim compensation immediately if one is cut down. All the woods & forests round here are totally destroyed but if we were to have the same style of bush in Australia, we shd not take any notice of it. The woods here are planted & for every tree that is cut down another is planted in its place. It will be many a year before these forests are replaced. It got very cold about midday, & then began to rain, in scotch mist fashion. We left for home at 3 o'clock. I heard a joke wh. is supposed to be a message from Fritz. \"If the Australian troops are transported to Egypt he will sink the ships, if to Italy he will wreck the trains, if to Australia he will escort them home.\"\n\n5:3:18\n\nI was almost asleep last night when somebody came enquiring for Sapper Job bringing a letter from Lt. Burrows, No 1. section. It was a note to say, Report to the latter at 8 o'clock prepared for survey work. Having rolled over & tried to sleep, I was prevented by the guns opening fire. The third division on our right, had a raid arranged & this noise was the beginning of it. It was a very strenuous affair, & as soon as the raid was over, Fritz counter attacked. I have not heard any details. I learned that it was a cold morning before I jumped out of bed. A very cold wind was blowing, & a penetrating wind. I reported at 8 o'clock, received my instructions, & straightway proceeded to the job. It was surveying some S.P.'s in detail, in the reserve line. It was very cold standing about, but towards midday the sun shone, wh. was a great improvement. I was unable to find one of the S.P.'s so was making my way home when I met Lt. Burrows coming out. I returned to the job & finished the work. I arrived home at 2.30, had a little lunch, & started to draw until dusk. Checked some of Lt. Shaw's work, had a shave, for I shave at night, & began to write. The C.S.M., well steeped in rum, came round to tell us to cover over our chimneys if Fritz came over. He has not come so far. Our planes passed overhead, well laden with souvenirs for Fritz.\n\nas it was too cold & boisterous to wait about when I returned to camp, it began to snow, & the weather looked stormy & threatening. I have hugged the fire all day nearly, & am thankful that I had work to do. I have been hearing all sorts & varieties of rumours concerning the raid last night. The only sure point about the whole affair is that Fritz hopped over between the first & fifth divisional areas, was beaten back in parts,& broke thro in others. But how many were casualties is unknown & nothing definite yet. I receiveda parcel from Edinburgh to-night, full of necessary & useful articles.\n\n3:3:18 \n\nWe had a very quiet night all thro, wh. is very weird after a bit ofstraffing. We were all expecting to have a holiday to-day, when at 8 o'clock, we were told to go & work at Kemmel. It was a cold morning,a little snow still lying on the ground so we wrapped up and away we started to prepare positions for dugouts, it is presumably going to be a dump. About 10 o'clock,I was sent to De KenneburgCorp dump \nfor\nin a G.S. waggon for some stores etc. Called in at Lindenhoek dump for other stores. I was not pleasant riding in a springless cart over the cobbled roads. I arrived back at 12.10,went to the canteen for something to drink & started work at 1 o'clock. It began to rain but nothing serious. The atmosphere warmed up, thaw set in, & the ground became very muddy in a very short time. We had the 31st battalion for a fatigue & working party. We finished work at 3 o'clock, & home. It seems apparent that the Boche penetrate the 1st Divy line & advanced as far as the advance company headquarters. A Major & much valuable information was taken.A large raid is annoucned for to-night. An order came round to-day that nobody must leave the camp when Fritz starts shelling. Some men the night before last left the camp, & did not return until next morning.\n\n4:3:18\n\nAt 12 o'clock last night Iwas awakened by the gunsroaring; as soon as I realised that it was the booming of the raid, I immediately went to sleep again. I did not hear any further of the raid to-day. It was not quite so cold this morning, but we had a muddy road to work. The at Kemmel is making an ammunition dump wh. will take some time to complete. We had the 31st battalion for a working party. We are putting the dugouts under the trees, so that they will be partially hidden from aeroplane observation. Kemmel is a huge ammunition dump, shed after shed filled with all sorts of explosive material.\n\nsector to-night. It is a wild cold night. R.A.J. answering my question on the last three or four generations, says concisely \"Mental equipment as well as physical beauty only come to go, but actions become habits, habits crystallise into character, & that, we take with us & it persists.\"\n\n2:3:18.\n\nAlthough the guns were busy last night, at 9.30 indicated something different from the usual artillery activity. We were already in bed, & a great barrage was going on. The next we heard was a Fritz shell to burst in the near proximity of our camp. The second was closer, our dugout door was forced open, tins of all descriptions flying round the dugout, & the powder fumes penetrate here. Men began to wander round, & a general clatter of voices was soon heard of men leaving the camp. The number of shell increased & we came to the conclusion that Fritz was putting up a barrage & having a hop over. Our howitzers, guns, & trench mortars put up a barrage in reply, & for an hour our home was shivering & shaking. We all remained in bed here, & took the chance of a shell lobbing on us. When Fritz puts up a barrage, he sends his shells all over the place, but it seemed last night as tho he were looking for these howitzers alongside the camp. Primarily, it is an absurd place to have a camp. Several of the men did not arrive into the camp again until midnight. I do not quite know what would happen if they were needed. In due course everything quietened, & I went to sleep. The first thing to face the next morning was a keen cold wind. The second was the mess on the floor caused by an open tin of jam rolling round the room while the bombardment was going on. I had a holiday today, as I was on bath leave. I had enough experience last time at Kemmel baths to convince me that if I had gone for a bath, I should never have returned to relate this story. The wind just whistles thro the bath shed, so I did not quite see the sense of inconveniencing myself. I put some water to heat on the fire & had my bath here. As soon as I started, Fritz began to shell these parts again. Having washed myself, it was natural enough to wash my clothes. Next was to get some firewood, then I was settled for the day. The cold has been intense: the ground frozen hard with a hurricane blowing over it. After lunch Iwent to Vierstraat to visit the first division wh.moved in this week. I did not see them, as they had gone up into the line. I returned post haste.\n\nthe parties, & it seemed as tho Fritz was going to shell us out of it. Aeroplanes were as busy as usual, the air being in a constant whir. I arrived home to lunch at 11.30. I have been drawing all afternoon. Fritz lobbed two shells by our camp this afternoon, looking for the howitzers alongside. He made a very good aim, but no damage was done. It has turned out a beautiful night, but cold.\n\n1:3:18.\n\nIt is an order for everyone to examine his gas helmet every day when in the line & once per week when out of the line. It is an order wh. is carried out casually, but if anything is wrong with the helmet, it means a casualty if gas is about, & only one man to blame. It is little or no trouble to examine all joints & mask, & see that the safety valve is not leaking. Besides the mice & rats are so bad that one never knows when they may take a liking to gas box respirators. So far I have not had to wear my helmet, in fact there has been very little sent over. I went down to the supports to pick up a dummy trench & a proposed duckwalk track. I did not waste much time as I was under observation & sniping distance. A Boche plane came over & I had to cease work, as I may have attracted attention. He got a very hot reception from our machine guns & anti-aircraft, wh. made him turn home. The planes now carry armour plate underneath, consequently bullets have very little effect. The latest is of course, to have armour-piercing bullets. I had a cup of cocoa at Y.M.C.A. dugout, wh. is my daily custom, & returned home at 11.30. Coming home I stood & watched the howitzers firing. There were some storm clouds about, & it was most interesting to hear how the shells struck the cloud. When these large shells leave the muzzle, they travel thro the air making a noise like escape steam from a loco, until it dies away in the far distance. When the shell struck the cloud the noise became a roar. What the effect would be is difficult to say definitely. When the gun is fired, the crew cover over their ears with their hands. It looks curious, but daresay essential. After lunch I started my drawing, wh. did not take very long. The weather began to look very stormy & cold, & the temperature fell very rapidly this afternoon, & we had a little sleat and snow. I have completed my survey work on this sector for a while & start on something new to-morrow. Some of our section were out in \"no man's land\" last night erecting dummy men. They are not being put there for nothing. Our guns are busy on this\n\nwas covered with huge lumps of dirty. I was surveying in the supports for Lieut Shaw today. I finished early then returned to have a look round the reserves. I did not stay therevery long, because it was a clear day, Fritz had his balloons up, & there were too many working on the open country. I was expecting to hear a few shells come over & skittle a few men. It is no use looking for trouble. Wherever a party is working Fritz always sends over a few reminders. I arrived home in good time for lunch, then set to work on the maps. The drawing is not difficult, & soon finished. It has become very cold to-night, & appears like rain. We have a very warm dugout, a good fire pot, & so long as we are not out working it can rain as much as it likes.\n\n27:2:18. \n\nOur breakfast of tea & bacon was not as palatable as usual, & we left for work with a somewhat unctuous taste round our teeth. I had very little to do this morning & did not rush about too much. There were several parties working in the reserves, wh. was a great temptation for Fritz. We have just been told to \"stand to\" as Fritz is expected to attack. We are now ready in battle order with rations & ammunition to fall in at any minute. Our aircraft were very busy to-day so very probably they spotted something. Our strong points were manned by the 31st battalion to-day so very likely something is in the wind after all. Perhaps a raid. I was walking thro one of the trenches, & the only thing wh. attracted my eye, was the way in wh. the men systematically look for vermin. The latter are universally known in the A.I.F. as \"chats\". In a shelter wh. is scarcely high enough for a man to sit up, is full of men in a prone position, fighting their lousy enemy. A blanket over the opening is the only means of keeping out the cold. I came home to lunch & then started to draw, wh. did not take me very long. During the remainder of the afternoon, I made a vernier scale wh. will no doubt be useful for measuring up on plans.\n\n28:2:18 \n\nNothing resulted from the \"stand to\" last night. we were never told to stand down, & eventually everyone went to bed. Shortly after we were warned, it began to rain heavily, perhaps having the effect of keeping Fritz back. There was some very heavy bombardment going on to the N.E of Ypres, wh. lasted for some time. Fritz was supposed to have hopped over there, but nothing reliable has come to hand yet. With the exception of the slippery mud, this morning was fine, & the atmosphere clear. I had very little to do & spent a good deal of time wandering about. The infantry parties were working on the dummy trenches, rather too close together. A whizz-bang was sent over near\n\none Fritz & five of ours. As soon as I located the Fritz I kept my eyes on it & watched the proceeding. Some of the finest air manoeuvres ensued. Our men surrounded the Fritz & above him, & forced him to descend. Fritz made some of the clever dives & spirals & each time tried to recover. Three of our planes remained high up & two planes chased him down. The whole time coming lower & lower. The german would volplane & try try to get above our man but it was a glorious piece of piloting on the part of the latter to maintain his superior position. I have seen a hawk soaring & swooping down on its pray, but pretty as it is, it is not as pretty as to-day's performance. The german came almost to the ground well within our lines, but again tried to recover. Our man circled round & round, & compelled him to descend. The crowd cheered \"hooray yer bastard\" as the german disappeared among the remains of a forest. Our man circled round the fallen german for some time until assistance came for his capture. The trouble is always, that if the Fritz burns his machine & papers all information is lost. When our man was satisfied all correct away he went home. This Fritz is the man who has been hovering over our lines for the last four days. He has been a daring man to do what he has done. I came home at 1 o'clock to start drawing. I did not make much of a show as Gormly was wanting the maps & materials. I despatched a cable home, \"well love\" to-night. The artillery are quiet now, probably preparing for the storm.\n\n20:2:18.\n\nAt nine o'clock last night the guns started to roar from all sides, but not so rigorously as a few nights ago. There were only fourteen men to go over, & they all returned with seven prisoners. Apparently we want prisoners for information, & we get them. We are expection Fritz to make the offensive, consequently we are preparing for the defensive in every way. It was a bright moonlight night & Fritz used very few flares. I started away from here at 7.30 this morning to make an early start. I was told that if I worked all day & finished my survey, I could have to-morrow for myself. On my way to work, I had to pass a place wh. Fritz was shelling with heavy stuff. He was after a pill-box wh. we use as an O.P. I don't think he succeeded in hitting it. It is quite safe to pass within moderate distance.\n\nthree hundred feet. He must have been bullet-proof. Our machines were floating about watching him, & they never seem to attack now, probably preserving their men & machines as much as possible. There is probably something he wants to find out in this sector. I have an idea it may be the trench mortars wh. have been a source of annoyance to him. Last night we put over a five minute barrage of machine guns & trench mortars,just to make him windy, so when the advance comes he may think it only another blind. I went over to see our fallen plane but there was only a heap of rubbish. The engine is under water & well buried in the mud, and the remainder splinters. The air corps men came down to salvage it, but they only took a sheet of metal, & the cushion from the seat. I returned home at 1 o'clock, & started drawing. The drawing facilities are worse than those wh. I had in the bush in N.S.W. We have insufficient material to cope with the number of draughtsmen in the coy. We had dinner later tonight, but the roast beef was worth waiting for. Fritz has been over paying us a visit to-night in his planes, & leaving his reminders behind him. The difference between bombs & shells is that the bombs make no noise in their descent, while the shells merely roar. The bomb is pear shaped, & tapers to the rear, & of course the taper on the shell, known as the nose, takes the lead: but the explosion of a bomb is terrific. Fritz loves the moonlight nights.\n\n19:2:18.\n\nWe started our day with a copious supply of bacon for breakfast, that is in comparison. I received my instructions from Lt Best at 8 o'clock & started away to survey. It was very frosty, & difficult to see the wiring as it was covered with hard frost, & the same colour as the ground. There was a slight mist & observation difficult. I did a fair amount of walking about as my work was in open country round Oostaverne wood. At 12.o'clock I strolled over to the Y.M.C.A. for a cup of cocoa. Just before I reached there, I heard a machine gun open fire in mid-air, & thought it was a Fritz plane firing on us, as there were several working parties in the area. On looking up, right above me were several planes dodging about, but were too highto see whomthey were. A few yards further on, the infantry in reserve had a pair of binoculars, & I hurried over to find out the news. They said that there was\n\nBoche was down. Much to our horror we saw our colours on the broken wing wh, landed about a hundred & fifty yards away. The plane fell in a heap just where I had been half an hour previously. I did not return to see the damage. Men ran from everywhere, wh. is a very unwise scheme, because Fritz usually has a habit of shelling fallen planes, merely to kill the congregated mob. I came home to plot my surveys, but first had a little lunch. Then I was told that I had to go & shoot ten rounds for practice. I went, & scored five bulls. Home again, & began to draw. At 3 o'clock the section went to the rangeto shoot. Everybody is afraid of Fritz, so men have to practise the use of their rifle, & the officers their revolvers. It seems absurd to do musketry so near the line. I had tea at 4.15, & continued to draw until dusk. When our sappers came home we heard that the plane fell about 20 yards from them. The pilot & observer, Australians, were both killed. The plane fell into a shell hole of water & the pilot was practically under water. Fritz is overhead to-night again,dropping bombs all over the country. After the disgraceful performance this morning, I don't expect the anti-aircraft people to bring him down. The cause of our plane coming down today was, that it struck a shell in mid air, probably & very much so, one of our own.\n\n18:2:18. \n\nThe howitzers woke me up last night for the first time. We have one not more than 100 yards from here, & so they go on at short intervals along the ridge. But when a man knows what the noise is, he turns over again quite contented to go to sleep. It was frosty this morning but a beautiful day. I had to survey some dummy trenches. We spend a little time building these dummies, & do not bother to camouflage them,but allow Fritz to take a beautiful photograph & let him worry out how he will deal with it when he attacks. The trenches are not usually dug as deep as the dinkum ones, but just deep enough to cast a shadow. The shape & the trimming up of the corners must be carried out the same. Fritz plane was hovering above our heads all morning, the same one wh. was up yesterday. The anti-aircraft shooting was ridiculous & the air was filled with bullets from machine guns & rifles. At times he was no highter than\n\nleisurely. Called at the Y.M.C.A. for a box for the purpose of making a drawing board. The attempt was quite successful. I spent a little time getting wood for our fire. I started to write letters before tea, as I felt in the mood. My mates returned from work earlier than usual. Fritz spotted them wiring & put a 5.9 into the wiring which they were erecting: they & the infantry party scattered, & Fritz continued to shell the spot. It has been a great day for observation. It is a fine moonlight night now, & Fritz planes have been over bombing a few minutes ago, & we received the order to extinguish lights. The artillery have been very busy tonight, likewise the M.G. Both sides are afraid lest the other should hop over. The spring offensive is the only thought now.\n\n17:2:18. Another cold morning. Up as usual had breakfast, & about to move off when the order came round, \"No work for the section\". We calmly retreated & began to wonder the reason, as none was given. We conjectured all sorts of schemes for the day, & intended to make the best of the holiday. At 9 o'clock another order came round, \"Getready to go to work\". Our holiday soon ended. The infanty had the day off, hence no working party. I obtained my instructions for survey. Lt Best, who is quite new on the field, asked me ifI would do the wiring survey, & he did not think Fritz wd shell the wire again. I thought it rather curious statement for an officer to make but assured him that I did not mind. The whole place was very deserted looking, as there were no working parties, wh. seemed so strange. A Fritz plane was hovering over our sector at a low altitude all morning. He was worrying our anti aircraft guns & machine machine guns. Shrapnel & bullets were flying in all directions, & once or twice I had to duck. I carried out my work, & enjoyed the open air work on a beautifully sunny morning. The noise of the serveral guns were distracting at times, & yet the-- still contined to hover over our heads. I met the Major on the work. Our sappers were working together on a new strong point. I finished my work at 12.15. I met Lt Fry, looking for his surveryors. I had come about half a mile on my way home, when I met the latter. Whilst talking we heard a curious noise, not dissimilar to that of a shell, tho different in intensity. On looking up we saw a plane minus a wing tumbling down like a wounded bird. Our hearts were quite cheered to think that the\n\nwind was blowing & when I began to use the prismatic, my fingers failed to move. I did not have extra much to do, but merely finishing up details for the map wh. has to be in C.R.E. \nbefore\nto-morrow. We are digging trenches all over the place, & very hurriedly too. We are laying wire entanglements in double belts by the miles. Every train that arriives is heaped up with barbed wire. Everybody is very much of the opinion that Fritz is going to hop over. Orders have been issued to us, what to do in case of an attack. Gun pits are being dug for miles back, & M.G.s are placed at every few yards behind each other. To-night we received the order to wear our gas helmets at the alert, as Fritz had sent over a few gas shells. The wind has been in his favor to-day for the first time since we have been here. He does not use cloud gas very much now, but uses the shell gas very much. He has been sending over some heavy shells lately. I saw where two shells had lobbed just by the railway line, & resulted in standing seventy five feet of rails & sleepers on end. I came home to lunch at 12.30, then spent the afternoon drawing what I had done. The topographical secton is taking over all the survey work. What survey work I do, will be for my section officers own information. I have been trying to write letters to-night, but gave up. The others would persist in talking & argueing, I am writing this, now that they asleep.\n\n16:2:18. \n\nAt last I was given a day off to have a bath. The baths are at Kemmel, two & a half miles from here by road. I chose to have a bath in this dugout & wash my own clothes afterwards. We have a stove here wh, heats the water quite rapidly. I spent the whole morning cleaning up etc, & doing a little mending. We ha\nr\nd a heavy frost last night, & everything frozen over. I saw the cook thawing the meat before the fire before attempting to cut it. But it was a beautiful morning, & possible to see every stone for miles around. I had an early lunch & started out for the 13th Field Coy. to see Lt. W.E. Potts. On my way I met W.S. Patterson in the 12th. Arrived at the 13th to find Potts non est. He is in hospital suffering from gas attack. Also badly burned about the face & hands. I returned home\n\nDranoutre. I found Nangle there, who is adjutant, & he put me on the correct track. I had my work cut out to do all that was required. At the beginning of the day, I could see myself working to all hours. Thanks to the cook there for a small piece of steak & a cup of tea. I had taken a tin of bully beef as is my custom, & on opening it, found that it was bad. It was just lucky that I had got hold of that tin, & not somebody who may have been entirely depending on it, whilst in the trenches. I did not waste much time having lunch. I finished up at 4.50, but did not leave until 5.0, as I had to work for Lt. Fry. It was after dark when I left the bicycle & I then had to trudge over the same route in mud & rain. I arrived home at 7.10 & made my tea on rice & condensed milk with cafe au lait. The wet has made it a miserable day, but it is another added to those spent in Belgium. I saw some very interesting aeroplane photographs at C.R.E. Nangle is adjutant there, & he shewed them to me. The photographs were pictures taken of our own work here, & comparing it with the map, it was interesting to note what work was not properly camouflaged. From the time the photo was taken & delivered at head quarters was four days.\n\n14:2:18 \n\nI set out this morning at 8.30 to take some bearings for checking. It was a very misty morning, & was able to wander about freely. I was on my own, & trespassed forbidden ground. Fritz was shelling certain points, & concentrated his fire on our trench mortar batteries. After I had been wandering about these places looking for wire entanglements, I saw a notice, \"Movement\" in daylight is forbidden beyond this point\". I had been a few hundred yards beyond & had seen nothing except a dried up dried up Fritz. His head was missing. I took a button from his coat as a souvenir. I returned at 12.30 in time for lunch. I spent the afternoon drawing. The machine guns have been busy to-night, & at times the rattle was incessant. We were beginning to think that Fritz had a raid on. Several large guns have been brought into this sectorduring the last two nights. It is marvellous how the tractors drag these guns over the mud & shell-holes. They are brought up at night wh. makes it all the more difficult. We have a new section officer, Lt Best. Lt Fry has left us.\n\n15:2:18. \n\nThe weather smelled colder from the blankets this morning. A very keen\n\n\n\nmy work early on account of inaccurate reading. The wind was strong enough to blow off my steel helmet. I tested my compass with my helmet to-day, & found that the effect was an error of two degrees. We captured a german machine gunner in this sector last night, & it is believed that he gave himself up & came over. All he tells us is, that Fritz is prepared for our advanced, & is expecting us. We are now waiting for a second capture to verify the latter's statements. I arrived home at 3.30. When I arrive home there is a fair amount of time wasted in reporting my day's work. We had a parade to-day to have our rifles and ammunition inspected. We were told that we have to be ready at a moment's notice.\n\n12:2:18. \n\nI was away by 8.30 this morning. I had to see the Captain before setting out, as he is taking over the survey department. Lt Fry is leaving the company & taking over the topographical section in the Division. I carried on with the survey of the wire before the supports & almost up to the front line. Despite the notices indicating danger I had to hop over into the open & expose myself. My mate did not care forit at all, & kept near me the whole time. If I told him to walk any distance, he wd hurry back. However nothing happened, & Fritz was kind enough to start shelling when we had left. We had to walk over a mile for a cup of cocoa to-day, but it was too risky to drink shell hole water: one has to be very careful & avoid poisonous water the deeds of the enemy. I arrived home at 3 o'clock, & then had a foot-wash: one's feet & legs sweat very much with gum boots, & require attention. When I had settled down Lt Fry called for me to tell me to go to Dranoutre to C.R.E. to make him a detail map of the divisional area. This survey game has given me very little peace at night, & have been unable to write letters at night. We are on a fat saving scheme now; fat is necessary for making of munitions.\n","4":" \n\nI was awakened this morning to find it raining heavily. I left at 8 o'clock & ploughed thro mud & rain for two & a half miles: I arrived at Kemmel about 9.0, & there picked up a bicycle. I don't know wh. was worse, riding or walking. With very little trouble I landed at C.R.E about 10.0 am. C.R.E. is about three quarters of a mile past\n\nsolitude. Our sappers on night work came home again as all the infantry were in the supports; we are supposed to be having a raid or \"hop over\" to-night. So far every gun is silent; the night is still young. I have been wearing gum boots all day, & they do really make ones feet tired, tho the foot wash at night relieves them greatly.\n\n11:2:18. \n\nAt ten o'clock to the tick last night, a 12 in. gun fired wh. shook everything, & then followed a small barrage. From here we were unable to locate preciselywhere this raid was taking place at first, but when Fritz woke up to the fact, the heavens were lit up with \"veri-lights\" around the sector. These eight inch guns out side our camp trench here did their share in the roar. The flash from one of these guns, is sufficent to light up the immediate country for several hundred yards, so imagine the glare from the artillery quarters whilst the barrage of several dozen guns roaring. Our guns had been firing for five minutes when Fritz sent up his S.O.S. signal, which is three green lights, sent up in skyrocket principle. Then his \"veri-lights\" increased along the whole line, illuminating the heavens like a heavy thunderstorm, then Fritz shrapnel was seen to burst very high up. On an attack of this nature he usually sends shrapnel over the heads of the attackers. This roar was kept up for three-quarters of an hour, & then began to subside gradually. We heard this morning that it was the 10th Brigade making the raid on Fritz front line. It was considered highly satisfactory. We captured thirty one germans, & our losses were one killed and twenty three wounded. I have been surveying for Lt. Shore to-day, doing No 2 Section's work. I had to survey the support line & the wire entanglements before it. I had a man from No 2 Section to help me, & to show me where the S.P.'s were. But he was very little help to me as he was awfully \"windy\", & wd not venture over the parapet without me. I learned that he has been gassed wh. was partially the reason for his nervousness. Fritz began to shell the supports on our left, & he then began to ask me how much more I had to do. I had a fine view of Fritz land, the best I have had yet: the line is just on the brow of the hill. The wind was blowing very strongly today, & I was consequently obliged to give up\n\non macconnicies, wh.is a changeto bully beef. A tin of bully-beef is worth 1\/10d. in England at present, & here we getenough to pave the street. Fritz was shelling the cross-roads by Clark's Dump this afternoon just before we arrived there on our way home. He only got one man whom they took to the dressing station on a railway trolley. We have a special trolley to take a stretcher, wh.can be taken along post haste. Coming home, I stood to watch an 8.0 inch gun firing. I was surprized to see the shell whizzing thro the air for a couple of seconds after it left the muzzle. The 8 inch shell is said to be very demoralizing & effective.\n\n9:2:16 \n\nThe weather was threatening this morning when we set out to work at 8 o'clock, but it kept up all day with a fairly strong wind blowing from the west. I carried on with the details of S.P.'s wh. was rather tedious. General Birdwood visited our sector this afternoon, & came thro the trench wh.I was surveying. He spoke to several men & asked them how they were etc. It is very nice for a General to act so genially, he is not our officer. All these men are the same it seems to me. Fritz was very quiet to-day, but our artillery were busy. We had a three course dinner to-night, soup - steak & potatoes - rice: not bad for the trenches seeing that in England the people are partially starving. Now that we are in the trenches, we get our rum issue every night. we only get two mouthfuls, but it is very accpetable if we have been out at night & come home wet. We also get an issue of cigarettes, tobacco & matches every fortnight. When I come home, Gormly draughts my day's work. One \nof\n\nthe\nman of this company returns to Australia at 5.0 am due to long service. This new reg. about two men per battalion going to Australia comes into force. \n\n10:2:18\n\nIt was colder than usual to-day. We had a little rain to start the days work, but it cleared up by noon. We left at 8 o'clock to carry on with the survey of Pioneer Lane. The wind blew very strongly this afternoon, still from the west. It is very difficult to steady the instrument in a gale of wind, but for this trench survey, it is near enough to take fairly accurate readings. As a result of Birdwood's visit yesterday, all the troops behind the line were given a holiday. We had to work until noon, that is the engineers, but I myself had to carry on. I finished up at 2 o'clock & came home. The deserted appearance of the whole place was uncanny. A typical Sunday's\n\nstarted to rain early this morning, & has kept on all day. I was up earlier than usual this morning, lit the fire, & had hot water for washing well before breakfast. After our usual bacon breakfast, we set out to our S.P. The weather was too boisterous for survey work to-day, but not so for floundering in the water-laden plastic clay. We again picked up a 55th Battalion working party & proceeded to the job. It was very difficult getting a start on in the rain, & when an extra heavy shower came on, they all ceased work. We got very little work done to-day. Fritz decided & succeeded in demolishing a pill-box before our reserve lines this morning. Naturally he has the exact range of all his pill-boxes, & when they appear suspicious to him, he just lets drive. I had my lunch hurriedly, bully-beef & biscuits in the rain. We were pushed for time, so had to work on. The infantry are expecting Fritz to hop over to-night, so we are taking over the S.P. I don't suppose he will come after all. Being a dull day, & when it was not raining, we had a very good observation of Fritz land. The O.P's said that they could see Fritz working quite well, & advised us to keep down. We finished at 3.0 pm, & came home in the face of a strong N.W. wind, that is blowing towards Fritz lines. I received an Australian mail to-night, latest letter dated 16th Dec. The mail is much faster nowadays.\n\n​We were issued with a pair of knitted gloves to-night; probably some of the comfort's fund. We are very comfortable in this dugout, in fact when we get the fire going it becomes too hot. We are well able to dry clothes. The guns have started roaring outside just a few minutes ago, & they shake everything in here. \n\n8:2:18 \n\nIt has been raining intermittently all day, but only one heavy showerstopped my working, & that was at lunch time. I havebeen surveying all day. I had a sapper to help me. I have been locating S.P's & barbed wire entanglements. I was told to-night that I will have to survey the whole of our area where we are working, filling in all details. When the rain cleared, we had a fine view of Fritzland. In this survey work I am under full observation, but so far my work has not taken me to within sniper's range. There was a huge fire in a small village on Fritz side this morning: whether it was the result of one of our shells, or Fritz burning the place himself is unknown. We could see Fritz trains running along behind his line. I had my lunch in the Y.M C A dugout\n\nof 10 at Clark Dump & went on. Our work was straight forward, wh. was to bag the parapet & parados. Our artillery were busy to-day, probably operating in conjunction with the aeroplanes of wh.there wereso many. The whole day long they were going over in fives & tens, probably watching something very closely. Fritz amused himself by firing at them persistently but his shots were miles off the mark. He was only wasting ammunition wh. is no disadvantage to us. During the whole day Fritz sent over five rounds into our sector. The infantry have an idea that he is going to evacuate. On the other hand, a german was taken prisoner, who told the infantry that they were going to have a hop over to-day. However it did not come off. The infantry have had to stand to, in case of the prisoner's words being true. We patronised the Y.M.C.A. cocoa again to-day, wh. I think will always be acceptable. We left for home at 3.0 pm. Green has gone to C.R.E. for six weeks, & H.G. Fry has taken over our section. The latter is far from popular among the men. We arrived home at 4 o'clock when we had tea. I was as hungry as a hunter.\n\n5:2:18. \n\nOur tool cart came down last night so I had some sharp tools to work with to-day. I was given fifteen infantry of the 55th Battalion at Clark Dump. I led them to the S.P. 3 & set them all working. At10.30 Lt Fry came & took me on surveying the S.P.'s & wire. I left the job in charge of Spr Smith. The infantry worked continuously until 2.30 p.m. I had lunch at 12.30, & continued the survey with another sapper after lunch. At 3.0 pm I returned to the S.P. to measure up the work for the report. I left for home at 3.15. The weather looked threatening this morning, but it cleared up this afternoon. On one point I was on, Ihad a beautiful view of german lines & our shells throwing the ground skywards. Since the men were gassed the other night, we have been more careful to wear our gas helmets at the alert when working. Some men are more careless. Iwas rather tired to-night as I have been wandering about in gum boots all day. Surveying with a prismatic is good & simple, butpacing thro shell holes of water & over barbed wire is not so good. The accuracy is not so good as theodolite surveying, but good enough for this work.\n\n7:2:18 \n\nI had little or no sleep last night, the cause I can't Imagine. It \n\nlittle rain to-night. The artillery were busy this afternoon, likewise aircraft. The aeroplanes do most of the directing for fire. A plane comes down to about 1000 feet over the battery, sends a wireless message down, then away go\nes\n the guns. A plane can send, but not receive messages. Fritz amused himself by shooting at our planes to-day, but none were hit. We have a Y.M.C.A. canteen about 200 yards from here, wh. is very convenient. We can buy quite a number of necessaries as well as luxuries. We fed on Australian rabbit to-night.\n\n4:2:18 \n\nWeleft at 8.0 am with rifle & ammuntion, gas bags & rations, for the line. We travelled thro a wonderful collection of war materials, guns of all calibres, dumps of varying sizes, & railroads leading in all directions; Fritz pill-boxes in dozens & devastation everywhere. At one portion of the road, where Fritz has been shelling constantly, we had to walk in three's at 25 yards interval. We arrived at the job in the reserve line, where we waited for Green. Two sappers were allotted to each strong point (S.P.), & were given infantry as a working party. There was a fair amount of work to be done, & as management had it we had no tools. After a little reconnoitering & stealing, we managed to collect a few shovels, a pick, a broken hammar (10 lb), & a pair of wire cutters. We did very well considering. We had half an hour for lunch, & fortune was again in our favour, because about 100 yards from us,deep downin a german pill-box, was a Y.M.C.A. canteen where we were given a cup of hot cocoa free. The latter made our bully beef & hard biscuits far more palatable. This is the first time I have seen a Y.M.C.A. so far in the line. Our aeroplanes were busy overhead all day, but Fritz were nowhere to be seen. Fritz pelted shrapnel at our planes until he was tired, but all without effect. The Australian Flying C. are operating in these parts now, & truly they are daring. We left the work at 3.30 & came home. I saw a tricky makeshift on my way home. A motor car without wheels, resting on a trolley of light railway, was so geared to the trolley axle, that it was used as a tractor for drawing trucks. Our planes are giving Fritz a little excitement to-night. One of our corporals was awarded the Croix de Guerre yesterday. This corporal was among those gassed the other night. \n\n5:2:18 \n\nWe left here at 8 o'clock this morning to continued with our same jobs. It was a lovely morning, & the weather calm.We picked up our infantry party\n\n1:2:18. \n\nUnder the circumstances we had a very fair night. After breakfast we continued to fit up our dugout with bunks & a stove. Our bunks are made of broken duck-walks & wire netting, copiously padded with sand bags: they have every prospect of being comfortable. Our greatest trouble to-day has been the cold: everything is frozen, bags, netting, & wood, even the wind seems frozen. We finished to-night at 5.0 pm. had tea, & by the time we were shaven washed & made our beds, it is quite time for tired men to turn in. E.O.K. Green returned from leave tonight. \n\n2:2:18 \n\nOur stove is convenient enough to light before we get out of bed, so that we can warmour socks before before putting them on. We were very cosy all night, but the cold was awful this morning: we had breakfast at 7.15 & started work at eight o'clock. We were put on building dug-outs for the other sections & officers. It was so cold that I did not know how to hold the shovel. The sun shone later in the morning, wh. made an immense difference. I made several trips to a dump half a mile from here to bring up material for the dugouts. The artillery make a great row here. The guns are only a few hundred yards away from here, & our home here shakes every time. Certainly our artillery is not very busy at present. We finished work at 5 o'clock, when we had our tea. After tea there is a general retreat to dugouts as there is nothing else to do. As soon as the day cleared this morning, aircraft became very active, tho Fritz does not seem to be doing much round these parts. \n","5":" \n\nFrom a hundred to two hundred yards from this dugout, we have six 9.5 inch howitzers: I was very surprised to hear this morning that they were busy during the night, because I never knew anything. We continued with our same dugout jobs to-day. There are yet several to be finished, but those will take their time. Our camp is situated at the edge of an old wood called \"Grand bois\". All that is left of the wood now is a few branchless trees, The remainder are bullet riddled stumps, where the top part of the trees have been blown away. Where there are no stumps, are shell holes & remnants of barbed-wire entanglements. We have plenty of fire-wood here & can afford to keep a fire going all the time. The weather has not been quite so cold to-day, & we had a\n\nduring the forepart of the night. I leave here at 9.0 am with the mess cart taking the blankets & cooks gear. \n","6":" \n\nI took on duty a 2.0 am. but there was nothing doing. I roused everybody at 6.30. Breakfast at 7.0 & the section were away by 7.45 with full packs ready to start a full day's work. I had time for a shave & wash before leaving at 9 o'clock. I put most of my gear, exceptequipment, on the cart. The roads were frozen & slippery, & the morning very foggy. We arrived at a certain portion of the road where we were stopped by the traffic man. We argued the point that it was foggy & unable to be observed. We got thro. Last time we were on this sector, this particular part of the road was used by any & every kind of vehicle going but the divison wh. has just left, has been a little more particular. We were again stopped at Lamp Post Corner & about 200 yards from the camp, but our former excuse put us thro. The latter portion of the road was lined on both sides with artillery: everything from anit-aircraft to 9.2 howitzers. My firstthoughts were, what a noise to go to bed with. The first aspect of our camp was not inviting. Down a deep broken Fritz trench were some dugouts, pill boxes filled with water & a general mix up of timber, iron & wire. The trench is so narrow that if two men want to cross, one has to lie against the bank while the other passes. Our section was working at the lower end of the trench, going for their lives at their homes. When I had depositied my gear, & distributed the blankets, I joined my three mates in building this home. We first raided a dugout about 400 yards away, took up the flooring boards & off with the door: this latter place must have been built for a general. By night time we had an excellent floor & door erected. We walled the place in front temporily with corrugated iron, & deemed ourselved sufficiently comfortable for the night. Almost the first thing I was introduced to, was a dead Fritz's leg sticking out of the side of the trench. He was only covered by about a foot of earth. There seem to be several of his kind about here, but this fallengentleman is only five yards from our door. After tea, we washed in a shell hole. When I washed my face - the smell! The thoughts of dead humans made me wash afresh in another hole. Three of our N.C.O's were gassed last night & taken to hospital to-day. They were out on a reconnaisance trip, & a gas shell lobbed alongside of them. We rolled into bed about 8 o'clock amidst a copious supply of sandbags.\n\nThey had had a long day: their day was prolonged as they were lost in one or two places. Shortly after the runner came along from the acting O.C., to say that they had to proceed to the other camp at once, wh. was two & a half miles further on. The air was justifiably blue. During the evening I was warned forgas picket, but also had another man to help me. I am taking on the shift until 2.0 a.m. & it is well on that way now. I have discovered that the first division moved out to-day,wh. is my bad luck, as most of my pals are in this division. The dugout wh. I am in at present holds twenty four men, & is so dark, that we have to light candles during the day. It is a matter of making the best of a bad job. \n\n30:2:18 \n\nI was relieved at 2.0 am, & was well ready for my bed after twenty four\ns\nhours on my legs. The section rose again at 6.45, so I had no sleep until they were out of the way: however I had my breakfast with them, & returned to bed immediately after. They left at 8 o'clock to work somewhere. I had a very good sleep until noon, had lunch & made the fire in the dugout as it was bitterly cold; I then heated some water & had a good general wash & shave. I had nothing to do all afternoon, & was waiting for orders. At 3 o'clock the transport arrived. The transport left Questrecques two days before we did, & \ndid\nmade the trip in easy stages. The amount of transport that a field company carries about is fairly large considering the size of the unit. But we have such a quantity of tools, pumps etc to carry round, not omitting our useless pontoons & waggons.Everybody seemed quite pleased to arrive. The C.R.E. transport also arrived with them. The section arrived home at 4.30 after working hard all day at the new camp. We are not staying here, but moving to this new spot nearer the line. The section had been on to building their own huts so to-day most of the digging & erection of the cupolas was done. Everybody had been detailed into fours as occupants of each dugout. Just as I was beginning to wonder whether I shd have to build my own at some future date, I was asked by L.Cpl S. whether I shd like to join them. I was warned for gas picket again. Orders came round to the effect that the whole section had to leave to-morrow at 7.45 with full packs. I decided to take from 2.0 am, so am turning in \n\n28:1:18 \n\nIt has been a matter of falling-in, being detailed for cleaning up round the billet, arranging packs, being inspected etc the whole day long. We started at 8.30, but not exactly rushed. The straw of our mattrasses was burnt, & the hesian returned to store. The orders were that one blanket had to be carried rolled in our ground sheets, the other had to be rolled in a common bundle wh. should be taken on the lorry. Orders to-night say that we must roll the remaining blanket in our ground sheet & place on the lorry before 4.30 a.m. The section cyclists leave at 3.45 am. for Desvres where they will entrain. The remainder of the section leaves at 5.20 a.m. for Samer, catching the train there. The interpreter & the landlady accompanied by one of our officers came round this afternoon to note damages: the estimated cost was 750 francs. - robbers.\n\n29:1:18 \n\nI can hardly say that we had reveille at 3.0 am, because those who were not kept awake by the cold, were kept awake by those running about waking cooks etc. I was unfortunately one of the former. However I had my pack ready, & blanket rolled by 3.30, & making good progress with my breakfast as I had no intention to miss the lorry. From then until 5.20 we cleaned the billet, packed the cook's gear, & kept ourselves warm by a roaring fire, burning whatever we could. At the end of the time we fell-in on the road ready to march off. It was a glorious morning tho dark, & we had everything in our favour. It was a great relief not having either our ground sheet or blankets to carry & we arrived at Samer station, not exactly fresh, but certainly not fatigued. When we arrived there, we were not disappointed to find, that we had to wait two hours to entrain. as is the usual method. This made us cold. We entrained & left Samer at 8 o'clock by the customary long troop-train. As time went on we became colder & there were no windows in the doors to help us: so promptly some took out their leather jerkins & fastened those up, as best they could. The journey was not an unpleasant one, in spite of the cattle boxes. We arrived\n\nat Zwynbar, the terminus where we entrained when leaving this locality before 12.20. Once more we were among the booming of guns. We marched away & arrived at these dugouts at 2.30. The cyclists who left long before we did, had not arrived. However a cup of tea was ready for us. On arriving here we found that this was not our destination, but a new camp near the line. Three sections went down immediately, but our section was left behind. The cyclists arrived towards dark, & waited about for orders. At 8.30 they had begun to turn in where they could as,\n\nMy Darling Mother,\n\nYou will follow the pages in sequence & bind all together. I have the covers here.\n\nYour loving Son\nCec\n\nMrs R Bernard Job\n\n28\/4\/18\n\n87 Phillip St\nSYDNEY NSW\nAustralia\n\nYour Son has recentlygoneto hospital ill after being in the trenches. He is\nI\n\nam\n\nsure\nnot too bad so you should not worry. I found these papers belonging to him and knew you would like to have them.\n\nYours Sincerely\n\n9791Private C APatchell\n55th Batt AIF\n\n25:1:18. \n\nFor the first time since I have been with the company, we had a muster parade at 9 o'clock. Everybody was present. It was merely for the purpose of the Major reading out to us the conditions of U.K. leave. We must be with the company twelve months before we obtain leave, including thirty days\nfor\nabsence due to sickness. Over that time there are certain modifications etc. There has been some dissatisfaction among the men, wh. has apparently called for this revision of conditions. Immediately after we were set on loading the pontoon\ns\nwaggons: but before doing this, all the chesses & baulks had to be collected from all over the place, as they were used when we first arrived here to erect tables. Everybody working, it took us a couple of hours to complete the job. We had no table for lunch, but made a counter lunch of it off \nit\nthe window sill. This afternoon we dismantled our barnof abode, by pulling down the hesian. So to-night it seems as tho we might freeze: it is nevertheless a beautiful night, mild, clear & moonlight. I have just returned from Samer: I went in to buy bread, but was really hunted home by the street smells, wh. are worse than ever to-night. Gormly has been transferred to company headquarters to-day. \n\n26:1:18 \n\nThe weather was unsettled this morning, but has since cleared up. We had an inspection in full marching order at 10.0 am. The whole company turned out, including our 74 horses, w.h we keep for ornaments. When the inspection was over orders were read out. The two main ones were:- the saving of waste paper & cardboard, & that the names of deserters would be published in the Australian papers for public notification. It has apparently become a habit for men to desert when their division enters the line. During the remainder of the morning we packed the limbers & left the bare necessities. The transport leaves to-morrow, as they have four days trip on the road. It is no job to be envied. This afternoon was devoted to cleaning up generally. Our advance party left last night. \n\n27:1:18 \n\nThe transport left this morning at 8.30. We had a route march at 9.30 with full marching order. It was not out of the way, tho the same roads become\ns\n very wearisome. Everything we do now is in preparation for the move. This afternoon I with another, went for a stroll. It has been a glorious spring day, & may it continue. Aeroplanes seemed very busy to-day, probably due to the beautiful weather.\n\nBy dinner time the weather looked more cheerful & brighter. No sooner had I finished my dinner, than Gormly appeared on the scene. For something better to do, we strolled along to the sports. We arrived there about 1.30. The first event was to have been at 1 o'clock, but at 2.0 the spectators were growing very impatient. The 100 yds were run off first, but it was very sloppy & slippery. In all the races the lucky man won. It was no test. Sawdust had to be laid for the jumping. Every competitor was covered with mud from head to foot. About 3.30, it began to rain, so we retired. I had a game of chess to-night, but was feeling rather tired to enjoy it. The rain continues. \n\n23:1:18 \n\nAlthough there was no change in the weather this morning, we were roused from our usual sleep at 6 o'clock. We had breakfast at 6.30 in order to be on parade at 7.45. The guard of honour moved off the company parade ground at 8.0, dressed with belt side-arms & rifle. The remained were marched away under the command of a few corporals, who were instructed to keep us on the move for a few hours. We marched to our drill ground, where we carried out a few movements at the feeble voices of the aforemention corporals, had a few relay races, then spent the remain\ne\nder of the morning on a route march. We were dismissed about 11 o'clock, & then because it was raining. An early breakfast make a long morning. That was the end of our day's work. The guard of honour had quite a short morning, but was unable to gather much information, reliable information, beyond the fact that Gen. Birdwood decorated the heroes. The ceremony was held at Samer. Immediately after dinner, Gormly & myself went for a tour on our own, covering about seven miles. We saw very little of interest, because once you see one French country farm-house you have seen them all, that is of course in northern France. But the scenery was beautiful: there were the finest collections of greens & brown under a clouded sky, that wd be possible to obtained for one picture. I studied them with as much interest, as tho I were an artist of many years. We still await news of our departure, but so far we are no wiser. \n\n24:1:18 \n\nIt seems ludicrous, but we had another bathing parade this morning. It was equally as good as the last: this constituted the morning's work. After lunch we paraded in full marching, & were given gas drill & squad drill. We are merely putting in time the best possible way, & the most monotonous way. Everybody is getting very tired of this village.\n\nbeen brought over here by the army. It is the corruption of the arabic word \"Backshesh\" meaning \"a tip\", hence used now, as meaning \"free\". \"Using your nut\" is an old saying, but nevertheless well said. If by simulation or dissimulation, not necessarily with any intent to lie, material benefit is obtained a man is looked upon as \"having used his nut\". Many men when in the line get afraid of Fritz M.Gs, H.E shells & his other means of murder: it is quite natural to be frightened, but the boys prefer the epithet \"windy\". There are numerous such words used, wh. can be more readily spoken than written. After dinner, in spite of the rain, I compelled myself to take a long walk. I was on the move continuously for a couple of hours, wh. was far better than the fireside or even bed. I say bed but I mean on the floor with a blanket over me. There is a general rumour that we are going to Egypt. It is marvellous how these rumours, or L--- as we know them, get about: I mention it now, & shall see how reliable they are. \n\n21:1:18.\n\nI was delighted when I heard last night, that Iwas to be mess orderly to-day. Am becoming a typical soldier by evading work. A route march was on the boards again. When the section left at 9.15 with full packs, I was taking my time at the end of a broom handle. Everything was clean & ready for inspection by 10 o'clock. Then in usual army style, I whiled away the time by doing nothing. There was another parade at 2.0 in drill order. Next Wednesday some decorations are to be given to the Div: consequently the company had to drill this afternoon & practice for this ceremony. The polishing of equipment is the next task & a laborious one too. Rations today were more than usual, hence we must be winning. \n\n22:1:18 \n\nIt rained heavily all night. A letter from D.A. Mac also stated that they had had a great deal of rain at M.& no war. It seems a pretty general rain\ns\n. On 9.15 parade, the ten men chosen for the guard of honour we marched off for general inspection & rifle exercises in preparation for to-morrow. The remainder, with the exception of three, of whom I was one, did a morning drill on the hill. We three had to go to the sports ground to prepare the grounds for the divisional sports. We trudged up thro mud & rain, & on arriving there, had to fill in a gutter wh. took about half an hour. This gutter crossed the track & hindered the competitors, but at the same time, was carrying away a great deal of water. When the gutter was filled, the whole ground was swamped as it \nhad\nwas on a gently slope. After this ridiculous job, we came home.\n\ninspecting in due course. He announced that we should be on the move within a few days. Having then inspected the billets we were dismissed for the day. It rained most of the afternoon, wh. compelled me to remain indoors & write letters. I was compelled to go to the village to purchase envelopes, but did not lose much time in returning. I met a man from the 8th F.C.E., & he informed me that they were leaving on Sunday next, for Messines. This looked very much as tho we shall follow. I received a letter from Th.B. tonight, wh. is the first since landing. The weather is very mild to-night, almost approaching one of our autumn nights.\n\n19:1:18 \n\nThe mild weather continues; no rain, tho cloudy. At 9.15 we were paraded in full marching order again. Thoughts of a long route march caused everybody much anxiety, & made them all ask for fatigue jobs. However we started on the road. We headed towards Boulogne, but had no\nt\ndesire to reach there. Packs & rifles always become heavy after a while, under any circumstances. We did not march any more than six miles so consoled ourselves that it could have been worse. It was warm walking, sufficient to raise a constant sweat. We had dinner as soon as we arrived home, Then the usual reading & writing in the afternoon. A parcel arrived from E.C. this afternoon. The sugar was very acceptable. Gormly is still on orderly room work, & busy at night, consequently we have not had many evenings together. \n\n20:1:18 \n\nA wet Sunday morning & no parades has little to attract. I have written letters until I'm weary & tired of writing the same things. There is no news to tell or rather no news wh. we are allowed to tell, so it boils down to the fact that I am merely despatching envelopes. Since I started to write, someone quite near by has very audibly used perhaps the most common slang word in the army. But my disregard for vulgar slang does not prevent me from making a note of it here as it may perchance remain & be established as one of the \"technicalities\" of the A.I.F. The failure to obtain an objective, probably with the idea of evading something less desirable either in work, food, dress, recreation or anything affecting one personel & individual environments, is voiced by \"Gutser\". I have heard the word before, but not attributed to anything outside a slip off a diving board, when the diver smacks the water in a prone position. However this abdominable catastrophe is metaphorically used for subjects ad infinitum, where more delicacy could be exercised with greater advantage. Since I have been started on this subject I shall enumerate one or two more. The word \"Buckshee\" is extensively used and attributed to any article given away free or issued. It is frequent that one hears \"Buckshee Tea\" or \"Buckshee Stew\", meaning tea or stew left after everybody has been given his share. The word originated in Egypt & has\n\n17:1:18 \n\nThe whole billet was kept awake to a late hour last night, until our convivialists settled down. Twoin particular grew obstinate as time went on, & wd not retire. It has become a common occurrence after pay day, for at least one or two to arrive home over merry. French wine proves too much for them. It was raining & snowing alternately this morning, but the rain won the day, & continued all day long. At 9.30 we were marched to Samer, for a bath at the regimental bathroom. We set out with a piece of soap & towel tucked under our rainproofs. Baths are such rare events, that I must never omit to mention them. We all had to peel & dive under the shower together, owing to the scarcity of hot water. We were given five minutes shower of hot water. These were the first showers I have seen in France: they were good. Then we were given clean underclothing wh. is always welcome. A good stiff walk home before dinner did us no harm. On arriving at the billet, we were informed that the G.O.C was doing the rounds of the billets. We had no sooner sat down to dinner than his Lordship, Lieut-General Hobbs was seen coming along with his train. He came into the mess room in a very genial & jovial manner, asked us whether we were receiving our rations, clothing etc, & did we receive a bath. \"Yes, sir we had one this morning.\" How things are worked in the army, not only for our benefit, but for those in charge. As usual the billet was cleaned up for the occasion, fire buckets placed everywhere in conspicuous & prominent places, almost where the old sport could kick them over. We were previously instructed by the orderly officer what we had to say if the General asked us, what we had to do if a fire broke out, but the instructions were so mixed up, that they were not worth remembering. I did a little rough washing after dinner, & sat by the fire until the articles were dry: also did some writing. Our days are short & nights long: as soon as we finish our tea wh. is usually at 4 o'clock, we come up & write, or read if there is anything to read; sometimes I may go out for a stroll, but that is always brief. I heard to-night that the 8th F.C.E. is returning to Messines to-morrow. We have heard nothing official or otherwise about our moving out but nevertheless we shall soon follow.\n\n18:1:18 \n\nAn order came round this morning whilst we were having breakfast, that there would be a parade in full marching order at 10.45. It took us all that time to pack up & change our equipment. It is always a nuisance trying to get everything\ns\ninto the allowed space: the weight seems to be always greater each time too. The Major has gone to C.R.E. for a few days, the Captain somewhere else, so Lieut Fry was left in command. He came round to do the\n\nbeams. The horses had a wonderful escape. One received a cut eye, & one or two walked very lame; but otherwise thanfright all were right. The drivers were living in the other end of the barn, but now both horses & drivers have been removed to other quarters. Salvage work then commenced to recover harness etc. I read most of the afternoon: & we had an early tea dished up in the form of Australian rabbit, stewed at that. The paymaster came up to pay the quarantined people shortly after. It means a long evening, but most of the men will now play cards until a very late hour, or until they lose all their money. In two days time, most of them will be penniless, & then live the time until next pay day in idleness & misery. Such is the ambition of many. \"Two-up\" the national game, as it called, is also a favorite pastime. This game is played whenever there is moment to spare. I have seen it played in the ranks when halted for a few minutes, & on one occasion have seen men playing in the dark at 3.0 a.m, using an electric torch to see the coins. So much for the national game. I hope very soon that you will realise that my previous criticisms wh. you deem trenchant, are not painted at all, but based entirely on fact without departure. \n","7":" \n\nA gale of wind blew all night, wh. gave everybody imaginitis; most men thought that at every sound on the roof, was a sign that it was coming in. However we are still here under the same roof. We were made to parade in the paddock in the rain. We were not allowed to go on\no\nthe parade ground owing to our isolation. We had a gas helmet drill for an hour then bayonet drill for an hour. It looks as though we are getting ready to go somewhere. We have been here for over a month now, & it has suddenly occurred to the sanitary section that the water we have been drinking, is unfit for anything but washing: so very promptly they erected a huge notice to that effect. We had an inspection of the billet to-day by \nthe\nsome froggies, accompanied by the Captain & the interpretor: the former were very excited making enquiries as to what we did etc. A very absurd method of doing business, because they were not told the truth once. Their object was to collect information concerning the barn wh. collapsed yesterday. They lodged as the excuse, that the horses had chewed the supporting pillars. We started to take the ant-eaten timber for firewood, so they wanted to make us pay for it. After lunch we were officially freed from isolation. Straightway there was an exodus to the village. We had been paid yesterday, & there had been no opportunity to spend it. The poker players finished up late last night, but nevertheless the money was still here. I was compelled to visit Samer to-night, to purchase candles & bread. We have been on rather short rations, with Anzac wafers as an alternative.\n\ngaze this morning just as the sun was about on the horizon, is beyond my descriptive capacity. It was the weird & uncanny stillness of the air, in a world of white, wh. called for admiration. The sky overhead was a pale grey, wh. seemed as though it were ready to freeze & fall. The old barns were there, the heaps of manure were not removed, & the pool where the pigs drink & we wash was \nfrozen\nthere, but all covered with the finest of snow, making a perfect picture. But apart from all the eye-sores being obliterated, the trees & shrubs & hedges were the culminating feature of the entire. Every twig of not more than one eighth of an inch in diameter, had a sheet of snow two inches high resting perpendicularly on it, & every twig even to the topmost of the loftiest tree was the same. Imagine to yourself how the trees looked. Had you seen the snow-laden coniferous trees, you wd quite understand why they always look so gloomy. Even the robins in the hedges enjoyed the morning because as they flitted about, & perched on the branches, they wd send a shower of snow to the ground. To look at such an unrelieved splash of white for very long is blinding. As the day grew, the sky cleared, the sun shone & picture became as one we have often had before. We had a medical inspection for mumps. We were lined up, the roll called, & the M.O. went to everybody & asked them whether they had sore necks. Orders of isolation were duly read to all whilst assembled, & we all returned toour billet feeling like caged rats. The guard was mounted, but after an hour all was forgotten. We then played football until lunch time, during wh. performance our boots got quite wet with the snow, wh. was about six inches deep. I spent the afternoon rending down fat as a pastime, but really a pretext to get dry & keep warm. I received six more letters from home, wh. I presumed lost sight of those wh. came yesterday.\n\n15:1:18 \n\nIt started to rain early this morning & has continued all day. Late this afternoon we had a thunderstorm, wh. seemed to me to be odd for this time of the year in a cold climate. We fell in on parade outside the billet at 9.30, inspected, & told to remain in the billet: not a severe punishment on a wet day. Shortly after lunch, there was a terrible crash: \"The stables\", somebody yelled out, & sure enough half the barn wh. was used for the horses was flat on the ground. It was merely a mass of debris & kicking horses. We all rushed out with saws & axes, to unearth any men who might have \nhave\nbeen caught. We were pleased to find no men but seven unfortunate horses. Many hands made quick work in removing the tiles, logs & mud walls from off the animals wh. were lying underneath tangled up & contorted in all sorts of positions with the\n\nblood. I have quite made up my mind how to treat these people in the future. The mild weather still continues, but the mud is getting worse. We had a check parade this morning, & then an hour's fiddling with our gas helmet, led by the corporal. That took us well on to dinner time. We have had no potatoes for some days, but onions have come to the rescue. We were given no jam to-day, but raisins issued in its place: sometimes figs are issued: fruit is the one food I miss in these parts. It is possible to buy a few wretched apples at a high price sometimes. However after our dinner of bully beef & onions, I wrote one or two letters to my friends over here. Letter writing is about the only comfort one has, & it is just as well to write them while the weather is mild because once the frosts come I cannot keep warm. After a tea of bread and chess, moistened with warm strong tea, I went out to look Gormly up, but was unfortunate enough to have missed him. I then returned here for it is no pleasure to remain in wet boots. \n\n13:1:18 \n\nI was up first this morning having my usual shave before breakfast. The temperature was lower this morning & the mud partially frozen, & by the cool feeling in the atmosphere now, the mud will quite frozen to-morrow. We received an announcement that there wd be a voluntary church parade for the company in the local school room. Being voluntary I lost all interest. But as it was Sunday, it seemed natural for me to have a general clean up, although I knew that we shd not be inspected. A stay froggy youngster wandered in with some English newspapers: he wanted 2½d. each although they were½d. paper in England. The commission these froggies must make wd almost be equivalent to a young fortune. Australian troops are not exempt where money is concerned, because everybody takes them for millionaires. However the reading of the paper occupied the remainder of the morning. The cook made a bargain by an exchange with a tin of bully beef. French people treat bully beef as a luxury it seems to me. Just before dinner one of our boys went to the doctor, & he pronounced mumps. The ambulance came along & took him off to the hospital. After lunch I took a stiff walk for exercise: I walked continuously for twohours, but did not actually reckon out the mileage. When I arrived at the billet, I was greeted with the fact that we were quarentined, & found that someone had been freely using phenol by sprinkling it over the floor. A guard had been placed over the billet but am afraid that they forgot their duty half the time. At tea time I received ten letters from Australia, & a parcel from Aunt Rose. I have been reading letters most of the night; the guard is non est now & there are very few left in the billet. But we shall know to-morrow the result of the M.O.'s examination. \n\n14:1:18 \n\nSnow has been falling on & off for over a month, but the grandeur wh. arrested my\n\nIn all villages, & even in Le Havre, the people bring their buckets to the pumps in the streets; they carry the buckets on a wooden yoke, wh. fits round their neck & over the shoulders. They look like beasts of burden\ns\n, but however comfortable for carrying purposes. Another method adopted for carrying water, is to use an iron hoop. The person carrying, walks inside the hoop, holds the buckets by the handles & lifts. The hoop merely keeps the buckets away from the legs, wh. affords less impediment to walking. We left the hole at eighteen deep. We arrived just in time for dinner. As soon as we had finished it, we were detailed to erect a tent on the sports ground wh. is about half a mile from here. The tent had to be erected & used as a dressing room for the footballers playing in a match at 1.30. The ambulance were playing the pioneers. The tent was erected, but nobody used it. The ambulance team came partially dressed, & the pioneers dressed in the motor lorries. We had to remain there, as some stores were to be returnedto the pontoon waggons. We watched the match. On a previous date, the engineers met the ambulance with a win for the latter. So there was a fair number of interested engineer spectators this afternoon. The ground was covered with water & liquid mud. A lovely slippery constituency. By the time they had been playing for quarter of an hour, it was impossible to recognise them, for they resembled mud balls. After some very funny sights, & good passing by the ambulance, they carried the afternoon by twenty five to nil. As soon as the match finished at 3.40, we ran off with the stores. After tea we had a foot wash which was a company order. \n\n12:1:18 \n\nI heard last night that Wilkinson, who came over with February reinforcement; has been transferred into a headquarters band. He came over to France about a fortnight before I did & joined the 15th F. Coy. Engrs, that is the same division. He put in for several such jobs I'm told but only one came along. When he left the company, he was very reticent towards those who were previously members of the old company. At first I almost declined to believe that he wd have done such a coldfooted action, but nevertheless it is true. He was, never popular among the boys, except musicians, the quintessence of laziness, & his self-importance was only lauded by himself, his demeanour & daily routine at Brightlingsea won for himself the name of the \"Village bull\". But a man who applies for a commission as soon as he enlists, & then takes on a band job when he gets into the line, is no soldier, & merely wants to live on the \"fat of the land\" won by his comrades'\n\ncold to-night, but a clear sky. The snow on the road made very hard walking, & on the sides it is about three feet deep, where it has been blown by the wind. I fell down in it twice & Gormly got into the gutter & sunk down up to his hips. \n\n9:1:18 \n\nOur easy time continues. No parade, no work, the snow is too thick for anything, so we amuse ourselves the best way we can. Kicking the football & snow balling are the most popular in this direction: sleighing & tobboganing are off until a freeze comes along. At noon it began to snow & has been snowing ever since. I cannot say that walking in a snowstorm is the most delightful pastime, it may be if one were equipped with all the necessary protection. But once we get wet it is difficult to dry our clothes. The snow to-day has been very wetting, but at times it brushes off ones clothing like powder. I went round to see Green after tea for a yarn. The Major is still away on leave. I afterwards had a game of chess. It is some little time since I played, & felt the want of practice. A very heavy thaw has set in, & it is weird to hear the water dripping from the roofs & trees, & running on the road & no rain. \n\n10:1:18 \n\nA thawing wind blew all night, with the result that very little snow was left on the ground this morning. I started out for a walk about 9.30, but the road was so slippery & wet that I had to return. I was unable to take steps greater than twelve inches. I came back & wrote a few letters until lunch time.Ater lunch I set out on the road again, & this time was quite successful. The road was very wet, but not slippery. I made for Desvres along the Boulogne road, but did not reach the town before it was time to return for tea. It was a walk, & nothing more, rather uninteresting in fact, but exercise is so necessary that I did not regret one step of it. Just as I arrived home, the tea was being served out. I came up after tea & started to write, & here I am writing yet. It is cold, & we cannot light a fire to-night owing to the wind being in the wrong direction for our improvised chimney. It is made of jam tins in telescope fashion, & does not draw too well. \n\n11:1:18 \n\nThe wind continued all night, & the\nwind\nmud was deeper than ever. It has been dull all day & threatening either rain or snow. However we are duty section to-day, & we had to do all fatigues in spite of the elements. Two of us were detailed to report to the C.S.M., on doing so it was to dig a hole for a rubbish tip. We dug down to a depth of eighteen inches, & the hole filled up with water running in from all sides. France is no doubt a wonderful place for water. Any sort of a hole in the ground is filled up. There are springs everywhere, & as far as I have seen, it is the only means wh. people have for their water supply.\n\ninside will get like water\". I'm sending this joke to the varsity for insertion in Hermes. I've not heard anything to equal it since I left Sydney over a year ago. Others in the company contended that it is impossible to obtain liquid air. When I had gone to sleep, I was awakened by someone poking me; \"Eh digger\" I heard, looked up to find a man flashing an electric torch in my eyes. Perhaps no so polite as usualI asked him what he wanted: \"Are you Mr Job\", \"Yes sapper Job\", I said. \"A mining engineer\", I again answered in the affirmative. \"Well I would like to have a yarn with you\". I asked him if he could postpone\nd\nit until the morning. I have not seen himsince, but learned that he was merry with wine last night, but how he learned that I existed at all in the company, I can't say. These two incidences in one night were too much for I woke up at 2.0 a.m. & found myself laughing thenit blew a gale & snowed all night. At 7.30 this morning it was snowing so heavily that it was impossible to see beyond a few yards. A good estimation would be about twelve inches. I was much impressed by the presence of the tiny Robins. These birds are lost among the bushes in ordinary times, but are very conspicuous against the white snow. They were flitting about the doorway this morning looking for food. We had no parades of course, & besides I was mess orderly. This responsible position comes round about once per month. It consists in sweeping out the billet & kitchen, chop or saw a few sticks of wood, & sit by the fire & watch the cooks make the dinner. It is a position that everyone is willing to accept especially if there are any parades. I had all my work done by 10.30 after wh. I did a little washing. I have been doing my own washing lately, & vigorously waged war on the vermin. So far I have been succesful & have had better & more comfortable nights. We had our rations increased to-day, to three men per half loaf: yesterday it was five men. When we get more food, the cry here is, \"We are winning\", but when we get cut down, \"We are losing\". Shall we call it rational news. We have had to make more use of biscuits, wh. we call Anzac waffers. We soak them, we boil them, make sops of them, grind them up & fry with bully-beef to make rissoles, & chew them. The absence of sugar makes these concoctions less palatable. We have not had porridge lately merely on account of having no sugar. Gormly & myself went to the village after dinner to-night; to stretch our legs. Having had a cup of coffeethere, we returned to play chess: Gormly has just begun to learn, & I myself am getting rusty, so we were not over matched. It is very\n\nA small bone stuck in the cook's throat, & after much coughing was unable to remove it; he promptly took the knife steel, threw back his head, & began poking with it. As I saw the steel disappearing it reminded me, as I said before, of the man who used to swallow the sword: but on the occasion I saw the gentleman conjuror, his stomach was much upset at such a rude entry, &it would have been no surprize to me, if the steely intruder wd have had the same effect. After lunch we took the sleigh to the hill. We had some very successful trips, & few spills considering the high speed we attained at times. When I arrived home there was a mail of 10 letters awaiting me, wh. is the second batch of my Xmas mail. I have spent the greater part of the evening reading them. \n\n7:1:18 \n\nJust as we were getting into bed last night, a party of drunks rolled in. We have one old man in the section who went into the village early this morning, & has been soaking up all brands of wine & beer the whole day; some more of his merry friends brought him home, & am afraid they all had a rough time coming home on the ice, with the result they were all very bad tempered by the time they arrived here. After some trouble we put him to bed, but he wd not allow anyone to take off his clothes, so he turned in soaking wet. But to-day he has been in bed, & by no means did he appear attractive. It was raining most of the night, leaving the ground & roads very muddy & slippery. We had no parade this morning, but were told to stand by. I did a little washing by way of amusement, as it was rather a mild morning. There areno facilities for washing but that adds to the excitement. I had no bread for lunch to-day, wh. is my first day without it. I was obliged to recourse to biscuits. The company has been playing football against the Field Ambulance & the other F.C.E. It was very muddy on the field, the players being covered with mud. I remained in the billet writing. I went for a stroll to the village after tea, but nothing exciting happened beyond the fact that I could not buy any bread. \n\n8:1:18 \n\nLate last night, when theargumentative fire-siders had almost come to the end of their usual tether, took up the subject of liquified air: apparently nobody knew anything about it, & certainly nobody had ever seen any. So it was quite fitting for one of the company to announce the fact, that itcould be bought at the chemist, & had to be kept in a thermos flask. He, seeing that the audience was giving a good hearing proceeded with the manufacture of liquified air. When I heard this, I immediately took out a slip of paper & noted his words wh. were these: \"Get an inch of air, & put a pressure of 500 lbs on it. This can best be done in a cylinder, then put the cylinder in something terriblecold, then the air\n\nfor what reason we cannot find out. But the mengo to Samur & buy French bread, wh. helps with the days ration. Extra military police however have been put on duty, to prevent the soldiers buying bread: if either buyer or seller is caught, the result is severe. Very often we can obtain bread from the farm houses because the people can buy flour & sell the home made bread at a small profit. The best method to buy is to get a boy to buy it & give him a commission or get it at night. We need not starve, as there is plenty of bully beef & biscuits, but the time will come when we shall have no choice, consequently we do not rush the latter. I have been writing all afternoon, & after strolled to the post office to get a registered parcel wh. happenedto be Hermes from Mullens:this afforded me a little reading nourishment for a while. I called in to see Gormly on my way. He is still doing orderly room in the way of draughting.\n\n6:1:18 \n\nIt was announced in last nights paper, that to-day is to be set aside for prayer and devotion, for the cause of a speedy peace. On the other side is a speedy prediction of a huge battle in the spring, where the Germans are preparing for a last try to capture Calais. No doubt the latter will be the greater factor in bringing peace to a successful issue. America has not surely placed an army on French soil to dictate peace only? Let us hope not. But not until hostilities have ended can we hope for definite peace. For my opinion is, as it always has been, that peace terms will be proposed & disposed for months, probably years before, & years after hostilities do actually end, & all nations retired to their own country with a sheathed sword. I have absolved myself from the responsibility of arguing on the war & its termination & resolved to the irresponsibility of a sapper; it is far more cheerful & sanguine to let the present envelope us with its trivial events. The church bells in Questrecques started pealing at a very early hour this morning, & this is the only evidence of a Sabbath day at the \"front\". I don't know what religion reigns supreme in these parts, but am given to believe that they are R.C. Crucifixes from miniatures to life size are posted up in many places round the village. We have two huge ones in the grounds of this farm, & they do make one shiver to see the snow hanging on & around them. In other places cubicles are let into the walls & a crucifix erected. In Samur too the same custom is in evidence. We had no parade this morning, so I went for a long walk to keep warm. It was very difficult walking as we had a very hard frost last night, the snow on the roads being very glassy. I was very fortunate however to have only had one fall. I came back in good time & feeling well able to eat our simple lunch. I cannot help but note an incident wh. occurred during the lunch hour: for it reminded me of a similar one in Sydney.\n\nappear busier than wide ones, but in spite of the apparent hum-drum & din of a huge commercial city, I leisurely wended my way thro the crowd, taking note of contents of the shop windows & looking for novelties. I found nothing worth looking at let alone to buy. My next objective was a bath, but being a little too soon after dinner, I took a stroll round the promenade by the pier & beach, where I watched a few miserable breakers roll in from the Bay of Biscay. It was too cold to be enviable, too cold even to make my mind &imagination travel back to warmer climes. The only bare sandwas that where the snow has been licked off by the waves. The bath was next, paid two francs, & upstairs. A clean bathroom, an immaculate enamel bath, & a clean towel crisp with dryness having every prospect of a good rubdown. What a difference to our pig-pool washing place, & my damp greasy towel. I lay in the bath for half an hour and soaked. When I came out, I felt as though I didn't want to look at anything in case I got black again. I gazed with envious eye at the camouflaged steamers in the harbour. All the steamers are painted in various colours, anyhow & everyhow, but that did not take away the desire to visit my antipods. I then spent an hour or two at the pictures wh. were quite good. I paid an exorbitant price of 2d. for a programme, wh. was a single sheet of common blue paper, a facsimile to those circulars wh. are thrown at our doors by dirty little urchins, wh. urge us to vote \"No\". At 6.30 I set out in search of food; firstly to buy bread, & secondly to temporily nourish myself. I bought the bread & tuckedit under my coat & away. The bakers do not wrap paper round the food, but each buyer is supposed to provide a basket or other equivalent. I walked down the street until I found a newspaper boy, who wanted to sell me an English paper for 2½d.& he didn't understand that a French 1d. paper wd do the trick. I then sat myself down in a restaurant and called for dinner. All was well until the last course came & heaven only knows what it was. I gave it best after two mouthfuls, & I now hope that it was not some frog or snail concoction. It was then time to look for the lorry, wh. I found quite easily: the trip home was notthe most comfortable, but I landed home about 9.30, to find half a dozen Australian letters.\n\n5:1:18 \n\nThe temperature was not quite so low this morning, wh. is always a consideration when parades are on card. The parade at 9.30 was no more than a short march to our parade ground on the hill & a double round the paddock. Immediately after we had a general M.O.'s inspection, & dismissed at 11.30. Everyone was scraping round for bread at lunch time, as five men to a loaf still holds good. The rations are being cut down considerably\n\n\n\net Facimus\" is not impossible when you see the collection and assortment of tools & gear. I could not give a list here, as it would take several pages to enumerate. When the carts were emptied, they were taken away to be painted. We had an hour to spare before tea, so we took the sleigh for a run. We had a man with us, who reckoned that he had done some sleighing in Canada, consequently gave him control of the steering. We certainly had longer trips than previously, but we also had heavier spills owing to the increased rate & weight. There were five of us & everytime we hit, we were hurled into a solid mass. We obtained a good appetite for tea. Our ration of bread went five to a loaf to-night, & again no bread in town. Another parade was announced for 6 o'clock, but when 6 o'clock came, the parade was off. I then took a stroll to the village, had a cup of coffee, bought the paper and came home.\n\n4:1:18\n\nThe temperature fell considerably this morning, the ground & snow being very hard & slippery: on such days, besides my feet getting nearly frozen, in spite of the two pairs of socks wh. I always wear, together with felt soles & paper inside, they get very tired & sore owing to the short steps one has to take: it also affects the muscles ofthe upper part of the leg. On parade I was told to fall out, that my leave to Boulogne had been granted. I returned to my billet to put the finishing touches to my dress. I turned up for my pass at the orderly room in due course & was on my way by 11.30. It was a beautifully fine and sunny day, and I imagined Fritz visiting Boulogne at night. I caught the train as it leaves earlier than the lorries. The trains are very old-fashioned in these parts: the platforms in the first place are only about a foot above the rails, wh. means that passengers have to climb into the carriages on two steps. We complain about our tram-car steps, but if you were to see the women getting in & out with babies & parcels in these parts, you would smile at our own. Our train also had three engines, antidiluvian at that, for what reason I could not find out, but guessed that if one broke down there shd always be another on hand: \"slow & sure\" must be their motto, interpreted by nine miles per hour & three engines.At a certain station en route, the civilian passengers have to get out & show their passports & tickets. Every person here must have a passport, to shew that he or she is not made in Germany.Of course in this country it wd be no difficulty for spies to live, & these extra precautions must be taken. On arriving at Boulogne, I made for the restaurant, as it was long past my usual dinner hour, & the cold twice as keen. I was very glad of my coat & muffler wh. I brought primarily for the return journey at night. Narrow streets with foot-paths three feet six inches wide, always\n\n\n","8":"\n\nIt is much easier to get out of bed on a mild morning, but when we did get out this morning, the breakfast was very late. The cooks have apparently been off their perch during the holidays, & the substitutes are not expected to do the same. Pay was advertised, but the boys have been disappointed so often that they were not inclined to believe it. However a few fatigues such as wood getting & Q.M. trips were tolled off, & the remainder were free. En route of a constitutional, I saw a company in the far distance, but located it by Lt. Hopton's gait. There is no doubt that the person in question is the finest stamp of a leader that the A.I.F. possesses. He is really imposing, when I \npassed\n was passing him, he cast a smile & \"Good morning Job\". I think I was always one of Hopton'sfavourites, & I found him to treat me to the possible extent. The orderly corporal announced pay at 11.30, just as we were about to have lunch. The company was actually paid, but too late to celebrate the new year. Lunch was a very poor one to-day for many: \nto-day\n Bully beef & tea. No bread. Fritz bombed the army bakery at Boulogne, & we have suffered The bread issue today was a small loaf between four, wh. gives just enough bread for one meal, & it has to last us for 24 hours. However, we shall not starve. I read all afternoon, merely because it was raining; but about 4 o'clock I called for a registered parcel from you dated","9":" After dinner I went to Samerwith Gormly. We tried to obtain bread, but it was impossible. We visited the several canteens & bakeries, but our search was quite futile. We learned there, that some of the infantry were dividing their loaves into five & six rations, wh, accounted for the wild rush at the restaurants. I could not even purchase a paper tonight, so do not know how the world goes.\n","10":"\n\nMore snow fell during the night, but fortunately the temperatureis not very low. I gavein my name yesterday as one of the two to go on leave to Boulogne. I remained behind in the billet while the section went off to Samur at 9.30 for a bath. I waited until 11.15 when it was time to report at the orderly room for passes & inspection. On arriving there, we were told that all leave had been stopped, as there were five men A.W.L. It was very disappointing to have been told so late: however the C.S.M. told us to put in an application to our O.C. in writing, wh. I did at once, hoping to obtain leave tomorrow. We returned to the billet & found that the section had returned also. The bath was a failure, conveniences unsatisfactory, water was cold & there was no change of clothes. Their mission equalled mine. We had a check parade at 2.0 pm, as a result of these men clearing out. Once on parade we were available for duty & were sent to bring & unload the tool-carts. This took the best part of an hour. Each section carries a doubletool-cart, wh. is quite a tool-shop in itself. The motto \"Frangimus\n\n\n\n\n\n"}}