{"Document Name":{"0":"Diary_0166","1":"Diary_0166","2":"Diary_0166","3":"Diary_0166","4":"Diary_0166","5":"Diary_0166","6":"Diary_0166","7":"Diary_0166","8":"Diary_0166","9":"Diary_0166","10":"Diary_0166","11":"Diary_0166","12":"Diary_0166","13":"Diary_0166","14":"Diary_0166","15":"Diary_0166","16":"Diary_0166","17":"Diary_0166","18":"Diary_0166","19":"Diary_0166","20":"Diary_0166","21":"Diary_0166","22":"Diary_0166","23":"Diary_0166","24":"Diary_0166","25":"Diary_0166","26":"Diary_0166","27":"Diary_0166","28":"Diary_0166","29":"Diary_0166","30":"Diary_0166","31":"Diary_0166","32":"Diary_0166","33":"Diary_0166","34":"Diary_0166","35":"Diary_0166","36":"Diary_0166","37":"Diary_0166","38":"Diary_0166","39":"Diary_0166","40":"Diary_0166","41":"Diary_0166","42":"Diary_0166","43":"Diary_0166","44":"Diary_0166","45":"Diary_0166","46":"Diary_0166","47":"Diary_0166","48":"Diary_0166","49":"Diary_0166","50":"Diary_0166","51":"Diary_0166","52":"Diary_0166","53":"Diary_0166","54":"Diary_0166","55":"Diary_0166","56":"Diary_0166","57":"Diary_0166","58":"Diary_0166","59":"Diary_0166","60":"Diary_0166","61":"Diary_0166","62":"Diary_0166","63":"Diary_0166","64":"Diary_0166","65":"Diary_0166","66":"Diary_0166","67":"Diary_0166","68":"Diary_0166","69":"Diary_0166","70":"Diary_0166","71":"Diary_0166","72":"Diary_0166","73":"Diary_0166","74":"Diary_0166","75":"Diary_0166","76":"Diary_0166","77":"Diary_0166","78":"Diary_0166","79":"Diary_0166","80":"Diary_0166","81":"Diary_0166","82":"Diary_0166","83":"Diary_0166","84":"Diary_0166","85":"Diary_0166","86":"Diary_0166","87":"Diary_0166","88":"Diary_0166","89":"Diary_0166","90":"Diary_0166","91":"Diary_0166","92":"Diary_0166","93":"Diary_0166","94":"Diary_0166","95":"Diary_0166","96":"Diary_0166","97":"Diary_0166","98":"Diary_0166","99":"Diary_0166","100":"Diary_0166","101":"Diary_0166","102":"Diary_0166","103":"Diary_0166","104":"Diary_0166","105":"Diary_0166","106":"Diary_0166","107":"Diary_0166","108":"Diary_0166","109":"Diary_0166","110":"Diary_0166","111":"Diary_0166","112":"Diary_0166","113":"Diary_0166","114":"Diary_0166","115":"Diary_0166","116":"Diary_0166","117":"Diary_0166","118":"Diary_0166","119":"Diary_0166","120":"Diary_0166","121":"Diary_0166","122":"Diary_0166","123":"Diary_0166","124":"Diary_0166","125":"Diary_0166","126":"Diary_0166","127":"Diary_0166","128":"Diary_0166","129":"Diary_0166","130":"Diary_0166","131":"Diary_0166"},"Date":{"0":"unknown","1":1401.0,"2":1428.0,"3":1429.0,"4":1435.0,"5":1436.0,"6":1437.0,"7":1438.0,"8":1439.0,"9":1454.0,"10":1457.0,"11":1466.0,"12":1472.0,"13":1473.0,"14":1474.0,"15":1477.0,"16":1481.0,"17":1483.0,"18":1484.0,"19":1488.0,"20":1489.0,"21":1490.0,"22":1496.0,"23":1506.0,"24":1509.0,"25":1519.0,"26":1552.0,"27":1553.0,"28":1554.0,"29":1564.0,"30":1566.0,"31":1568.0,"32":1582.0,"33":1612.0,"34":1613.0,"35":1614.0,"36":1615.0,"37":1616.0,"38":1617.0,"39":1618.0,"40":1619.0,"41":1623.0,"42":1624.0,"43":1625.0,"44":1627.0,"45":1628.0,"46":1633.0,"47":1634.0,"48":1637.0,"49":1638.0,"50":1639.0,"51":1640.0,"52":1641.0,"53":1643.0,"54":1644.0,"55":1649.0,"56":1653.0,"57":1654.0,"58":1661.0,"59":1662.0,"60":1663.0,"61":1664.0,"62":1665.0,"63":1669.0,"64":1672.0,"65":1676.0,"66":1677.0,"67":1684.0,"68":1685.0,"69":1686.0,"70":1687.0,"71":1689.0,"72":1694.0,"73":1705.0,"74":1711.0,"75":1712.0,"76":1719.0,"77":1720.0,"78":1721.0,"79":1722.0,"80":1723.0,"81":1724.0,"82":1730.0,"83":1731.0,"84":1733.0,"85":1734.0,"86":1742.0,"87":1743.0,"88":1744.0,"89":1745.0,"90":1746.0,"91":1747.0,"92":1748.0,"93":1751.0,"94":1752.0,"95":1756.0,"96":1760.0,"97":1761.0,"98":1762.0,"99":1763.0,"100":1764.0,"101":1765.0,"102":1766.0,"103":1774.0,"104":1782.0,"105":1783.0,"106":1784.0,"107":1785.0,"108":1788.0,"109":1789.0,"110":1799.0,"111":1806.0,"112":1808.0,"113":1811.0,"114":1816.0,"115":1817.0,"116":1822.0,"117":1833.0,"118":1847.0,"119":1851.0,"120":1852.0,"121":1853.0,"122":1856.0,"123":1861.0,"124":1866.0,"125":1880.0,"126":1881.0,"127":1891.0,"128":1892.0,"129":1899.0,"130":1900.0,"131":1905.0},"Entry":{"0":"\n\n","1":" –\n\nWe have all lost our packs, with our private gear.\n","2":" Outtersteen\n\nWe are now in Outtersteen arrived on the","3":" after a long march. The billeting arrangements were all messed up, by some means\n","4":"\n\nWe left Outtersteen on the","5":" & marched to Berr Barracks where we put in one night, then came on to this camp.\n\nTo morrow night we go again into the line\n","6":" – The bn. moved into a new sector on the","7":"\n","8":" This afternoon the battalion went to Popernighe to the vaudeville which played especially for our bn. We left camp about 1,15 pm. the show starting 2.15 it was not so bad, including a few pictures.\n\nPopernighe is not much of a place the few main streets are full of motor traffic & crowds of soldiers, there are a good many shops & you can get almost anything required there. The estaminets here have queer names, I came across one in Pop. called “Ye Old Blood Tub.”\n","9":" Lindenhoek\n\nTo day I received pen & gloves from England. The pen is to replace one that I lost with pack, which I had unfortunately left leeking in pack. We moved here yesterday. The bn. has been in the line 16 days, in a quiet sector, this time I was left out in detail, a certain percentage now being left out. In the afternoon Levered over to Kemmel, a small village with an interesting chateau, said to be owned by a german.\n","10":" - This afternoon we had our first fall of snow. Church parade was held in an old school room & Kemmel, Gen. Hobbs (Div.) & Gen. Hobkirk (Bde) were present, they gave us the latest war news.\n","11":" Lindenhoek Camp.\n\nThis camp consists of a number of Bow Huts. \n\nThis morning we spent an enjoyable morning on Mt. Kemmel. We were Here for the purpose of doing some signalling but it proved too misty. We had some coffee at a Belgian pheasents place.\n\nThis afternoon a german aeroplane flew over quite low, all the archies in the district opened up, but he got away, shortly after we saw two baloons, which dropped papers, French printed in Germany, they had a very good & interesting article, but otherwise\n\ncontained no news that we did not already know. The other afternoon I went to the top of the Mount from where we got a very interesting view, stretching out to the front.\n","12":" Hallinghen.\n\nBeautiful day, the wind has dropped. We left Linden Loek on the","13":" & all trained at a siding near Neuve Eglise a very uncomfortable journey detraining at Desures about 6pm & put the night in billets in that town. Desures is a fair sized place & should have liked to have seen more of it, but the","14":" Bde. were allotted to the place & we had to go on to Hallinghen a very small village about 16 kilos from Boulogne, it was a very long & tiring route march.\n\nIt snowed all \nlast\n the other night & there were at least a couple of inches of snow everywhere. We have had a few very cold days. To day a thaw has set in & the snow is melting so expect that everything will be very muddy & sloppy.\n\nThere is a great deal of holly out on the hedges, looking very pretty. Yesterday there was more snow about than I have ever seen before. In the morning we went for a walk as far as the village of Hubersent, which is about four kilos away & came back through Le Turne. We had a good game in the snow.\n\nThe fields look like \nfields\n seas of snow.\n","15":" – Everything appears to be frozen today. The trees are covered with snow or ice. We keep a fire going all day, but find great difficulty in obtaining wood, we have to cut down hedges or anything of that sort.\n","16":"\n","17":"\n","18":" went off well, we had our dinner in an estaminent. In the afternoon went for a walk to Neuf Chatel, about five kilos away.\n\nJan 3rd –\n","19":" passed off well. On the 1st &","20":" there were no parades. On the","21":" we had a great spread excelling that of Xmas. I went to Bologne by Motor bus on Tuesday, bought a few things & went to the pictures. It is still very cold, though milder today. The snow has turned into ice, & consequently the roads are very slippery & when marching we often have a fall.\n","22":" Hallinghen\n\nHave had my teeth fixed up, they broke down a year ago. The bde. dentist is in a village about 8 kilos away. Just as I started for home, it came on to snow, & continued to do so all the way home. I went across country which was covered with the snow & quite enjoyed the walk. We are getting together\n\nin a Keystone band, with instruments made from any old things..\n\nHalinghen 15.1.8\n\nThe other day I got a large parcel from Louie. Have been getting a lot of mail from home.\n\nWe are getting variable weather, three days ago the snow thawed all away & remained so a couple of days, then yesterday when we got up we found every thing covered\n\nwith it again. Then again this morning we found the snow all gone & it was raining, so we did not have to go on parade.\n","23":" 18.- Brigade sports, fine programme of events, the bn. pulled off a good share. Our Keystone band competed against that of the 53rd, we expected others, it was declared a draw. A. Coy gave a consert in the evening & we played again.\n","24":" – Yesterday I went to Boulogne again, had a very interesting time. We visited old Boulogne & looked through the cathedral, it is very fine, the interior is in two parts & has a very fine dome. Round old Boulogne is the old retaining wall, which is about fifty feet high & thirty broad.\n\nThis morning Gen. Birdwood gave out some medals.\n","25":" 21s 18 In the forward Area. This afternoon we moved up to this position. H.Q. &’ sig office are in Prince Ruperts Dugout. We relieved the 54th who have gone back to our old position.\n","26":" Prince Ruperts 10pm. There is going to be a hop over tonight at 11.45 & are waiting for it. I believe that it will be all along the line, though our bn, are only sending a small party over, about 20 to raid a farm. Heard from Tom who has had a Paris leave. Rec. a parcel from home a couple of days ago.\n","27":" Prince Ruperts.\n\nThe raid on Sunday night came off all right. Owing to the dark, things got mixed up, the farm intended to be raided, was not, one prisoner was taken & a small machine gun, our side has one missing – two slightly wounded.\n\nLast night was a queer one. At night we put up a two minute bombardment, it was sharp & furious, then later a raiding party or something went over & there was another heavy bombardment, this time it lasted for about an hour. Fritz did not reply very much but after everything had settled down again, he suddenly opened up a furious bombardment against the","28":" Div. lasting about a ¼ hour, to which we hardly replied.\n\nWytchaete","29":"\n\nA couple of nights ago there was a raid on our right at the same time we had a dummy one. This was managed by dummies made out of wood painted up & from the front looked very real. They are so arranged that by pulling a wire they would rise from the ground, & move their arms. These were put out in No Man’s Land 200 yds or so. Things went well at first drawing a lot of machine gun fire, it was intended to drop them\n\nat intervals when the firing got heavy, but something went wrong & some of them would not drop, result was that the firing increased & drew larger stuff. This was not the desired effect, & as they would not drop we turned our own machine guns on to them, we were afraid that the enemy would discover the hoax. We had some casualties over it & one officer badly wounded.\n\nFritz is throwing a lot of gas over, two of our H Q runners got some of it the other day. Effect was a very dry feeling at the throat & smarting of the nostrils, making them want to pull their nose off, they did not think that they had it bad, but were given two days rest, free of duty. However they both got worse on the second day, one went to hospital, the other whose leave was due, left for England.\n\nWytchaete","30":"\n\nLeft this morning for leave to England, second leave. Was taken from Kemmel to Bailliue by motor lorry. had a very rough trip to Calais. Shall arrive in England tomorrow afternoon. \n\nLanded on","31":" Left Calais about 4 pm arriving in Dover about an hour & half later.\n\nWe did not finish with Horseferry road untill about 9 pm.\n","32":"\n\nHad a very fine time in England, very good weather. Put the first two days in London, then left by the Midland for Bradford where I put in five very quiet days, did not go about very much. I then spent two days in Manchester, do not think a great deal of the place, saw the Art Gallery & went to Lohengrin (opera) in the night, the second day I went out to Droylesden, to see the Thomassons, they wanted me to stay longer but did not & came on to London where I put in the rest of my time. I went over St Pauls, House of Lords, Westminster Abbey & the Tower of London they are all very interesting.\n\nLowencourt\n\nI was held up for a couple \n\nof days in Calais, after a terrible journey in a crowded cattle truck, rejoined the bn. in this village.\n\n","33":" Pont Noyelles\n\nThe following has been crossed out:\n\nThis morning we moved out to this village, HQ only are in village the coys, out in the trenches, which are every where outside.\n","34":" Pont Noyelles\n\nTo day have been laying lines all over the country as the coys. are spread about so much.\n\nTo night a few shells have come over, but none have fallen in the villaghe.\n","35":"\n\nWe have been for the last few days camped in a pretty wood outside the village (Pont Noyelles). We are having a very nice time, there is plenty of swimming, as there is water all round us. Yesterday the the Bn. held aquatic sports, & our section pulled off two firsts. This afternoon Tom paid me a visit, had tea together.\n\nWas inoculated this evening.\n\nEnd of the portion which is crossed out.\n\nMar\n","36":" Near Fouilloy.\n\nWe moved into this front relieving a cavalry bde. it was a very dark night when we took over & very muddy. These Tommies appear to be a shiftless lot, there only a couple of posies they seem to have just hung about with their horses.\n\nWe did four days in, then were relieved by the 56th & came back to the road, there we were much better off & made ourselves very comfortable.\n\nWe went in again & were to have been relieved again by the 56th, but the night before, the enemy heavily gassed the village Villers Brettonoux the wind changing blew on to the \n\n54th who were in supports to the 52nd, both had about 200 gassed & consequently the 54th were too weak to relieve so the 56th relieved the 53rd & we had to stay in the line again, for another four days. This time we were relieved by a Tommy rifle Brigade. We were back to Aubigny for the night & next day moved into a new \npo\n support position a little on the left. While there fritz hopped over & took Villers Brettonaux, the Tommies putting up a very poor fight, most of them being taken prisoners, others ran back leaving the 54th flank in the air, making them swing round.\n\nThe following day the 15th & 13th bdes A.I.F. counter attacked & retook the village. They attacked with the bayonet, encircling the village, with our artillery aid, it was a great success, capturing about 1200 prisoners including a whole coy. of machine gunners. There was a great deal of shell fire those two days, we were moved forward & took up almost the same position as we first held. I had a fairly rough time one night, I helped to lay a line to the forward coy. & coming back with the O.G. sigs Mr. Nickolls called in at supports, while there we got a fast & furious bomber with whizbangs, lasting about a ¼ hour, was very pleased when it was over, we soon started off\n\nagain & had only got about 200 yds when 5.9’s started falling round us, I immediately dropped into a shell hole, the OC following, none too soon, one shell fell about three yds from us, this did not last long & we arrived back safely. We were relieved by the 56th a couple of nights ago & just now are in the road again, but a little higher up.\n\nThis afternoon I went into Fouilloy & took a look at some of the houses. They are in a dreadful state. The civilians evacuated in such a hurry that they could not take away their belongings, now they are going to ruin.\n\nAll the rooms \nare\n have been turned upside down, clothes & furniture, thrown every where.\n\nI saw several pianos & a pianola. I got a few books to read. Do not know when we are going to be relieved, but the boys are getting very tired of the line.\n","37":"\n\nThe night before last part of the 4th Div. & the French hopped over, but the attack failed I am told we put up a very poor bombard, & the bosche put up a good one. \n\nI am sending a couple of books over to England one on Botany & the other on Zoology. They are in French. I got them in Corbie.\n","38":" In the line\n\nLast night we changed over with the 56th, had a quiet relief. Yesterday afternoon the enemy shelled the hill heavily, kept\n\nit going for a couple of hours.\n","39":"\n\nWe are having a very quiet time, so far, the lines are holding well, we found them in a very bad condition, but very soon had them right. Last night we had to go out in the rain to repair a break on a road, broken by a limber.\n","40":"\n\nYesterday morning a prisoner was captured by the unit on our right, who informed us, definitely that the bosche were going to attack last night at 11 pm, so naturally, we expected something to happen, further ammunition was brought up to the artillery & to the line, at 11 everyone was standing too, at the same time our artillery put over a heavy barrage, nothing happened, another barrage was put over at 4 AM, but apart from this the night was quiet. To night the 56th will relieve us.\n\n","41":" Three more days on the road, & fairly quiet untill this afternoon, an intercepted message told us of a straff at 7pm & 3Am, which came off to time, however we were prepared,.\n","42":"","43":" Div again went over this morning, with a very heavy bombard.\n","44":"\n\nSent back to detail camp today for a rest, the bn. goes into line tonight. Very hot, had a swim in canal. We get a lot of bombing here, searching for guns & Owens.\n","45":" Detail Camp.\n\nWe are just behind Daurs. To day & yesterday were both hot, this afternoon I enjoyed a swim in the canal, there were a good number there.\n\nLately I have been helping myself to a Frenchman’s library in Fouilloy, which joins to Corbie. This man Buillet by name had some very fine books beautifully bound, have already sent four on different subjects over to England, they are on Botany, Zoology, Geology, & Astronomy. Have now two novels which I intend sending to Sydney.\n\nHave been doing a great deal of French reading lately & am getting on well. It is a great pity to see some of these places, especially the home, where I got these books from, this man must have been a student of natural history, I saw there a fine collection of butterflies, & also a photographer, the attic being fitted out as a dark room. As this village comes under a great deal of shelling, there is a big chance of the house being knocked down & everything ruined.\n\nHave no compunction about taking his books, as he has left them there to be destroyed one way or another.\n","46":" Near Daurs.\n\nWe are getting some very hot weather real Australian, a lot of the boys have been going over to the canal for a swim, have been there twice.\n\nBeing moonlight at night we get a good many bombs round about us, but so far they don’t appear to have done much damage.\n","47":"\n\nSudden change in the weather today, very cold wind\n\n24.\/5.18\n\nVery cold today & raining\n","48":"\n\nBeautiful day today. Am having a very quiet time, am still in details.\n","49":" 27th.18 Detail Camp.\n\nBeautiful day again. Last night we had enemy aeroplanes over Dropping bombs very near, expect him over again tonight. This afternoon I went for a walk over to a neighbouring village, on the way back watched for a while, some of the","50":" Div. having sports on the river (Somme).\n","51":" Details\n\nYesterday I received some Australian mail, two from Louie, four from home one from Kallard & an English one.\n\nLast night the bn. went into the line, relieving the 5 on the left of old posie.\n","52":" Detail Camp\n\nThis afternoon a friend & I walked over to Fouilloy, to get some more reading matter, found that the village had been shelled more heavily than ever, & was shelling it while we \nthere\n were there.\n\nWe went & came back along the river (Somme) \n","53":" Port Noyelles\n\nThis morning we moved back to this village. H.Q. only are in village, the coys. are scattered about the hills\n","54":" Port Noyelles\n\nHave been laying lines all over the country, as the coys area spread about so much. Tonight a few shells came over but none so far fell in the village.\n","55":"\n\nFor the last few days we have been camped in a pretty wood just outside the village (Port Noyelles)\n\nWe are having a very nice time, plenty of swimming as there is water all round us. Yesterday the bn. held aquatic sports, the section pulled off a couple of firsts. This afternoon Tom paid me a visit stayed for tea. This evening was inoculated.\n","56":"\n\nA couple of days ago the Bde. held their sports, which went off first rate.\n\nWe are still in the woods, & having beautiful weather, though now and again a few showers.\n","57":" 16th.18 Sunday\n\nThis morning we moved from the wood to this position about seven kilos away. We are now a little on the left of Corbie in a reserve position, on terraces again\n","58":"\n\nWe are having an ideal time here, Practically nothing to do.\n\nThis morning had a little rain.\n\nReceived a few letters from Australia today.\n","59":"\n\nBeautiful Day.\n\nWe have a very comfortable little dugout for two, a good supply of reading matter, found several books in a village yesterday. This morning my friend (Ted Neild) made a book shelf & it is surprising the books that are on it. There are a couple of Dictionaires. French-Espagnol conversations. Histore de Don Quichotte, two french grammars, Lettres de Mde de Sevigne several notebooks, an encyclopedigne, a volume of short stories by Feuillet, a volume of French\n\nplays (Moliere), Lenne des Livres, (book keeping) several small books on communication in the field & one on telephones, quite an assortment. Also there is a beautiful bunch of wild flowers which we gathered along the railway line yesterday\n","60":"\n\nToday I sent off to Louie a nice eddition of Moliere’s Plays, some time ago I sent two other “Rapa Mama Babe” & “The Leeland Fisherman”.\n\nWe are still on the hill, have had a couple of windy says with some rain, but today has been fine, read nearly all the day.\n","61":"\n\nHave been doing a great deal of reading today, just now ave read Julia de Trecoeur (Feuillet) a very nicely written little book.\n\nWe go forward tomorrow night.\n\nThis evening I received two letters from Louis & one from Annie, wrote several this afternoon.\n\nJuly 11th 18.","62":" Army Signal School Le Quesnoy\n","63":" In front of Hoilly\n\nWe are now in a large dugout in a small\n\nravine. There are two bns. 55th & 56th in the one dugout, our bn, just now is in the front line\n","64":"\n\nLast night the bosche raided both the 53rd & \n54\n","65":" Div with no success, was told that the 53rd dot three prisoners.\n\nThis is a large dugout, at first, through having the passages blocked up with blankets, there was an awfull stench of foul air, but now the blankets have been taken down, which has improved things considerably.\n\nYesterday I got a large parcel from home, all in good condition.\n\nJuly2.18This afternoon spent about four hours fixing up the lines, remaking knots, bringing line into sap & taking out bad pieces. \n\nIt has been a very hot day. Went up as far as the relay. The relay is there on account of the lines being so long. The relay itself being about one mile away.\n","66":" 12.15 am\n\nThere is going to be a big hop over in the morning, sometime in the early hours. Three or four of our divisions & some Tanks are taking part. We are in a very narrow salient, & the object of the \n\npush, is to widen it.\n\nWe are in extreme end of salient & consequently are just going to raid, but those on each side are out for keeps.\n\nWe have our lines in good order, but expect a lot of trouble.\n","67":"","68":" Army Signal School Le Quesnoy.\n\nThe attack came off about 3.30 Am, & all round was a great success. Of the 55th two coys. only went over, they had a good many casualities, it seems, that our own trench mortors caught them, owing to some fault in the bed plate. We had a fair amount of trouble \nof\n with the lines, & the sig. office at the relay was blown out, a shell landed on the door way, luckilly no one was hurt, one runner was taken away, shell shock, they all had a great shaking up. I was not there at the time being back at H.Q. however I went up at 6 Am & found them all in a pityable state, they had taken up a position in the sap, teeing the phone in the line.\n\nWhe\n The sgt. was in a bad state through the shaking he had got & puting in so much work on the lines. He went back to HQ & I remained at the relay\n\n& had the task of squaring things up, we remained in the sap for a couple of hours, shifting along as he shelled, then went over to \nnew\n old position, & reached the sig. office in another dugout close by the old one.\n\nIt was not a great while before we had most of the lines good again.\n\n We changed over with the 56th that night. I & another remained up at the relay untill the changeover was completed. We left about 12.15Am, & hurried back to HQ.\n\nThe next evening was told\n We had about 60 casualities including a good few killed including one officer Mr Stafford, who was killed while doing some good work in the german lines.\n\nThe next evening was told that I had to leave at once for the school, so left shortly after, & soon obtained cart which took me right into Tehoussoi where the real HQ was.\n","69":"\n While there I recommended the Sgt. for decoration for the work he did. Then rode over to the Div. pay-office at to draw money for the school I drew 150f.\n\nArriving back I turned\n\nin at once. In the morning I started off immediately after breakfast, waited until a motor lorry came along which took me within a couple of miles of Ailly Sur-Somme where I had to entrain. The train left at 4.30pm. & reached Longpre’ about an hour after, where I got out, from there I walked to Airaines about 7.5 kilos, there being no lorries, from Airaines to Le Quesnoy I got a lift. Am not having such a good time here, foot very poor & have bery little time to ourselves.\n\nYesterday afternoon being a half day holiday we went over to Airaines, not much of a place, no excitement. While there had my photo taken. There is a lamp parade tonight.\n","70":" Le Quesnoy \n\nHave been here one week now, & a very dull week it has been, have had to sit our a number of very sleepy lectures.\n\nWent to the cinema last Friday night, this belongs to the school, about the only diversion there is.\n","71":" Le Quesnoy.\n\nToday has been very hot, & just now we are having a very heavy thunder storm. This afternoon\n\nI went into Airaines to get some photos which were taken last Wednesday, they are very poor photos.\n\nThere is a very dull village the houses are principally built of mud mixed with straw, there are two brick walls on each end & the rest are mud & straw on a wooden frame. They have a town crier here, or rather a village crier. An old chap goes round beating a kettle drum. When he is about to say anything he gives an extra flourish. The other day he announced that there was plenty of pork in the butcher shop for tomorrow, generally he announces the war news\n","72":" Le Quesnoy \n\nHave been here two weeks now. We are getting terrible weather, fine for a couple of hours then it will get very hot, then rain, cold, hot & so on very changeable, have had a cold ever since I came here. Yesterday I received 2 letters from Louie & four from home. \n\nLe Quesnoy","73":"\n\nStill at the school. Yesterday afternoon I went into Airaines again.\n\nAm having a very quiet\n\ntime, we are kept going plenty of parades.\n","74":" Le Quesnay.\n\nYesterday we were on loop set wireless, had a very interesting morning. Today we were on the Power Buzzer & Amplifier, which is quite as interesting.\n\nThis afternoon I was trying to take the wireless from the Eiffel Tower Paris, which was sending out war news. But as it was in international code, could not get it all. The Eiffel Tower sends out war news every afternoon to the world.\n","75":" Le Quesnay.\n\nToday we have been on a scheme, had breakfast half an hour earlier & \nreceived\n finished up at 4.15. I had a very easy day, & did very little.\n\nThe war news now is exceptionally food, especially as it comes so soon after the Chatteau Theirry German defeat.\n","76":" Le Quesnoy\n\nAm doing the first guard that I have ever done, though this is a very poor sort of one.\n\nWe have the school on the","77":" I believe.\n\n Longpre’ ","78":"\n\nHave left the school arrived here about 4pm.We are billeted in an old butcher shop, very much knocked about. Bought a pipe here this afternoon 3 F.\n\nThis evening I put in an hour & quarter at the cinema.\n\nAug. 18th.\n\nLeft Longpre’ 2 pm. am now at the Divisional Wing. We leave for the Tueleus early in the morning. \n\nAug 20th Allonville\n\nLeft the Div. Wing about 7am. Marched about 4 kilos then was taken on by light Railway\n\nThis is the Tueleus camp I go on to Details as the bn. is in reserves this morning.\n","79":" Details Camp.\n\nLeft the Tueleus midday yesterday, was taken by light railway to Dawrs, from there we marched, it was a long hot march, & to make matters worse, the guide that was sent to meet us, & show us the way, a 56th man, got lost, however we arrived here at 11 pm.\n\nAs the The bn. just now is forward, tonight they come back where I shall join them.\n\nToday is again exceedingly hot. Got a few letters from home none from Louise.\n\nTuesday Aug 22nd .\n\nAm now in the forward area, arrived here yesterday evening, & had rather an exciting time.\n\nI left the details with the ration limbers about 4 pm, at first we made good progress, all being quiet, until we were about one kilo from HQ, there we had a halt, for the road ahead was being shelled. After a while we started off again in small parties, leaving some little distance between, the limber got well ahead, & suddenly three or four shells burst just in front of it, the driver turned his horses about & galloped back, in the meantime we had got over alongside a ridge, the limber reached about fifteen yards from where we were, when another 5.9, I think \nfurs\n burst just ahead of it, the blast went forward & cut \nthe\n on of the horses in half, broke the front pole of limber, we had a lively time for about half an hour, but we kept low. Eventually a new pole was fitted in & we arrived without further mishap.\n\nMy friends have a lot to say about the advance, it would have gone much further if the Tommies had not failed on our left.\n\nWe captured an enormous amount of material, & ammunition, on dump, which the French got, is said to have a million shells, close bye is a\nn\n hugh dump of timber & & other stuff, the timber however has been set on fire. There were two german nurses taken in the advance, an armoured train, & also a leave train full of troops going on leave.\n\nThis morning there was a hop over just on our left, do not know the result yet.\n\nYesterday I received word that the £ 15 which Louise sent is in England, shall have it put in my book, received a letter from Louise also.\n\nAug. 23rd. Proyart\n\nThis morning there was a pop over, two divisions taking part, the 5th Bn of the 1st went over where we are. We did not go back as expected, but remained as support battalion.\n\nI think that it was fairly successful, a big haul of prisoners, the 5th gained their objective but had a good few casualities. The prisoners were quite pleased with themselves & did not mind in the least when our fellows went \n\nthrough them for souveniers. Several officers were taken. Do not know what we are going to do, we continue to have casullties from shell fire.\n\nThis morning was watching the field artillery moving up forward.\n\nAug 24th. 18\n\nLast night we were suddenly woke up by a number of bombs which fell all round us, but the only damage done was to break the brigade line, cut a piece clean out of it. We soon repaired it though. They have an awful stench, I put my gas helmet on to get away from it.\n\n This position is now about 5 or 6 kilos from the front line, so we do not get much shell fire.\n\nThe 5th Bn. yesterday morning captured altogether about1500\n0\n prisoners, among them was an adjutant, a sergt.–major, one man who had previously been wounded, & had his hospital ticket on him, he is going to a hospital but not on the side he expected. The prisoners state that the casualities on their side have been heavy.\n\nIn that stunt, 1 15 inch gun was taken, 14 – 77s, & a couple of 4.3. also the village\n\nThe French are doing some hard fighting on our right, & the 4th Div. Australian &\n\nNew Zealanders, who have been transfered to the","80":" Army on our left.\n\nIn the advance the Canadians, I am told took Chauleus but had to retire from it, our brigade was sent over there with the intention of retaking the place, but the Canadians objected to this arrangement, stating that we had done enough, so we were sent over to this place to hold the place.\n\nThe","81":" Div. Australians who took Bray a couple of days ago are now 500 yds in front of the town, prisoners brought in only number 40.\n\nIn the stunt yesterday morning the men were lined up on the tape in no man’s land an hour before the time of starting, so the majority just laid down & slept, so confident were they.\n\nThe dug out we are now in is a long affair like a tunnel, an entrance at each end, connected to the old French trenches. Just now they are making a noise, on a salvage accordion.\n","82":" Near Proyart.\n\nOnce again the enemy has evacuated in front of us owing to pressure. Protrols that went out last night advanced 2000 yd without comming in sight of the bosche I think myself that he\n\nhe has gone back to the other side of the Somme.\n\nWe were to have had a hop over in the morning but owing to events this has been postponed.\n\nThis afternoon I went into Proyart about I kilo ahead, it is terribly knocked about.\n\nReceived word from home.\n","83":"\n\nWe had a parade this morning only a couple of hours though.\n\nHave shifted from the dug out where I was, a friend & I built a nice little place above ground, we got a lot of canvas from a german marque that was left near bye.\n\nFritz is sending over a lot of heavy stuff.\n","84":"\n\nLast night for a few minutes we had an enemy plane overhead. It is a queer experience to hear one drop some bombs not far away, then come on & circle round overhead, but he did not drop any near us, but he let his machine gun go at something very near. \n\nWe have left Proyart & have come on about 12 kilos, & just now we are waiting on the old Somme battle fields, to know what we shall\n","85":" remain somewhere near for the night or go on further. This is a most dreary some God forsaken country, charred trees & ploughed up ground, before the war it must have been a beautiful part of France.\n\nToo dark to write more. We have just heard that Peronne has fallen the","86":" Bde I believe has crossed the Somme.\n\nThis rumour turned out to be incorrect.\n","87":"\n\nThe Beaufort War Hospital Fishponds. Bristol England.\n\nHave been wounded & am now in hospital, this is the third day in England.\n\nThis is a fine large place & am very comfortable, but the foot is not good, nor not enough. Am progressing fine & think that I shall get up this afternoon & have a walk about. \n\nOn the night of the 29th we did not move, we lay down were we were & tried to get a few hours sleep. I myself got down into our old trench with a few others, think that I got about half an hour of sleep. Very early in the morning the cookers arrived, & we had\n\nbreakfast, shortly after we moved again this time to a position about 2000 yards to our left, in some old trenches. It appears that the","88":" & 15th Bdes could not cross the Somme, owing to the March or the far side, a patrol did manage to cross, & the bridge was blown up behind them.\n\nWe remained in these trenches for a day, then a new place was found. At this time the 2nd Div. \nha\n were attacking Peronne & had captured Mont St Quenton so it was decided that the 5th Div. would move over & cross the Somme on the left of Peronne, when the place was taken we would go through it & move back to our right sector again. We moved off about midday, & apparently jerry saw us, for he sent over a good many shells, some landing very close, but fortunately none was hit to my knowledge. We had these shells after us most of the way.\n\n We made slow progress the 53rd were ahead & crossed the river in small parties. We arrived there at last halted for about half an hour on the near side, then moved across. We had no difficulty in crossing the canalised river, but when we were nearing the marsh on the far side,\n\nwould have sold out for very little, there was a spit of land, which branched off into two areas, a bridge to each, one of these bridges was broken & the engineers were repairing it, apparent by the one we crossed by, had previously been broken, judging by the condition.\n\nWe arrived at the far side safely & found posies against a cliff with a hill behind. Here we remained all the night, the shell fire, heavy some bursting only about fifty yds ahead, some behind us, others fell into the water, throwing the water high into the air.\n\nThe engineers were fine they worked through all this & every moment I expected the bridge to be blown up again, however they completed the job, & did it well.\n\nAbout 8 Am the next morning we moved a little more forward to the foot of another rise.\n\nThe shell fire had not ceased & the fighting ahead was hard, we were continually seeing wounded go by, I was beginning to wonder how I was going to live through the day.\n\nWhen we arrived at this new position, some of us got down into a dugout, but I sat down outside thinking it was safe.\n\nAbout fifty yards away was \nthe\n some of the Australian field artillery, & quite close were some more, a howitzer bty. I think.\n\nI shall never forget the picture they made, they must have been working their guns all night, \n&\n the shells were all round them, but they carried on very calmly firing away, was watching these for some time, then I noticed that the bread that I was carrying had got wet & was changing it into my haversack, suddenly I heard an explosion beside me, & immediately a bang behind my left shoulder which knocked me over. I also got a slight bruise on the side of head & left thigh. I was wearing a leather jerkin under my tunic at the time, after I picked some small pieces out, which did not go through. Well I thought to myself I am wounded at last, but knew that it could not be very bad, for I got up & hurried down into the dug out, where I had a field dressing put on.\n\nIt appears that the same shell caught a friend of mine Cpl. Rogers, who was in the AMC, have been told since, that he died from it, am not surprised, for\n\nhe was in a bad way when I saw him at the G.G.S. After I had the field dressing put on I hurried around the aid post, which was near our first position over the Somme.\n\nAs they they were attacking again, by this time the prisoners were comming back in groups, in making my way round to the aid post I kept close to the hill, I heard a large shell pass over my head which made me drop down, this shell landed in the middle of a group of german prisoners about forty in all, it could not have been a better shot, they were only about thirty yards away, it got about fifteen of them I was told later.\n\nWhen I reached the aid post I thought of waiting for a car, but when another shell landed close bye I decided to make my way out on foot, as quick as possible. There was a string of prisoners going out some carrying wounded. I arrived safely at the Field Ambulance,","89":" if I remember correctly, then was taken by motor lorry to another field ambulance. At the first place I had an injection of serum against tetanus, it was in the arm, did not hurt much.\n\nI was then taken to a Casuality clearing stn. outside Daours, there I had my wound dressed again & was put on a stretcher. They marked me severe, but I would class it as slightly severe. \n\nI was then taken by ambulance car to ambulance train & put into a bunk, I was very comfortable in all the trains. At Rouen was taken to the No 10 Gen. Hospital where I underwent an operation this is a fine hospital & enjoyed myself while there.\n\nThere I remained untill the morning of the","90":" I got the wound on the 1st..Was kept at Rouen on account of my temperature \n96\n 98.6 the next day there 101°, when I had been at normal for a couple of days they shifted me over. I saw some awful wounds at Rouen, it is wonderful how some get through. Was put into another ambulance train to Le Harve, where we embarked on the Aberdonian, was very comfortable on board, the trip over to Sout hampton was very smooth, we arrived at South hampton about 8.30Am, waited awhile in the Bay & was then put on to another train for Bristol, arriving here at night. We were taken off train by the \n\nSt. John’s ambulance, which seems to be composed of civilians who for some reason or other, such as over age, are exempt. \n\nThis afternoon I had a look around the grounds they are some fine lawns & it is a large house, previously being used as a lunatic asylum, was told.\n\n","91":" Bristol\n\nAm progressing fine, the wound is discharging a lot which is a good sign.\n\nHave now been five days in this hospital.\n\nDoing a lot of reading. It is generally raining in the mornings & fine in the afternoons.\n\nWas told that there are 1500 patients in this hospital.\n\nBeaufort Hospital 14.9 18\n\nThis afternoon I went into Bristol, Had a look at the streets, had something to eat, went into a picture show & came home again. It does not appear to be a very nice place, saw no large buildings nor any thing of interest, if I can go out tomorrow, intend going to the Clifton Sus-Pension Bridge, which is a little further on.\n\nI shall never get at the bottom of this food business. Feeling hungry I went into a Café & ordered a cup of tea a couple of\n\nscons & a couple of cakes, but I could not have all that as it came to more than five pence, so I just had the scones, after I came out, I saw a restaurant, no meals over 1\/-, as I still felt hungry thought I would go in there, so I went in, & had a poached egg on toast with some bread & butter, the bill came to","92":" .\n\nIt was rather a dull afternoon though there was no rain, & not the least bit cold.\n\nBeaufort War Hospital","93":"\n\nI had a very enjoyable afternoon. Immediately after dinner, I got a pass, having decided to go to see the Clifton suspension Bridge.\n\nAt the tram centre in Fishponds I got a tram to the centre at Bristol. I then walked round to St Augustine’s Bridge & there caught another to the bridge. There is very little to be seen in the town but outside is very fine. It was only a short ride to the bridge, through some interesting old streets then along the Avon. The scenery at the bridge is grand, high rocky walls on each side of the river. The tram took me below the bridge, to get to the top, on a level with bridge I took the Rock railway. This is the most peculiar\n\nrailway that I have seen. I paid a penny & entered a nice little car. When we started the car appeared to rise almost vertically. I discovered that it was only about 200 yds of a ride & that the car was pulled up by stout wire cable.\n\nOn going out found that I was near one end of bridge, I did not go on it, there was a small toll. \n\nWhile there I discovered that the Zoo was only about ten minutes walk so decided to go to it. It was a very pleasant walk along the top, with a grand view.\n\nThe Zoo I found to be first class, plenty to see & very compact. Had some refreshments in the Zoo. \n\nI came back the same way, down the rock railway. Had tea in the city & arrived back before dark.\n","94":" – 18. Beaufort Hospital\n\nThis afternoon I visited the museum & Art Gallery they are very fine, especially the Museum, which has a great number of very interesting things. I spent some time there, & could easily put in another afternoon. The \nto\n tea room is very nice I enjoyed the cup of tea & cakes which I had. After I went to the\n\nYMCA Dugout as they call it & had tea there.\n\nIt was a very enjoyable afternoon.\n\nThe afternoon was fine though windy, to night it is raining.\n\nRed Cross Hospital Oaklands Clevedon \n\nSomerset","95":"\n\nWas transferred to this hospital yesterday afternoon.\n\nClevedon is a very pretty residential place, from my bedroom window I can look out over the Bristol Channel & see Cardiff in the distance.\n\nThe food here is much better than what it was at Beaufort, & everything else is very nice. This morning I had walk along the esplanade & through the streets, there are some very fine houses.\n\nThis afternoon I went to the pictures, free to wounded soldiers.\n\n Before leaving Beaufort I watched an x ray photograph being taken, but I could not see much.\n\nReceived some Aussie mail this morning, & yesterday a parcel.\n","96":" Clevedon.\n\nAm having a very nice time. There are a lot of nice walks & have been on the pier, on the hill at the back.\n\nYesterday afternoon I went to the pictures again.\n","97":"\n\nRaining today. Yesterday afternoon I went as far as the old norman Castle, it appears to be ages old, standing on a hill from which there is a fine view all round.\n\nReceived some more mail from home.\n","98":" Clevedon Red Cross Hospital\n\nToday has been very fine This afternoon I went for a walk in the village, & bought a few things, set of chess etc.\n\nThis afternoon I had a new glass put into my watch, which had started going again.\n\nReceived £2. & 5 francs yesterday, which was the 60 francs which I gave to Jack Coyle to mind, before going forward the last time.\n","99":" Clevedon\n\nThis morning as usual after being dressed, which is usually after breakfast, I went out, bought the Times & sat in the sun reading. In the afternoon I went to the pictures, after tea went out for a short while, then came in & played a couple of games of chess with a bed patient.\n","100":" Clevedon\n\nRaining all day. This morning we had to stay indoors on account of the Rain. I had an invitation to tea at Lady Billairês, who is a \n\npatron of this place. Lady Billairs however \nwas\n is out of Clevedon just now.\n\nWe had a very nice time, there were three of us. After tea we played cards untill supper time.\n","101":" Oct","102":" Clevedon.\n\nRaining this morning.\n\n We had to stay in all morning on account of the doctor comming, my left arm had swollen a little & he put it down to the bandage which was first wound round it.\n\nThis afternoon had a walk through the town, posted a few post cards.\n\nPlayed chess in the evening\n","103":" Clevedon.\n\nPlenty of wind and rain.\n\nWent to the pictures this afternoon.\n\nAm getting tired of this place, it is too damp. All the Australians are being shifted on Monday to Dartford, it should not be so windy there.\n\nThe wound is feeling sore lately, the sister has been rubbing it with caustic, this is done so that by keeping the flesh down allowing the skin to grow.\n\nAustralian Hospital Dartford","104":" – 18\n\nArrived here last night. Left Clevedon about 10 am. took train to Bristol, from there, train to London, Paddington. There we took tube to Charring Cross, where we caught train.\n\nAm now in huts, do not like the look of the place.\n\nDartford","105":"\n\nYesterday afternoon I & a friend went into the town had a look round & then went to the pictures. Do not think much of Dartford.\n\nThis afternoon \nwe\n I was one of a party to visit Woolwich Arsenal. We did not see a great deal of it as the time was short, but we saw shells in the making & guns of all sizes, it was very interesting. We had a very nice tea at the canteen in the grounds, provided free. Comming out of the Arsenel, we had a look round the city, which is a much nicer place than Dartford then pictures again. Before going in to the Arsenel we had to give up all cigarettes & matches, as a precautionary measure.\n\nThere was great excitement over the taking of Ostend & Bruges\n","106":" ","107":"\n 20 Dartford\n\nYesterday was a lovely day. After tea went into Dartford, after a while went into the pictures, but discovered that it was the same lot that I had seen before there.\n\nNo 3 Auxillery Hosp. Dartford\n","108":"\n\nLovely day, not cold. Yesterday afternoon I went to London, to the performance at Her Majesty’s, for Australians.\n\nWe saw the Revue, ‘Choo Chin Chow’ & it was very fine.\n\nIn the interval after the second act, Sir Peter McBride, Agent Gen. to Victoria spoke a few words, said that Australians had done \nevery thing that\n as good as he could wish them to have done, & asked us to give three cheers for Mr Oscar Asche who gave the performance. We had a cup of tea passed round & on leaving were all given a packet of cigarettes with Mr Asche’s compliments. This afternoon am going to see The Bing Boys of Broadway.\n","109":" 26- 18\n\nThe Bing Boys turned out to be a picture show instead, so I did not go in, had a bus ride out somewhere & back in the tube\n\nIt is a beautiful day.\n\n","110":" Dartford.\n\nWound not healed yet but very nearly.\n\nOn account of the influenza the afternoon leaves to London has been stopped.\n\nAm tired of this place, so very dreary.\n\nDartford","111":"\n\nToday as been very cold but fine.\n\nThe wound is nearly healed, but will then have to undergo massaging. The war is practically over, or will be in a few days.\n","112":"\n\nDartford\n\nTo day is the last day of the war, the armistice was signed at 5 AM, & hostilities ceased at 11 AM this morning. This morning I was marked out to Little Moor for massage treatment.\n\nThe terms of the Armistice are- Evacuation of Belgium, Alsace & Luxembourg in 14 days Alsace railways to be handed over.\n\nGerman troops not evacuated in 14 days to be treated as prisoners of war.\n\nOccupation by allied troops to keep pace with evacuation.\n\nImmediate repatriation of Allied prisoners\n\nGerman troops in Russia to be withdrawn\n\nComplete abandonment of Bukarest & Brest treaties\n\nSurrender by Germany of 5000 guns, 30 000 machine guns & 2000 aeroplanes \n\nHanding over of all submarines \n\nEvacuation of German armies on left bank of the Rhine Bridge heads of Mayence Coblentz & Cologne with Bridge to be held by Allies\n\nSix battle cruisers, 10 Battleships, 8 light cruisers & 50 distroyers to be disarmed\n\nRight to occupy Heligoland reserved\n\nDuration of Armistice to be 36 days\n\nUpkeep of troops of occupation of Rhinelands to be charged to the German government\n\nReturn of prisoners in Holland to continue. \n\nReturn of German prisoners to be decided by peace preliminaries\n\nLittle Moor Weymouth\n","113":"\n\nArrived here last night, had a wretched journey in train. very cold\n\n","114":" Little moor\n\nAm having a very quiet time.\n\nVery cold. Have been into Weymouth a couple of times, it is a very pretty place.\n","115":"\n \n","116":" Little moor\n\nVery fine day, though it rained yesterday. I met Dick Thomasson this morning, he got a bullet through his lung, he is doing well.\n\n Little moor ","117":" – 18\n\nYesterday afternoon I went into Weymouth again. Bought a new pipe 5\/6, had a very nice tea then saw a vaudeville show, had a very pleasant time.\n\nReceived several letters from home yesterday & a couple from Louie. We are getting plenty of rain though it is very mild for this time of the year.\n\nLittle moor Dec. 9- 18\n\nHaving very miserable weather now, shall be glad to get out of it. So far two lots for two different boats have left & another is now ready to go, hope to be on the next, went into Weymouth again, last Saturday night\n\n Little moor. Dec 12- 12 18\n\nwas told yesterday that the £15 was in the pay office here, but will not be able to draw it untill I get my pay book back from London.\n\n Little moor Dec","118":"\n\nAm now on a Boat Roll, the Takada to sail on the","119":"\n","120":" last I drew my remittance of £15 & in the evening went to Weymouth & bought a ring for Louie & registered it home straight away. The ring cost £14. 10- a diamond cluster. I also sent the french book on Zoology.\n\nLittle moor Dec 20.th-\n\nThis morning was innoculated against Influenza as all are being done who are \n\nleaving for Australia\n","121":"\n\nOn board SS Takada. Yesterday afternoon I \ngot\n embarked at Devonport on the SS Takada, we left port for Australia at 10 AM this morning.\n\nSS Takada","122":"\n\nFourth day out.\n\nSea is beautifully calm we are now nearing Gibralter, will pass it either tonight or in the morning.\n\nThe first day there was a heavy swell on & as the ship practically empty, she rolled a great deal. We had Xmas dinner on board, but most of us gave it up to the fishes, since then have been OK, eating plenty.\n","123":" SS Takada.\n\nYesterday being New Year’s Day we had sports on board, & there was a very fine turn out of fancy dress costumes.\n","124":" SS Takada.\n\nIn the Red Sea\n\nWe are making great progress. Early Sunday morning we arrived at Port Said, there we took in Water & provisions, & left about 6pm the same day.\n\nIt took us about fourteen hours to pass through the Canal which is ninty miles long.\n\nWe lay in Port Suez for a couple of hours Nearly all the way along the canal are military camps & stores.\n\nAt both Port Said & Suez we had crowds of natives ‘round us in their boats selling all sorts of stuffs. At first they would ask about three times the real value, then with a lot of parleying would gradually come down. I noticed one selling silk scarves, at first he asked 10 \/-, some one said 6 \/-, ‘No no no’ 6 \/- said again the would be buyer, “Give it 8’ said the Gypo, after a few minutes more it came down to 5\/-, ‘all right’ said the merchant, ‘Put the money’. The money had always to go down first, so he slung up a cord, on the end of which was a basket, so up went the basket, then down with the money in it, & up again with the goods. This bargaining caused a great deal of amusement.\n\nAt Port Suez they came over in their Dhows these boats are rigged \n\nwith one triangular sail, there is one mast to the top of which is attached a long cross beam which holds the sail. When the sail is furled this cross beam is brought vertically with the mast & the top end came easilly up to the promenade deck. Some of the boys, fastened this beam to the ship, by means of a rope. When the dhow tried to move off they found that they could not, so then there was a hubbub, \nthe bo\n asked to have it undone, but the boys demanded bucksheesh first, it was sore against the Gypo’s grain, but they sent up oranges & cigarettes, but the boys could not give up so good a joke so soon, a native police boat came on the scene, but that made no difference. However they were finally let go, but not untill some one had turned a hose on to them, which I think carried the joke too far, as it did damage to their goods. We are now going down the Red Sea. While at Port Said we saw the masts & funnels of ships that had been sunk, sticking up out of the water.\n","125":" SS Takada\n","126":" mid day we arrived at Colomba, one does not see it untill quite close, low lying country.\n\nThere was no permission granted to go ashore, \nbut\n on account of the recent influenza epidemic, but never the less more than half the boat did go on shore.\n\nOn Sunday afternoon a friend invited me to go with him. We were loading coal, & the troops were going over on the empty coal barges.\n\nOn landing we found our selves near the native quarters, from there we walked to the European part of the town, It was sweltering hot.\n\nThere are a good many very fine buildings in Colomba, especially the Governor’s house, we sat down \non\n under a tree outside that building to cool down, & up came a native guide, who explained that he would take us round to show us the sights for a very reasonable sum, so we engaged him.\n\nWe very soon got a native cart drawn by a sort of a bull,\n\nit was slow, but much better than walking. We first went \nAt\n to Victoria Park, there we saw all sorts of tropical trees, Para Rubber tree, Banyan & an Australian Gum.\n\nFrom the park we went to the museum, there was nothing of very great interest there, they had a queer sort of an insect or animal which, resembled a small leaf. We then went to a Buddist temple saw Budda in a sitting & sleeping position.\n\nIt was getting late so we decided to find a hotel for a meal, but we went to one after the other, & were turned down, because we were Australians, the Australians who had been in the town previously had made a name for themselves, &\n\nWe arrived safely back on board about 9 pm, for we had a long walk for a barge.\n\nWe left Colomba 2 pm yesterday (Monday).\n\nThere are a good many flying fish about this morning, generally they skim along only a few inches above water, but I saw a couple of large ones, which rose\n\nup eight or nine feet, but did not go far.\n","127":" SS Takada.\n\nEarly this morning we arrived at Freemantle during the morning we anchored outside untill the medical officer gave the ship a thorough overhauling, but the boat was given a free bill.\n\nWe pulled in at midday & went ashore, where we were given a fine reception, & plenty to eat, it was very good of them.\n\nFruit here is surprisingly cheap here after England, Grapes there are","128":" lb. & only 4d in Freemantle.\n","129":"\n\nWe arrived at Adelaide Thursday, & got ashore about 6 pm. We had a great welcome, & had a royal time the two days we were there.\n","130":" we went ashore early & had breakfast at the Cheer Up Hut, which provided meals free to all visiting soldiers & very fine meals.\n\nDuring the morning we visited the Art Gallery Museum & Gardens.\n\nHad lunch at the Cheer Up then went & saw more of the city, then back again to the Cheer Up for tea.\n\nThis Cheer Up Society is very good, provided us with meals, drinks & as much fruit as we wanted. \n\nOn Saturday we were taken by the Red Cross for a picnic on the mountains, by train. During the morning it rained a little but cleared off later on in the day.\n\nWe had a grand time, had everything we wanted, ate fruit all day & drank soft drinks. We had two very fine meals, we left the mountains 6.20.\n\nThe Ship sailed at 5 AM & expect to arrive in Melbourne in a couple of days.\n","131":" Sydney\n\nArrived here yesterday 7 pm & ankored off Rose Bay. Everything looks beautiful.\n\nJust now we are doing the remainder of the four days \nleave\n quarantine, four days from\n\nMelbourne, owing to the influenza epidemic there.\n\n"}}