{"Document Name":{"0":"Diary_0497","1":"Diary_0497","2":"Diary_0497","3":"Diary_0497","4":"Diary_0497","5":"Diary_0497","6":"Diary_0497","7":"Diary_0497","8":"Diary_0497","9":"Diary_0497","10":"Diary_0497","11":"Diary_0497","12":"Diary_0497","13":"Diary_0497","14":"Diary_0497","15":"Diary_0497","16":"Diary_0497","17":"Diary_0497","18":"Diary_0497","19":"Diary_0497","20":"Diary_0497","21":"Diary_0497","22":"Diary_0497","23":"Diary_0497","24":"Diary_0497","25":"Diary_0497","26":"Diary_0497","27":"Diary_0497","28":"Diary_0497","29":"Diary_0497","30":"Diary_0497","31":"Diary_0497","32":"Diary_0497","33":"Diary_0497","34":"Diary_0497","35":"Diary_0497","36":"Diary_0497","37":"Diary_0497","38":"Diary_0497","39":"Diary_0497","40":"Diary_0497","41":"Diary_0497","42":"Diary_0497","43":"Diary_0497","44":"Diary_0497","45":"Diary_0497"},"Date":{"0":"unknown","1":1642.0,"2":1643.0,"3":1644.0,"4":1645.0,"5":1646.0,"6":1647.0,"7":1648.0,"8":1649.0,"9":1650.0,"10":1651.0,"11":1652.0,"12":1653.0,"13":1654.0,"14":1655.0,"15":1656.0,"16":1657.0,"17":1658.0,"18":1659.0,"19":1660.0,"20":1661.0,"21":1662.0,"22":1663.0,"23":1664.0,"24":1665.0,"25":1666.0,"26":1667.0,"27":1668.0,"28":1669.0,"29":1670.0,"30":1671.0,"31":1672.0,"32":1674.0,"33":1675.0,"34":1676.0,"35":1677.0,"36":1678.0,"37":1680.0,"38":1681.0,"39":1682.0,"40":1683.0,"41":1684.0,"42":1685.0,"43":1686.0,"44":1687.0,"45":1688.0},"Entry":{"0":"\n\n \n\n","1":"\n\nFranvillers\n\nAnother beautifully fine day with warm sun. met all the company commanders and gave them full details for our reconnaissance and we then set off on horseback. Rode through Heilly and Mericourt. It was very pretty and shady down in the Valley of the Ancre where the green leaves of the many trees gave splendid shade. The village of Heilly is not badly knocked about but that of Mericourt is different indeed. There nearly every house is bashed about and notices are up telling people to keep out as the whole place is full of gas. The Boche did not shell at all as we rode up to a deep chalk pit where a number of dugouts were located. Here I saw Colonel Pat Currie and got full details for our take over tonight. They have been having a fairly quiet time and general rumour is\n\n \n\nthat they are being taken out for the purpose of doing a stunt although they know nothing themselves. This rumour has originated entirely among the Billjims and it remains to be seen if, as usual, their information is correct. Whil with Currie, Peter Borwick GSO II called in and congratulated me on being mentioned in Despatches – the first that I heard of it!. Rode back to Franvillers having a little trouble at times with our horses in passing heavy batteries that were in action. Here you could see a core of fire, the shell as it left the breech. Returned and lunched afterwards fixing up the orders connected with the move tonight. While doing this I heard the notes of Cummings bugle sounding \"Last Post\" and a rattle of blank as Bandsman Riddell\n\n \n\nwas buried. He passed me on a stretcher last night delirious and raving after being hit by a big shell that landed in the village. J. Kohn left today for England to join the 6th T.B. and naturally full of commissions to execute for the other officers. The news from the Soissons front is serious in the extreme and things look most serious. The Boche shelling on this front has been slight the last few days. Our aeroplanes flying all the time – his are seen rarely. Sent up our advance parties to the front line to billet the fellows marching in tonight. The 26th Bn are coming into these trenches and their gear commenced to arrive. There were not a few grave crosses on the limbers – part of our stock in trade. Wrote a few letters and then walked around and had an inspection of the trenches.\n\n \n\n31\/5\/18\n\nFranvillers Frontline\n\nAt 10 pm rode up to the support Bn H.Q. at Marett Wood and there relieved old Pat Currie – the white headed Colonel of the 28th. Had some amusing conversation with him for he is a tremendous wag. Meanwhile our chaps were changing over and they got in alright. About an hour after they had settled down Fritz started to pump in gas shell on ourselves and the 24th. Anderson had to move all his chaps to a place further over to the right. Firing steadily the Boche kept pumping a deluge of gas into Ribemont and into all the lowlying ground along the river. Rang up Bde H.Q. and gave the direction (Morlancourt) for them to switch the field batteries on to the job of neutralising the fire. Unless one of our bright inventors can find a better thing than this yellow X gas we are going to be well \"left\"\n\n \n","2":"\n\nSupport near Mericourt\n\nThe bombardment with gas kept on until about stand to arms. Most of the stuff was going over into Ribemont and into the woods along the Ancre. In accordance with usual custom I was awakened for \"stand to\" at 3 am but nothing unusual transpiring I went to sleep again. Got up at about 9.30 and an hour after went for a tour around the positions. Just before leaving the Quarry he put in a few whiz bangs right into the place without hurting anyone. The Quarry is hewn out of the purest white chalk – that chalk which emerges in the Somme trata only to reappear in the Dover cliffs. A background of vivid green crop shows up the whiteness of this position vividly. In the Quarry are a couple of motor ambulances. Our R.H.P. and are driven deep into the walls of \n\n \n\nthe excavation and our H.Q. details are dug in as usual round about. Round the corner two cookers are dug into the bank and there is cooked the food for the men forward – altogether I have just under 400 here. The day was quiet and hot as Thewlis and myself set off on our rounds. We cut across crops and grass to what was once the Railway station and here we found Sparrow in a concrete pillbox bunker in the building. Talked here for a time and then walked along the railway to where Keith Anderson had his people. The smell of gas was very distinct here with its mustard oil smell. Found Anderson evacuating his headquarters and shifting the men on account of this shelling. Leaving him we cut across to near Treux. The Boche had 3 balloons up looking directly down on us\n\n \n\nTreux – Ville-sur-Ancre\n\nTwo of our planes attacked them & their observers parachuted down. All the was left of a couple of balloons was a spiral of black smoke in the air. Treux has been a pretty little place and owned a nice Chateau set in thickly wooded grounds running down to the heavily timbered river and enclosed by a very neat and trim hedge. We went into this Chateau and found it partially shell wrecked and in a deplorable condition owing to the damage done by looting troops. Valuable knick-knacks and belongings lay strewn all over the place and books clothes and furniture were lying in one huge mess. Walked through the village and found Lanyon at D.G.H.Q. in a fairly good cellar on the outskirts. We walked out into the trenches in front and saw the men mostly asleep in their little bivouacs\n\n \n\nOne chap had his place lined with white lace curtains and furnished with elaborate bedclothes. The walls had photographs on them and just under the first blanket screen from the trench was an inner curtain of black lace material. Milord took his ease here naked except for a pair of women’s drawers. It is a queer war! Just 300\"in fron of us are trenches that were our front line prior to launching the attack of","3":" Ville-sur-Ancre sadly bombarded and with its slate rooves partly demolished lies in the valley close to the river and in temps de paix was no doubt a nice little village. The Caterpillar could be located by the fringe of hedge on top of its banks. The ridge of Morlancourt with Boche posts on it looks down on us here. All the positions are open cultivated\n\n \n\nfields. All turnip patches are covered with the yellow flowers of seeding plants and the countryside presents a remarkable sight. Not unlike Victoria looks when the land in Spring is covered with the yellow flower of the cape weed. We had a look round from the Marett Wood O.P. and talked to a number of the men of the various companies on our way back. Slept most of the afternoon. In the evening the Q.M. & F.O. came up. I revised and rewrote the opening chapters of our History of the Regiment which is being compiled by Pat Gorman. Shelling was brisk late in the evening owing to our batteries firing on their lanes of counter preparation. I turned in at about 11 pm but could not sleep a wink despite strenuous efforts. Some more gas went over towards the","4":" Otherwise the night was devoid of incident\n\n \n","5":"\n\nSupport near Mericourt\n\nRose at about 10 and put in the morning doing odd jobs. It was a fine sunny day and emerging from the dark dugout into the glare of the chalk nearly blinded one. The Hun put a few shells right on us but a ring to the 60 pounders soon got the counter batteries to work and silenced him. Our mess here is a little wood shanty made mostly of doors & shutters brought away from Ribemont. In this little place is a very fine little table that must be worth quite a lot of money. It is splendidly made and all inlaid. Left with Thewlis at 2 pm and first of all inspected B Coy – all the men were lying off in their bivvies or leisurely sunning themselves. It is really more of a rest here than it was back in reserve. Worked round to the","6":" Bde. And located 18th Battn HQ where I saw Major Robertson, the C.O. being off colour. We discussed the\n\n \n\nDefence scheme. From this green ridge covered with yellow flowering plants there was a splendid view of all the positions opposite us. The rooves of Morlancourt could be seen plainly in the next gully. We are confronted with another ridge but in a few days time the 7th Bde. will attack and capture the one in front of us and give us command of the valley. Behind the nearer ridges rises the blue line of La Boiselle and Pozieres. It is rotten to think of once more assaulting these places after so much war. Walked over to the 21st and found things very quiet with them. They have an American attached for experience and he appeared a fine clean cut stamp of youth. From here I cut across to where Keith Anderson is and had a talk with him. The river valley is looking delightfully pretty – a few of the men were bathing\n\n \n\nSome fumes of gas could be smelt still. Returned via Mericourt station. The small civilian cemetery here has not yet been knocked about and there are a good many wooden soldier’s crosses. There was one French grave with the Republican tricolour upon it. An old P.O.W. cage seems strangely out of place here. The enemy was throwing some rather heavy stuff around in the direction of Bn HQ but fortunately scored no hits.. settled down to reading etc upon return. Gorman and Burrage came up after tea and yarned for a while. The evening was very quiet and hardly a hostile shell came over. 150 men went on to the job of digging Joppa Reserve and got down well. The nights now are very short. It is not dark till 10.15 pm. Work had to cease at 2.45 pm on account of the growing light. No casualties\n\n \n\n3\/6\/18\n\nSupport – Treux & Mericourt\n\nThe General called about 10 a.m. and soon after him came a Gas Projector officer from the Special Coy R.E. to arrange details of a gas stunt. Another bright and sunny day. Had been awakened as usual for the stand to arms but nothing developed. After lunch took Thewlis out around the coys. Our 18-pounders shot down a Hun ‘plane early this morning. Went along to King and was talking there when the Hun started throwing round 5.9’s which burst loudly with plenty of white smoke. Some of these came round close enough to be uncomfortable. From here we made for the bank near Marett Wood and talked to Groves and Swanton. The Boche was putting over 5.9 in doubles – the two coming together made a noise like an 11 inch shell\n\n \n\nWe pushed overland across crops and cultivation and went through the fruit trees & hedges that skirted Treux. From here it is only 2000 yards to the enemy front line and his positions were plainly visible. We avoided being seen by skipping among the ruins and eventually came to \"D\" Coy’s cellar. Yarned here for a while to Davis and then returned along the main street to the Chateau. The little village has been a pleasant little place and the houses are still full of furniture and goods just as their owners fled and left them when the English retired. We cut through the grounds down to the river and wandered along under the trees crossing and re-crossing the Ancre by little rustic footbridges. A few shellholes and a faint smell of gas were the only signs of war.\n\n \n\nAfter chipping Keith Anderson we went and saw Sparrow & Co. Cowan was having a hot bath in a tub. They had furnished a small mess in an unruined room and collected furniture from houses around. After we went back to Bn H.Q. the only excitement was our planes going backwards and forwards over the Hun lines and drawing a little wild a.a. fire. Davis came in after mess and cropped my hair off close to the roots. Miles and others came up. We sent out a working party 150 strong digging on the Joppa Reserve line. There was no excitement during the evening and we just yarned and whiled away the time. Turned in at about 11 o’c and slept well and soundly. Thewlis, Stafford and Sutherland divide the night shift among them\n\n \n","7":"\n\nSupport - Mericourt\n\nGeneral Patton rang me up first thing and told me that I had been awarded the D.S.O. A dull cloudy day which seemed to give promise of rain. The day was abnormally quiet only a very few shells going over from either side. Capt Furlong of the 4th Army H.Q. sent me round a Soissons map marked up to date. It shows the extent of the Hun advance – to date 35 miles! Instructions came to hand early that we are to carry all the necessary gas apparatus up tonight for a gas projector attack. Our boundaries for the Brigade are also being extended and when I relieve the 21st I expect to hold 2100 yards of front. On a 2 Coy front this will be about 1 man to 1.8 yards in the actual front line posts. The whole of the afternoon I spent at the mess writing and so until\n\n \n\nabout 10 p.m. Walked overland up to the outskirts of Treux. It was quite dark and the enemy flares had commenced. His fireworks tonight were something special. Strings of ‘flaming onions were creeping skywards in single and in double lines. The beams of our own and of enemy searchlights were fleeting across the sky. The ordinary white flares were shedding enough reflection to show us our path across crops and grassland. Now and then big reddish parachute flares were fired these sailed up to agreat height and hung suspended by their parachutes. The light was very bright and showed up the whole sector just as brightly as electric light. Shining through the leaves of the trees this light produced a peculiar optical illusion. The shade of the rustling leaves had the look\n\n \n\nof running water and one feared falling in! on the road outside Treux is an old derelict tank complete with its 6 pounder gun (less breech) The Germans used to have a post in here before our last attack. 37 of our limbers laden with gas projectors and charges now started to arrive and disposed in the trenches round about we had 200 men to carry them up to the Tommy Engineers to put in. this job took a fairly long time and as we were close up to Ville sur Ancre it really seemed as if the Boche must hear us. However everything worked fairly smoothly. Some of our newer men a bit which meant more trips for the older ones who returned to their bivouacs vowing deep and lasting vengeance. This carrying continued until after midnight\n\n \n","8":"\n\nOur parties had all knocked off at 1 am and Thewlis and I returned to Bn. H.Q. At 2 am a heavy Hun barrage opened and the Tommy Gas sergeant came along to our R.A.P. wounded. The strafe kept on and our was sent up in two places. Our guns opened heavily. The Germans attacked on a front of 520’ with about 250 men and entered our trenches on the 19th Battalion. Our men got to them properly and drove them back rescuing some men of ours they had stunned and taken off a little way. After a good stiff encounter we finished up with 16 unwounded and about a like number of wounded prisoners. About 25 Huns were killed near our lines and doubtless there are more lying ready to be ratted tonight. Our chaps drove him out\n\n \n\nlost no prisoners and only had a few killed and wounded by the bombardment so from the Hun’s standpoint the thing was a disgraceful failure. The wounded soon started to arrive at our R.A.P. and we had a great collection of groaning Huns all round our place. Some were very badly injured and were knocked about in the legs and bodies. They were not very good physical specimens. One of our chaps was shot through the stomach and crying out a lot. He became quieter – possibly died. The front was normal at about 8 am. At 10.15 I left with Thewlis to visit 21st Bn HQ and there met the General who propounded a scheme for a raid on the morning of our attack by the 7th Bde. Discussed the plans and then walked overland and saw K Anderson One of this morning’s shells came\n\n \n\nvery close to knocking his place out. Then to Sparrow and found him asleep and then on to see Harricks. Put him in charge of the raid arrangements & came back to H.Q. for lunch. There was nothing doing in the afternoon or early evening. Relief of 7th Bde passed at 10 p.m. for up forward. Just outside a 5.9 killed 2 and wounded 6 others. One died at our door. Sent out a stretcher party and brought them in. MacMahon, our doctor, was busy dressing them and making them comfortable. Some were badly hit and making noise as much from shock as from anything else. After we had got rid of them there was no further excitement. Everything on the front continued very quiet until near midnight when our guns went on to their nightly work of counterpreparation\n\n \n","9":"\n\nEarly the Germans attempted a raid with 30 men against our post at the 28th Battn. front. Our people got right into them with Lewis Guns and left a few of the Huns lying dead upon the wire. Our loss was 3 slightly wounded and the Hun party was dispersed. On our right parapet lie the dead bodies of some of them – one an officer wearing spurs and who by looks received nearly a whole bomb to himself. The object of the Hun is to find out who is opposite him. On the disastrous results he ought not to have many doubts! Some of our men when they first came to this area were lousy and unable to obtain clean clothes. So they put on the chemises and knickers they found in the women’s rooms of deserted houses. When stripped by the nurses at hospitals after being wounded there was quite\n\n \n\na scandal. The day was a fine sunny one and very quiet on this sector. Drew up all the plans for a raid and submitted the proposal to Bde. H.Q. for approval. Arranged the making of \"nutcrackers\"- loaded waddies designed to crush through a head from skull to lip. After lunch set out on a tour of the position with Stafford. Called on King, Groves and Swanton and then to 21st H.Q. around to Treux and home after around seeing Frenyer & Paterson. Very quiet and peaceful today. A few big shells sailing over lazily going well back. Aircraft active. A few balloons up. Aeroplanes were humming over after dark & our guns opened up heavily on counterpreparation work. Busy reading writing and doing routine work until late in the evening.\n\n \n\n7\/6\/18\n\n100 men were out on working party digging. An old original Sgt E A Smith was killed with a bomb by a dead man in an extraordinary way. They were digging and struck a rather smelly patch. Smit & Braithwaite were standing watching the digger and joking about the way that dead Huns stink. Suddenly the pick struck a bomb in the pocket of the deceased. There was a muffled explosion, a large blue odour and chunks of German. Smith was badly wounded in the head and he died soon afterwards. The digger was hit in the head and made a lot of noise so he could not be too bad – rather blinded by his own blood. Braithwaite was shaken and lightly wounded in the forehead – sufficient to perhaps get him to Blighty. Colonel Forbes called in early & the D.D.M.S. & Simmons\n\nAfter lunch went around to present different medal winners with the ribands of their decorations but found most of them away either up the line or at the nucleus. Not a single shell came anywhere near us right throughout the whole operation of walking round. The men all getting ready to go up forward and packing up their belongings. At 10.30 left our home & walked up to Marett Wood where we conducted a quiet relief of the 21st. It was a dark night inclined to rain and the gun flashes and reports lighting up the dark sky were weird. At 1 a.m. under cover of a barrage we put over a gas projector attack evacuating portion of our own trenches and wearing gas respirators. Although there seemed to be a good clod the Hun took little notice and replied with a very small retaliatory shelling\n\n \n\n8\/6\/18\n\nFiring Line. Ville-sur-Ancre\n\nQuiet and dull in the morning. After lunch I went off with a Map of Artillery, Thewlis and Smith and we walked over grass paddocks and along C.T.s until we struck the front line. We passed several old German posts now well behind our own line and well bombarded. There were many old Hun helmets and pieces of equipment lying about here. Pushed on to the front line and observed our 18 pounders firing. We look well into Morlancourt in different places and have the Boche’s head well down. Out behind one of his posts is an old abandoned 77 gun pretty well knocked to pieces by our fire. Our batteries were trying to complete the wreck and the shooting was corrected by a direct phone line. In places along the front line the trench is shallow and we\n\n \n\nwere continually exposed to view without being sniped at. Our line is very thinly held. At rare intervals along it are a handful of Billjims who tuck themselves into any old crevice or niche. The chalk covers the clothes and makes all white. The 36 grenade is splendid and used much. The Boche posts and his wire were plain to view and he was putting over on to us a few pineapples & minnies. Hereabouts there is a post very close to us – about 60\". Later our 6’ Newtons got on this place and blew the Huns out. They had to run and our chaps fired at them. Lennon & a sergeant then crawled out and found some papers in a pack there Carried on along the trench and saw some of our raiders and examined the terrain. Returned \n\n \n\nvia the Caterpillar which is well churned up. Found by smell the presence of a dead German in a crop and ordered him to be covered with dirt to prevent the flies coming off him on to the men’s food. Several of our web equipments lying round here told a silent tale of battle tragedy. One was riddled nearly to pieces – another covered with blood round the waistbelt told of where its wearer got his fatal wound. On return to Bn H.Q. we walked through Marett Wood which is not strafed now as much as it used to be. Had numerous interviews with various people blowing in & out of the place. In the evening the sky was literally full of our aeroplanes who kept sailing over the enemy lines dropping bombs and returning. His a.a. fire\n\n \n\nwas accurate and some shots went close enough. The things sent down from Lennon’s daring reconnaissance did not give a clue to what unit was there so I rang up Anderson and asked him to try and get a Hun. He decided on a silent raid on the party of 14 under Lennon got into the Boche post and killed and wounded about 6 or 8 of its occupants. One prisoner a boy of 20 belonging to 3 Battn 90 Reg 54 Divn was sent back. Another was taken but got away in No MansLand went towards the 28th trenches and was shot dead. Machine guns opened up and got on to our party as it was returning. Sgt. Tyler was killed and fell near the Boche post. Pte also was killed and left in No Mans Land. Just as he was crossing our parapet a machine gun sent a spray of bullets through Lennon’s\n\n \n\nback and the bullets passed right through him and out of his box respirator. He died soon after. Six of the men were wounded & came along to Bn. H.Q. later with bullets through their limbs and bloodstained clothes. Mostly slight. Meantime the Hun commenced a heavy gas bombardment and flooded our dugout with lethal & tear gas. Our curtains were soon down but men coming in brought it on their clothes. One of our drivers (Green) was killed and his driverless horses were found at dawn. The gas soon had us choking and sneezing but our curtains kept most of it out until splinters pierced them. Our communications all went early in the fray. Little Baker the linesman was badly hit and wounded in both legs – they were broken. Another linesman\n\n \n","10":"\n\nMoniff was badly gassed and wounded in the face. No one got to bed until dawn. I went up the line after lunch & made for the right flank where our Newtons had blown Fritz’s post about very much where our chaps raided last night. Soon they had to evacuate the place. Our chaps and the 28th had their rifles laid and ready on the parapet ready to pot any who ran out. The I.M. shooting was splendid and several landed right on the post. The M.W.s sent over in retaliation landed close enough. Walking along the trenches and intervals we struck a smell and crowds of large flies who evidently had a feast of sorts outside the parapet. Picked up a blood stained Hun cap and took it back to Bn H.Q. No Mans Land is pleasant beflowered ground. On the right where we propose railing are the artillery OPs.\n\n \n\nReturned along the C.T. with a 5th Div. officer. Passed a crop and laid out in it beside a grave that was being dug by three of our chaps, was the \"finished article\" – a monument to War. It was a dead German. Stinking he lay on his back, his steel helmet on and a thing that was once a face upwards. A belly puffed with gas and brown withered rotting hands. Someone had powdered it liberally with the white of chloride of lime. We passed by unmoved. Colonel Henry Cohen CMG D.S.O. called in to elaborate plans with me for tomorrow. He is a wag. \"Wiltshire & Cohen, Butchers, Families Waited on Daily\". Chalmers out on patrol found 2 dead Huns in a post killed by one of our shells. A Light m.g. lay alongside and our chaps carried it back. Other patrols searched fruitlessly for the bodies of Tyler & Bundon killed last night but found only a few odds & ends where Huns ratted them\n\n \n\n10\/6\/18\n\nStayed up nearly all last night writing the operation orders for our raid tomorrow. First thing this morning the General arrived and we discussed odds and ends. Decided on 9.45 p.m. as zero hour. Busy again interviewing people and writing. Hughes and Smith reported back from England. Had a hurried lunch and walked up to D Co H.Q. to hold a conference of company commanders and to arrange plans for tonight. The 7th Bde. Attack on our right on a front of 2000 yards to a depth of ½ a mile. 23rd raid on our left later on. The afternoon gave promise of rain and some feel. As we returned we walked all round the old German positions in the two Caterpillars and coming back it was interesting to see all his old posts now well\n\n \n\nbehind our line. Plenty of his materiel was lying around. A very good day for visibility and distant places looked close. Some shrapnel bursting over Marett Wood. Returned to Bn. H.Q. Our rations came up early & our parties carried them forward. All the necessary artillery and other liaisons having reported for the stunt \\i moved at 8 oc pm to the Quarry East of Marett Wood where I established battle headquarters in a dugout under the bank. The evening was quiet & tranquil and continued so until 9.45 pm which was zero hour. The evening was still bright and you could see 400 yards ahead. At the very minute our barrage lashed out and the 7th Brigade attack and our raid hopped over at\n\n \n\nthe same moment. I was glad that I had arranged a fair lot of smoke rounds in the barrage in order to screen our people. The barrage was perfect and Harrick put his men right up under it. When it lifted they rushed the trench and mopped it up for 60 yards. There were about 36 Huns lying or standing in the trench and our chaps killed or left for dead about 30 of them using knobkerries and the bayonet. 6 prisoners of 8 Coy 84 I.R. were captured and sent back. Our party withdrew without a scratch and regained our own lines. A very neat little operation was concluded without loss. The 7th Bde. Got all objectives and we linked up with them on the right flank. The 23rd raid did not succeed and they lost about 13.\n\n \n\nRetaliation was light and things quietened completely afterwards. Bazley from 21st was attached to me. An Engineer sergeant who spoke excellent German interrogated each of the prisoners. They were not very intelligent and said they were absolutely taken by surprise. They thought Australians were opposite and knew they were good troops but expected us to be black! Pinched the cap off one chap and gave him an old salvaged steel helmet without lining which came well down past his chin. Received congratulations fro the General and others on the raid. Harricks called in and we wrote our report for Bde H.Q. pushed out standing patrols and linked up with the","11":" Bde. Our patrols found the body of Sgt Tyler who\n\n \n","12":"\n\nwas killed last night. It had not been ratted and I ordered it to be brought down for burial. All was quiet at 1.30 a.m. and we are waiting now for counter attack. This failed to eventuate although later a prisoner who had lost himself said they had been pulled out of bed to do a counter attack. It never developed. Dawn broke with wreaths of grey mist hanging round the \"wodongas\" as one of our runners said. Waited until 6 a.m. and things then having resumed normality I transferred my H.Q. back to the rear of Marett Wood and turning in slept the sleep of one who has done a good job of work. Remained in all the morning and went up after lunch to make a reconnaissance of the left flank towards Ville-sur-Ancre. Things were\n\n \n\nquiet on our sector but very heavy stuff both in calibre and quantity was going over on to the rear of the 7th Bde. Reached Harrick’s raiders and had a yarn with them before pushing on up forward. They were in great fettle and full of blood lust. Reached the front line and went on to a post for a look round with the glasses. Many Huns could be plainly seen. They were coming down the road into Morlancourt in small parties apparently on fatigue work. From a hollow men were walking as if the place was a headquarters. Saw quite a lot of others. There was a lot of digging in progress. Towards our left I now went. We could see some Hun posts fairly close to our line. All our men were in good form. Returning to the right I noticed some shrapnel & AE coming over our front line and\n\n \n\nalso some pineapples. A man named Rogan was at the latrine and a shell or bomb landed fair on his lap killing him. I met \"Bull\" McLeish the stretcherbearer and he was very puffed and rather shaken. He and another had the remains on a waterproof sheet and could not carry it any further. So Davis & I gave them a hand and dumped the terrible burden over the back of the parapet until kindly night allowed us to bury him. This poor chap was nearly blown to bits, the legs were hanging shreds and the whole contents of the abdomen were hanging out. A dreadful sight. All the way along the trench were dabs of blood etc. Told the nearest posts to get dry earth to cover up the mess. Now met some wounded men coming along the trench hit by whizzbangs none very serious.\n\n \n\nAs we continued along to the right we had to duck along very fast. A shell whistling very close was only a precursor to another that landed right over our heads blinding us with flash and deafening us for the moment. Sat down to get a breather and then located old Keith Anderson and had a talk with him. He was dug in slightly close against a chalk bank. Fritz sniped us a bit as we hopped into the . All the way back we found that we were in heavily straffed ground. On its floor were many pieces of metal and now and then was a whole shell case. Did not get back to Bn H.Q. until nearly 6.30 pm being very tired and sweaty. Near our Bn HQ a man was laid out. Lifting the blanket I found he was a young chap of the 21st Bn\n\n \n\nNearly half of his head was sliced off and he was badly knocked about. Everything was quiet until about 8 p.m. and I then moved down below into the dugout on account of the enemy opening up shelling. Before long a barrage was raging and all the communications went. After dark things got very busy so I decided to move forward to battle H.Q. Stayed here all night and nothing further came. There was a good deal of stuff being plastered around our support trenches. Except for one or two men slightly wounded there was not much doing all night. Our patrols had a quiet time out in No MansLand. Our little Battle H.Q. became very \"fuggy\" and being tired out I soon got to sleep and was conscious of no more till dawn\n\n \n","13":"\n\nMorning sleep as usual was broken by the signing of intelligence summaries. At 9pm. Went down to BnHQ. It was a lovely fresh morning. At 10 p.m. the General B.M and the other C.O.s met at my mess and conferred. He was not long in broaching the subject. We are to do another operation and the necessary parties are to be found from the 21st. hurriedly drew up plans and let them have them. Got into touch with the Artillery and T.M.s and gave Reed as much help as possible with the preparations. Busy on this and interviewing people until late in the afternoon. In the evening Major Sheeney USA Army from Illinois reported to be attached to us and see the line. To sleep at .\n\n \n","14":"\n\nShortly after 1 a.m. we put a gas projector attack over on the Boche and he took no notice of it. Evidently the stuff is not much good. The General rang me up at about 10 a.m and said he was going away for a few days. Got up and was very amused by our U.S.A. major who cannot understand shells and how they work. Sent him around with Thewlis to see the O.P.s etc. Rhodes our transport driver was hit last night when out on an Engineer’s job and although he was shot through the shoulder he carried on splendidly. After lunch set out with the US. Major & Thewlis and made for the front line. Had an uneventful trip. From our left Coy sector we could see the Huns in one portion of their trench walking up and down and could even see a \n\n \n\nmachine gun mounted on the parapet. Our guns were pushing over a few rounds at various targets some of the shells were bursting well over our heads and sailing very low. Sitting under these when an error of the gun or shell would send the latter right on one, it makes one think it is a good job the little flappers who make these things have good supervision over them. We returned to our H.Q. without incident & thereafter the night was quiet. Recd. word of Matthew’s DSO Greene, Hutton, Madden, Patterson & Abercrombie MC & Cadwell DCM. Tonight I am sidestepping taking over more trench from 24th and giving more to","15":" Bde. Otherwise a quiet night and nothing much doing. A little retaliation for our counter preparation.\n\n \n","16":"\n\nThe enemy kept up pretty incessant harassing fire all night and there was an almost constant barrage between us and the supports. There was also some gas. About dawn things slackened off. Colonel Scanlon 59th came in to arrange our relief. Hoad rang up to tell me Jack was awarded M.C. Spent the day quietly but was busy preparing orders etc. finally it was decided for one raid only of the 21st. Issued all the necessary orders and at 10pm moved up to Battle H.Q. with Reid and our American major. Things were quiet until a feeble barrage opened on our right and the 24th hopped out. They got 2 machine guns & 7 prisoners – normal identification. Everything is ready for the 21st to hop over an hour later and they are going to try & get one prisoner extra to beat Elwood\n\n \n\n15\/6\/18\n\nSlept in until 10 a.m. and then got up and took a walk around. It was a very quiet day and there was not much eventful doing. A number of 59th Bn. People round reconnoitring. Yarned with our Amurkan Major and heard all about Hickey Dick’s saloon bar and Bathhouse Joe’s resorts in Chicago. An American medical Colonel came around after lunch and little Cadman guided them to the front line. It was remarkably quiet all the afternoon and well into the evening. Just before dark we were treated to an aerial display of no ordinary kind. Squadrons of our planes were a source of constant annoyance to Fritz who soon had the sky all covered with puffs of black smoke as he tried to bring them down. Very soon after\n\n \n\nthe first of the 59th Battalion came up and marched through to our relief. All went well and smoothly. Going out to a listening post they had a man wounded and in our trench we had a man killed. Discussed the defence with Colonel Scanlon and handed over also to him our U.S.A. Major. By 1 am. All coys had reported \"Relief complete\" and Sutherland and I set off on horseback. It was an extra quiet night on the front. Rode back to Franvillers and found our mess quite comfortable under the Presidency of Habel. Yarned here with our fellows and then went over to our old home in the trench to write for a while before going to sleep. It was breaking down before I turned in.\n\n \n","17":"\n\nIn our old position we slept in comfort until about 9. then got up dressed in purple and fine linen and set out for a walk around the companies. Found the men all resting and cleaning up. For each there was an issue of the \"Echo\". Talked with several little groups and they were delighted at the quiet trip out. It was a fine warm morning and we could see Fritz putting odd heavy shells close around our old positions near Marett Wood. We had numerous observation balloons up – one just on the fringe of this village. The 55th Battalion marched in to our relief about noon and put all their men with the trenches until ours got out. At 1 p.m. we pushed off in platoons at 100’ distance for H11d r near the Querrieu Chateau. The only excitement en route was a few big ones coming over round about us. We made a \n\n \n\ndetour and luckily missed several which landed among transport lines and caused great scatter of horses. Just as the head of the column reached L’Hallue River our billeting officer Swanton came up and told us that the Battalion was desperately scattered in all sorts of old trenches and we had no knowledge of this. Our dam-fool order gave us no assistance at all on the job. Rode on to BdeH.Q. at Querrieu Chateau and found out that such was the case so perforce we had to carry on. For a piece of luck our column’s great length worked rather well and we were not so very dreadfully put out about it. The guides led the companies right to their billets. The 21st are camped right alongside a big pool of water and should be able to have quite a good time at swimming etc. the Chateau at Querrieu in itself is one of those rather shabby brick chateaux peculiar to this\n\n \n\ncountry. Its wood though are quite out of the ordinary. The drives wind rough through lovely shady avenues of old, old trees which give the most delightful tints of russet green. It is in his landscape gardening and the making of prospects through woods that the Frenchman excels. L’Hallue is a small river and has a wooded low lying course which is marshy and hard of passage after a little rain. Alongside it runs a light railway for carrying up heavy shells and the trucks are propelled by little motor engines which have no funnel and are armoured. Round here we see more of the \"backdoor\" of the Army, the supply system and all the Transport Lines etc. My groom Murphy has gone to hospital so little Tommy Snowden (erstwhile jockey) in looking after my horse which just now is looking fine. Found that my home was a tent under trees in the grounds of the Chateau\n\n \n\n16\/6\/18\n\nQuerrieu\n\nA very pleasant spot here except for a wretched Hun gun which drops big shells around. Two English officers were killed in the village tonight. After mess in the direction of Villers Brettoneux the Hun downed in flames one of our observation balloons and its poor occupants went to hell. Rode right round the companies which out in open paddocks are living in trenches and yarned to them all. This was a fairly long ride and it was dark when I got back. We got 500 francs worth of beer up for the boys tonight. Camped at BnHQ in the grounds of a fine Chateau the air balmy. Were it not for this cursed War the life would be idyllic. Tonight from here we could see the spire of Amiens cathedral looking out over these downs as it has done for 800 years. What a loss to the world if the fine old place is hit\n\n \n","18":"\n\nBusy day writing etc. In the evening I met Colonel Brazenor and rode all round our companies with him. On Stewart’s horse had a good ride. News today of Hun’s attack in Italy. Received about 5 months mail tonight and read it until late. All our Nucleus rejoined the Battalion returning in motor lorries from Bertancourt where they have had a splendid time among the hospitable French people. A few heavy shells coming over and after dark the air was full of humming planes. The big mail tonight filled me with thoughts of good friends in Australia. Some careless devil at the Base, curse him, has bottled my letters for months. We are to make full reconnaissances of the positions around here tomorrow. Busy times these. The men was a rest way, way back & drill\n\n \n","19":"\n\nDid not go out at all until about 10 and then visited the Transport and QMs Department. The Boche downed one of our balloons and the occupants had to parachute down. Went to","20":" BnH.Q. and had a yarn there. At 3p.m. rode over to C & D Coy and had a conference with all the officers over there. We then went back to BnH.Q. and messed. At 7.15 into the saddle once more and madefor A & B Coys where we spent more time in conference mainly about statistics and fact: Our strength is coming down very much and we are now the weakest battalion in the Bde. The 24th were hitherto but their Ploegsteert gas cases are now returning. Everyone has wind up about prospective breaking up of divisions batts etc.\n\n \n","21":"\n\nThis morning’s visit to C & D Coys was very necessary and I found considerable slackness. Ordered 1 hour extra parade for the latter. Close order drill etc – very necessary as the men are slack & careless. Rain blew up but did not properly come down until noon when such a deluge set in that all ideas of sport this afternoon had to be cancelled. Spent the afternoon writing. 7 men evacuated today with \"P.W.O\" a form of \"la grippe\" which I also have. Smith the L.G.O. is confined to his bed with it. Leon Barbier came in and yarned for quite a long while and remained to dinner. Our Band played very well. A sunshiny shower – silver rain falling on green grass among these fine old trees was very beautiful tonight. Colonel Brazenor came in for a couple of hours at the end of which we were amused to find that War was the only topic\n\n \n\nA windy dull day very thundery in looks. Rode out to A&B Coys and found work out there progressing well. Then over to 24th where I saw Colonel James then to 21st Bn where I met Duggan. An aeroplane was flying very low over here. The whole of the 24th is very nicely situated in a few banks and ledges all along a lot of terraces and they are comfortable enough. After lunch our band and the 24th played and the 21st had swimming and other sports. I wrote all the afternoon and then got Charlesworth to make my bed as I was feeling unwell with P.W.O. or grippe. It is not an unpleasant existence here living under trees in the grounds of this old Chateau. Our paper returns for this week show an enormous rise in the figures which is very satisfactory.\n\n \n","22":"\n\nSpent the whole day abed on account of the prevailing epidemic \"la grippe\". It was a showery dank day and quite extraordinary for this country – rather like Colombo weather. A big gun drops shells at intervals in this map square, the sound of the gun going off can be plainly heard and then a silence while no doubt the shell is a mile or so up at the height of its trajectory and then a gradually growing rapid screech as it plunges down. General Paton came in for a yarn about the War and tells me the 3 Batt. per Bde stunt is probably off. Doctor wants to evacuate me – but Nein. Two officers (Patterson & Westaway) and a number of men sent away with this cursed epidemic. Might be able to wangle a bit of leave out of it in due course.\n\n \n","23":"\n\nA windy dull and blustery day so I remained in bed all day in order to complete a recovery. Feeling better. Remarkably quiet and uneventful day.\n","24":"\n\nRemained in bed. There was an inspection and presentation of ribbons by General Monash at Bde.H.Q. and as some Bishop or other turned up there for lunch our Band went down and played for them. After lunch General Patton looked in and had a yarn about things generally. From the Staff nowadays we get nothing in the way of advice or criticism unless something goes wrong to a glaring extent. Usually they are content to pick C.O.s carefully and leave all to them. Keith Sutherland, Stewart Davis Matthews and others dropped in for a yarn. Sgt. Cop & R.Q.M.S. Hawkins got their . Gorman continues busy on his monumental work history of the battalion.\n\n \n\n24\/6\/18\n\nThe epidemic of influenza is spreading and causing serious diminution of strength. The papers say the Hun has got it too – I hope he is as miserable as we are. Matthews laid up this morning and Davis the R.S.M. and others had to be evacuated. The doctor returned from Abbeville with a temperature of 104 and had to evacuate himself. The General looked in after lunch when Brigade Swimming Sports were in progress. The 21st won the Championship and we came 3rd. the afternoon had a tincture of excitement caused by a long range shell landing right in the lake and sending up a geyser of water and dead fish – killed by the explosion. Feeling rather worse today than yesterday and seem to have another relapse\n\n \n","25":"\n\nPlenty of band music this afternoon. Each battalion has a band and they are not bad. Our printing press struck off programmes for the Sports we are having tomorrow. A few more of Pimblett’s sketches done on the wood blocks arrived from London \"Punch\" for publication in our \"Echo\". This time he has \"got\" \"Jonah\", Tom Willis and B. Horan to a tee. Overhead a few aeroplanes are buzzing but otherwise there is not much here to show that a War is on. Georgie Hughes is acting as Sports officer and is a grand little chap who I like very much. A quantity of beer at Bde. Sports has left an aftermath of stray drunks who wander home like lost voices roving in Eternity\n\n \n","26":"\n\nAnother day in bed with nothing very special to chronicle. Our new Dr. proved a cocky little person, who found his own level after a while. Two new officers Mallinson and Miller reported today and I gave them some sage advice I do wish they would not send to a fighting unit at this stage of the War, officers who have never smelt powder. On the afternoon we had a Battalion Sports meeting which went off very well and resulted in \"C\" Coy winning the Battalion Championship. Hughes had the job of running the sports and did it right well. In the morning we had held a competition for the champion Lewis gun team and H.Q. won it. Received an order for Major Matthews to go to Aldershot to attend a Senior Officers School. The Bde Major came down to see me re this and I suggested leaving him here. A letter to hand from\n\n \n\nGeneral Birdwood tonight from the F.M. C in C himself re Ruthven and his V.C. I hope he gets it. Word today of another stunt. The 4th Divn attack. We hop over also 21 & 23 24 support and our goodselves well in reserve I hope. Preparations in hand already. Conference held tonight. The present is a messer and keeps things well bottled up. Tonight the Pay sergeant produced over 100 pounds worth of debits for my pay book – some ridiculous error on the part of the Pay Office. We are writing to them about it. A few of the troops are using Mills bombs for fishing – sending the fish stunned to the surface by exploding the bomb in the water. A few more military medal awards have been gazetted some of them are for old originals Charlesworth, my batman today got carpets rugs etc out of the village for tent\n\n \n","27":"\n\nStill another day in bed. The chief excitement consisted of 2 heavy shells which landed within 20 yards of my tent tearing large craters and creating miniature earthquakes without hurting anyone. Stewart took the Battalion out to carry out a practice attack. Read and wrote and slept all day. Leo McCartin came back from England and is still mad to get into the Flying Corps so I must perforce recommend him. Our business like Staff Capt. The son of Sir John & Lady - is a messer of the first water and bottles my recommendation for promotion. Different people came in for a yarn during the day and I went into Canteen and other matters Tomorrow reconnaissances for our move will have to be undertaken. Thewlis leaves for the Flying Corps to be attached for a few days experience\n\n \n","28":"\n\nIt was a fine day. Got up about 10 a.m. and ventured down as far as BdeHQ in the Chateau. Here I saw the General and discussed affairs of state and the plans for our forthcoming attack. Returned and got sketched by Pimblett who missed quite my expression in a sketch but caught it in a caricature. Had some lunch and then all the officers sat in a group for a portrait and then all the N.C.O.s were taken. Tried a man at Orderly Room and remanded him for Court Martial. Two men were paraded about their pay and I fixed them up as well as I could. Feeling tired I then went back to bed and from there conducted a conference of company commanders re our move tomorrow. Read wrote & was employed on odds and ends until fairly late in the evening which was quiet\n\n \n","29":"\n\nEveryone early astir being moving day. A fine warm sunshiny day. Great bustle always when there is a move on. Batmen all going with their heads down to get their officers attended to and valises packed and stacked ready for transport. It wants a move to show up many little overlooked points. Tents and bivouacs that have been standing for a long time are struck and their accumulated rubbish from the term of occupation is exposed to view. People who ordinarily do not wear equipment are expected to turn out smart as those who do. One discovers just as we move off that the \\band has dirty instruments or that there are many men carrying bags and other unmilitary an ragged looking paraphernalia. Just in front of us is a large swimming pond which has been used for sports and by other units. One\n\n \n\nrealises that, being nobody’s job, nobody has cleaned up there and as all here are now in the throes of preparation for the shift it is hard to find a party to put on. Steel helmets have not been worn for some time and one realizes that their covers are dirty and ragged. Our transport is driving about loading and meanwhile the other people’s has started to come \noff\n in. There is on loading here and off loading there. One stands aloof disinterestedly and looks on, every now and then sending for Capt. This or Mr. That as some irregularity crops up and asks \"Why the hell this\" or What the devil that\" etc. The 3rd Division march in here and their Details look very wild and wooly – strange ill clothed people – cooks and the like. Probably they remark the same about our \"tail\" when it reaches\n\n \n\nthere. Their officers mess property includes a very fine and good looking milking cow which some menial of the officer’s mess drags along by a halter. So much for the look of the \"move\" before it actually commences at all. We move to a set of trenches in front of the village of Glisy. There is no accommodation of any kind there and we must needs dig in. At about 9.30 Colonel Knox Knight came in and we had a cup of tea together. With him was Heseltine sometime a L.H. instructor at Broadmeadows. At 10 I pushed off with Sutherland and found that the tail of the column had passed the starting point. Rode right along the whole length of the column. The platoons were marching at 300 distance and were formed 3 deep instead of 4 – the first march on which we have tried this scheme\n\n \n\nThe men were all in battle order with blanket on belt and greatcoat above the haversack. Their turnout was good and showed up well in comparison with other units we passed on the march. We marched through the village of Bussy-les-Daours which was not much damaged. The march led us along the road near Blangy Tronville and we could see about 4 miles off the village of Villers Brettoneux with here and there a big shell bursting. Crossed the Somme here a fine canalised river well bridged on either side is rather flat and marshy ground. Billjims were rowing up and down the river in a boat and some enterprising people had hoisted a sail on another and went sailing along. Marched into Glisy and the guides took the companies\n\n \n\n28\/6\/18\n\nQuerrieu - Glisy\n\nalong to their different portions of trench in front of the village. Our doctor coming along slowly with a number of men who are sick with the current influenza and consequently weak. Went into the village – one of the ordinary type and with no civilians. There located our officer’s mess and commenced to look round. A number of French troups hereabouts because the two Armies here adjoin. Mostly heavy artillerymen and motor transport personnel. After lunch walked through the back of a fine modern red-brick villa house and found myself looking right down into a splendid green valley quite a delightful spot. Here there is a Divnl. HQ and I found a good friend there who I went to see. Major-General J.Gellibrand C.B. DSO & Bar. We yarned about old times, present\n\n \n\nGlisy\n\ntimes and future times and refought many old battles. We must have talked for an hour and a half until I had to tell him I had work to do. There is a charm about this General for those who know him that would send them through hell for his sake. A leader of men! Spent the afternoon quietly and then after mess had a conference of the officers commanding companies and discussed the march today. Caustically caned up Mackinnon for being late. Discussed the plans for our Brigades hopover in conjunction with the 4th Division. Moved down to a new and good billet further down the road feeling very unwell went to bed early. My batman Charlesworth got influenza today and O.P. Hunt took over in his place. Once more into the breach. The ‘flu epidemic continues to grow. Our new doctor had a very busy time today.\n\n \n","30":"\n\nGlisy\n\nStayed in bed until after 10 a.m. and then went round for a walk. The village full of DHQ troops and of French soldiers. After lunch went round to C. & D. Coys. As usual we are well messed up about trench shelters. Went and saw the General and put the acid on him about several matters. All the officers came to mess dinner and we managed to fit into two rooms out of which we shall have to shift tomorrow. Quite a lot of new ones among them of late. A nice quiet evening. Now and then an enormous French gun (13 inch) fires at a German railhead 19 miles away and its shell hurtles a terrific distance up into the air during its passage. Went to Bde H.Q. 9 pm and had a talk to the Brigade Major. Colonels James Duggan & Ralston (MG) soon came along and we started a conference at\n\n \n\nwhich Major Bateman. Harris, Capt Hogg Sale and others were present. We went very fully into the matter of the impending stunt and arranged all the details therewith connected. position of H.Q.s, assemblies, dumps rations, hour of attack, signals, medical and other arrangements – a thousand and one details. The General encourages the drawing up of orders by this method and it certainly has this advantage that everyman gets what he wants in the way of arrangements and if anything miscarries then the General has only to say \"Well, you suggested it – it was your wish!\". Questioned as to where he was going to cook for his snipers young Gear said \"Villers Brettoneux\" – I wonder what a Tommy officer would have said under the same circumstances:\n\nTo bed midnight\n\n \n","31":"\n\nA fine clear day with warm sun. Our padre tells me that it is Sunday and he was going to hold a Church parade only the Brigade called for all our remaining available men for a cable burying task. With Stewart I arranged our warning orders and the preliminaries for our move. One of \"B\" Co. men was caught in the act of \"pinching\" a tent from people no less exalted than the DHQ staff! He would have succeeded in his design had he not made the tactical error of returning for the pole when he was caught. A few large shells went past here probably in the direction of the railway. After lunch left with Stewart for the line to make a reconnaisance. Rode out on to and right up the Villers Brettoneux Road – a fine straight and splendidly kept\n\n \n\nVillers Brettoneux\n\nroute shaded with fine trees reminiscent of the approach to the Pyramids at Cairo. The junction of the French & British Armies occurs here and this road is to all intents and purposes the boundary. On the right are French batteries transport etc and the prevailing colour is blue. On the left is the Australian Corps with the familiar khaki as the prevailing tint. We rode right into the torn and battered village of Villers Brettoneux along a road that was covered with debris in such a manner as to testify to how heavy the shelling has been at times. Only a few troops were to be seen mostly souvenir hunting. Against the side of a house was a dud German six inch shell standing. On top\n\n \n\nof this was a carved chalk head surmounted by a cap. Over all was the legend \"Billy Hughes!\" The village of Villers-Brettoneux in times past must have been a very pretty and pleasant place. Now it is a monument to the devastation of modern War and nothing but a tangle of rubble. We rode along passing an old spinning factory outside of which much material was still lying. From the shell torn houses in many places came the quite unmistakable stink of human dead bodies and crowds of large flies. To the initiated this told a tale of dead men rotting in cellars where they had been killed when our chaps made their advance an mopped up the village in the moonlight. Across the streets in places\n\n \n\nwere barbed wire entanglements and we could see by curious glances from steel hatted passersby that we were riding considerably closer to the front line trenches than is customary here. We turned out through the village down a side road and found that we were well ahead of the Battalion headquarters of the firing line and had to go back some distance to locate them in deep dugouts dug into the white chalk and liberally camouflaged. Our destination lay in the support positions and we located them similarly in a deep place well behind. Going down many steps it was at first impossible to see anything owing to the so sudden change from bright sunlight to deep darkness. The rooms below\n\n \n\nare all furnished from the deserted houses in Villers Brettoneux and the walls are covered with white sheets & tablecloths upon which pictures from La Vie Parisienne are pinned. Altogether quite palatial. Rode home via Blangy Tronville. Here went to look at a 13 inch French gun was is under a mass of skilful camouflage. The affair with its trucks must cover a couple of acres and the railway branches leading to it are also hidden. The camouflage is made of real moss and so skilfully blended into the surroundings that even when standing upon it you could not tell which was which. After evening mess we had a mess meeting and I then rode to La Motte & saw the transport and then to the Nucleus to yarn with Elwood\n\n \n","32":"\n\nMatthews and Dundas left today for England. At 10.30 with Stewart set out again for the line and this time went over the same ground as yesterday save that we kept out of the village. Went up to Diggers Support past the usual bivouacs of the men and had a look round. Not much could be seen from the right but on the left we could see Vaire Wood, sundry direlict aeroplanes and a double telegraph post which are good landmarks. Some fine shells of ours were bursting on the Hun trenches in a wealth of thick wooly smoke and dust. Returned with Colonel Forbes who happened to also be up and came back to firing line B.H.Q. Just as we arrived Fritz put over a couple of salvoes of big ones which\n\n \n\nmade us seek shelter but fortunately no one was hurt. Then returned home via Blangy Tronville. Today is a midsummers day with a cool breeze and warm hot sun. Heard today that General Paton goes home and General Robertson comes back here. After dinner walked down to Blangy Tronville a pleasantly situated little place but getting warworn and ill used owing to constant traffic and clouds of dust. Found Col. James and spent a good long evening yarning with him. On the front darkness fell quietly except for the dull boom of heavy guns and long flashes of fire leaping out from their muzzles. Home at 11 pm and got word that Harricks was awarded the M.C.\n\n \n","33":"\n\nUp at 7 a.m. and after breakfast went up to D.H.Q. with Sergts Ruthven and Turner and there saw General Rosenthal, who gave the two N.C.O.s somewhat of a lecture on the many responsibilities that come to a chap when he rises to the rank and grade of an officer. The D.H.Q. is situated in a thickly wooded dell and well cut into the banks of the hillside. Pleasant paths & shady trees run in the several directions. Yarned with the A.A.G. and with Colonel Miles – the attack on the 4th is entirely under the supervision of the Fourth Division to whom our people have lent a Brigade. After going back to my billet I gave to Stewart a great wigging over the delapidated condition of our guard at D.H.Q. this morning and sent him off to find out if\n\n \n\nif things could not be improved. M. Leon Barbier came in and stayed to lunch full of optimism and much buoyed by the latest speech of M. Clemenceau, The Tiger, now in his 73rd year. \"We shall fight to the last, though we yet have much to suffer, and shall win in the end. The last quarter of an hour is France’s\". At 2 pm I set off on horseback for a place the other side of La Motte Brebiere where our Nucleus was being inspected by Billy Hughes. Found the spot a fine grass sward extending well down to the river. Here all the other Brigade’s Nucleus were also gathering and we soon had a parade of 1250 men formed up including A.S.C. Artillery & Engineers. It soon appeared that I was the Senior officer on parade so I took charge from Major Bushell the D.A.A.G. At about 3.30 pm Major General\n\n \n\nRosenthal came up and we had a yarn. At 3.45 I took post in front of the parade and brought them to the slope as the car drove up containing Billy Hughes, Joe Cook, General Birdwood, General Monash, and their satellites (?). Received them with the general salute \"Present arms\" and the crash of the band. Put them down to stand at ease on the order of General Birdwood. B Hughes came forward and shook hands and I walked him round to look at the men. B.H. is a miserable weak-looking devil with a vicious glint in his eye and was deafer than I at first realized. After a prowl round the flanks were brought in and he mounted a rostrum of empty boxes and made a speech. John Longstaff and others were sketching while Wilkins had a cinema going and there were enough\n\n \n\ncameras. J Cook followed with a few well chosen words and I then called for 3 cheers for Australia coupled with the names of the Prime Minister and the Minister for the Navy. After this the field officers fell out for an introduction and General Birdwood asked me to allow the men to march off which I did. Had a long talk about general matters to Generals Monash and Birdwood and then took leave of Hughes and Cook who sailed away in their cars. Now returned home along very dirty roads and met Dick Dowden. After mess went down to the General & tapped him for leave. He poured out his many troubles into a sympathetic ear. Returned then to my H.Q. there to receive Dowden and hear a long recital of his! Rode off at 10 pm for the front line\n\n \n\nand had a good passage. A strafe was proceeding ahead of us and there was plenty of red fire and smoke to be seen. I stopped before we got that far forward but the acrid smell of explosive smoke was pungent. Relieved Colonel Forbes with just on 300 men – the weakest I have ever yet gone into the line. A fine dugout lined with white sheeting and plenty of good furniture from Villers Brettoneux. The walls are covered with erotic pictures from La Vie Parisienne. My headquarters this time in consists of Stewart Harricks, McCartin, Hughes, & Harricks all first class chaps. It was well after midnight when I was able to sit down and to write this record of events of what has been an intensely busy day\n\n \n","34":"\n\nSeized with illness during the night and had a complete relapse of \"Dog fever\" – shivers, sweats, pains etc. The doctor came up and said temp. was high. Duggan sent off today.\n","35":"\n\nStill ill. At zero 3 am our Bde hopped over in conjunction with the","36":" Division on the left and assisted by tanks. The attack was carried out by the","37":" & 23rd with 24th in support and ourselves in reserve. The barrage opened rather raggedly but soon settled down to a good bombardment. The going was fairly easy and not a great deal of opposition. By noon we knew of 1300 prisoners for the whole stunt of which 130 were taken by our Bde. The 21st got a tank gun & 21 m.g.s. Got up and shaved about 6 pm and realized then that I was very weak again\n\n \n\n4\/7\/18\n\nColonel Sadler & 17th Battalion marched in to our relief and our companies moved up to Banana Swith & Villers Trench. The General moved some of the 24th further forward for use in case of counter-attack developing. Some Americans hopped over with our 4th Division today and did well. Hostile aircraft heavily bombed the 17th coming in but caused no casualties. The relief was all complete by m.n. and I tried to get some sleep but not very successfully. This is the rottenest attack of illness that I have had for some considerable time. This dugout is 30’ under ground and hewn out of damp chalk everything soon becomes dank and moist. No chance of getting better here. On the front a quiet night. Sent up some parties to bury the dead. Owing to crops some will not be found for days\n\n \n\n5\/7\/18\n\nNo better today. The situation quiet here on the front but the Tommies lost all their gains North of Albert after holding them for three days. Our people don’t want to take any risks here. At 4 p.m. the mess cart called for me and I set off for Lamotte-Brebiere where they had procured a room for me in the Chateau. A few big shells landing about 1000’ from Battalion H.Q. as we left. Feeling wretchedly weak when I got as far as as Mile’s Store. Miles none too well either. The weather has been muggy and close for some days and I think a good fall of rain would do good. The Somme river is low and exposes many weeds. The men seem to enjoy swimming here and plunge in from their little camps so conveniently situated on the riverbanks. Sutherland and others came in to see me and inquire as to health\n\n \n\n6\/7\/18\n\nLamotte-Brebiere\n\nRemained in bed. The little Chateau or residence is situated in pleasant leafy grounds and the surrounding trees are very beautiful. No hint is here of the warworn village or the dusty thronged roads only a few yards away. A backwater covered with waterlilies comes up to the back of the garden. The room I am in is furnished in the usual French style for middle class places and points to a tincture of cheapness and gimcrackry. The windows are shuttered and inside have drapings. The bed has a high and elaborate canopy. Most of the furniture is white enamelled and unsubstantial and a few ordinary pictures complete the furnishings. Word down from the line this morning of over 20 casualties for gas. It appears that A & D Coys were working on a trench digging job and a few gas shells burst right on the\n\n \n\njunction of the two companies. One man (Walker A Coy) was killed and others wounded and gassed. The redoubtable Barney Horan was among the latter. Willoughby got a slight whiff but I refused to allow him to remain at the Transport and packed him off to the hospital. Ruthven & Turner commissioned today. Had numerous visitors at my bedside mostly my own officers who are good chaps and with whom I much enjoy a yarn. Our new gains on the front have not been challenged by the Hun. Sent Abercrombie up the line to take the place of officer casualties. Went to sleep at about 10 p.m. and had a most refreshing sleep that lasted the whole night through. Did not wake up until ¼ to 9 am\n\n \n\n7\/7\/18\n\nStill very heady and unwell especially late in the afternoon when a bit tired with letter writing and with reading. The band came down here and played me a rather good programme. The day fine and sultry like all days lately.\n","38":"\n\nGot up and sat in a chair for a while in the morning and also in the afternoon. A hot and clammy day. The Battalion moved back last night upon relief but are still well ahead and near Villers Brettoneux\n","39":"\n\nGot up, dressed and wandered round. Eventually reached Bde HQ saw the General and returned with a leave pass for the 14th inst. Feeling very weak but otherwise very much better. Little news except they are going forward in easy \n\n \n\n10\/7\/18\n\nWord came to hand that 2nd Lieut. (Ex Sgt) \"Rusty\" Ruthven has been awarded the Victoria Cross – the first V.C. in the 6th Brigade and a great thing for the Battalion. Everyone is very bucked about it. A fine day but with an unpleasant wind. Sent a cable off to Australia to","40":" Bde Depot telling of Ruthven’s V.C. At lunch time rode over to the Nucleus and saw different people there and yarned with them. Harold Smith M.M. came back from the T.B. Talked to those of the men who were in their little bivouacs. After returned to my billet and had a talk to different ones who dropped in and made final arrangements for leaving tomorrow. A chill cold wind tonight. Up at the front last night they had a few more people gassed\n\n \n","41":"\n\nSet off for Boulogne at 8.45 am making first on horseback for Longpre the nearest station to Amiens. There is a striking rolling plain surrounding Amiens. At this time it is covered with parched ripe crops. Rode right to the outskirts of Amiens and got a splendid view of the wonderful old Cathedral. As far as I could see there is no damage done yet to the Cathedral. Skirted the town and rode through utterly deserted and silent streets traversing a route I had not been on since the opening days of the Battle of the Somme in 1916. arrived at Longpre only to find the place closed and no trains and to get directed on to Ailly sur Somme. Made my horse sweat in order to get there before 10.30 am and one of the usual frigidly polite Tommies said there was no train till \"arpas four\" and in any case\n\n \n\nAbbeville\n\nI would have to stay all night in Abbeville. Grabbed my baggage and saw an M.P. who got me into a good civilian motor car which took me to Hagest. There got an ambulance for Conde and there after a wait got a motor lorry for Pont Remy. The route lay through very pretty country as we hugged the river flats. Passed L’Etoile and other familiar spots noticing some Indian cavalry and also plenty of Chinese 2 Indians working on the roads. At Pont Remy had only to wait a few minutes when a Flying Corps tender dashed up. Boarded this and broke all speed limits in a trip that landed us in Abbeville before noon. Walked to the Officers Club and had lunch very good for 3.50. Colonel Manning and an A.S.C. Major were here. After lunch read and slept and then walked out. The town has\n\n \n\nsuffered heavily from air raids and a number have evidently landed right in the main square where there is not a business place intact. A fine old church (St Vulfran) is intact outwardly but seems to be under repair. Round about the station all the houses are in ruins. Took train from Abbeville and had a tiring journey to Boulogne which was reached about 9 pm. Went to the British Officers Club and put up there opposite the station and then walked round to the club at Place Capecure and had a late supper served by W.A.A.C.s. Someone pinched my Australian hat and left a very wretched specimen behind in its place. Met Major Berryman of 2nd Divnl. Artillery and shared a room with him and slept well\n\n \n","42":"\n\nRested in the Clubs most of the day and late in the afternoon went for a walk along the promenade and sat down there on a bench looking out over the sea. There was a rough sea coming in. a feature of the Boulogne sands is the crowd that gets down, on them as the tide recedes, looking for shellfish. While having dinner at the Club Major Roe of 2nd Divnl Arty came in and dined with me. He says there was a very heavy bombardment down about the French front this morning. The class of English officer we see now is very different to what it used to be. There are not a great number of officers about here now as leave is not very liberal.\n\n \n","43":"\n\nBoulogne-sur-Mer\n\nA fine day. In the morning took a paper and read on the seafront. Along the quays the characteristic loose redbloused seafarers are a striking feature of the scene. After lunch again went down and this time sat right on the beach close to the waters edge. A few people bathing. W.A.A.C.s walking along the cynosure of all eyes. Rather a fresh sea running. Dined at the club having as table companion a miserable little Yiddisher- Scotch Second Lieutenant. After dinner an English second Lieut M.M. & Mons ribbon was drunkenly sick in the smoking room & forced everyone to evacuate the place. Feeling very tired went round to the club and there did this writing read the papers etc.\n\n \n","44":"\n\nBoulogne - Folkestone\n\nLeft Boulogne on the leave boat at 12.30 p.m. in rain having four Australian nurses as travelling companions. No airship accompanied us today but the usual torpedo boat destroyers were in the convoy. Found seats and yarned with the nurses all the uneventful way across. Arrived at Folkestone we disembarked and caught the second train for London. The journey up through Kent was uneventful, the country looking very pretty and green. Arrived at Victoria changed some French money for English and rushed over to the Belgrave Mansions\n\n \n\nTook a taxi round to Royal Automobile Club and put up there. Waslked up the Strand to the Cheshire Cheese and had a good meal there. Returned to R.A.C. – a most luxurious place with swimming bath etc. and went to a concert there in the Gallery\n\n \n","45":"\n\nLondon\n\nWalked down to Horseferry Road and there bought a few clothes but could not get a decent hat. Went to the Army & Navy Stores but could do no good there either. The day was muggy & oppressive. Was struck again by the whitened stone of the Abbey and of Whitehall. It gives these old places a most venerable look. To Piccadilly and had a shave and a haircut before going back to the Royal Automobile Club for a good lunch. Afternoon took ‘bus out to Wandsworth and found the hospital rather empty. Saw Major Dooley who is off to Australia in a few days and also saw Southwell who was up. The V.A.D. girls here are fine capable and womanly girls. My trunk and suitcase here\n\nend\n\n"}}