{"Document Name":{"0":"Diary_0438","1":"Diary_0438","2":"Diary_0438","3":"Diary_0438","4":"Diary_0438","5":"Diary_0438","6":"Diary_0438","7":"Diary_0438","8":"Diary_0438","9":"Diary_0438","10":"Diary_0438","11":"Diary_0438","12":"Diary_0438","13":"Diary_0438","14":"Diary_0438","15":"Diary_0438","16":"Diary_0438","17":"Diary_0438"},"Date":{"0":"unknown","1":1418.0,"2":1419.0,"3":1420.0,"4":1421.0,"5":1426.0,"6":1427.0,"7":1428.0,"8":1429.0,"9":1430.0,"10":1431.0,"11":1432.0,"12":1457.0,"13":1458.0,"14":1459.0,"15":1460.0,"16":1461.0,"17":1462.0},"Entry":{"0":"\n\n24th\n\nOrders issued for NZ MR Bde to detail one sqdn. To escort 2nd Bde supply column from Esani to Halasa commencing night 25th. At this place 2nd Bde escort will take over.\n\n1500 At request of infantry commander, NZMR Bde ordered to send one squadron to Esani in advance of the Bde to be in position on 680 Khor El Ajram by dawn tomorrow 25th\n\n1700 NZ Bde & Somerset RHA left Fukhari for Esani – Op. order 103\n\n2100 Message received from 2nd LH Bde that they have reached Khalasa – they report having had to detach transport under escort of two squdns owing to very heavy going for first four miles.\n\n1850 orders issued from Descorps for 2nd Bde at Asluj to send one less one squdn to cross roads near junction of Wadis Amirin (?) and Haleigim (Abda sheet) whence a reconnaissance of one squdn will be pushed out about 5 miles towards El Matrada. Detachment to reach cross-roads 1300. R.F.C. to cooperate and bomb enemy (estimated at 150 irregulars) at Matrada.\n\nDiary by Major Walter Urquhart of General Staff Australian and N.Z. Mounted Division. (Operations)\n\n","1":"\n\n1st Bde Marakeb to Abhsan\n\n2nd Bde Esani to Asluj (+ Ayrshire RHA)\n\nNZ. Bde Fukhari to Esani (+ Somerset RHA)\n\n25\/10\/17\n\nDiv order No 105 drafted and printed but not issued. This order gives details of moves and operations from Z-1 day. Special instructions to NZMR Bde and 2nd LH Bde for dealing with enemy posts at Gelshegeib and Arara respectively \n\n0400 2nd LH Bde report transport arrived Asluj 0400\n\n0040 NZMR Bde arrived Esani\n\n0115 2nd Bde less transport reached Asluj\n\n1700 2nd Bde at Asluj report water still undeveloped. Only activity is that of numerous bedouin moving about mostly northwards\n\n1955 Instructions issued for Br Gen Con to assume command of Division (less 2 bdes etc) for march to Esani tomorrow.\n\n26\/10\/17\n\n0700 2nd LH Bde reports no signs of enemy during night. Water development progressing – 600 horses watered.\n\n1000 Div. Cmdr \nleft\n (and GSO 1) left Abasan and went to Esani where he assumed command of Des Corps troops in the area.\n\n26\/10\/17 contd. Esani\n\n1700 D.H.Q. (less H.Q. opened at Esani) Div. troops, 1st LH Bde and \nSomerset\n Inverness Battys having assembled south of KILO14, marched to Esani \n\n0005 arriving 0005. 27th.\n\n27\/10\/17\n\n1200 General Chaytor assumed command of all Desert Corps troops in area south of line Ghabi – Goz Mabruk – Elbuggar.\n\n1500 DHQ established Esani at point 342° from junction of Wadis and 800 yds from bank of W Imaalaga.\n\n1540 NZMR Bde report point 970 occupied at 1440 without opposition, outpost squadron occupying usual line.\n\n1400 Orders received from 1st LH Bde to relieve with two squadrons the squadron NZMR Bde at 680 – 1 Squadron 1st LH Bde will push on to 840 and entrench same while the other squadron will\n remain in support at B of Khabeira.\n\n1635 orders issued for all \ntroo\n Des Corps troops south of line Ghabi – Goz Mabruk El Buggar to stand to arms at 0400\n\n1700 ICC Bde at Khalasa – Beersheba road.\n\n1530 2nd LH Bde report contact patrol failed to see any enemy troops in Matrada area or to locate our squadrons. Have not got visual communication with 5th regt yet owing to difficult country.\n\nRef Abda 1\/125000\n\n2200 Report of Matrada reconnaissance received and forwarded to Des Corps –","2":" regt & 1 sec. M.G. squ. Left Asluj \nlef\n 0950 reached point 1 mile south point 1850 and 1 mile NW of E in El Murra at 1400. PTO\n","3":" contd\n\nObserved all country N of Abda – no signs of enemy – many natives seen, one of whom reported twenty Turkish lancers at Ain Murra two days ago. Route very stony and severe on horses – Good plentiful water and easily developed at Ain Murra.\n","4":" Esani\n\n0005 DHQ Div troops and","5":" LH Bde with Inverness Batty arrived at Esani\n\n0615 Patrols to our front report all clear but heavy firing can be heard to north East of Esani\n\n0810 NZMR Bde report one enemy squadron distributed along line 820 – 790. – Earlier troops with transport were seen moving towards Beersheba road from line 790\n\n0915 Hostile aeroplane reconnoitred Esani\n\n1040 5th Mtd Bde ordered to relieve posts of ICC at Ibn Saiid and 970 by dawn on 28th\n\nOrders issued to 1st LH Bde to relieve squadron NZMR Bde at 680 N.N.E. of Esani by 1700 tonight. Appen.\n\n1100 ICC Bde ordered to push forward posts to 940 Ibn Saaid and 970 after dark tonight and have a camp entrenched by dawn, when the posts will be relieved by 5th Mtd Bde\n\n1135 Aeroplane reconnaissance reports no movement along Saba – Asluj road or Asluj – Arara road.\n\n1200 Orders issued that Inverness battery will be under orders of GOC 1st LH Bde until further orders\n\n1140 NZMR Bde report enemy strength 2 squadrons cav. And one co. infy. halted on the line Abu Yahir – El Hathira – Taweil El Habari.\n\n1227 2nd LH Bde report reconnaissance has made good cross roads S.W. of Arara and is engaging at long range party of 20 enemy towards that place. Enemy obs. post on 1550 N of W Imshash.\n","6":" contd. Esani\n\n1252 2nd Bde further report – enemy towards Arara now entrenched at 150 camelry and cavalry.\n\n1615 As many Bedouins were wishing to water as Aslus. Representations were made to GHQ – instructions now received that Bedouin are to be given minimum amount of water necessary and then directed on Ain Murra or AIJA.\n\n1600 Report received from Asluj that unless 2 regiments of 2nd LH Bde are sent to Khalasa to camp and water there will not be sufficient water for the division at Asluj.\n\n1855 In accordance with above, horses of two regts ordered to be sent to water at Khalasa tomorrow morning, returning Asluj dawn on 29th\n\n1740 Report received from NZMR Bde that enemy have left 720 and are on line 820 – 810 – 790. Infantry and 3rd LH Bde are operating to north of Auckland Regt.\n\n1845 GSO 1 returned from car reconnaissance to junction of roads N\/W1.\n\n \n\n2000 2nd LH Bde report that patrol on Arara road has returned and reports 1 regt. enemy cavalry at and around Arara.\n\n2355 1st LH Bde unable to get communications with their forward squadron at 840. All quiet on night outpost line.\n\n28\/10\/17 Esani – Asluj\n\n0300 5th Mtd Bde took over Khalasa and Ghalyun from ICC Bde\n\n0940 orders for following reconnaissances sent out – 2nd KH Bde – W. Shegeib El Soghair – 5th Mtd Bde to ascertain of there are any enemy S of Ras Ghannam – Ras Hablein\n\n28\/10\/17 Esani\n\n1st LH Bde ascertain if enemy still holding posts E of Abu Shar and NE of 960. 2 ½ miles east of 840.\n\n1212 1st LH Bde outpost reports enemy movement at 1170 N of 2nd A in G El Naam and enemy cavalry about Beersheba.\n\n1315 Water situation at Asluj now as follows – In reserve 13000 gallons. Developed wells make 2000 gallons an hour. Two wells still being developed. Supply will give by tomorrow morning one drink per day per horse for the whole division.\n\n1415 orders received from Des Corps for Divn. less two Bdes to move to Asluj tonight. 1st and NZ Bdes to move to Khalasa. Orders in accordance with above were issued.\n\n1445 Divisional Commander left for Asluj\n\n1510 Hostile aeroplane reconnoitred Esani and flew off NE\n\n \n\n1430 Report from RFC – No movement or concentration\n\n1531 5th Mtd Bde reports from Ibn SAIID states redoubts E of Abu SHAR occupied. Odd Turks on trench line about 1070 and squadron moving N near there. Tents seen at Ras Hablein\n\nAsluj\n\n1705 Div. Commander arrived and DHQ opened ¾ mile W of Asluj mosque.\n\n1825 Report recd from 2nd Bde that reconnaissance of W. Shegeib Es Soghair area reports only seeing 2 small enemy mtd patrols which retired towards Arara.\n\n1920 Orders sent to 1st and NZ Bdes at Khalasa that in case of attack on Asluj they will be prepared to move to that place, both under command of Br Gen Cox.\n\n2040 Report received from 2nd LH Bde that reco of today has returned and \n\nreport trenches on Ras Hablein and Ras Ghannam occupied\n\n2115 orders read from Descorps that Div will concentrate at Asluj tomorrow no movement to take place before 1700.\n\n29\/10\/17 Asluj\n\n0715 orders as above sent to Anzac units at Khalasa. BGen Cox to command and issue orders for 1st LH Bde to relieve day observation posts of 2nd LH Bde at G El Shereif and pt 1240 N of Asluj by 0600 tomorrow 30th. 2nd LH Bde to still find southern day post\n\n2030 Arrangements made for one troop NZMR Bde to prepare crossing over railway tomorrow where road M crosses it.\n\n2115 All troops in from Khalasa – concentration completed.\n\n30\/10\/17 Asluj\n\n0545 All clear reported\n\n1240 Special instructions issued to No 11 LAM battery to move out before march of column tonight, and take up position on road on N slopes of Gebel El Shereif to protect flank of column (see Appen)\n\n1310 Instructions issued to 8th LH Regt that their position in column tonight is in rear of NZMR Bde.\n\n1430 Conference of Bde & Div. unit commanders held at DHQ when points in connection with forthcoming march and deployment were discussed\n\n1430 March orders for tonight issued (Appen).\n\n1533 orders recd. From Descorps that D troops 1st Field Squn. will remain at Asluj until receiving station moves – and will be responsible for its protection\n\nON THE MARCH\n\n1730 DHQ closed down – Troops commenced to move into their positions for the march\n\n2000 Last troops Anzac Divn clear of Asluj station.\n\n31\/10\/17 South OF Kashim Zanna\n\n0645 Situation: Head of NZMR on 1420-1A30 south of Iswaiwin and pushing forward – 2nd Bde can be seen just reaching Bir El Hammam. 1st LH Bde in reserve. Enemy can be seen in trenches about 1070. About 2 squns cavalry moved out of Beersheba in direction of Khel Omry\n\n0645 NZMR Bde ordered to push on to Kashim Zanna.\n\n0748 Situation: NZMR Bde on Kashim Zanna and beyond – 2nd LH Bde can be seen moving towards 1130 – 8th LH regt moving down track W1 and keeping in touch with our left\n\n0830 NZMR Bde report they are in touch with 2nd Bde on their right.\n\n0855 About 200 enemy cavalry and some transport and guns can be seen moving up Hebron road opposite Tel El Saba\n\n0855 NZ Bde holding 1130 – Kashim Zanna – 1180 – 2nd LH Bde on their right near Hammam\n\n0945 Aeroplanes dropped message at DHQ reporting large camp mounted men at Tel El Saba\n\n0935 2nd LH Bde report they have made good their first objective – orders issued for them to advance on Sakaty at once\n\n1005 Situation: 2nd LH Bde leading troops seen moving rapidly over ground 1150 – 1190 – Patrols beyond the Wadi Hora about 1180 and moving on Tel El Sakaty – NZ Bde crossing Wadi El Malah about pt 1130 and swinging to left to attack Tel El Saba. 1st Bde in reserve.\n\n1050 2nd Bde ordered to move on their objective with all speed.\n\n1117 2nd Bde report enemy is holding high ground to south of Sakaty.\n\n1140 2nd Bde report country towards Sakaty very difficult – 5th regt being sent\n\nSouth of Kashim Zanna\n\nround to endeavour to find enemy’s left flank and battery getting into position\n\nOne squadron enemy cavalry on high ground E of Wadi Kashim Zanna.\n\n1150 2nd Bde report having reached 1st objective – 5th and 7th regts moving to occupy high ground which dominates it. our guns shelling enemy positions\n\n1202 2nd Bde reports having captured 47 prisoners 31 of which were taken by 2 men also 8 horses and 8 waggons loaded with forage.\n\n1240 NZ Bde report having reached line road junction ¾ mile N.E. of 1st Ls of Um Gutein 1st L of Tel El Saba. CMR on right AMR on left.\n\n1255 NZ Bde report AMR cooperating with 1st LH Bde in advance against Tel El Saba.\n\n1310 NZ Bde report that all horses were watered in Wadi Saba\n\n1330 2nd Bde report 5th and 7th regts have pushed well on to high ground NE of Sakaty. Many pools of water in Wadi el Malah.\n\n1345 7th Mtd Bde report their battery shelled enemy in mass on N slopes Ras Ghannam. \n\nReports received from 2nd Bde that there is sufficient water in small water south of B of BIR Hammam for 3 Bdes. Also good supply in W. Hora.\n\n1400 3rd LH Bde also B batty HAL having come under Anzacs arrangements made for it to crossWadi Saba at NZ hqrs and cooperate with 1st and NZ Bdes at 1530 – a NE direction on attack on Tel El Saba. 1st and NZ Bdes to push attack on forward position in meantime. Descorps orders are that GOC Anzacs will gain possession of Tel El Saba as soon as possible.\n\n1420 1st Bde report 1 squn. enemy cavalry leaving Beersheba in N direction\n\n1430 DHQ shelled with HE by enemy field guns\n\n1445 2nd KH Bde report three enemy guns put out of action by our battery. Our force in high ground N of Sakaty held up by 5 M Gs. 5th and 7th regts have gained objectives and are astride Hebron\n\n31\/10\/17 contd \n\nroad and endeavouring drive enemy off high ground to North.\n\n1500 it was observed from DHQ that Tel El Saba had fallen. Orders were issued for advance on 3rd objective by division plus 3rd LH Bde group and advance to commence at 1600 – Right section 3rd LH Bde 1020 – 970 inclusive. 1st Bde 970 to mosque inclusive. NZMR Bde to remain in support about Tel El Saba. 2nd LH Bde to be responsible for the rear and for transport part of which is on Bir Arara road. GOC and GSO1 now moved forward to Tel El Saba. Here it was found that hill had finally been carried by bayonet charge by Auckland MR Regt. 120 prisoners (47th regt) and 4 machine guns had been captured.\n\n1515 Enemy commenced shelling Tel El Saba and this continued throughout afternoon.\n\nAttack on Beersheba proceeded according to plan town being finally secured by charge of 4th LH Bde on our left several hundred prisoners and 9 guns being taken. 1st LH Bde also took 50 prisoners\n\nTel El Saba\n\n1800 Remainder of DHQ moved to Tel El Saba, being attacked by hostile aeroplanes with M.G. fire en route.\n\n2000 3rd LH Bde report hostile aircraft dropped 9 bombs on 9th regt at 1700 today causing severe casualties.\n\n1758 orders arrived re dispositions for tonight –\n\n17\/10\/17 \n\n0930 GOC visited Jaffa\n\nCamel co sent out to fill gap between 1st Bde and Yeo div.\n\n2000 orders for taking up outpost line PT 222 Hefr Ana – 275 – Summeil – Sea issued.\n\n3 sectors right to left 2nd 1st N.Z. 2 cos No 4 Battn ICC and cars in Div. Reserve.\n\nNZ occupied Sarona without opposition and on to Summeil\n\n18\/11\/17 22nd Bde occupied SHILTA – 8th Bde Beit Ur El Tahta without opposition\n\n18\/11\/17 085 S 25C\n\n0710 NZ Bde report – Patrol arrived Jerisheh at 0630 reports no sign of enemy. Patrol to Ford Y18 reports 1 troop enemy cavalry in sand dunes A00 north of prel.\n\n0820 1st Bde report 1 regt now on support line Pt 222 to Kefr Ana\n\n0825 2nd LH Bde report 1 regt moving forward to take up support line 222 to Kefr Ana to relieve regt 1st Bde. Remainder of Bde moving at 1200.\n\n0925 NZMR Bde report – B.H.Q. moving to Jaffa 0930.\n\n0950 1st LH Bde report patrol to 205 and Mulebbis have made good village. No sign of enemy but inhabitant reports 6 taburs and 3 guns moved north at 0130","7":" and are entrenching 4 kilometres to the north. 6 oil engines 40 wells water laid on in village. 500000 kilos of hay and 144 kilos of bread. Bridges over N. el Auja supposed to be mined.\n\n0900 GOC left to visit NZMR Bde HQ \nat Jaffa\n \n\n1057 1st LH Bde report 13 div moving to Yazur 1100\n\n1230 No 3 Light Car Patrol reported at DHQ for duty\n\n1300 1st LH Bde report move to Yazur now completed.\n\n1425 1st LH bde report that at 1120 Wilhelma – Kefr Ana and Yehudiyeh were all clear. Advanced regt (3rd) in touch with two troops enemy cavalry 1 mile NE Rantieh railway station. At German village of Wilhelma straw stacks and good well 12 feet diam. 80 feet deep oil engine 4000 gals per hr. Reservoir 30 feet square 15 feet deep full of water.\n\n1620 Orders for patrols to move forward 8 miles tomorrow recd.\n\n1805 Descorps Operation O. No 8 recd Amwas and Latron to be attacked by 75th Div tomorrow as enemy are retiring from Jerusalem . ICC Bde (less batty) to be attached to Anzacs tomorrow. Strong points to be constructed along present outpost line\n\n1835 orders issued in accordance with above.\n\n19\/11\/17 \nOther moves\n \nYeo div and Infy\n \n\n8th Bde to move from Urel Tahta via Bahania and Ram Allah to Bireh where position cmdg road will be taken up and endeavour made to cut off enemy retiring from Jerusalem.\n\n23rd Bde Shilta to Ain Anik ready to support 8th\n\nRemainder of Yeodiv east through Beit Ur El Tahta\n\nInfantry\n\n75th Div to Latrun – Amwas\n\n54th Bde each to Ludd – Ramleh – Abu Shusheh and detachment at Beit Dejan\n\n52nd – 155 Bde picquet heights south of road Berfilya – Beit Likia as far as L 16 – other two Bdes march from Ludd and Ramleh to Beit Likia\n\n18\/11\/17 contd 085 S 25 C\n\n1600 2nd Bde on line ordered\n\n2120 NZMR Bde report enemy strength about 100 with MGs holding high ground north of bridge in 17 & 18. 50 enemy infantry at Sheikh Muannis with MGs. Two explosions heard at dusk in direction of Khirbet Hadrah. Believed bridge was blown up\n\n2230 Situation report recd from Yeo Div – 8th Mtd Bde occupied Beit Ur El Tahta and 22nd Bde SHILTA\n\n19\/11\/17 085 S 25 C\n\n0015 Orders issued as follows and 7th Bde & OCC Bde come under Anzacs tomorrow at 0800am. Following line to be taken up by 1600 – NZ. Sea along N of Nahr el Auja to east of bridge – 1st Bde thence to Yehudiyeh inclusive – 2nd to BUDRA inclusive – 7th to Nalin. ICC Bde in reserve.\n\n1000 NZ report infy & M.G.s in positn. covering ford Y18 and entrenched 400 N of bridge Z17 \n\n1025 2nd LH Bde report Rantieh all clear small enemy redoubt at Nebi Tari. Two troops enemy cavalry in high ground. & in touch with 1st Bde patrols N of Yehudiyeh\n\n1045 GOC left to accompany Corps Cmdr to Jaffa\n\nDuring the day GOC and Corps Cmdr visited Jaffa and NZ MR Bde.\n\nEnemy were in some strength on northern bank of Nahr Auja.\n\nNZ Bde were in contact with him throughout the day. They did not cross bridges and orders were issued whereby line held by NZ will run along south side of river instead of to north as ordered last night.\n\n1530 ICC Bde marched in and bivouaced north of DHQ.\n\n1720 orders as above wired to all concerned. Also for patrols tomorrow and for ICC Bde to be ready to take over line held by 1st Bde and part of that held by 2nd Bde. NZ have special instructions to cross river Auja tomorrow if opposition not strong. 2nd Bde right is in touch with left of 7th but no direct communication yet between DHQ and 7th\n\n19\/11\/17 contd. 085 S 25 C\n\n1730 7th Mtd Bde report Bde in position on line Nalin – Budrus in touch with 2nd LH Bde on left and Yeodiv on right.\n\n20\/11\/17\n \n\n1745 orders recd from Descorps for ICC Bde to be used in part of line nearest Ramleh owing to question of drawing supplies.\n\n20\/11\/17\n\n0840 Orders recd from Descorps whereby one Bde Group 54th Div will today take over portion of line now held by 2nd LH Bde. 2nd LH bde will on relieve remain in reserve in present bivouac but for day reconnaissance work will place one regt at disposal of 54th Division. ICC Bde to remain in reserve under Anzacs – compy. now with NZ Bde to rejoin its battalion. 7th LH Bde to come under direct orders Descorps at 1400 – moves to be complete by 1530\n\n0915 Orders in accordance with above issued to all concerned.\n\n1000 2nd bde report patrols this morning found Nebi Tari – Rantlieh and Et Tiren all clear. Wadi Abu Lejja strongly held.\n\n1300 7th Mtd Bde report they have been in touch with infantry at Berfilya. Parties of enemy totalling about 100 seen near Deir El Kuddis.\n\n1705 NZMR Bde report enemy still in position north of Nahr El Auja.\n\nDuring this afternoon GOC visited H.Q. 54th Div. and conferred about scheme to be adopted in holding outpost line.\n\n1740 1st LH Bde patrol reports being fired on from a point 500 yds NW of Mulebbis. Patrol crossed Wadi Abu Lejja moving on Ferri – Kiyeh from where they were fired on.\n\n1915 Relief of 2nd Bde by Bde from 54th Div. completed.\n\n2120 Orders received from Descorps for one Bde to return to vicinity of Esdud after watering tomorrow owing to difficulty\n\n20\/11\/17 contd 085 S 25 C\n\nof supply due to bad weather.\n\n2235 orders in accordance with above issued. 1st LH Bde to be relieved by 2nd LH Bde (less regt. At disposal 54th Div for day patrolling) and to march back after watering and bivouac at a point from which it will be convenient to draw supplies by wagon from Julis.\n\nOrders were issued today for improvement of communications in area occupied by the division to be taken in hand at once.\n\n21\/11\/17\n\n1022 2nd LH Bde report patrols have reached point 1 mile N of Neby Tari and have reconnoitred El Mezeirah. No sign of enemy. Above reconnaissances carried out for 54th Division.\n\n1040 1st LH Bde reports outpost line relieved by 2nd LH Bde. 1st Bde moving out for Esdud area at 1045\n\n1600 1st bde report they have bivouaced at point 2 miles S of Yebna.\n\n1655 NZMR Bde report enemy still occupying high ground covering bridge over Nahr El Auja Z 176. Our battery shelled enemy position from 1230 – 1400.\n\nOrders issued for ICC Bde to take over with one battn. Right section of our line at present held by 2nd LH Bde i.e. Yehudieh inclusive to 265 inclusive\n\n1710 Ten deserters (Turks) were brought in today. 7 from 76th 1 from each 119-21-143 regts.\n\n1730 2nd LH Bde instructed to reconnoitre towards fords in F14B and F4A ref sheet 13\n\nIt is proposed to move DHQ to Jaffa tomorrow. 2nd Bde H.Q. now at Yezur.\n\n1915 Orders issued that DHQ is moving to Jaffa tomorrow. ICC Bde less one battn holding line to move to bivouac 1 ½ m. S.W. of Yazur\n\n22\/11\/17\n\n0900 CRA instructed that to facilitate supply whole of Amm. Col to remain in present position\n\n1050 1st LH Bde report having reached bivouac at Sheikh Abu Jahm. 2nd Bde report 1 battn ICC relieved 7th LH regt. on outpost line at 1030 this morning.\n","8":" contd. Jaffa 071 H 17D\n\n1230 DHQ moved off and headquarters established in stone house N. end of Jaffa 071 H 17D\n\n1306 2nd bde report 5th regt patrol to Ford In Summer reports crossing held – one M.G. impossible to estimate number of rifles – patrol not able to approach within 1200 yds of ford. Inhabitants of Mulebbis state that arabs are holding the ford.\n\n1730 2nd LH Bde ordered to send one squadron to Mulebbis to be in position from 0800 to 1500 tomorrow to cover passage of civilians from Jaffa to Mulebbis and back \n\n1815 ICC Bde (less 1 bn. holding line Hong-Kong batty. with yeodiv. Yehudieh to pt. 265) arrived at bivouac about 1 ½ miles S.W. of \nYE\n Yazur.\n\n1835 Patrol from 7th regt today having returned reports enemy observed in Naha El Auja from 084 F 15 D \nenemy were observed in\n screen were fired on by M.G from vicinity of Keibuta. Main body of patrol fired on from ford itself (F14). One horse of patrol was killed.\n\n23\/11\/17 0830\n \n\n23\/11\/17\n\n0830 \nP\n 2nd LH Bde report covering sqn in position occupying in line 500 yds N of Mulebbis to Tell Abu ZEITOUN\n\n1040 Report recd from AFC that at 0830 today – line of trenches 400 x south of \nLEJJA\n Tabsor running WNW to F 27. About 150 shelters behind this line. Large camp 2000 men immediately NW of Mulebbis. 300 men in Nebi Tari.\n\n1050 161st Bde Group (54th Div) en route for Selmeh came under orders of Anzacs.\n\n1125 2nd Bde instructed to report on supplies at Wilhelma.\n\n1345 54th Div wire they propose sending patrol 6th LH Regt tomorrow to ascertain if Kulat Ras El Ain is clear.\n\n1245 2nd LH Bde report patrol to “ford in summer’ reports crossing\n\n23\/11\/17 contd. Jaffa 071 H 17 D\n\nstill held by enemy. Enemy also have small post along northern bank of wadi.\n\n1500 161 bde group (less 2 battns.) concentrated at Selmeh 071J28a\n\n1750 orders issued for 2 battns 161 Bde \ngroup less 2 battns\n supported by one Battn. RFA one Batty 4.5 hows. to take over that section of front line at present held by NZMR Bde. On relief NZMR Bde will concentrate in the vicinity of Sarona.\n\n2020 2nd LH Bde ordered to send patrol at daylight tomorrow through Mulebbis to ascertain if enemy still north bank in vicinity of Ferrekhiyeh.\n\n24\/11\/17\n\n0050 Instructions received from Descorps that in order to make enemy believe that we intend to advance further north along the coast Anzacs will today endeavour to secure a bridge-head over Nahr El Auja. Advance to be preceeded by bombardment of enemy posts covering crossings selected\n\n0140 Warning order in accordance with above issued – NZMR Bde to carry out this operation – points to be crossed to be ford \nZ\n Y18 Mill Z21 and Bridge Z17\/18\n\n0750 Following plan for above operations submitted to Descorps: as soon as NZ Bde relieved by infantry demonstration as above to commence. NZ to push strong party over ford in Y18 – this force to then turn east with view to driving enemy from Sheikh Muannis and occupying Khurbet Hadrah. Light Armoured Cars to cooperate. Strong patrol from 2nd LH Bde supported\n\n24\/11\/17 contd. Jaffa\n\nby a battery to also cooperate towards Ferrekhiyeh. Artillery of 161 Bde group to cooperate by firing on enemy known to be in position north of crossing in Z 17 CD.\n\n0905 Orders received from Descorps that 13th battery (Inverness) now with 1st LH Bde is to be ordered up to the front tomorrow 25th. GOC RA Descorps is issuing orders for 2 6 inch hows to be in position in Anzac sector as early as possible, and two 60 prs in right sector to be ready to move to left sector at short notice\n\n0925 Instructions in accordance with above issued to 1st LH Bde, 15th Bd.\n\n1000 orders in accordance with plan sent to Descorps issued. Should operations be successful NZMR Bde will hold a line for the night covering bridge in 2 17 c d Mill in Z 21D and ford at mouth of Nahr Auja.\n\n1045 161st Bde group instructed that when mounted troops have made good their objectives they must be prepared to push forward infantry posts and machine guns to hold crossings.\n\n1130 54th Division instruct that two 6 inch hows of 189th H.B group are now moving to take up position in LEFT SECTOR near Sarona.\n\n1235 54th Division advise that No 1 Section DAC is being ordered to proceed to Selmeh at once for replenishment of 18 prs and 4.5 hows. Heavy guns replenish themselves by tractor from T 17 D south of Yebna.\n\n1236 G.O.C. left HQ to establish Advanced DHQ at 070 Z 27B\n\n1300 Situation: NZMR Bde approaching FORD at mouth of Nahr Auja, with our artillery supporting (Somerset Batty R.H.A.) Enemy have opened rifle fire from position covering FORD. Our 4.2 howitzer battery is shelling high ground immediately N of Bridge in Z 17\/18.\n\n29\/11\/17 contd. Jaffa\n\n1400 By 1400 NZMR Bde having crossed ford at mouth of river had occupied Sheik Muannis and advanced well up beach, enemy cavalry retiring Northwards.\n\n1400 2nd Bde report \nour\n our guns have shelled Tel El Mukhmar where three troops enemy cavalry were reported this morning but no movement was visible. Now shelling wadi and high ground north of 1st R of Ferrekhiyeh. B.H.Q, at Mulebbis.\n\n1405 N.ZMR Bde report one squadron of theirs is moving North to guard left flank – 20 enemy observed on Tell Er Rekkeit.\n\n1500 Our 4.2 hows have been shelling enemy post at BRIDGE Z 17\/18. NZ Bde report two regts are moving to seize Khurbet Hadrah at 1530. Somerset Batty is moving forward to support this move.\n\n1543 NZMR Bde troops reached Khurbet Hadrah. Troops from NZHR Bde now advanced \nagain\n from Khurbet Hadrah on Bridge Z 17\/18 when enemy post there surrendered – 1 Machine Gun one Lewis Gun and 24 prisoners being taken. 5 other prisoners were taken near Sheikh Muannis. All prisoners belonged 31st regt 3rd Div. They stated that the division (1200 bayonets and 2 guns was about Tabsor)\n\n1545 orders giving dispositions for tonight issued: 1\/4th Essex battn holding bridge head Z 17 C\/D with two cos. 1\/6th Essex battn holding position about Sheikh Muannis to cover crossing in Z 21D with two coys. NZMR Bde to have post of one squadron in front of infantry post at Kh Hadrah, one of a squadron in front of infantry post at Sheikh Muannis and one covering ford at mouth of Nahr El Auja. Squadrons to patrol ground between each other during night. Post at Hadrah to patrol gap between their right\n\n24\/11\/17 contd. Jaffa\n\nand Nahr El Auja. Patrols to be pushed forward at dawn for at least 2 miles. CRE to at once commence making crossing at Mill in Z 21D and \ncross\n pits for infantry and crossing in Z 17\/C\/D to take artillery. Outpost line hitherto held by NZ bde will also be held by 161st bde\n\n1600 ICC Bde informed that there is no objection to move \nd\n of ICC Bde to Ibn Ibrak tomorrow.\n\n1605 NZMR Bde report that squadron demonstration against Ford In Summer F 14B reports enemy M.G. just N.E. of Ford\n\n1610 2nd LH Bde report one squadron pushing forward towards Wadi North of Mulebbis but it is intended to withdraw demonstration troops to Yazur at dusk\n\nGOC went forward from Advanced DHQ bridge Z 17\/18 – Bridge had been destroyed by enemy. Advanced DHQ closed.\n\n1720 2nd Bde ordered to withdraw to bivouac – (less troops holding outpost line)\n\n2015 2nd Bde report that during the day little movement was noticed North of Mulebbis though Wadi was held at first in some strength. Battery made good shooting at various indifferent targets.\n\n2100 NZMR Bde informed that after daylight patrols have reported all clear posts of NZ may be reduced to one squadron in all, which will find small standing patrols pushed well out to North and East. Ford In Summer to be investigated and report rendered.\n\nThe NZ Bde report that the opposition today at ford at mouth of river consisted of about 20 mounted men who retired rapidly towards El Jelil\n\n2238 54th Division advise that 5th and 7th Essex battns will move to\n\n24\/11\/17 Jaffa\n\nSelmeh tomorrow and come under orders of 161st Bde.\n\n2330 orders from Descorps that operations tomorrow are to be continued with object of consolidating hold on bridgehead already secured, raiding hostile posts at Ferrekiyeh and Keibuta Ford and reconnoitring enemy’s dispositions in area Ras El Ain – El Mirr – Wadi Abu Lejja.\n\nToday general principles for the defence of the line Ludd – Jaffa as laid down by Descorps were issued – the left section of the defence – (Yehudieh exclusive to the sea) is under command of GOC Anzacs and is divided into four subsectors. For details see Appendix.\n\nAppendix\n \n\n25\/11\/17\n\n0005 Orders based on those received from Descorps at 2230 issued to all units\n\n0015 In accordance with instructions received from Descorps – 1st LH Bde ordered to march to bivouac area at Ramleh arriving 28th instant. Inverness Battery to join Bde there. Bde will be under GOC 54th Division\n\n0445 NZMR Bde report enemy strength uncertain advancing towards Khurbet Hadrah. A good deal of rifle fire.\n\n0640 NZMR report enemy strength several hundred on high ground north of Khurbet Hadrah. One regiment is pushing forward from Ford Y 18C against enemy’s right flank. Battery getting into position to shell enemy. Remainder WMR moving down to Bridge to support outpost squadron\n\n27th \n0930\n ICC report 11\/2 battn \nRantieh\n Ras El Ain to Mulebbis. Can see batty shelling 54th – It is south of Rantieh\n\n25\/11\/17 \ncontinued.\n Jaffa\n\n0635 161st Bde report “Mounted troops have withdrawn and enemy occupying their position\". A good deal of rifle fire. 270th Bde RFA orders it to come into action in yesterdays positions\n\n0715 Enemy reported to have half company extended across squares X 27 28 29 and about ½ company in support. Two enemy guns have fired.\n\n0750 NZ report Enemy holding building and wood east of Khurbet Hadrah in strength square Z 12 B. NZ ask for assistance of artillery of 161st Bde.\n\n0820 2nd LH Bde ordered to move \nwith\n battery and one regiment up to neighbourhood of PT 275 ready to deal with any enemy move in the direction of Mulebbis.\n\n0825 NZMR Bde report enemy entrenching in X 31 D. 1000 enemy reported around El Velil.\n\n0830 NZMR Bde report enemy have captured Khurbet Hadrah\n\n1840 161st Bde report: Khurbet Hadrah and vicinity being shelled by one enemy battery. Two coys and one squadron holding Khurbet Hadrah 2 ½ coys. and one squadron holding Sheikh Muannis. Situation satisfactory.\n\n0852 161st Infantry Brigade report Khurbet Hadrah position heavily shelled by three enemy batteries including heavies. Infantry have fallen back slightly but are holding on north of river. Our artillery now in action 4th Essex will counter attack with whole battalion. 6th Essex will counter attack from Sheikh Muannis.\n\n0920 ICC Bde HQ at Q 1 B\n\n0930 NZMR Bde report two enemy guns 900 yards NE of Tel El Rekkeit. One compy. enemy infantry about Rekkeit.\n\n1000 Instructions received from Descorps that Corps Cmdr. does not wish infantry to go beyond the line Khurbet Hadrah – Sheikh Muannis\n\n25\/11\/17 contd. Jaffa\n\nbut high ground covering the Ford at mouth of Nahr El Auja and also Sheikh Muannis must be strongly held. Infantry not to become heavily involved in a position from which it would be difficult to withdraw. Our role is still that of a demonstration.\n\n10000 ICC Bde ordered to have one battalion standing to ready to move at a moments notice .\n\n1015 Report received from 161st Infantry bde timed 0920 that 4th Essex are still holding high ground covering bridge in Z 17 C?D.\n\n1015 Report recd from NZMR Bde timed 0954 that strong force of enemy are advancing along flat ground between Khurbet Hadrah and Sheikh Muannis, also from direction of El Makkras. They are apparently preparing to attack Sheikh Muannis timed 1012 and FORD square Z 21 B\n\n1030 161st Infy Bde report following from Sheikh Muannis– Large bodies believed to be cavalry and infantry advancing from NE distance about 2000 yards. Our artillery warned but range is long.\n\n1030 observation post half mile West of Mulebbis report enemy convoy moving towards Jerisheh. Artillery advised\n\n1030 NZMR Bde report Sheikh Muannis has been captured by enemy.\n\n1040 Aeroplane report recd: Concentration of troops approx 2000 – 3000 in A 28 B (084) 200 men at JILJULEH and 500 at Kefr Saba.\n\n1055 ICC Bde ordered to move battalion which is standing to to Selmeh at once to be in Divisional Reserve.\n\n1100 161st Infy Bde advise: our artillery ordered to shell Sheikh Muannis\n\n1100 2nd LH Bde report no enemy movement visible North or East of Mulebbis. 5th Regt holds usual outpost line with patrols\n\n25\/11\/17 contd. Jaffa\n\nin Mulebbis. 6th Regt on way to join Bde which is about a mile North of 275 (BHQ.) Ayrshire Batty. will seek target.\n\n1225 orders issued as follows: 161st Bde will hold on to present line at all costs. BGC 2nd LH Bde to move up one regt in rear of bridge in Z 17 C\/D to replace Auckland M.R. who will rejoin their Brigade. 2nd LH Bde will be prepared to support the Infantry line in case of attack – from Z 30 D up to and excluding the Nahr El Barideh with his whole brigade. NZMR Bde will support the infantry line thence to the sea with whole of Bde.\n\n1230 Report received from 2nd LH bde that observation post half mile W of Mulebbis reports at 1200 – enemy convoy moving towards JERISHEH.\n\n1255 Report received from 161st Bde: Situation at 1115 – Enemy in possession of Kh Hadrah and Muannis. Strong Turkish attack now developing against the Ford. 4th and 6th Essex now in course of reoccupying former positions S of river. Am not certain whether bridgeheads at Dam and Mill are still held. Turkish force actually seen in numbers 5000 approx.\n\n1330 Descorps advise 7th Mtd Bde will move at once to Ayun Kara and on arrival will come under orders of Anzac Mounted Division.\n\n1335 2nd LH Bde report situation unchanged – 6th LH regt has arrived from 54th Div\n\n1410 Situation is quieter our guns opening fire when favourable targets appear. Our artillery is located as follows: OP at Z 30. Howitzer Batty 4.2 and 6B Field Batty 18 prs. 270th bde F25C – 2nd Field batty J 6 C. 6 inch Hows J 2 C 13 pr battery 750 yds south of Summeil. and LH bde 13 prs. in support vicinity Point 275. Inverness Batty will on arrival be placed in reserve in H18\n\n1440 161st Infy bde report received timed 1305 that 5th and 7th Essex regts and one section R.E. arrived at Sarona.\n\n25\/11\/17 Jaffa\n\n1505 Report received from 7th Mtd Bde that they march off at 1445\n\n1540 Orders sent to 7th Mtd Bde that they will remain in vicinity MAYUN Kara until further orders.\n\n1645 Orders giving dispositions for tonight issued to all units: No 1 Sub-section held by ICC Bde less 1 Battn in Div Reserve at Selmeh. No 2 Subsection 2nd LH Bde. No 3 Subsection & No 4 by 161st Infy Bde. 2nd LH Bde to remain in present position (less regt holding line in No 2 subsection) ready to support in case of attack in either No 2 or No 3 Subsection. NZMR Bde as soon as infy have taken over line in No 4 subsection will be concentrated in rear of present BHQ and be ready to support in case of attack on No 4 Subsector. Inverness battery will be in DHQ reserve in present position. CRA left Sector to have night lines laid out to cover crossings. 161st bde to strongly entrench line they are now holding. Wadi Bank to be carefully patrolled. Patrols to be sent N and NE by 2nd LH and ICC Bdes as soon as it is light enough to see. Whole force to stand to arms at 0400 from which time reserves will be ready to move at ½ hours notice.\n\n1730 2nd LH bde report situation unchanged \nat\n Bde shelled just before dark by very long range gun but no casualties. 7th regt relieved AMR. 5th regt holding outpost line 6th regt in reserve.\n\n1745 ICC bde report situation 1700: No movement to north of our line. Large enemy convoy observed moving E from a point NE of 265\n\n1955 7th Mtd Bde report their HG are located ¾ mile N of Ayun Kara.\n\nover - *\n \n\n2000 Orders from Descorps to place one squadron at disposal of GOC 54th Div tomorrow and until further orders for patrolling in place of the regiment which rejoined 2nd LH Bde today (6th Regt)\n\n25\/11\/17 contd. Jaffa\n\n2027 Advice received from Descorps that 1 section 60 prs is leaving Safiriveh at 0500 tomorrow for left section where it will come under orders GOC Anzacs\n\n2050 161st Bde report relief of two Battns in front line by remaining two battns who arrived today completed\n\n* 1955 Orders recd from Descorps that 7th Mtd Bde north of Avun Kara will not be moved without reference to Corps HQ. Anzacs to warn 1st LH bde to be prepared to move at short notice after morning watering.\n\n2020 Above sent in cipher by wireless to 1st LH Bde\n\n2315 5th Essex regt. holding No 3 sub-sector report movement enemy cavalry estimated 50 towards bridge Z 17 C D.\n\n26\/11\/17\n\n0010 161st bde report about 100 enemy digging in on north side of river at about Z 22 A O 2 otherwise all clear.\n\n0435 161st Bde report patrol of 8 enemy approached bridge Z 17 D. One killed remainder dispersed.\n\n0650 161st bde asked to at once reconnoitre all fords and crossings.\n\n0720 Situation: Enemy guns firing at Ford at mouth of Nahr El Auja. Our guns firing on target West of Sheikh Muannis. Reconnaissance of Ford In Summer now being carried out.\n\n0735 Our guns have fired on infantry coming forward West of Sheikh Muannis. Enemy scattered and made for farm – guns now shelling farm. 161st Bde report post on ford about Y 18 D report 200 enemy seen 0550 on sand ridge 45° 2000x & enemy went back into trenched on that ridge.\n\n0830 2nd Bde instructed that squadron allotted to 54th Bde must be in its area by 1600.\n\n0915 Aeroplane reconnaissance report received – 0600 – 0800. Trench work about Tel En Nuriyeh – Sheikh El Ballatah and along Wadi from C 24 – C 10. Four lines in all facing generally SW. At least 3000 Turks in trenches and crowded in WadiS in area East of Dam – El Tireh road. 4 gun emplacements in C 16 central occupied.\n\n200 cavalry at El Jelil – Sheikh Muannis appeared deserted.\n\n0916 2nd LH Bde report Ford In Summer appears to be strongly held. Patrols reconnoitring towards Ferrikiyeh and Ras el Ain.\n\n1145 ICC Bde reports observation post near pt 265 reports considerable movement of troops near Khurbit Shaireh. 3 companies infy with some camel transport and scattered parties of cavalry moving from direction of Mulebbis and Fejja through Nebi Tari SE into the hills.\n\n1220 Guard from NZHR Bde ordered to take over Wagner’s Engineering factory.\n\n1230 Report received from 161st infy Bde that bridge Z 17 D was shelled with 77,, guns at 1030\n\n1245 Report received from 161st Bde that small parties of enemy were approaching bridge Z 17 D. Artillery have been warned\n\n1415 161st bde report patrol reports small post dug in about 150 yds north of M in Mill square Z 22 A\n\n1427 2nd Bde Ferrekiyeh patrol reports – Reached pt 200 yds south of MILL on Wadi. Observed 2 troops enemy cavalry at Mill. Observed no infantry. Inhabitants report about 80 in wadi N of Mill. Machine gun and 10 men in MILL. 80 infy at El Mirr.\n\n1100\n 27th Destroyers cooperated.\n\n1500\n Air raid on Jaffa\n\n26\/11\/17 contd Jaffa\n\n1450 161st BDE report pontoon bridge, which is complete and will take infantry in file is completely denied to enemy by our posts on South Bank. Muannis unoccupied except by natives.\n\n1700 orders issued – No change in dispositions. Stand to arrives at 0400. Wadi to be carefully patrolled – Daylight patrols to be pushed out to N and NE.\n\n1710 Arrangements completed with senior Naval officer whereby a trawler with searchlight will be off Nahr El Auja from the time the moon sets and in event of heavy firing will endeavour to light up enemy.\n\n1720 2nd LH Bde report BHQ shelled by 5.9 at 1700. Major Bryant MC cmdg. Ayrshire Batty killed. 1 OR killed 1 wounded. Shelling was observed from DHQ Tower\n\n1820 Advice received from Descorps that 7th Mtd Bde moves tomorrow to Zernuka and comes under YEODIV. 1st LH Bde (less 1 regt and batty) moves from Esdud to Avun Kara and remains in corps reserve. 1 regt 1st Bde moves Esdud to Ramle & comes under 54th Div. relieving squadron 2nd LH Bde which rejoins 2nd Bde\n\n1950 2nd LH Bde instructed to have standing patrol not less than one troop in vicinity of I at Zeitung watch Ford in Summer and connect with infantry patrols from 161st Bde moving along S bank of Nahr El Auja east of bridge. If sufficient cover available patrol to remain in observation after daylight. After daylight tomorrow the regt in support of No 3 Subsector can be withdrawn and concentrated in vicinity of present BHQ.\n\n2200 161st Bde report enemy reported dumping material about\n\nG 22 A 11. Artillery have been asked to fire a few rounds. Otherwise all clear.\n\n2250 161st Bde report enemy digging in Z 22 A and eastwards. Artillery advised\n\n27\/11\/17\n\n0010 161st Bde report enemy digging in\n \n\n0310 161st Bde report enemy hammering and digging in Z 20 A 8 4 with strong covering party on N bank of river. Artillery informed. Post at bridge report enemy apparently cutting down trees and dragging towards bridge.\n\n0600 Situation unchanged. Our guns have been shelling ground between Sheikh Muannis and Nahr Auja. Enemy guns shelled beach at ford near mouth of river.\n\n0612 2nd LH Bde report that Ford In Summer was reconnoitred during night and saw no sign of enemy there.\n\n0630 ICC Bde report no movement observed on their post during night\n\n0815 ICC Bde report their line shelled by a few 4.2 shells at 0745. Enemy are shelling 54th Div. line with shrapnel and H.E. east of Yehudieh\n\n0815 54th Div report Turks have advanced during night and are holding line from Railway to Rantieh. Their right not yet located. Strength unknown. Slight M.G. fire on posts near German Colony.\n\n0845 By arrangement with Royal navy – two destroyers are now moving north from Jaffa and will endeavour to shell high ground and trench north of river.\n\n0920 Inverness Batty RAA ordered to march to No 1 Subsector.\n\n0925 2nd Battn ICC at Selmeh in Div. Reserve ordered to report forthwith to ICC Bde.\n\n0930 7th Mtd Bde advise that they move off from Avun Kara at 0930 today.\n\n0930 161st Bde report small enemy party crossed Ford In Summer and have been allowed to come within 300-400 yds of our post in Z 17 D. They are now under our fire.\n\n0940 ICC Bde instructed that until further orders the left of their subsector will be extended up to and including O 8 B.\n\n0950 2nd LH Bde Ferrekiyeh patrol reports that place more strongly held than yesterday. One regt cavalry and 300 infy moving southward in vicinity of Ras El Ain. Patrol was shelled through Mulebbis. 2nd Bde reports our outpost line and camel line shelled by four 5.9 guns and one batty 77mm. Inhabitants of Mulebbis state large force ot Turks approaching.\n\n1010 161st Bde report5th Essex report enemy strength one battalion moving towards Mulebbis from Ras El Ain. Also one battalion and one battery seen moving south from Rantieh.\n\n1140 161st Bde report that 20 civilian refugees at their H.Q. report Mulebbis full of Turks\n\n1145 54th Div report 200 enemy advancing from DEIR TUREIF. 2500 enemy extended from El TIREH to 500 yds W of Rantieh. 3 enemy batteries shelling German colony E of Yehudieh.\n\n1200 161 Bde report refugee from Mulebbis reports at 0800 considerable enemy force with artillery arrived from Ras Al Ain and now moving on German Colony Wilhelma. \nIntermittent shelling of\n \n\n1212 2nd LH Bde report intermittent shelling of their right flank by 5.9 guns and 77m.\n\n1220 54th Div advise \n16\n their 162nd Bde report at 1140 enemy pressure on Deir Tureif continues but not increasing. Sharp M.G. fire on their posts between Deir Tureif and German colony. German colony heavily shelled with high explosive. Enemy infantry advancing from Rantieh but situation well in hand.\n\n1230 ICC Bde report 400 enemy have advanced from Mulebbis towards 265. Enemy shelling 265 and road in O 14 B with three batteries including one 5.9. Four enemy planes flying over our lines. 2nd Battn and Inverness Batty have both arrived.\n\n1240 54th Div advise 162nd Bde report 1220 pressure slightly less but enemy maintaining his positions and trying to build up line in Wadi SW of Rantieh. Column of 800 caught in close formation about Et Tireh and dispersed.\n\n1330 54th Div. advise 162nd bde report situation quieter. Enemy battery at P 26 C and another at P 22 B silenced. Transport close to Rantieh shelled by us.\n\n1350 Report received from ICC Bde that their post on 265 has been shelled off and enemy are in occupation. Two 13 pr batteries shelling it and 60 prs about to.\n\n1445 161st Infy Bde report: Am moving 6th Essex to vicinity of PT 275 with orders to be ready to be ready to deal with any enemy who may break through. 5th Essex are moving reserve to form defensive flank facing Birket El Jamus.\n\n1507 Advice received from Descorps that 1st LH bde (less regt) will move at once to Selmeh square J 27 B and come under orders GOC Anzacs on arrival\n\n1510 Hostile air-raid took place in Jaffa – seven planes dropped about 40 bombs causing about 30 casualties among civilians but no military damage.\n\n1600 54th Div. advise timed 1425 \nenemy\n German colony being heavily shelled and infantry appear to be forming for attack west of Rantieh. Reinforcements steadily arriving at Rantieh. Quiet in front of Deir Tureif.\n\n1600 8 enemy aeroplanes moving North over Sarona.\n\n1605 54th Div. wire timed \nbegins\n 1510. After heavy shelling attacks launched by two to three thousand infantry with left on railway line right 1000 yds W of Rantieh on German Colony. Stopped dead about 800 yds from our lines. Heavy shelling still continues. Turks reported to be retiring from Et Tireh in easterly direction\n\n1630 5th Essex report considerable bodies about 4000 of Turks advancing down Wadis in SE direction in about F 4.\n\n1640 54th Div. report further 1605. Another attack in NE corner German Colony repulsed whilst still 800 yards away from being enfiladed by our post at Railway Station who did much execution with Lewis Guns. Attack from Et Tireh now developing but appears weak. About 300 Turks advancing down Wadis in W 2 C towards Beit Nabala. Anticipate no trouble in dealing with last two parties.\n\n1645 Descorps direct Pt 265 to be reoccupied after dark if not previously.\n\n1704 Descorps \n\n wires 1st LH Bde will halt at Ayun Kara but will be ready to move at shortest possible notice.\n\n1710 161st Bde report 6th Essex on move to Pt 275.\n\n1710 2nd LH Bde report timed 1600: Situation unchanged. 5th Regt report 3 Coys of enemy Infnty in C 28 G moving toward Mulebbis in artillery formation. They have pack mules with them. Work on trenches was continued last night and today as far as shelling permitted. Trenches have been extended & deepened so that full Regt can now be placed in them without evacuating. Alternative M.G. emplacements have been chosen. Work continuing tonight.\n\n1720 1st LH Bde (less 2nd LH Regt) in bivouac Ayun Kara 1500. 2nd LH Regt left column at Yebna at 1200 & proceeded direct to Ramleh.\n\n1720 Camel Bde report situation 1630. Shelling has died down but enemy Infantry continue to advance from Mulebbis. Turks are now in position with M.G.s 1000 yds N of No 1 post. Pt 265 reported to be unoccupied by Turks. Am pushing forward to pt 265 with object of occupying it. No. 1 post reports enemy advanced all afternoon in thin waves. Impossible to estimate numbers.\n\n1720 54th Div. report 1645. Another attack repulsed parties at flanks and drove him back. His centre remains about 500 yards from our centre. Situation there momentarily fairly quiet. Increased musketry from Et Tireh towards E and number of enemy in Wadi in W 2 G. Their intentions not yet being clear. Enemy now appearing on our left of El Yehudiyeh \n\n1810 orders issued. Dispositions for tonight. Information in position W of right of No. 1 Sub-sector. Force of about 4000 enemy Infty marched over Ford at Keibuta F4 into Mulebbis at about 1630. At 1600 large transport columns moving behind Mulebbis in direction of Railway. 1st LH Bde in bivouac at Ayun Kara. Trawler with searchlight will be in vicinity of Wadi mouth to assist should a crossing be attempted before dawn tomorrow. No change in dispositions from last night. Lines will be strengthened on all occasions possible & lines in rear chosen in case of enemy penetrating front line. The whole front will be carefully patrolled & watched. 2nd LH Bde will establish a post in advance their lines to link up with a forward post of the 161st Bde, the 2nd LH Bde will also push forward standing patrols on the tracks leading towards Ford In Summer towards Mulebbis & Fejja. The ordinary dawn patrols will be sent forward.\n\n1815 6th Essex reported arrived vicinity Point 275 1700.\n\n1835 The Batteries of 7th Mtd Bde and 4th LH Bde now at Zernukah and Deirah will move to Jaffa at 2200 tonight and 0600 tomorrow respectively and are placed at disposal of G.O.C. Anzacs.\n\n1845 163rd Bde report situation. Right battn. Reports enemy apparently holds line junction of track at J 3 a along track to Nalin then on high ridge from Sherrafaty to Z 25 C 05. Scouts sent forward from patrol observed\n\nseveral enemy dead. Left battn reports situation unchanged also that patrol to Budrus & KIBBIAH report no enemy in sight.\n\n1930 Camel Bde report situation 1645. Patrol to pt. 265 reported it strongly held on its northern slopes. Estimated strength of Turks 500 with M.G.s, therefore do not consider that this post can be held if occupied. Have asked 5th LH Regt to cooperate with enfilade fire in the event of attack. Estimated strength of Turks in front of right of my Subsector1000.\n\n2130 162nd Bde report 2025. Exchange of musketry continues. Hostile patrol approaching station near German Colony withdraw leaving dead.\n\n2130 Camel bde report , two of our evacuated posts on right of pt 265 reoccupied at point of bayonet. One M.G. and several boxes of ammunition captured. All quiet on front.\n\n2125 Descorps wire, the C in C directs the present line. Hostile patrol approaching station near German Colony withdraw leaving dead.\n\n2130 Camel bde report , two of our evacuated posts on right of pt 265 reoccupied at point of bayonet. One M.G. and several boxes of ammunition captured. All quiet on front.\n\n2125 Descorps wire, the C in C directs the present line is to be held. Should it be broken at any points, neighbouring troops must stand fast where they are and line must be ready instead by employment of reserves.\n\n2220 161st Bde E.A. passing over Sarona. Bridge post Z 17 D reports loud hammering N of copse.\n\n2225 Move of 2nd LH Regt to Ramleh completed at 1600.\n\n28.11.17\n Jaffa\n\n0015 Following to Camel Bde. Corps Commander approves of your\n\npresent arrangements as to pt 265 but wishes it to be shelled as early as possible after dawn so as to make it untenable as a point for the enemy to collect behind for an attack.\n\n0840 Sqdn 6th LH Regt that was attached to 162nd Inf Bde has rejoined Regt complete.\n\n0910 Camel Bde report situation 0900. About 100 Turks seen on northern slopes of 265 at 0745. 2nd LH Bde & Inverness Batty have been shelling 265. No movement observed 265 since 0745.\n\n0945 Report of situation 0900. No enemy across Nahr El Auja in front 4 T & 3 subsectors, all crossings in the two subsectors covered by our troops. Very little movement noticed on N bank. Patrol to Ford In Summer fired on by M.G. & forced to retire. Enemy reported entrenching S of Mulebbis 150 to 200 enemy reported entrenching on northern slopes 265. This force has been under our Gun fire since 0630. Our troops in position on One Tree Hill S.W. of 265. Enemy patrol approached right post of No. 1 Subsector but were driven off. With the exception of vicinity 265 enemy appear to have drawn back in Nos. 1 and 2 subsectors. Convoy observed going towards Ras El Ain and retiring to Mulebbis.\n\n1015 Air reconnaissance 0700 – 0900 report Tabsor & Tulkeram defences strongly held. Considerable movement S.W. on Tulkeram – Jaffa road. Enemy appear to hold line \n\nC 23 – C 31 – El Jelil \n\n1102 2nd LH Bde report considerable enemy movement of troops and transport in vicinity of Bde at Ferrekiyeh also at Ford at Keibuta and Ford In Summer.\n\n1250 2nd LH Bde report situation unchanged. Our battery has fired on trenches on 265 & adjoining, also on Bare Hill just S.W. of Mulebbis where Turks were seen & and has endeavoured to knock out enemy battery previously indicated. Enemy has shelled nearly all our trenches at different times during morning mostly with 77 guns and an occasional 5.9.\n\n1300 Camel Bde report situation. Right post shelled by 4.2. Intermittent shelling along line now practically ceased. Enemy still visible at points along lines but no concentration.\n\n1515 161st Bde report ten limbers and 20 camels moving NE from Ferrkehiyeh. Troops estimated 100 strong moving NE about Z 6 central\n\n1820 The Corps Commander wishes it to be clearly understood that the line at present held in this sector is not to be given up when the enemy attack or shell. If a party is absolutely forced out of any place on the line it is holding a counter attack must at once be reorganised and the line \nreorganised\n readjusted.\n\n1855 Camel Bde report situation 1800 heavy shelling on No. 1 post and a fair amount of ranging fire along\n\nwhole positions, more especially behind front lines. Enemy holding a line about 1500 yards in front of Nos. 2 & 3 posts with a few snipers in front. Much movement of Cavalry and convoys near Nebitari towards and away from Wilhelma. No concentration observed. No rifle fire until dark when a little sniping commenced. Essex, Inverness, H.A.G. Battys all now in position.\n\n1900 A raid will be carried out tonight by 161st Bde at 2000 against an enemy trench located on S side of Nahr El Auja near Bridge SE of Dam.\n\n1930 161st Bde report that on the last two nights they have been forced to fire on natives attempting to cross the Nahr El Auja and refusing to stop when challenged. This has led to 2 being killed & one wounded.\n \n\n2100161st Bde report raid on enemy post in Z 18 a successful. 8 prisoners and one MG captured. Our casualties 2 O\/Rs wounded.\n\n2200 Descorps wire: Take steps to have Bedouin encampment reported at Tel Abu Zeitun moved to W side of Jaffa – Ludd road\n\n28.11.17\n\n29.11.17\n\n0730 prisoners taken in raid belong to 1\/134th Regt. State 3rd Div. made attack on river line and that their Regt. followed behind and took over. \n\n0935 Situation 0900 front line trenches in right half sector being shelled by heavy and 77 guns. All crossings\n\nin left of sector covered by our troops. All quiet in direction of Sheikh Muannis.\n\n0915 Air Reconnaissance 0600 – 0800 report Nalin Beit Neballa Mulebbis Ras El Ain no movement or communication. Kuleh 100 cavalry Fejja 400 supply.\n\n1000 I.C.C. Bde estimate enemy casualties as a result of retaking posts 2 & 3, 37 dead and casualties in rear of enemy position where supports were being brought up should be heavy owing to our M.G. fire.\n\n1030 162nd Bde reports 0900 . Considerable shelling of Wilhelma & Yehudiyeh and MG fire on former from direction of Et Tireh. 60 pdr at T 1 a has been engaged in counter battery work with aeroplane observation for last hour. F.A. engaging suitable targets. No movement visible.\n\n1055 Camel Bde report 0800 Situation. Quiet during night. About 2200 a number of enemy about 30 seen digging on hill formerly known as 265. Inverness battery opened fire & drove them temporarily off the hill. During the night enemy threw up a good deal of new trench on this point.\n\n1100 2nd L.H. Bde report. About 0900 small party of Turks attempted to rush one of our advanced posts but were driven back by rifle fire. Considerable trench work has been done on long ridge about 1000 yds N of 265. Our trenches have been severely shelled this morning, two\n\n direct hits on a trench being made.\n\n1230 Situation 1200 54th Div. report considerable shelling of Wilhelma and Yehudiyeh. No enemy movement. On our front no enemy movement of note, front line & communications trenches of No 2 Subsector continuously shelled during morning.\n\n1235 161st report enemy are in occupation of trench raided last night S of river.\n\n1300 Camel Bde report situation intermittent shelling along our line otherwise all quiet.\n\n1350 Patrol to Ford In Summer report no enemy movement about 0700 small party of enemy attempted to rush an advance post on right of No 2 Sub-sector but were driven off. Considerable trench work has been done by enemy on long ridge about 1000 yds N of pt 265.\n\n1355 Report from 2nd L.H. Bde. Considerable MG fire and sniping on our right flank. Trenches are being a great deal knocked about by Artillery fire.\n\n1715 Enemy shelled lines intermittently today and at times brought a fairly heavy fire on the trenches of the 2nd L.H. Bde but as these are well dug & now nearly completed only one man was wounded. Camel Bde in conjunction with 2nd L.H. Bde will carry out raid on 265 at 2200 tonight with one compy. Artillery cooperation has been arranged with “A\" Batty H.A.C. and Inverness R.H. A. who\n\n \n\nwill open bombardment at 2120. Duration of raid 20 minutes. Duration of artillery bombardment one hour. Return of raiding parties will be notified by one red verys light. 6th L.H. Regt will cooperate with one Sqdn providing infilade fire.\n\n1717 Work on 2nd L.H. Bde trenches was continued today five communication & support trenches were deepened. It is intended to place trip wires in front of trenches\n\n1920 162nd Bde wire timed 1800. Considerable shelling of \none\n practically whole front line and apparently only done to annoy us unaccompanied by Infty. Action excepting case of attack by about 200 Turks and MGs about 1500. This attack was caught by our Artillery before being launched and scattered. It eventually stopped about 900 yds from our front line. It was preceded by movement of majority of enemy E & NE of Naballa into Wadi Abasiyeh and appears little doubt their troops supported attack. Enemy’s digging near Rantieh and Ettireh much curtailed by our artillery. Railway station Wilhelma badly damaged by enemy’s artillery. Report timed 1820 Turks have captured hill at W 21 b 2 8 but were immediately attacked and driven out. 163rd Bde report Budrus and ground between Budrus and Kibbiah free of enemy but Nalin and Kibbiah occupied. \n\nOrders issued to Bdes reference cycle of couriers commencing at Zeitoun on 10.12.5. Defence Ramleh – Ludd. Defence scheme sent on to Bdes.\n\n30.11.17\n\n0505 Report from 2nd L.H. Bde shows that at about 0345 parties of Turks advanced against our No 2 & 3 posts. The number who attacked the latter are estimated at 100 with more behind. These got to within 50 yds and were then beaten off. Enemy appears to be very active on on Pt. 265 & has shelled considerably during the night.\n\n0645 54th Div. reports 162 Bde report at 1800 enemy strength 200 attacked hill held at W 31 b 3.2 and rushed front line capturing M.G.. post commander immediately counter attacked, ejected enemy followed up and recaptured M.G. Number dead Turks in front of line 8 buried 3 prisoners 11 Rifles captured. 0445 enemy attacked Naballa Hill W 32 d attack still in progress when unit report sent off but situation then reported satisfactory and all quiet now. At dusk last evening stretcher bearers appeared very busy in area that has been shelled by our guns during day.\n\n0700 2nd L.H. Bde report situation to 0630. When attack on 265 by camels was proceeding the enemy made\n\na determined rush against an advanced outpost on our right flank. This post is 1400 yds in front of our main lines and since 265 was evacuated by camels has been quiet in the air and has been considered more as an observation post than part of the outpost system and it could never be safely held by us while 265 was in hands of enemy. There is dead ground within30 yds of its front and in this the enemy evidently were massing to rush the post when the attack on 265 spoilt their plan. Our post was however driven back after a bomb fight and were taken in flanks by MGs. They occupied the support position for rest of night. Enemy shelled our trenches a great deal during the night and about 0345 made what now appears a determined effort to rush Nos. 2 & 3 posts. This was repulsed and enemy dug in about 200 yds from our line. When daylight came he found this a very bad position and 7th Regt quickly surrounded him & caused the surrender of 2 officers 146 O\/Rs. 4 Automatic Rifles (Bergmann) enemy rifles & bombs were also taken. There prisoners state that there are about 4000 Turks at Mulebbis. Our guns at daylight commenced shelling lost observation post and\n\nhave made it untenable for enemy but we cannot at present reoccupy while enemy on 265, he also has M Guns on left flank which seems to command it.\n\n1030 A raid was carried out at 2200 last night by ICC Bde on hill 265 by a Coy of","9":" Battn. The raid was preceded by half an hours bombardment by HAC and Inverness Batteries.","10":" L.H. Regt cooperated on left flank. Raiding party was divided into two parties. On reaching new trenches dug by enemy it was found empty, but a trench on our E shoulder was occupied. The occupants about 15 fled before our men following them up with bombs. Whole raiding party returned safely. Casualties three wounded. Those of the enemy unknown. During and after raid enemy shelled whole right sub-sector heavily.\n\n1050 Situation report 0900 from Camel Bde. At 2400 outposts reported about 60 Turks to have reoccupied pt. 265. At dawn 20 enemy were observed moving along W slopes of 265. Throughout the night out line was intermittently shelled. During the night 6th Regt reported about 200 enemy massed on N slopes of 265. Our night post reported 2 large parties of enemy advancing towards this post\n\nduring the night. This movement did not develop.\n\n1650 Prisoners return 2 officers 147 O\/Rs captured by","11":" L.H. Regt this morning.\n\n1823 54th Div report situation quiet. 163rd Bde patrols report Budrus occupied by enemy strength not discovered. Trenches being dug in front of village occupied by small parties only so being seen. 162nd Bde report continual movement of loaded camels and mules into Et Tireh throughout day.\n\n1825 Yeodiv HQ’s are at Annabeh\n\n2240 Commander-in-Chief impresses that use of hand grenades by ICC in this case was reprehensible. This weapon is of no value in open. Rifle & bayonet should have been used.\n","12":"\n\n0720 2nd L.H. Bde report situation to 0700. Quiet. During the night large enemy parties were observed working on Salient and Bold Hill, our covering parties report that enemy appear to be putting wire out in places. Enemy working parties were continually dispersed by our artillery fire between midnight and dawn.\n\n1350 Yazur supply dump heavily shelled this morning two men killed, two wounded, Supply officer reports villagers of Yazur in housetops under very suspicious circumstances.\n\n1420 Air reconnaissance 1200 – 1330 reports about 1500 infantry & 400 cavalry S.E. of Mulebbis behind enemy line. Work going on one hour on trenches.\n\n1725 I.C.C. Bde report 1700. Front line shelled with shrapnel & HE about 17.30 & 2 O\/Rs wounded. One officer killed by shelling near Sakia this morning. Our batteries successfully engaged enemy on right 1500 yds E of O 29 b. Enemy wounded seen being carried off. General situation quiet.\n\n1810 54th Div. report situation unchanged. Parties of enemy who approached Sheikh GHARBAWY this morning who turned N and occupied ridge running roughly H 5 central Y 29 central from which place they sniped a Coy at Araken Natuf throughout the day. Sniping and M.Gs at Sheikh El Gharbawy from direction of Midieh. Otherwise all quiet.\n","13":"\n\n0625 2nd L.H. Bde report quiet night. Our battery shelled enemy working parties on right flank at intervals during night. At 2330 twenty seven prisoners were taken by 7th Regt. It appears that three Turks surrendered to one of our listening posts and intimated that there were more Turks willing to surrender same distance further on\n\nbut they were afraid of their own people. A party was then sent out and guided by one of these Turks for fully a mile and though fired on from both flanks managed to collect these prisoners and bring them in. One man also gave himself up to 5th Regt. during night.\n\n0822 1st L.H. Bde less Regt at present at disposal of 54th Div. is placed at disposal of G.O.C. Anzacs for work on trenches tonight. Led horses will be kept as near at hand as possible in case Bde is needed to act practically in any portion of the Descorps line.\n\n1000 1st L.H. bde ordered to I.C.C. Bde. To leave camp at 1745.\n\n1100 Prisoners captured by 2nd L.H. Bde belong to 57th Regt entrenching company.\n\n1215 New enemy work observed Z 14 a 7.3. About 200 yds of trench round hill with house at E end.\n\n1320 Cavalry course which was to commence Dec. 10th will now commence Dec. 17th.\n\n1700 Operations to be carried out by our aircraft during hours of moon-light.\n\n2020 One Mtd Bde Anzacs to relieve ICC Bde night of 4th inst.\n\n2100 Ref. raid carried out by 161st Bde in enemy trench S of Bridge at 1930. Raiding party returned. Only six Turks appear to have been S. of river, all killed. Our casualties one officer killed one O\/R missing one O\/R wounded.\n","14":"\n\n0630 2nd L.H. Bde report situation unchanged. Our patrol last night crept to within 30 yards of the salient trench passing the Turkish listening post 100 yards out. No signs of wire seen but the Turks appeared to be driving stakes on the other side of the cactus hedge behind which is the trench. Three Turks on patrol came near one of our listening posts. Two were killed the other captured.\n\n0910 In accordance with instructions issued by O\/C R.A. left sector. The batteries in the sector will be organised on the night 4th \/ 5th & 5th \/ 6th into three artillery subsectors. Covering the Nos. 1 & 2 subsectors B Artillery Subsector covering No 3 Subsector C Artillery Subsector covering No 4 Subsector. Each Artillery Subsector is under its own Command\n\n1315 3 Enemy planes passed over our lines at 1415 flying N from Ramleh towards Mulebbis.\n\n1525 1st L.H. Bde will detail 1 Regt. to move into this area & be bivouaced in the lines vacated C.M.R. by 0600 on the 5th inst. This Regt to become Divisional Reserves.\n\n1615 Aeroplane report 1500. No movement in enemy’s front line and trench system at Nebi Taril Fejja – Mulebbis. No concentration seen in this area.\n\n1700 Camel Bde report situation. Movement of the enemy towards the N. observed during the day. Apparent decrease in number of bivouacs in front of No 5 post. Quiet day with little or no shelling\n","15":"\n\n0700 Situation report 0700 from Camel Bde. During last night’s raid on Bald Hill a certain amount of rifle & M.G. fire against posts No 9 & 10. No 3 post very heavily bombarded during raid but no casualties. Following the raid a quiet night.\n\n0715 54th Div. report situation unchanged. Slight shelling of Wilhelma about 2000. Our artillery shelled probable H.Q.s in cave about R 18 C 9.1. Machine Gunners fired on in J 7 A 1.9. Suspected entrenchment running from Khibanneh to W 30 C.\n\n0730 Situation on front unchanged. In raid last night 20 enemy were bayoneted by 2nd L.H. Bde\n\n \n\nparty and four prisoners belonging 57th Regt. taken. Enemy trenches were strongly held.\n\n1108 R.F.C. report timed 1000. Usual garrisons at Sheikh El Ballutah. Troops massed in Wadi in rear and 50 tents and shelters about C 20. Trenches between Sheikh Muannisand El Jelil appear to be unoccupied about 100 Cavalry in and scouting two miles S. of El Jelil – Trench system occupied (garrison estimated at 300) facing S. behind bridge in X 1 6 central. 100 large shelters scattered between \n-\n V 5 & Arsuf.\n\n1612 2nd L.H. Bde report situation unchanged. Our batteries heavily shelled and new trench being dug 900 yards N. of Forward post.\n\n1730 During the night N.Z.M.R Bde will take over the Right Subsector of line from ICC Bde and one Regt.(1st L.H. Bde) comes into the \nRight\n Left Sector and becomes Divisional Reserve.\n\n1740 Situation report Camel Bde up to 1700. No 3. Post heavily shelled between 1400 & 1500. Battery appears to have come up closer. Otherwise all quiet. Message delayed by breakdown on line.\n\n1800 54th Div. report situation unchanged. Digging observed N.W. corner of Et Tireh. Our artillery registered Nalin and Budrus and engaged enemy Infty. There. Also ranged on movement in\n\n \n\nWadi Malakeh and bolted over 200 men, horses, mules & camels. Carrying parties seen leaving store houses with sacks at J 7 C. Slight enemy shelling along whole 162nd Bde front.\n\n1935 I.C.C. Bde report raiding party onto Bald Hill met with opposition from enemy rifle men and bombers at two positions before reaching objective which was trench on west of hill. Enemy were bombed out of this trench apparently losing heavily, also seven were bayoneted. Raiders met with heavy M.G. fire and enemy trench mortar fired four times. Our casualties during this raid two O\/Rs killed 2 Officers and 27 O\/Rs wounded.\n\n2000 orders (O.O. No 108) for relieve of troops now in left sector by 52nd Div. issued (Appendix) Anzacs will then be about Ayun Kara\n","16":"\n\n0255 Relief of I.C.C Bde by N.Z.M.R. Bde in No 1 Subsector completed at 0015.\n\n0640 2nd L.H. Bde report Situation unchanged. Before the moon rose enemy fired field gun at ten minute intervals at our No. 1 post and seemed very nervous during night.\n\n1000 After order to OO108 issued giving further details re routes, formation on the march etc.\n\n1720 Relief of Artillery in Left Sector to be carried out in accordance with instructions\n\n1640 N.Z.M.R. Bde report quiet day. Very little movement of enemy on front. Enemy Bty.\n\nJaffa\n\nLocated in P 26 C 3.0. Enemy shelling with two heavy guns from direction of C 30. Telephone wire with forward posts cut by shell fire\n\n2015 155th Inf Bde Group arrived in Ibn Ibrak bivouac. Bde H.Q. at J 36 b 2.5.\n\n6\/12\/17\n\n0700 161st Bde report one prisoner taken from 20th Regt. – He states 21st regt. no longer exists – remnants drafted to 20th and 134th regts\n\n1040 NZMR Bde report enemy working on trenches on Bald Hill and to the NE. otherwise position unchanged.\n\n1415 orders sent to 1st L.H. regt to rejoin 1st L.H. Bde after 1700 tomorrow.\n\n1645 Arrangements completed for dispatch of a number of candidates to Imperial School of Instruction Zeitoun.\n\n1545 orders received from Descorps and issued to 161st and NZMR Bde that the inhabitants about Summeil and Kefr Ana are to be removed to south of old Jaffa – Rantleh railway by 0700 on 8th instant.\n\n1555 Orders issued \nwhereby\n giving moves of relieving infantry brigades for tomorrow:- 156 Bde from Ramleh to Selmeh. 157th Bde group to remain at Selmeh in divisional reserve.\n\n1730 Orders issued \nfor\n giving details of moves of DHQ to \nAVU\n Richon Le Zion tomorrow. Also regt 1st L.H. Bde. DHQ close at Jaffa 1600 and reopen at Richon.\n\n1935 157 Bde report they arrived in bivouac Selmeh at 1915.\n\n2200 2nd LH 155 Bde report they have completed relief of 2nd L.H. Bde\n\n2200","17":" LH Bde report their relief by 155 Bde is completed.\n\n"}}