{"Document Name":{"0":"Diary_0484","1":"Diary_0484","2":"Diary_0484","3":"Diary_0484","4":"Diary_0484","5":"Diary_0484","6":"Diary_0484","7":"Diary_0484","8":"Diary_0484","9":"Diary_0484","10":"Diary_0484","11":"Diary_0484","12":"Diary_0484","13":"Diary_0484","14":"Diary_0484","15":"Diary_0484","16":"Diary_0484","17":"Diary_0484","18":"Diary_0484","19":"Diary_0484","20":"Diary_0484","21":"Diary_0484","22":"Diary_0484","23":"Diary_0484","24":"Diary_0484","25":"Diary_0484","26":"Diary_0484","27":"Diary_0484","28":"Diary_0484","29":"Diary_0484","30":"Diary_0484","31":"Diary_0484","32":"Diary_0484","33":"Diary_0484","34":"Diary_0484","35":"Diary_0484","36":"Diary_0484","37":"Diary_0484","38":"Diary_0484","39":"Diary_0484","40":"Diary_0484","41":"Diary_0484","42":"Diary_0484","43":"Diary_0484","44":"Diary_0484","45":"Diary_0484","46":"Diary_0484"},"Date":{"0":"unknown","1":955.0,"2":957.0,"3":958.0,"4":959.0,"5":960.0,"6":961.0,"7":962.0,"8":963.0,"9":964.0,"10":965.0,"11":966.0,"12":967.0,"13":968.0,"14":969.0,"15":970.0,"16":971.0,"17":972.0,"18":973.0,"19":974.0,"20":975.0,"21":976.0,"22":978.0,"23":979.0,"24":980.0,"25":981.0,"26":982.0,"27":983.0,"28":984.0,"29":985.0,"30":986.0,"31":987.0,"32":988.0,"33":989.0,"34":990.0,"35":991.0,"36":992.0,"37":993.0,"38":994.0,"39":995.0,"40":996.0,"41":997.0,"42":998.0,"43":999.0,"44":1000.0,"45":1001.0,"46":1002.0},"Entry":{"0":"\n\n","1":"\n\nPozieres. Leaving our place of bivouac at 5.30pm we marched through Albert and got out of the town where trenches start at once – mile after mile of chalk white ribbons far more intricate than Johnston’s Gully. Traffic wound thick up all the valley leading up to the firing line. Guns were thick everywhere and the air was full of their talk. We advanced to the forward reserve trenches and filed into them A great artillery battle was in progress the air full of fire and crash. Several gas alarms and great displays of contradictory orders. Eventually two guides reported and we commenced an advance in single file drawing picks, shovels and bombs en route. The way lay up a winding chalk road and presently we started to get into a shell torn devastated area covered thick with shell holes many feet deep and so close together that one could not pass round them but had to plunge on straight through sliding down one side and crawling up the other. It was pitch dark and shells were bursting thick everywhere. Imagine the difficulty of it – 1000 men in single file crawling through this hell of waste and in the strange locality trying to keep blocked up for fear of losing\n\nconnection. Presently we reached an awful area – a tangled mass of deep pits 30’ deep and with girders bricks and other sharp things sticking up. One would get right down into or tumble into one of these and then commence the painful ascent streaming sweat. Here shells were screaming around us and machine guns kept flicking but I had to halt the whole column several times on account of the fatigue of the men, letting them crowd into the deep shell holes for cover. Presently we came to the remains of an iron gate which opened into a tangled, almost imprenetrable, mass of sticks¸splinters and shell holes it was some time before we realised that the first area we traversed was once the village of Pozieres and the last area was the famous wood. As I say the “village\" has literally been uprooted and not a vestige of it remains except a few bricks and beams at the bottom of these pits made by high explosive. These are everywhere so close together that not one inch has been missed. The “wood\" has a few trees all torn and waste still standing. It is a hell and shells up\n\ninto it all day and night. The place resembles a filthy rubbish heap, equipment rifles Lewis gun magazines bombs and a thousand other things litter the ground. Stinking corpses lie around. There a man with his face blown off and all shrivelled up, here a good Australian lad with his leg lying beside him. A chap leaning against a tree with a little trickle of blood on his face and no other apparent injury bloated with gas. Most of the dead lay on their faces in most natural positions. Portions of bodies lie everywhere as the shells burst up the place again every day. Crawling and walking over this filth with the reek of putrefaction in our nostrils we reached the summit of the hill and were under heavy fire all the time. The actions of the guides became most erratic and I soon found that they were lost. It was excusable perhaps owing to terrible country and every fresh shell in the bombardment blew up some other feature of the landscape and their work became all the more hard. They had only been here four days and the landscape had been ripped to pieces over and over again. Eventually I found my men in the shape of\n\na V, the two heads going different ways. Shells were pouring in now and machine gunswere playing on us. Called the guides up. They were both quite unstrung and nervewracked so they could hardly speak but I managed to elicit all they knew. What they said was that we were all out in No Mans Land between the German trenches and our own! Here was a nice fix to be in. We reconnoitred ahead and at last discovered a parapet over which we jumped crawling over plenty of dead men in the process. Fortunately it turned out to be the correct place and the chaps soon started to file in. Binns was the officer I had to relieve and he was just about dazed and silly as all his men were too. We could hardly speak to each other as shells were landing within a few yards of us. It took a long time to get all the chaps in and then we had to start to dig like hell while still dark as the trenches were only 2 feet deep in places and in other spots ceased altogether and one had to go across in the open. The\n\nmen were all exhausted with their experiences, for God knows that it was hell coming across the rear, but they needed no telling to get a move on digging. The enemy trenches were about 1000 yards in front. My frontage was about 500’ and such trench as was complete was deep & narrow, quite good protection against shells but two men could not pass at one time. Issued orders to my officers to man posts and collect all loose bombs etc. and then let a proportion go to sleep. This they did and after stand to arms about 25% slept standing up or sitting down. When daylight came we could see the opposing trenches on the next ridge, the intervening ground would have afforded them excellent cover for an advance and was covered with peculiar short bushes which swayed in the breeze and almost exactly resembled waves of soldiers doubling across. Away to our left a valley seemed to run right in and on the further slopes of this were guns that could us as we found to our cost later in the day\n\nIn the centre of our line we held a number of German gun pits captured from them and apparently joining up as a communication trench to their firing line. I decided to seize this and at once put a bombing post on and searched the place with revolver drawn and two bayonet men behind me but we could not find so I was unable to push on towards their trenches but was going to cut a place through later in the day. There was a splendid German dugout here going down over 30 feet and good wooden stairs leading down. Shells were lying round and any amount of souvenirs in the way of rifles and equipment were also there. Propped up against a place and so small and shrivelled was a young Hun who had been dead some time and there were plenty of others lying underfoot. I remember treading on the stomach of one elderly Hun who was blown up like a balloon with the gases of decomposition. Just outside was another half buried lying on his knees in a crouching position\n\nA few days shrivels a corpse up until it seems just like a shrivelled mummy. Our dead were lying thick where they had been thrown over the parados. Later in the day we found that the trenches were so narrow this was the only way to deal with a dead or wounded man. Hurl him right out to the back. Men sleeping crawled over and slept in handy shell holes and also used shell holes as latrines there being none dug. The other people had started a reserve trench but only scratched the surface, dead Australian lads lay crumpled up here. Right in gangway in the firing line we saw a hand sticking out. It belonged to the body of an Australian who had about an inch of dirt on him and everyone was trampling over him. Arranged for the collection of all Australians and after dark they were to be put in shell holes and buried. The German bodies we built into the parapet to stop bullets. All this time a continuous bombardment was in progress. Our guns had superiority\n\nduring the morning rocking them in with terrific force but in the afternoon the Germans did what they liked with us and the response of our guns was small. It would have heartened our boys up if they had heard shell for shell going back. All day we could see great activity in the enemy trenches. Troops passing and repassing gaps where our shells had breached their parapet. On some being seen to leave their parapet we stood to arms and prayed for them to come and let us measure steel with them but nothing happened. They seemed to be putting out new entanglements. Later we could seem them massing on the right all wearing packs. We were practically cut off from HQ by the shell fire curtain but I kept sending men back with the information of enemy movements. Some of these brave despatch carriers had terrible experiences, poor Gander returned nearly half dead having been right out in No Mans land. The other men I never saw again. From noon on the enemy gave us such shelling as we had never before experienced. We started\n\nwell back behind our supports and concentrated 5.9’s and other heavy shells on them. The air was full of explosions and smoke. Andrew Fraser and Tapner were all blown out. Working forward he carefully pitted every inch of ground up to our parados making the previous devestation there many times greater. Our parapet got blown about and Sergt Scott was buried completely. We dug him out little the worse while their snipers potted at us through the breach. Little Sutherland was also buried and the shock made him like a baby and I made him lie down and covered him up. The fellows were all getting a bit rattled so I walked along and joked and asked questions and so on and left them all cheerful. The sentries require a steady nerve to keep their heads over the parapet all the time while shells are coming so close abut all stuck to it splendidly so no rush could be made under cover of shells. I jumped up and observed too. Some guns enfiladed us. Just returned to the\n\nbay where my headquarters were when the bombardment increased to intense and they got right on to our parapet shelling the breaches particularly. The fellows crouched on their haunches right down low. The next thing was a still further shortening to just a few feet in front of the parapet and the shells struck with such force that they burrowed underground and burst in the trench. My steel helmet saved me from a nasty scalp wound. Just about 3.00 I was sitting on the fire step with one leg up in front supporting a note book while writing a message when a shell came right through and burst. All I know is that I felt a tremendous weight fall on my left leg above the knee and my breeches were covered with blood which at first I thought was someone elses. The air was full of groans and cries of “Hell! God! Jesus Damn\" etc “My arm, My leg, Oh the pain\" etc etc. Poor Newton who was next to me lay a mangled dead mass on the floor. was writhing terribly injured but still alive Adair’s leg and arm were blown about causing him dreadful agony. Sergt Scott\n\nhad his hip blown away and was in great pain. King had his hand blown off and there was another man horribly injured in the stomach. On pulling down my trousers I found my left leg covered in blood from a wound 3 inches above the knee and fastened on a field dressing. I then got Lance Corpl Smith to drag me out of the way while I supervised operations. The shells continued to blow the trench in on the dead and wounded and other men got to work bandaging up those who were hit. Dyett, Smith and others did splendid work for poor crying shattered fellows . the groans and cries with the constant crash made a hell of the place Earth kept being blown in on the wounds as they dressed them. I sent for Bazeley and ordered all the sentries back on to their posts to watch for any signs of attack and supervised the carrying out of the worst cases on waterproof sheets. I was lying right in the gangway and they could not help treading on my wounded leg as they passed by and I don’t remember much\n\nfor a while until Bazeley was bending over me. Just then another shell burst over us and a splinter caught my other foot and at the same time another piece wounded Bazeley passing clean through his shoulder. There was a good deal of blood. They carried us out on waterproof sheets as all the worst cases had gone on the stretchers. The enemy turned a machine gun on us and our bearers and also did some rifle sniping at us. The men could only carry us a few yards at a time and ran from shell hole to shell hole It was a dreadfully rough path. Rotten corpses were lying everywhere. One was on a stretcher so my men tipped it off and dumped me and the waterproof on top of its loathsome dampness. The carry was easier with a stretcher. The enemy now lengthened his fuses and intensely shelled the whole rear area to prevent wounded getting back and some of the carriers were hit. Dyett and the other brave chaps kept going ahead. Corpses were strewn everywhere shrivelled up and wizened some shockingly mangled\n\nOne rest, feeling sick with the stench I found they had lowered the stretcher on top of a big dead German. After being fixed up by Dr Craig stretcher bearers carried us to different dressing stations. Changed from horse ambulance to motor and so on until at Warmoy my old friend Dr Drummond probed the wound and said bone was touched and operation would be necessary Gave morphin and then motor ambulance again to Puche Villiers where beds are provided. Andrew and others here and left for England, doctors kept me.\n","2":"\n\nEnjoyed my first sleep for some days & they and washed me. This hospital is very comfortable. Went on by hospital train to English hospital at Etaples. The train was most luxurious and comfortable. Spent a bad night with great pain.\n","3":"\n\nAt Etaples in bed all day. 20th Gen Hosp\n","4":"\n\nDitto. Wound X-rayed. Nurses all English & splendid women kind, painstaking who work long hours One little “sous-lieutenant\" of V.A.D. in our ward The nurses are always smiling and tender. The night nurse (Sister Child) is a grand girl.\n","5":"\n\nEtaples . 20 Gen.Hospital\n\nCamieres. Quiet day. Chloroform and operated on at 6pm\n","6":"\n\nFeeling quite good. Quiet warm day\n","7":"\n\nDitto\n","8":"\n\nAwakened 1am and left for hospital train in motor ambulance. Great bustle and stir, old Irving the orderly, came running after me with my belongings. Strong sister directing operations – a splendid woman. Three hours train journey landed us at Calais and stretcherbearers soon had all embarked on a small steamer there ready to leave with the tide at noon. The waterside appears busy with the grime of coal and engines and big cranes. It is a sunny clear day with a slight breeze, just such a day as the chalk cliffs of Dover are visible from here. I am lying between decks with my wounded thigh preventing me from moving and therefore unable to see if the same view as Caesar showed his legions is still obtained in these days. The noise of big guns was very plain both here and at Etaples during the night. At 1.30 we cast off from the pier and turned towards Dover – a 1 ½ hr. run\n\n3\/8\/16\n\nKent The run across was as smooth as a paddle on a pond. Entrained at Dover and found the train not half up to the standard of the French ones. The run through Kent was very pleasant, fields hedges \n\n & green trim meadows with many acres of hops looking very pretty with the sunshine glinting through the rows. A good many orchards most of which appeared nbeglected probably owing to shortage of labour. At Chatham we stayed some time putting off 87 cases. Marines acted as bearers and local people brought sweets & cigarettes. The day is a very close unpleasant one and that makes the journey tedious Commenced running through the suburbs of London and passed over the Thames, saw the Houses of Parliament and Westminster Abbey. Pulled into Charing Cross, and there unloaded. As the ambulance left the station crowds of women and girls smothered the stretchers with flowers. Ran up to 3rd Lon. Gen. Hospital at Wandsworth and found it far less of a home than the 20th General. The place is crowded and nurses hopelessly overworked, the patients have to do most of the work for themselves. A warm night and only a sheet was necessary over one\n\nLondon","9":" L.G Hospital\n\nQuite a lot of Australian officers in this (K) ward. From all accounts the 5th Divn. Show at Armentieres was a hopeless bungle. Hunhter called in during afternoon and as there is no sign of kit, gave him some money for some necessaries. He says Fussell went mad and is now in restraint. Got up later in afternoon and hobbled round the wards in a dressing gown. Saw Bird whose right leg is off at the waist, - poor devil. It is a great thing being able to do for oneself and be independent of the orderlies.\n","10":"\n\nMuch better. Bunning wounded and called in. had a hot bath and complete clean change\n","11":"\n\nHot & close. Can move round the wards a bit and feel bored to extinction. Base kit not in store and it will be a long time before the other arrives from the Battalion so intend to purchase a new outfit. Being Sunday there were numbers of visitors about and one must admit that the English girls, with their milk-and roses-complexions, are very nice. Hobbled all around the grounds.\n","12":"\n\nDull wind & cold but later it cleared up. Ordered uniform etc.\n","13":"\n\nFine day. Progressing very well and am only waiting for clothes to start moving around.\n","14":"\n\nSteve Smith came in last night and his list of losses is awful. 28 officers 706 men killed & wounded Curnow & Mackay killed and my splendid lads all broken up. Curnow was a brother to me and the news was a shock. Yeadon also said to be dead. We shall never see the like of these chaps again. Does God laugh?\n","15":"\n\nWarm dull day. The weather is keeping very dry and London has been some time without rain. My expected uniform did not arrive so perforce had to remain hanging about indoors in dressing gown and slippers.\n","16":"\n\nWent out with Bazeley & Lt Ross and took ‘bus to Lambeth Bridge. Interesting ride on top of the ‘bus. London an enormous cruel dingy place. Saw the Life Guard sentries Picadilly Circus and had lunch at the Regent. Struck by the women drinking “pots\" their smoking and the cult of the dog instead of the baby. Went out to Hampton Court, being Friday the picture galleries were closed but we saw the fine grounds the sunken garden, the King’s Garden, Anne Boleyns Walk and then went to the Maze which we penetrated with ease remembering the rule. Keep to the left every turn except the first two which take to the right. Waterfront very pretty. Returned Clapham Junction then Taxi home. Expenses for day","17":"\n\nWanted to go out early so partly dressed before and left with & Currey at 11 by ‘bus to Lambeth Bridge meeting an Australian sister and two ladies who asked us to their flat. Passed Lambeth Palace and then went to A.I.F. Headquarters, meeting numbers of old men of the Regiment. To the Trocadero for dinner much struck by the number of foreigners there as waiters – all nationalities. Luxury in food and clothes everywhere and plenty of naval & military officers about. By taxi to Westminster Abbey. The Abbey is a delightful old place with grass in front of it and upon entry ones first impression is one of the place not being as large as one would expect. The next impression is that the place is one vast tomb. Hundreds of historic tablets & monuments. Delightful stained glass windows and very verbose epitaphs. Met a Melbourne man and his wife and spent the rest of the afternoon in their company and they invited us to afternoon tea. A verger took us to King Henry VII Chapel a lovely place. Verger an . Walked to tube and then to Leicester Square to the Elysee Café a haunt of gay\n\nlife. Much frequented by officers and like Cairo Casino. Plenty of girls smoking cigarettes and plenty of music and dancers kept coming in and dancing among the tables. It was a scene of frivol & of gaiety and I chatted and laughed with our friend’s wife but all the time my mind was thinking of the hot sun of Pozieres beating down on hundreds of festering rotting corpses and of all our dear lads lying there unburied. Home by 1 bus.\n","18":"\n\nBy taxi to St Pauls Cathedral. On the way passed the Old Guard coming off at St. James Palace. – marching very smartly with their colours and splendidly turned out. About 30 strong preceded by Scottish pipers and crowds of people following them. Drove up to St Pauls out in front tame pigeons feeding. One large central entrance and then once inside the vastness of the place impress one. The interior is sombrely decorated and the decoration of the Colonial Bank flashed through my mind. A service was in progress and the mumble of the priest reached us very indistinctly. The dome is vast and\n\nthe whole church very lofty. The pulpit is in the centre of the church and a round canopy-like sounding board is above it. Moving forward we heard a mediocre sermon mostly read. The music was disappointing as where we were, everything was drowned by the organ. From the choir stalls to above the altar the ceiling is magnificent. Owing to the services we did not see much else. On the Thames we saw the captured German submarine UCZ with the Union Jack hoisted above the German flag. Cleopatra’s needle (the sister of the Mattarin obelisk) is close by. Walked round Fleet Street and the Law Courts and then took taxi for Trocadero as we soon became lost. After lunch taxi again to Hyde Park and went along Rotten Row to the Serpentine – a very pretty lake. Listened to the band and watched the types of people passing and repassing. Took taxi passing the “Hyde Park orators\" and went to Westminster R.C. Cathedral – an enormous imposing building from the outside but rather barnlike & incomplete inside. The smoke of incense hung heavily around. The side\n\nchapels are very fine that of St. Andrew being lovely. The roof of tiny cubes of brass, colour resembled a brazen cloudy sky Constantinople was outlined on the wall and looked like a night view with twinkling lights. When finished this will be a great church. To the Elysee for afternoon tea much dancing and plenty of girls there all smoking and giving the glad eye. They took some dodging. By the tube to Waterloo and then to Charing Cross and home by ‘bus. \n\nYesterday at Westminster Abbey we could not see the Coronation Chair as it had been put away in some safe place.\n","19":"\n\nShowery. With Hinchcliffe & Bazeley to the Trocadero and then by ‘bus to the Tower Bridge from which a splendid view is to be had. To the Tower and saw the whole place being shown round by Beefeaters clad in their quaint uniforms. A great deal of stair climbing to do which knocked us out. The Crown Jewels very fine. Afternoon tea in Piccadilly Circus. Women smoke everywhere here with no sense of shame\n","20":"\n\nAfter being dressed went in with Hinchcliffe to the High Commrs. Office & got passed for Parliament then to United Service Museum. Lunched Slaters. To Royal College of Surgeons and saw the bones but the Secretary said all the “wets\" had been stored below “depuis la guerre\". To the Inns of Court and went all over Lincoln’s Inn & Middle Temple. To the Temple Church – an old lovely church. A little round place with Crusaders tombs, lovely stained glass and an exquisite choir. A verger admitted us on our knocking – fortunate man to have the care of such a quiet and ancient . To the “Cri\" for afternoon tea and then back via Clapham Junction. In the morning went and saw the German submarine UC5.\n","21":"\n\nTo Piccadilly Circus and walked around and after a Trocadero lunch went down to the Houses of Parliament and went through the Hall into the House of Commons and listened to the questions and after to Sir Ed Carson & Mr. Asquith speaking on the Franchise A small place beautifully panelled in oak. Back to Trocadero for afternoon tea and then by tube to Victoria. Taxi home. Choruses of “heah! heah! heah! heah!\" in Commons\n\nStayed in all day being very tired and chose a fortunate day for my rest, it being very showery and wet.\n","22":"\n\nAfter being massaged went out with Bunning to A.I.F. Headquarters and there went off without B. after waiting ¾ hour. To the Houses of Parliament & heard that the Lords were not sitting and then to some lunch at a café opposite. To Westminster Abbey again and feasted the eye on gorgeous shades of stained glass and noticed the lovely roof. The place seems one vast tomb and many mediocrities seem to have been buried there. There are big memorials to people whose very names are forgotten. To St Pauls Cathedral and walked all round. Saw Wellingtons tomb. The superimposed weight of dome must be prodigious – no wonder the foundations sink. Had earlier walked from 130 Horseferry Road to the Abbey and now tried to find my way from St Pauls to Piccadilly Circus but had to call a taxi. Fleet Street being widened and does not look old at all even the old Cock Tavern looks modern. One thing that is striking is the modernity of the city & the absence of obtrusive old age in the houses & so on\n","23":"\n\nLeft early for Victoria and from there walked to houses of Parliament. Went all over Lords and Commons, the beautiful work in their interiors (done 70 years ago) shows that our artists in wood and stone can do work thyat compares favourably with those of past ages. The Lords is a gilded chamber and brighter than the Commons. Noted the Thrones & Woolsack. Westminster Hall is under repair but the great roof could be plainly seen. To St. Margaret’s Church in front of the Abbey a lovely old place full of stained glass & dating 800 years back. To the Guildhall and sat in the Lord Mayors chair in the Council Chamber Saw the standard weights and the measures on the floor. More exquisite stained glass and carved wood work. Saw Gog & Magog. To Trocadero for lunch and after a promenade round the streets went to the Abbey and sat there for a while. Then to St Edmunds Chapel and the Cloisters. The beautiful windows and tracery of wood & stone have a great edifying effect on one. Home per bus.\n","24":"\n\nA wet Sunday morning and eventually spent the rest of the day in the vicinity of the ward. In the afternoon conversed with and “afternoon tead\" with on the grass, two glad eye damsels of liberal conversation and plenty of chatter\n","25":"\n\nIn Royal Army Clothing Depot & A.I.F. HQ and strangled with red tape, went to an A.B.C shop for lunch. To the Abbey and found Henry VII chapel open for inspection and then went round the Poets Corner etc. After lunch to the Kensington Palace and Gardens – a very pleasant spot. This continuation of Hyde Park forms a grand belt of greenery and open space. The sunken garden at the Palace is very fine. To Chiswick for afternoon tea with some relatives of Bazeley’s. they make a meal of it in England. Searchlights sweeping the sky vigorously\n","26":"\n\nAsked to be boarded. Went in to Berkleys & Pay Office and then to Picadilly & Regents Street. No lunch & then to Downing Street and saw the mean & dingy residences of Britains Prime Minister & the Secretary for War. To house of Commons & heard Lloyd George, Churchill & Asquith speak.\n","27":"\n\nBoarded at 10am and then left for the city per bus. From Piccadilly to Bank by tube and emerged in the welter of traffic near the Bank of England The Bank is a low old dingy one storied building with no windows – a glimpse of gorgeously dressed beadle is seen in the courtyard Along to the at 4 Threadneedle Street and saw the Accountant. Past Lloyds Royal Exchange and then stepped into a little church dating back to 1650. One steps from roar and din into the dull musty silence of stained glass and dullness. Down Poultry & Cheapside seeing Bow Church and then down towards Aldwich passing St Clements Dane (Dr Johnsons church) to Piccadilly and lunch at the Trocadero, to Leicester Square past the “certain women\" via Trafalgar Square down to Westminster Abbey and sat down there for a while and wondered on the scenes the old walls and roof had looked down upon there. Thence to House of Lords but found they had just risen and gone into recess and then to Victoria Station by to Clapham Junction and ‘bus back to hospital. Passed the Coal Hole and at the Savoy noticed a tablet stating a dingy little courtyard in the tavern in the courtyard was a gathering place for Saw the Prime Minister going into Downing Street\n","28":"\n\nLeft at 9.30 am for Horseferry Road and found my board could not sit as papers had not arrived, so met Skene Smith and made for Hotel Cecil. Walked right up to Ludgate Hill and after a roam round St Pauls returned to the old Cock Tavern in Fleet St. for an old English meal of Roast beef. Old fashioned black fittings partitions between tables and a waiter of the old school. By ‘bus to the Bank of England and had a look through the foreign exchange department. Round the Exchange etc and then walked down Cheapside past Bow Church as far as St. Sepulchres with its old dull musty interior. Then to Batholomews Hospital being content with an outside view and then passed on under the quaintest archway in the “Ye olde Church of St. Bartholomew\" – green with age and full of interest. Spent an hour going thoroughly over the old place and examining Prior Boltons winton and the other sights. Raephere’s tomb was sandbagged. Turned out to the right into the Cloth Yard full of old Elizabethan houses. Saw a gang demolishing an old inn the Old Dick Whittington dated 1569!! Returned home via Victoria then to the Old Bailley. How quaint these old churches are with their mustiness and dullness. Their darkness, their silence. Went through the Crypt of St Pauls and saw Nelsons grave, Wellingtons & his old funeral car and Wren’s grave\n\nIn the Church of Sepulchre is the bell that used to be rung by the watchman in front of the condemned cell at Newgate what time a doggerel was recited flames of hell and true repentance etc. it was also a custom of this church to hand a bunch of flowers to each criminal as he made his way towards his death at Tyburn. Boards inside the church tell of record bell ringing done there. 5031 change rung in 3 ½ hours recently. The walls of all these old places are covered with dingy tablets and mural monuments.\n","29":"\n\nTo Horseferry Road and there saw Major Cross & received 3 weeks leave. Civilian in warrant room drew up trip & arranged to leave for Scotland on the morrow. Back to hospital packed up & then taxied in to Kings Cross Hotel (Item 7\/21) To Elysee (Leicester Square) for afternoon tea and received much glad eye. Pouring rain returned to hotel and took things easy. About 9.36 went out to have a look at the night side of London and found it very hard to find the way about owing to the pitch darkness of the streets of a Zeppelins. This very darkness is a premium to vice and the solicitation in Piccadilly Circus & Leicester Square is worse than anything I have ever seen while chemist shops flaunt rubber goods etc with electric signs\n","30":"\n\nEdinburgh Caught the Scotch express at 10 am and had a good run through lovely country similar to that between Bailleul – St. Omer – Steenwerck only England has more hedges and is much more trim. York & Durham are old fashioned old towns and Chester-le-Street is a quaint Dutch looking town. We ran into rain about Lincilnshire and the country took on a rougher aspect from there on. What lovely greens they get there in their woods and how smooth the trim meadows look. Newcastle is a big smoky place with plenty of coal about Berwick is an old place on a peninsula – naturally well fortified and easily able to take its place as a scene of many bloody border wars. We now ran along the sea for the rest of our journey passing Prstonpans and other familiarly named towns. The rain was now coming down properly and in a little sylvan valley I saw a “Scotch mist\" at home. Reaching Edinburgh put up at the North Britain and took a walk up Princes St above which towers a height with an old collection of buildings on top of it. Very Pretty. Noticed the Scott memorial. Very wet.\n","31":"\n\nSlept in until nearly 10, it being Sunday. After breakfast met Colonel Hutchinson and two other Australians and caught a char-a-banc for the Forth Bridge. Being Sunday the city was quiet and the weather was very dull and lowering. The road soon ran into open country and the scenery was delightful many little glimpses of wood and water and the most exquisite shades of green in trees and grass. Reached the Forth Bridge, the height of which is very great and the engineering of it is not realised until you walk across. It is 1 ¼ mile from one side to the other and a double line of railway runs across. The enormous size of the masonry pillars and the thickness of the steel girders now becomes apparent. On the far side (we crossed from Dalmeny) is a little stone village with plenty of soldiers & sailors and we dined at an inn there. The harbour towards Rossyth was full of ships of war and was an impressive sight. Returned to North Britain hotel for tea and after that walked round a bit. The girls are very goodlooking with lovely rosy faces and all the children are sturdy and rosy cheeked. Passed Arthurs Seat which was wreathed in mist and did not ascend it. Everyone has broad Scotch accent. Noticed boards up “Land to few\". A couple of miles takes you out among farms – the place is charmingly pretty.\n","32":"\n\nUp at 8.30 and after breakfast went to Cooks and booked for Trossachs, then walked up the hill to the Castle. An old guide, so Scotch you could hardly understand him , showed us round the place. Perched on its crag it dominates the city and its batteries of old guns must have been a good influence on the conduct of the town beneath. Mons Meg is a 20 inch gun and fired big stone balls or a hollow iron globe. Some N.Z. nurses were with us. The old chapel of St Margaret and the room where Argyll took his last sleep, the old banqueting hall the window from which James was lowered were all explained to us. Troops drilled doing goose step and ceremonial on the flat parade ground outside the main gate. Called in at St Giles Cathedral, a fine old place with much recent stained glass but many old, old things. Jenny Geddes threw her stool and Knox thundered here. Saw Knox’s house in Canongate Street. To Surgeons museum and had a good look at some of their specimens. All the wets still here. After lunch via squalid old Canongate to Holyrood Palace and saw Mary & Darnleys rooms with original beds & connected by staircase. Good tapestries on walls. Saw the little supping room where Rizzio was murdered & the brass plate denoting where his body was left. The old Abbey is ruined and adjoins. The vault of the Scotch kings was locked many stones denoted old graves. To the foot of Arthurs Seat and watched raw Tommies drill. No one allowed to the Seat for military reasons. Good view nevertheless\n","33":"\n\nEdinburgh, Glasgow & the Trossachs. up at 8 and left by the 9.6 train on Cooks Trossach trip. Detrained at Aberfoyle and coached to Loch Katrin passing through the most delightful and enchanting scenery which defies description. In many places the place reminded me ofImbros particularly in regard to the bare barren hills with their steep rocky sides and grazing black faced sheep. Boarded a boat at Loch Katrine which is a lovely lake with the most perfect reflections in the water. Loch Achray is a little gem though and we passed it before reaching Loch Katrine. From there we coached to Loch Lomond passing through rugged grand country. Our old driver (named Cleland) had driven the same coach for 49 years but has not yet been to Edinburgh and a youth of 14 proudly informed us in the broadest accents, that he had never been inside a railway train. Nearing Loch Lomond the road is most beautiful. We had afternoon tea at Inversnaid Hotel and after wandering round the falls there boarded a steamer and went right through Loch Lomond and its beauties calling at many sidings The lower part of the loch is studded with little green islands. Reaching Balloch pier we boarded the waiting train and arrived in Glasgow at 7.20 pm having covered 170 miles in 11 hours by road water and rail. The arrangements were excellent, no delay just step off steamer on to train & so on. Cols Hutchinson & with us\n","34":"\n\nGlasgow. Strolled round the streets nearly all the morning visiting different places of interest and find this a fine modern city with regular braod streets full of a bustling busy people. A fine city nearly twice as large as Melbourne. The trams are run by an enterprising municipality and are of the usual London double deck kind. The conductors are women and in many cases they are also drivers, The lower classes wear the shawl and have bare heads. Girls of 18 & 19 appear with their babies tucked into the shawl. In Britain one notices a total absence of 3d pieces which results in pocketsful of pennies very soon. In the morning ascertained that all trips through the Caledonian Canal by steamer were off and that passports were necessary for Inverness. Resolved on a modification of the trip getting no further than Oban. Visited the Glasgow Cathedral which is in the old town and rather “ungetatable\". A fine 900 year old (in parts) structure much too large evidently for present day use as seating is only provided from the choir forwards. The crypt beneath the choir is dank and wet. The churchyard is one close paved mass of tombstones (flat). Behind on a hill rises the crowded modern cemetery.\n","35":"\n\nGlasgow & River Clyde. left at 10.40 am from the river wharf at the Jamaica Street on the steamer Lord of the Isles and went right along the river to Dunoon & Lochgoilhead calling in at Greenock, Kilcreggan, Kirn, Blairmore & Carrick Castle as well. We passed all the ship building yards and it was a great eyeopener. Miles and miles of stocks and slips. Saw Harland & Noff’s yards & Boron’s, Yarrow etc. some yards had fleets of torpedo boats under construction others had submarines, big and little and here and there much larger vessels. In sheds and behind screens other work was doing. Liners and cargo steamers were also building and these miles of liners of industry resounded to the rivetting and clashing of intense work. The scenery when the open country is reached is very fine, the bare rugged hills go straight up from the waters edge and the green of pasture and woodland sets off the little stone villages. It was fine going out but it rained like the devil all the way back and detracted from the pleasure of the trip. Crowds of people aboard – many munition workers “spending up\" their high wages. Hordes of babies and shawled women carrying them. Reached Glasgow again at 8.30 pm. Cold & damp.\n","36":"\n\nGlasgow. a great day. Pottered round all the morning and at 2pm went up to the Windsor Hotel to Skene’s wedding. There were a good many guests and everything went off like clockwork. It was a homely little wedding and afterwards “the younger ones\" adjourned to the Central for tea and afterwards went to the Ahlambra music hall until 9 o’clock. Skene’s sister in law tres bon and also a little first year med girl. Spent a grand evening with them and really have never listened to anything so pretty as their Scotch accent. They twit us about our Cockney one. Out to Newlands for supper and some music and it was grand to get with a family again. All so homely and so Scotch. Bed 12 mid.\n","37":"\n\nRothesay, Kyles of Bute & Oban. Left Glasgow early and took train for Wemyss Bay changing there for a steamer to Ardrishaig. To Rothesay and round the top of Bute. The Kyles of Bute have exquisite scenery especially at which is a heavenly little spot. Plenty of holiday makers aboard & they nearly all went off here.\n\nOban. Passing out of the Kyles we glimpsed the open sea around Arran and then continued our course via Turbert to Ardrishaig. Land on either side all the way. Got a motor at Ardrishaig and motored from there to Oban. Very good roads past crag, fell & torrent and a lot of our 6 hour drive was taken up in the windings. The scenery was splendid, such shades of green and brown. In places the country is most barren and precipitous in others soft and well suited to the arts of husbandry. The lochs always have an impressive background of mountain. Reached Oban about 6.30 and put up at the Caledonian Hotel. The town seems to be a favourite tourist resort, of course this is the tourist season. Apparently most of the local folk are seafarers. The air is very cold which is rather unusual they say for this time of the year. Tired and have a rotten cold in the head the result of the trip down the Clyde two days ago. The sun set in a golden flame behind the Isle of Mull. At dinner the thought struck me, how tired waiters must get of the sight of food and ministering to the selfish gourmandising mountains of gut you encounter so often.\n","38":"\n\nSlept in being very tired and then had a loafing morning not going outside the door until after lunch. Walked then rather out of the town going inland along a pretty little glen heavy with green ferns and carpeted with a thick sole of grass. The trickle of water is heard everywhere. Above the town towers a big crag of rock covered with trees and other green but with many an outcrop, on top is a big circular stone structure like a Coliseum and then another place apparently ruined. Gaelic is spoken in all the homes here and English at school and elsewhere. The sunset behind Mull was gorgeous and the reflections in the still waters of the bay kept changing colour as the hour grew darker.\n","39":"\n\nTook train for Glasgow at 12.20 and came via Stirling passing through fine scenery en route. Passed in the distance Rob Roys grave, the ford where Bruce lost his broach and the house of Rob Roy (or was it Bruce?) burnt down by the soldiers of Montrose. Every glen seems to have its own local legend and an old Scotchman travelling with me explained. Reached Glasgow at 5 pm. Ad Balfour is staying at the Central too – a weird looking with a black soft felt hat & a walrus look. \n","40":"\n\nGlasgow - London. Left by the express at 10 a.m. and travelled right down the West of England via Carlisle and Crewe to Rugby and from there across to London. The day was fine and the country showed to advantage. How compact everything is – too compact for us who are used to large spaces. The country traversed was all farming and, except for stretches near the border, closely farmed. Most of the crops are in the stooks, the meadows looking as if rolled with a lawnmower and a trim hedge round all. Brooks and small rivers, with some canals, intersect the country. Farmhouses appear substantial and comfortable. Running into London we reached Euston and taxied from there to G.N.R. Hotel at Kings Cross. Went down town after lunch and had dinner at one of Lyon’s shops and then strolled round in dark, thronged streets. The demi-mondaines were in hordes plying their brisk trade. Searchlights piercing across the sky for Zepps. Made the acquaintance of Jeanette Dumart who lives at Q. Alex. Mansions Grape St Shaftesbury Avenue\n","41":"\n\nLondon. Went down to Buckingham Palace and then had a look at Pall Mall coming to the St James Palace in time to see the ceremony of the changing of the guard. Band in scarlet uniforms and busbies but the guards (Scots today) were in khaki. Some new men evidently – Australians could turn out a better guard for smartness in rifle exercises. The slow march is effective. Then to Westminster Abbey to soak in the glories of the dear old place once more and then to the 3rd London General & arranged for field kit to be sent up there from Base. Bazely Allan and the others gone. Spent afternoon with Jim Bird. Returning to town went up to Bank & then walked down Fleet St. to “Ye Olde Chesyre Cheese\" – a dear old inn stuck away in wine Court – an old haunt of Johnson & Boswell and quite unchanged. Old English waiters, old curtained “pews\", candles, & old fittings discussed the celebrated pudding & a mug of ale. Walked down Strand and then took tube to my hotel\n","42":"\n\nLondon & Bideford. To the Palace of St James and there again saw the guard mounting – crowds attracted thereby. Rather amused ath the breeches of some of the officers which are cut to resemble the Tommies trousers in the war they bunch over the puttees. Some knut has set this new unsightly fashion. The slow march from the parade ground to the street is very effective and so is the advance of the new towards the old guard early in the proceedings. We could turn out as smart a guard at rifle work any day. Caught 1 p.m. train for Bideford and went right through the south of England, which is much the same as the rest of the compact old country until Salisbury is reached. Approaching there the land becomes stony and poorer in nature. But after getting off the plain it gets back to “normal\" again. I noticed more old thatched houses and snug old “Frenchified\" villages than in other parts. After leaving Exeter (identified the Hall opposite the station I think) the country changes once more in gets more timbered and rougher. Reaching Bideford put up at Tantons hotel which seems a good place.\n","43":"\n\nBideford, Bucks Cross, Colvelly, Appledore, Northam. Took motor for Clovelly after breakfast and the patriarchal old chauffeur turned out to be a red hot scorcher and tore round the many corners of these twisty old roads at a speed that made one rather apprehensive at anything getting in our way. Beyond damaging a dog, no other casualties resulted. Along hedge lined lanes, past woods and snug thatched farmhouses and barns reminiscent of Steenwerck district, through Bucks Cross. Glimpses of the sea occur, and many a snatch of exquisite countryside, until you pass the head of the Hobby drive and glide through a particularly fine lot of thatched and whitewashed houses just outside Clovelly. Walking down from here one looks almost straight down hundreds of green tree covered cliff to the sea below but terraced from top to bottom is the unique doll-house like village of Clovelly. The High Street turns like a corkscrew and is in cobbled steps. The only animal traffic practicable is donkeys. The chimneys of one house vent their smoke on a level with the garden of that above. The street winds through at least one building and at last reaches the stony beach where are the Red Lion inn and a little old quay. The cliffs tower all round.\n\nSmugglers caves abound and this seems an ideal place for a rest. Came back via Abbotsham After lunch walked up a path alongside Torridge to Appledore – a winding track that passes once through a good fine wood with wealth of oaks. (Church at Clovelly has tablet to Will Cary). Appledore still does local ship repairing and the little yards were busy. From outside the town a good view of Westward Ho! Is obtained and the intervening country. Walked along the lanes to Northam an old place nestling round its church. An old stone by the roadside with a “Stop, stranger, stop!\" directs attention to the fact that King Hubba the Dane met his death hereabouts. Bideford is not far distant. It is a pleasant stroll through the old twisting High Street and then past the old Ship Inn where the Brotherhood of the Rose had birth. Dialect a soft burr “Draive slow Maister please!\". Not noticeable in middle class but pronounced in the lower order of people. At ordinary times Clovelly is deluged with day trippers this year fortunately free. A dear old place & not modernised with asphalt like Bideford & Northam.\n","44":"\n\nAfter breakfast walked over the old bridge and across the other side of Torridge along lanes in the direction of Torrington The roads are mostly sunken and enclosed with hedges. Glimpses of very quiet peaceful country, browsing herds etc. All trees are in full leaf – winter must be a different spectacle. Returned for lunch, the tide racing through the piers of the bridge and transforming the river from a shoaly stream into a fine estuary. The arches of the bridge are irregular – some small and some large. Walked round the older portion of the town along streets that twist in most tortuous fashion and made way back to Tantons. Caught the 3.40 p.m. train for Waterloo, changing at Exeter. At Salisbury one of our lads parting from his dainty little piece of fluff. Very affecting. Most resonant kisses. The country looks very snug and compact all along. Taxied to G.N.R. Hotel at Kings Cross and put up there. Little devil of girl in office all on for a joke.\n","45":"\n\nLondon. Up betimes and by tube to Piccadilly & then walked past rear of Whitehall (Guards on parade) to Westminster Abbey and there conducted by verger in all solemnity and installed in a stall in the ancient choir. – a good old seat and methought how many ancient and worthy persons sat there in its time. A good service with an excellent Te Deum well sung but a long long sermon The Abbey fascinates me with its stateliness and its beauty. I could go again and again just to revel in thoughts of its mighty past and the doings it has seen. Walked round the streets and got well lost and found myself up in Tottenham Road. Then to Wandsworth and saw our people. Peart is dead – a good and faithful servant. They say I am mentioned in despatches but I have not seen the paper. Found all kit had arrived and sorted over my stuff thoroughly discarding much. Home by taxi item 7\/2 due to being an office and it being infra dig to lug burdens about. After tea wrote. In Leicester Square today I saw \nnurses of rather\n women in nurses costumes soliciting Hygenic appliances for sale are blazoned everywhere\n","46":"\n\nTo Horseferry Road and was there boarded and found fit for general service and report to Perham Downs to join a draft on Thursday Spent the afternoon at Wandsworth with wounded and returned to town late for dinner at Cock Tavern. Old fashioned waiter etc.\n\n"}}