{"Document Name":{"0":"Diary_0182","1":"Diary_0182","2":"Diary_0182","3":"Diary_0182","4":"Diary_0182","5":"Diary_0182","6":"Diary_0182","7":"Diary_0182","8":"Diary_0182","9":"Diary_0182","10":"Diary_0182","11":"Diary_0182","12":"Diary_0182","13":"Diary_0182","14":"Diary_0182","15":"Diary_0182","16":"Diary_0182","17":"Diary_0182","18":"Diary_0182","19":"Diary_0182","20":"Diary_0182","21":"Diary_0182","22":"Diary_0182","23":"Diary_0182","24":"Diary_0182","25":"Diary_0182","26":"Diary_0182","27":"Diary_0182","28":"Diary_0182","29":"Diary_0182","30":"Diary_0182","31":"Diary_0182","32":"Diary_0182","33":"Diary_0182","34":"Diary_0182","35":"Diary_0182","36":"Diary_0182","37":"Diary_0182","38":"Diary_0182","39":"Diary_0182","40":"Diary_0182","41":"Diary_0182","42":"Diary_0182","43":"Diary_0182","44":"Diary_0182","45":"Diary_0182","46":"Diary_0182","47":"Diary_0182","48":"Diary_0182","49":"Diary_0182","50":"Diary_0182","51":"Diary_0182","52":"Diary_0182","53":"Diary_0182","54":"Diary_0182","55":"Diary_0182","56":"Diary_0182","57":"Diary_0182","58":"Diary_0182","59":"Diary_0182","60":"Diary_0182","61":"Diary_0182","62":"Diary_0182","63":"Diary_0182","64":"Diary_0182","65":"Diary_0182","66":"Diary_0182","67":"Diary_0182","68":"Diary_0182","69":"Diary_0182","70":"Diary_0182","71":"Diary_0182","72":"Diary_0182","73":"Diary_0182","74":"Diary_0182","75":"Diary_0182","76":"Diary_0182","77":"Diary_0182","78":"Diary_0182","79":"Diary_0182","80":"Diary_0182","81":"Diary_0182","82":"Diary_0182","83":"Diary_0182","84":"Diary_0182","85":"Diary_0182","86":"Diary_0182","87":"Diary_0182","88":"Diary_0182","89":"Diary_0182","90":"Diary_0182","91":"Diary_0182","92":"Diary_0182","93":"Diary_0182","94":"Diary_0182","95":"Diary_0182","96":"Diary_0182","97":"Diary_0182","98":"Diary_0182","99":"Diary_0182","100":"Diary_0182","101":"Diary_0182","102":"Diary_0182","103":"Diary_0182","104":"Diary_0182","105":"Diary_0182","106":"Diary_0182","107":"Diary_0182","108":"Diary_0182","109":"Diary_0182","110":"Diary_0182","111":"Diary_0182","112":"Diary_0182","113":"Diary_0182","114":"Diary_0182","115":"Diary_0182","116":"Diary_0182","117":"Diary_0182","118":"Diary_0182","119":"Diary_0182","120":"Diary_0182","121":"Diary_0182","122":"Diary_0182","123":"Diary_0182","124":"Diary_0182","125":"Diary_0182","126":"Diary_0182","127":"Diary_0182","128":"Diary_0182","129":"Diary_0182","130":"Diary_0182","131":"Diary_0182","132":"Diary_0182","133":"Diary_0182","134":"Diary_0182","135":"Diary_0182","136":"Diary_0182","137":"Diary_0182","138":"Diary_0182","139":"Diary_0182","140":"Diary_0182","141":"Diary_0182","142":"Diary_0182","143":"Diary_0182","144":"Diary_0182","145":"Diary_0182","146":"Diary_0182","147":"Diary_0182","148":"Diary_0182","149":"Diary_0182","150":"Diary_0182","151":"Diary_0182","152":"Diary_0182","153":"Diary_0182","154":"Diary_0182","155":"Diary_0182","156":"Diary_0182","157":"Diary_0182","158":"Diary_0182","159":"Diary_0182","160":"Diary_0182","161":"Diary_0182","162":"Diary_0182","163":"Diary_0182","164":"Diary_0182","165":"Diary_0182","166":"Diary_0182","167":"Diary_0182","168":"Diary_0182","169":"Diary_0182","170":"Diary_0182","171":"Diary_0182","172":"Diary_0182","173":"Diary_0182","174":"Diary_0182","175":"Diary_0182","176":"Diary_0182","177":"Diary_0182","178":"Diary_0182","179":"Diary_0182","180":"Diary_0182","181":"Diary_0182","182":"Diary_0182","183":"Diary_0182","184":"Diary_0182","185":"Diary_0182","186":"Diary_0182","187":"Diary_0182","188":"Diary_0182","189":"Diary_0182","190":"Diary_0182","191":"Diary_0182","192":"Diary_0182","193":"Diary_0182"},"Date":{"0":"unknown","1":1568.0,"2":1569.0,"3":1570.0,"4":1594.0,"5":1595.0,"6":1596.0,"7":1597.0,"8":1598.0,"9":1599.0,"10":1600.0,"11":1601.0,"12":1603.0,"13":1604.0,"14":1605.0,"15":1606.0,"16":1607.0,"17":1608.0,"18":1609.0,"19":1612.0,"20":1613.0,"21":1614.0,"22":1615.0,"23":1616.0,"24":1617.0,"25":1618.0,"26":1619.0,"27":1620.0,"28":1621.0,"29":1622.0,"30":1623.0,"31":1624.0,"32":1625.0,"33":1626.0,"34":1627.0,"35":1628.0,"36":1629.0,"37":1630.0,"38":1631.0,"39":1632.0,"40":1633.0,"41":1634.0,"42":1635.0,"43":1636.0,"44":1637.0,"45":1638.0,"46":1639.0,"47":1640.0,"48":1641.0,"49":1642.0,"50":1643.0,"51":1644.0,"52":1645.0,"53":1646.0,"54":1647.0,"55":1648.0,"56":1649.0,"57":1650.0,"58":1651.0,"59":1652.0,"60":1653.0,"61":1654.0,"62":1655.0,"63":1656.0,"64":1657.0,"65":1658.0,"66":1659.0,"67":1664.0,"68":1665.0,"69":1666.0,"70":1667.0,"71":1668.0,"72":1669.0,"73":1670.0,"74":1671.0,"75":1672.0,"76":1674.0,"77":1675.0,"78":1676.0,"79":1677.0,"80":1678.0,"81":1679.0,"82":1680.0,"83":1681.0,"84":1682.0,"85":1683.0,"86":1684.0,"87":1685.0,"88":1686.0,"89":1687.0,"90":1688.0,"91":1689.0,"92":1690.0,"93":1691.0,"94":1692.0,"95":1693.0,"96":1694.0,"97":1695.0,"98":1696.0,"99":1697.0,"100":1698.0,"101":1699.0,"102":1700.0,"103":1701.0,"104":1702.0,"105":1703.0,"106":1704.0,"107":1705.0,"108":1707.0,"109":1708.0,"110":1709.0,"111":1710.0,"112":1711.0,"113":1712.0,"114":1713.0,"115":1714.0,"116":1715.0,"117":1717.0,"118":1718.0,"119":1719.0,"120":1720.0,"121":1721.0,"122":1722.0,"123":1723.0,"124":1724.0,"125":1725.0,"126":1726.0,"127":1727.0,"128":1728.0,"129":1729.0,"130":1730.0,"131":1731.0,"132":1732.0,"133":1733.0,"134":1734.0,"135":1735.0,"136":1736.0,"137":1737.0,"138":1738.0,"139":1739.0,"140":1740.0,"141":1741.0,"142":1742.0,"143":1747.0,"144":1748.0,"145":1749.0,"146":1750.0,"147":1751.0,"148":1752.0,"149":1753.0,"150":1754.0,"151":1755.0,"152":1756.0,"153":1757.0,"154":1758.0,"155":1759.0,"156":1760.0,"157":1762.0,"158":1763.0,"159":1764.0,"160":1765.0,"161":1766.0,"162":1767.0,"163":1768.0,"164":1769.0,"165":1770.0,"166":1771.0,"167":1772.0,"168":1773.0,"169":1774.0,"170":1775.0,"171":1776.0,"172":1777.0,"173":1778.0,"174":1779.0,"175":1781.0,"176":1782.0,"177":1783.0,"178":1786.0,"179":1787.0,"180":1788.0,"181":1800.0,"182":1801.0,"183":1802.0,"184":1808.0,"185":1813.0,"186":1814.0,"187":1815.0,"188":1821.0,"189":1822.0,"190":1824.0,"191":1825.0,"192":1830.0,"193":1832.0},"Entry":{"0":"\n\n","1":"\n\nWet day. Fritz still sending over a few shells. The anti-tank gun supposed to be in position today; Goodbye to gun and crew some of these day when the Huns spot it. A big row on in Bty. V.O. objects to horses going on long trips in one day, one team in G.S. Wagon went 50 Kilometres, result one horse Laminitus.\n","2":"\n\nPartly wet, Fritz still shelling. If he increase his range, he will be right on to us.\n","3":"\n\nFive S.O.S. on different part of the line last night. Our Bty. fired in the lot. One of the 15 men knocked out, some shots very close to our lines. Enemy aeroplanes over, dropped some bombs. Went to hospital sick, Pneumonia, carried out on a stretcher.\n","4":"\n\nLeft Calias","5":" General Hospital at 2 p.m. Arrived at Bolougne 8 p.m. In charge of 19\n\nmen. While waiting for the train at Calias, my Bty. come through on train, going north. For two pins I would join up and go with them, instead of going to a comvalasent camp; but having 19 men in my charge, and no N.C.O. to hand over to I went with them to C.C. Feeling a bit off colour, turned out of hospital, and had to walk 3 miles, and then get on board train and stand up in a horse truck for 6 hours, and then wait for motor bus to take us on to No. 7 C.C. depot, arriving there about 10 p.m. Rotten hole, parades all day long.\n","6":"\n\nBitterly cold, wind. Not wanted in this camp, shunted to another, this time No. 10 C.C. Raining a treat, had to walk about 4 miles, mostly up hill. About 3,000 men here from diffrent regiments, I am in a hut with a lot of Tommies, make a man sick, the damn lot of lead swingers. N.C.O. trying their utmost to dodge going to join their units. On the","7":" of last month the Germans made a\n\npush. They are still going, capturing village after village. Our hospitals full of wounded, and men who think they are wounded and sick. I have seen men from English regiments come into hospital one night, and away the following day. The nurses in the Calias hospital, packing up and sending their gear to England, ready to clear out.\n","8":"\n\nParade before M.O. Classed as fit for active service. The doctor did not want to let me go, said stop here another week. Glad to get away from here.\n","9":"\n\nArrived at St. Martins detail camp Bolougne at 12-30 p.m. 16 Sgts. in one tent. Had dinner in Sgts. mess. Weather cold, snow and wind.\n","10":"\n\nLeft camp, 1,600 men marched to Bolougne station, en route for base camp.\n","11":"\n\nArrived at Harfleur, near Le Havre at 6 a.m. after about 36 hours in the train. Raining in \n\ntorrents, in a rotten tent. This is an Artillery camp, where we are all Australians. Other Australian units are alongside. This is the A.G.B.D. Australian General, Base Details .\n","12":"\n\nStill in base details camp. Today the weather is fine. 240 men Artillery arrived here last night from England.\n","13":"\n\nDetailed to take a draft of 5th Division Engineers up the line. Left Le Havre at 4 p.m. on 24-4, arrived at Pernois 8 a.m. on the","14":" I then had to report at the engineers camp, and hand over my men, and get the docket signed. Next I reported at Canaples, two kilometres further on, to the R.T.O., who ordered me to catch the 4 oclock train (which did not run). Nothing to eat all day. I eventually boarded a goods train at 6 p.m.\n","15":"\n\nLeft Canaples at 6 p.m., arrived at Abbeville 10 p.m. Had something to eat at Y.M.C.A. hut. Left here at 9 a.m. arrived at Hafleur 2 a.m.\n\n27 inst. Hundreds of French troops on the road.\n","16":"\n\nAt base detail camp, Dog tired, and hungry, dirty and lousy. Weather fine. Paraded to officer in charge to get put on draft, to rejoin my unit.\n","17":"\n\nWarned for draft to rejoin Bty. Weather wet, and cold.\n","18":"\n\nParade at 5-30 p.m. to entrain at Le Havre. Wet weather.\n\n30-4-1918, Le Havre\n\nThe 5-30 p.m. parade cancelled. Move off now at 2-30 a.m. On board train by 6 a.m. I am writing this in the train. I am in charge of 31 men including one A.M.C. prisoner. Today so far is fine (10 a.m.) ordered back to camp. Our train was to be attached to a French passenger train. The French authorities objected, and the result was, we had to walk back to camp, about 6 miles. The\n\nprisoner refused to walk, a real rotter. Got back to camp just in time for dinner.\n","19":"\n\nWarned again to move off at 5-30 p.m. Today is showery. 250 Artillerymen marched in here this morning. An Infantryman shot himself yesterday. This base camp is a home for some men. Men have been here for 12 and 18 months at a stretch, name not on the roll. Plenty of entertainments here such as moving pictures, concerts, lectures & etc., mostly free. The Bishop of Bathurst, C. of E. is in charge of the C. of E. hut. He is a captain. The Salvation Army caters for the troops in their hut. You get a cup of tea and a packet of biscuits for 3 pence. The Y.M.C.A. is doing the same.\n","20":"\n\nLeft Havre at 3 p.m., arrived at Reoun 7 a.m. and marched to rest camp, had breakfast and dinner there. Entrained at 4 p.m. Moved out at 5-30 p.m.\n","21":"\n\nArrived at Berquete at 4 p.m. Marched to rest camp 6 miles.\n\n4-5-1918, Lingham\n\nReveille 6-30 a.m. marched to gas school, fitting on gas helmets. Drew iron rations, ready to move tomorrow. Nothing doing this evening.\n","22":"\n\nLeft Lingham camp 12 midday, arrived at another rest camp, 50 tents in a paddock. Walked about 10 miles, the last mile or so in the pouring rain. I am now in charge of 5 men (Artillery).\n","23":" In action Borre\n\nArrived at Bty. 3 p.m. Guns in action. No casualties in this position. The","24":" Bty. had almost all of the officers killed or wounded. Lieut. Short killed. He was one of our Sgts. leaving Sydney. Lieut. Coleman also killed. Major Randell wounded. Major Selmes is now C.O., D.A.C. Plenty of shells about. We are amongst the French.\n","25":"\n\nTerribly wet. Terrific bombardment this evening.\n\n8-5-1918, Wagon Line Le Brearde \n\nBeautiful fine day. Terrific gun fire all night, 10 horses killed and 8 evacuated to mobile, belonging to 101st Bty. Saw a Hun aeroplane brought down this evening. Shells flying about all over the place. The Hun is again massing behind his line. Several of these masses have been smashed up by our gun fire.\n","26":"\n\nFine day. Hun shelling a wood about 1,000 yards away. He started off with small shells. Then he changed to heavy and high velocity. A shell falling every few seconds. A few Hun aeroplanes over, flying very high. The","27":" Battalion of Infantry coming out of the line this evening. The village of Mont Des Cats on fire. This village is built on a hill, the highest point about here. It is practically no mans land.\n","28":"\n\nMorning foggy, day fine. Most wonderfully quiet, Troops changing over, a bit of a stunt\n\nlate in the evening. One gun returning from workshops.\n\n11-5-1918\n\nVery quiet morning. Lieut. Duffy hospital. Brother Vance promoted to Sgt. Major 5th Bty.","29":" Brigade. Sgt. Crane and Corp. Nelson rejoined Bty. Major Byrne inspecting horses this evening.\n","30":"\n\nFoggy, with rain in the morning. Things extremly quiet. A rather laughable incident occurred the other day. Some of our Infantry captured a pig, away up forward. They killed it, and were carting it down on a stretcher, when a General met them. Another casualtie he asked, the diggers answered, yes. The General then asked if he was dead. They again answered yes. The General saluted and rode on. I saw another Infantryman regulating the traffic, rigged out in a top hat and evening dress coat. During the last retreat, we must call it a retreat, some of the civilians got 20 minutes to get away\n\nconsequently everything was left behind, so when the troops arrived, they looted the houses, and now it is nothing to see, privates dressed in white starched shirts, black vests, and ankle shoes. In the Bty. we have a cow captured in the front line. The civilians are gradually creeping back with horses and wagons, salvaging their goods and chattels. The villages are absolutely destroyed. One house, a large building with red tiles, within range of the Hun guns, has a number of tiles broken almost daily. The old Frenchman said that he will keep on repairing it, as long as the tiles are broken. During my absence in Hospital, Staff Fitter Gyson was awarded the M.M. and Sgt. Torpey a bar to his M.M.\n","31":"\n\nShowery all day. Hun aeroplanes over in dozens. Dropping bombs. Inspection of our horses by D.D.V.S. and A.D.V.S. Things quiet.\n","32":"\n\nInspection of horses by the 15th Corps Commander\n\nand General Anderson and staff. Report good. Our planes very busy day and night.\n","33":"\n\nTerrific Hun bombing last night. Three waves over, dropped hundreds of bombs. The ground quivered with the explosions. They even come over with lights up, and so confused our people. Col. Dean inspecting our horses. He said that the report from the Major General, British horse master was excellent. 15 pdr. ammunition drawn from D.A.C.\n","34":"\n\nEnemy bombing not so extensive last night. Day hot. Some rough shelling in rear of our wagon line. A few casualties. As soon as it is dark, over come the enemy planes. Sixteen search lights were in action last night. Two reinforcements for Bty. arrived. They are the first to arrived at Bty. via Italy.\n","35":"\n\nWent to gun position this evening. Things very quiet. Bty. shooting at diffrent times during the day, and night. Whilst I was there, the\n\nright section fired, one gun 13 rounds, and the other 12 rounds, Section salvos. On my way back to wagon lines, I fired a shot out of a 6 inch Howitzer. Target, roads. This was the 38th Howitzer Seige Battery. We have about 25 horses turned out in good grass at Bty. position; that was the reason I went to Bty., to have a look at them. Fancy having horses running loose at a gun position, a few hundred yards in rear of guns. That will illustrate the quietness of the position. A large number of gunners sick. The Doctor says it is black fever. The sickness lasts only a few days, Temperature up a terrible height, 103 & 104 deg. Farrier Sgt. Kaglund before the General, applying for a transfer to the Flying Corps, approved by the General.\n","36":"\n\nToday, hot. The Huns have registered our Bty. Shelled heavily last night, no casualties. Our horses will now be moved. Enemy planes over again during the night. Saw an aeroplane photo of Bty., every object showing up plain.\n","37":"\n\nQuiet day, weather still continues fine. A bit of a stunt coming off tonight. The Bty. opens fire at 8 p.m. No officer in wagon line. Our 15 pdr. went into action last night, gone forward, an anti-tank gun. Enemy aeroplanes over again last night. A few bombs were dropped as we say on the outer circle, a fair way from our lines.\n","38":"\n\nBattery Sgt. Major Crittenden to go to St. Johns Wood (O.T.C.) tomorrow. Sgt. Torpey acting B.S.M. Weather still good. A few shells flying about. Enemy planes fairly quiet. The French made a slight advance on our left, captured 200 prisoners.\n","39":"\n\nQuietness still prevails. Weather remaining fine 80 deg. in the shade, seem terrible hot. B.S.M. Crittenden away. Good bye and best of luck.\n","40":"\n\n1,350 rounds of ammunition to go to Bty. Two enemy planes down last night. A big stunt on\n\nalmost all night. Today hot. Capt. Staley with us again. The Generals two horses shod today, last shoeing very unsatisfactory, waiting until I come back from dock. I now hear that I was to have stopped at the D.A.C. for a time to have a spell, but the strings were pulled, and I was taken on the strength of Bty., and the Farrier who take my place supernumery.\n","41":"\n\nDirty windy day, nothing doing. Very few enemy planes about last night.\n","42":"\n\nRaining all day. 456 rounds of ammunition to Battery. Today is as cold as an Australian winter day. Some heavy Btys in field near our horses lines, likely to draw crabs (enemy fire). Capt. Staley is showing, had about 18 or 20 men at office this morning, for being absent from early morning parade. Two of my shoeing smiths amongst them. He awarded them two horse piquets. In this Bty. shoeing smiths don’t do piquets.\n\nScottish regiments going into the line.\n","43":"\n\nAccording to prisoners captured by us, Mont Des Cats, which is just in rear of our position, is supposed to be taken by the enemy today. So far, 8-30 a.m., it is still ours. The Huns were to use a new gas. Hundreds of Scotch passed by here last evening. Kilted regiments. Made and put a pair of bar shoes on W.O. Fitzsimmons’ horse, under V.O. instructions. Very bad quarter crack. In fact one inside quarter the piece had to be cut away, hanging by a thread. One of our horses suffering from Tetanus. The day is fine but cloudy.\n\n26-5-1918\n\nThe horse suffering from Lock jaw, destroyed this morning at 7-30. This horse had a bolt run into its foot, about a fortnight ago. My horse run over by a motor wagon, crushing the inside of his off hind foot, the wheel of wagon went between his hind legs. He was always frightened of motor traffic.\n\nNow waiting for a float to convey him to Vet Mobile Section. A bit of a raid by our people last night. A feeble raid by the enemy. Artillery active all night. A big stunt going on, now on our left 6-30 p.m. on French sector. One gun out of action, going to workshop. 450 rounds of ammunition to Bty.\n\n27-5-1918\n\nDay fine. Our Artillery active. One of our large ammunition dumps bombed and set on fire, the other night, illuminating the country for miles around. Thousands of rounds destroyed. The Hospital in St. Omer was also bomed. Casualties heavy. Our ration dump shelled, they moved. The anti-tank gun attached to Bty., pulled back some 300 yards. A team of donks left here at 1 a.m. They were successful.\n\n28-5-1918\n\nWagon line shelled, on and off all day. Started this morning at 6-30. The cooks mate of 1st Battalion blown sky high. Three\n\nmen killed, and three wounded in 1st Bty. In the morning we moved our horses. Capt. Staley, Q.M.S. Hunter and Sgt. Torpey, out to select another wagon line. These shells are 6 inch high velocity, armour piercing. Pieces flying in all directions hundreds of yards away. Casualties heavy in back aeria. 28 casualties in Brigade. Saw one shell go through the roof of the 101st Bty. billet. No one injured. The cook house and cooker of 1st Battalion blown to atoms, men evacuated. The enemy is sweeping and searching for the heavy guns on the flat, and everybody is getting a share.\n","44":"\n\nOur order to move wagon line cancelled. The 1st and 101st moved last night, and this morning. The casualties in","45":" Bty. up to now are four dead and two wounded. One horse in 101st both hind legs broken. Rather a peculiar break, in one leg, half of the cannon bone carried away, and the upper pastern, leaving the foot hanging by a piece\n\nof skin. This evening the enemy brought down 3 of our baloons in flames. This piece of work was performed by one plane only. Our barage was intense, but he managed to get back to his own lines. At times he seemed to wabble considerable. No shelling in our vicinity, only a few pot shots at our baloons. The Yanks are getting about this quarter. Another one of our baloons down in flames 8 p.m.\n","46":"\n\nFoggy morning. Enemy shelling all night. The French lost a lot of ground about Rheims. Two more","47":" Battalion Infantryman killed this evening; Fritz got into their Head Quarters, and put in 40 shells, done a lot of damage. A lot of Tommy Infantry going up into the line just now 7-30 p.m. Sports are to be held here on Sunday, weather and Fritz permitting. The Huns are using a new gas, called yellow cross gas. Two pairs of white cotton, and one pair of leather gloves to be issued. After exposure to gas, they\n\nare to be soaked in hot water, this is to free them from gass. A pigeon was shot at Bty. today carrying a German message. One of our Corpl. took it to D.A.\n","48":"\n\nFine day. Extensive bombing by the enemy. This is worthy of note, as the British authorities were asked by the Pope, not to bomb Cologne on the","49":" as a religous festivity was being celebrated. The Feast of Corpus Christi. Last night was terrible. Bombs dropped all around us. Where the 1st Bty. were camped an aerial torpedo was dropped, making an awful hole. These Huns are mongerels. During the interval of no bombing, they rushed troops and munitions up to firing line. One of our drivers injured jumping a horse. Horse fell.\n","50":"\n\nFine day. Enemy aeroplanes over during the night. German shelling the villages in vicinity of our gun position. Several fires started. Sports to be held tomorrow.\n","51":"\n\nFierce Artillery work. Last night 280 prisoners captured, including some Artillerymen. Very seldom are Artillerymen captured. I note that tomorrow is the King’s birthday. Sports this evening I was in two tug of war teams, one on horse back, the other on foot, winners in both events. A concert was held in the evening.\n","52":"\n\nOur Capt. (Staley) is laid up. In thanking the concert party last night, he sprained his ankle stepping off the platform. Lieut. Irwin back from school.\n","53":"\n\nFurther particulars to hand about the last stunt. We captured a number of machine guns, trench mortars, and 2 77 mm. guns, also an Artillery officer. The prisoners were Saxons and Prussians. It appears that they were changing over. Birthday honours Major Byrne D.S.O. Weather fine but cloudy. 456 rounds of ammunition to Bty.\n","54":"\n\nTwo of our baloons brought down in flames. Continuation of sports this evening. Major Byrne taking Colonel’s place, who is ill in hospital.\n","55":"\n\nTwenty five men in wagon line sick. Black fever. Saw a great fight between a German plane and three of ours. A splendid piece of work by the Hun, as brave as any man living. Although an enemy, one must admire such men; he did not turn tail and try to fly away, but attacked, and attacked again. He was in a single seater with one machine gun, that fired forward, he had a bit of manoeuvring to get his gun covering his enemy. Dived, side stepped, and looped the loop. He forced one of our planes to land. At last he was forced to land, slightly wounded in neck. His plane was painted a flaring red. It was considerably smashed up.\n","56":"\n\nStarting to rain. General Anderson inspecting our lines this evening. The usual complaints. Thirty men down with dogs disease. Fairly quiet during the day. Artillery active during the night.\n","57":"\n\nCloudy, indications of rain. W.O. Fitzsimmons awarded the D.C.M. Five remounts recieved (scrubbers). Sports on at D.A.C. this evening. Over thirty men out of action with Influenza the doctor now says it is. Our Infantry standing too, expecting a hop over. Two gun pulled back. The heads say, 6 guns make to large a target. A map found on a captured officer, shewed the 1st and 3rd Btys. wagon lines marked on it. They were both shelled previous. Our gun position and wagon line were not shown. The whole of my staff is ill.\n","58":"\n\nCold snap. Showery, nothing doing. One driver Bertleson a Dane sold a cow for\n\n500 Francs, he is missing. If I had my way, none of these Danes, Russians, & etc. would be in the Australian Army. They are a great trouble.\n","59":"\n\nTerrific Hail storm at midday. This evening fine. Great aerial activity. Hundreds of our aeroplanes about. Artillery active every night. General’s Pony shod today. By the look of our air force now, it is certain that we have supreme command of the air. Never saw so many aeroplanes.\n","60":"\n\nFine day. The sickness in camp almost stamped out. Two horses stolen off lines last night. So far only one has been recovered. It was at Vet Mobile Section lame. Got a clue to the other. Our planes busy. Seldom see any of Fritzs planes over our lines. I believe he is reserving his air force for some special occasion. The Bty. very quiet, only periodical shoots.\n","61":"\n\nTwo horses to go to mobile. Rumoured that the 2nd Brigade hop over tonight, no objectives, go as far as possible. Sgts. changing over at gun, Corpls. taking their place. Some poor horses sent to paddocks near guns. Driver Wiggans wounded in leg by a piece of high explosive.\n","62":"\n\nThe stunt last night successful. Cloudy indications of rain. Our cook Gr. Dingle gone to hospital. The General’s motor car driver dead, sick 2 days. Staff Fitter Sgt. Gyson promoted to 1st Class W.O. The lost horse recovered. The 27th Division stole them. Major Selmes acting Colonel.\n","63":"\n\nWeather dull, cloudy, and windy. Our Bty. is quiet. Today is Friday our usual pay day. Paid every two weeks. Rumoured that General Fock is going to make a big move. 450 rounds of ammunition to guns.\n","64":"\n\nA stand too, ordered tonight. Twelve teams to take ammunition up to Bty. Reserve position. Our Major sent his kit down to wagon line. Three of the enemies baloons down in flames, (Troop cheered) and one broke away from its moorings. All this happened this evening. Fritz is expected to attack, but I hear that we are about to attack, no definite objectives. Weather cloudy, and cold.\n","65":"\n\nThe stunt did not come off last night. I was working up till 10-30 p.m. making foot holds, to be driven into a tree, used as an O. Pip, no excuse this work must be done tonight. Our gun teams to report to Bty., 9-15 p.m. the first one, and every 15 minutes interval. They are to move the guns to the alternative position. One Gr. wounded (Watson).\n\n17-6-1918\n\nEnemy aeroplanes over last night, dropped a few bombs, some shells over also\n\nmostly all duds. Our planes about in force. Just saw 36 altogether. The Huns bombarded the right of Borre this morning. We are again moving our guns tonight. Weather cloudy. Two Hun planes collided in mid air at 3 oclock this morning. Teams to pull guns back to old position 3-15 a.m.\n\n18-6-1918\n\nShowery. The usual stunt again tonight, moving guns and ammunition to battle position. Major Byrne to school at Calias. Went over to 5th Bty. to see brother, he is well.\n\n19-6-1918\n\nThis morning showery. Clearing off now 6 p.m. No news, nothing doing, things exceptionally quiet. Numerous planes about. 15 teams out tonight moving guns and ammunition. Saw a most daring performance by Hun airman, he attacked one of our baloons, about 3 kilometres behind our wagon line. Our air craft guns\n\nopened up on him. He missed the baloon, one man jumped out. The Hun then made off to another baloon. This time 2 men jumped out. Again he missed his mark. That was the end of him, 15 of our planes come out of the clouds. The last I saw was a trail of smoke, and an aeroplane diving to earth. Our planes now travel about in what they call a circus. I have seen as many as 30 flying together; They make short work of any Huns.\n\n20-6-1918\n\nEnemy aeroplanes over, dropped 6 bombs, no damage done, dropped in a field. 300 rounds to be fired by each gun. Three guns out of action. Weather cloudy.\n\n21-6-1918\n\nRaining all night. The 101st had a claim put in against them for 2,000 Francs, from a French farmer. The items were, 35 fowls, 2 pigs, 2 calves, 60 bags of potatoes, and some green stuff, clover, wheat & etc. A Sgt. Major reported to Bty., Sgt. Major\n\nWright, from 6th Bty., 2nd Brigade. No Sgt. M. are made in a Brigade and get a Bty. in that Brigade. A 1st Bde. man must go to 2nd Bde., and a 2nd Bde. man to","66":" Bde.\n","67":"\n\nDull and cold. An anti-tank gun crew to go forward. Scarcety of horses, the first line wagon to have only 4 horse teams, Howitzer Btys. 4 horse teams all round.\n","68":"\n\nThe Germans attack last night on our sector. They were driven back with great loss. We recieved an order for gun teams at 11-45 a.m. to take guns forward. Everything O.K. no casualties. Today is Sunday. Just been inspecting a wind mill, for grinding wheat. It was built in 1790, wonderful construction all wood. Very peculiar weather, with wind and rain. The names of all 1914 men taken and forwarded to B.H.Q. Total in Bty. 53. Our aeroplanes active all night.\n","69":"\n\nWet evening. The 2nd Battalion attacked last evening. All objectives gained. Mettren is in our hands. General Anderson inspecting our horses and lines.\n","70":"\n\nFine day. Major Selmes, acting C.O. inspecting wagon lines this evening. Some men going to Australia. Our Artillery made a mistake last night, started a barage 200 yards behind our own line, it was a creeping one, it went into our first line, and then stopped. The Artillery band here this evening. Saddler Sgt. Hoyes of 3rd Bty. received the M.S.M.\n","71":"\n\nWednesday, half holiday, Cricket match between D.A.C. & 2nd Bty. D.A.C. winners. Weather fine 456 rounds of ammunition to Bty. Major Byrne returned from Calias. Three men went to B.H.Q. Two going to Australia, not selected yet.\n","72":"\n\nThe G.O.C. and Mr. Hughes, Prime Minister, were supposed to visit our wagon line this evening. They did not arrive. 900 rounds of ammunition, smoke shells sent to Bty. Our air craft exceptionaly busy. One of Fritzs aeroplanes over last night, he was accorded a warm reception. Subsection cricket match on.\n","73":"\n\nHeavy thunderstorm at midday. A big stunt started at 6 a.m. Result, advance of one mile on a four mile front. Hundreds of aeroplanes about.\n","74":"\n\nA raid by our people successful, 40 prisoners, 6 machine guns, and two trench mortars. Two Hun planes over this evening. Six wagon loads of ammunition to Bty. A bit of a stunt on by Fritz. The canteen in this Battery is awful. All of the mongrels of the British and Australian armies congregate there, men drunk and unable to do their duty. If I had my\n\nway, drink of every kind would be certainly cut out, and the labour employed in the production, would be used to a better purpose. This drink is one of the many causes of prolonging the war. Why should officers be able to sign a chit, and send it to an E.F.C. and get one or two cases of whisky. I have proved that drink (beer or spirits) is not necessary. Q.M. Sgt. Gibson awarded the M.S.M.\n","75":"\n\nFine day. 456 rounds of ammunition to Bty. Half holiday, this evening, Sunday. One Officer and 5 men to go to rest camp Boulogne.\n","76":"\n\nLimbers up to gun position, ready for a move. Six loads of ammunition there also. Enemy planes over during the night wounded 2 Officers in 1st A.S.C. The town of St. Omer bombed. Our planes busy. Saw 27 in one squadron, coming to aerodrome, and even then Fritz sneaked over our line. The 6th Bty. moving their guns. 408, 8 inch shells just on right\n\nof position.\n","77":"\n\nLiet. Irwin, on leave to England. Today is fine, but windy. General Walker taken away from the Australian Army; I hear that all Imperial Officers are recalled. Sub-section cricket match still on. These matches are played after evening stables. Stumps drawn 9 p.m. A terrific air fight about 8-30 p.m. Thirteen or fourteen machines mixed up in it; two aeroplanes crashed to earth; one shot to pieces. Don’t know if they were our planes or not. This stunt only lasted about 5 minutes.\n","78":"\n\nThe result of aeroplane battle yesterday, was two of ours, and three of theirs. Five enemy planes tackled three of ours. Major Byrne in wagon line this evening; 456 rounds of ammunition to gun position. Today is cold and windy. A little Artillery fire on our left, which is the French sector.\n","79":"\n\nA few Hun planes over, flying very high. Another 456 rounds of ammunition to Bty. position. Large number of American troops about here. Most of the French troops are going down towards Paris. They are to defend Paris.\n","80":"\n\nLast evening at 9-15 the Germans opened a barage on our front line, and come over in squads of a hundred. They were cut to pieces. Our casualties were light, 15 killed. This morning at day-break Fritz counter-attacked, most of his men would not come over. He again failed. Some heavy shells fell 50 yards in front of our guns, and a lot of smaller ones fell about the Bty. No casualties. Our planes are about in large numbers.\n","81":"\n\nGenerals Birdwood and Anderson inspecting our gun position. 456 rounds of ammunition to guns. Today, weather fine. Hundreds of our Aeroplanes flying bout.\n","82":"\n\nDay fine. 456 rounds of ammunition to Bty. position. Anti-tank gun crews, to go forward to gun. General Monash to succeed General Birdwood.\n","83":"\n\nVery hot day. General Anderson inspecting wagon line. Very satisfied with the condition of things generally. An English Baty. pulled in here near us today 13th Bty. 29th Division. Supposed to be in action for a two days stunt.\n","84":"\n\nSevere thunderstorm last evening. Flooded out; now showery. Six wagon loads of ammunition to guns. Yesterday afternoon all W.O.s, B.S.M.s and Q.M.S. parade in front of the C.R.A. A bit of a lecture, told them their job.\n\n10-7-1918\n\nThunderstorm 4 p.m. Little Artillery fire, otherwise quiet. Shoeing Smith Heyden returned from hospital, away about 3\n\nmonths. Shoeing Smith Doust, rejoined his Bty., the 8th. Concert by the thistles in our lines last evening. Good entertainment. Mostly professionals. Saddler Sgt. Saunders gone to Australia. He is a","85":" Bty. Sdd. Sgt. Struck a wicked mule, issued to us from D.A.C. The Major stopped me from shoeing it; Kick bite, and strike. He said that he was not going to have men hurt, or waste their time on such things. Took me half a day to put a pair of hind shoes on this mule. The D.A.C. shod him in a pen; they carry it with them. When the Bty. get these brutes, you have to do the best you can with a piece of rope and a post.\n","86":"\n\nMajor General Glasgoe Divisional Commander accompanied by General Anderson, inspected our wagon line this evening. Highly pleased with everything he saw. The weather was showery. We have a lot of these higher ranks inspecting, all they think about is, horses, wagons, and harness, not a word about the men, they don’t\n\ncount. Never a mention abot them. A few Hun aeroplanes over this morning 9-30. Our Artillery more active. More ammunition to guns. The enemy shelled Mont Des Catts last night.\n","87":"\n\nWet day. The enemy has evacuated our sector, Infantry can’t find him. About 1,000 prisoners passed through our sector yesterday and 36 machine gun captured; Most of the prisoners were Prussian Guards, Germany’s crack regiment. Our heavy Artillery active all night. 18 pdrs. forbidden to fire. Weather conditions bad for flying. One of our drivers awarded 14 days 2nd field punishment.\n","88":"\n\nHun aeroplanes over, last night, dropped some bombs near our wagon line. They then bombed St. Omer. This is worthy of note, considering the state of the weather, a gale was blowing at the time. Our 2nd Bde. got cut up, they hopped over, but Fritzs was waiting for them. About 200 prisoners passed by last\n\nevening. More decorations in Bty., Gr. Toohey, Crowley and Cobcroft awarded M.M.s.\n","89":"\n\nHun aeroplanes over in numbers early last night, one caught in search-light, dropped his load, and got away. St. Omer heavily bombed. Showery all day. Bdr. Cullen, son of Lieut. Governer Cullen, transferred to 101st Bty. 456 rounds of ammunition to guns. The enemy shelling away on our right, in the vicinity of Borre. Just made a rough calculation of wages only, to pay the Bty. for one day £80-0-0 is a low estimate.\n","90":"\n\nShowery. Put a pair of hind shoes on a mule, threw himself down 6 times, had him tied up to a post, with a side line on. This is the same mule that our Major stopped me from shoeing a few days ago. He is a wicked animal. Guns to move forward 3,000 yards tonight. Paris leave again opened, 50% of Bty. will be granted the priveledge, provided, in the pay book is £10.\n\nA rumour in the lines that Hindenberg is dead.\n","91":"\n\nVery hot. Terrific thunderstorms last evening. Enemy planes over in large numbers after the storm. Guns moving forward tomorrow 2,000 yards behind front line. The American Military Authorities bought a French horse, paying 2,900 Francs.\n","92":"\n\nStill very sultry. Terrific bombardment on our right. Two red baloons from enemy, fell near our lines. The authorities give 5 Francs for each of these baloons. Our people are still collecting a lot of French furniture & etc. and carting it to the French mission.\n","93":"\n\nA fine day. Some baloon affairs like airships sailed over our way this morning, apparently they come from Fritz. One was brought down by our planes. An order come out a week ago, re, horses with long\n\nfeet. I was told to cut the feet down, this order was carried out by me. The result, so far is, three horses on sick lines with punctured feet. Some of our T.M.B. were dropping bombs 500 yards short, faulty ammunition. The 3rd Bty. has a rotter of a Major, Sgts handing in their stripes and going as drivers. All staff down in wagon line. Sgt. Stone, one of our Sgt. at one time, going to St. Johns Wood, Cadet Officers school.\n","94":"\n\nAbout 60 prisoners passed through. Very rough appearance. Meterin is well in our hands. Bty. went forward last night, teams got back here at 2 a.m. Battalion Head Quarters objected to them being there, so we had to come back to normal position. At Rheims, we hear that 17,000 men and 200 guns were captured.\n","95":"\n\nVery sultry in morning, Thunder storm this evening. Cricket match was in progress between our Bty. and 3rd Bty. Good news from down\n\nRheims way. This is a French and American sector. Our aeroplanes extremly busy. A Fritz machine over this morning, very high. One of our planes attacked and brought down in flames a German baloon. He was then attacked by two Huns, who compelled him to land. A few shells over during the night, the first for weeks. Sgt. Torpey to go to guns, Corpl. McDonald to come to wagon line. The 31st Division pipe band, and our D.A.C. band favoured us with a few selections.\n","96":"\n\nWindy, but fine. A consert party gave a performance in our wagon lines. Styled themselves the Cooees. The Artillery 29th Division pulled out today.\n","97":"\n\nFine weather, 2nd Brigade pulling out tomorrow. Lieut. Scrivenner of the Bty. awarded the M.C.\n","98":"\n\nRaining. Trenches and barb wire\n\nentanglements erected through and around our wagon lines. The British are only now making defences in back aerias. Gr. Holden one of the anti tank gun crew, wounded last night. Guns moved again during the night. Vet Sgt. Whinfield and Capt. Haley on Blighty leave.\n","99":"\n\nF Subsection gun blown out. Six loads of ammunition to gun position. Lieut. Irwin back from leave. The French civil population, highly delighted over the success of the French Army. A few stray shells overy. An operation, on a horse, revolver bullet removed from jaw. Three men wounded, a shell landed under gun, an it turned turtle. Our position is rotten, 3000 yards behind front line.\n","100":"\n\nLast night was beautiful moon light. Hun aeroplanes over in swarms. Dropped a few bombs in the vicinity of our lines, they all fell in the fields. Several planes\n\nwere caught in the search-light, and then the anti-guns had a bombardment on their own. An order out, reading, that all Portsmouth bits are to be cut and shut by Farrier Sgt. in Bty. The holes at the end of bars are too large, and they pinch the horses mouths. All rot, not one horse in this Bty. ever injured in that way. Still good news from the French front.\n","101":"\n\nWet on and off all day. Things very quiet. Very wild night, half a gale blowing. Rather cold.\n","102":"\n\nAgain showery all day. Major Byrne inspecting wagon lines. Our aeroplanes battling against the weather. A large number of new troops come in last night. A bit of a stunt on with the heavy Artillery. A 12 inch Naval gun on the railway doing a lot of shooting. We still send six wagons loads of ammunition to guns each night, about 456 rounds. Four\n\nLewis guns now in Bty.\n","103":"\n\nA great bombardment by the enemy, on our right, the French sector. That was in the morning early. A big stunt is in preparation on our sector. A section of each Battery of 2nd Brigade is in waiting a few Kilometres behind our lines. We are about to make a bid for Merris.\n","104":"\n\nGood weather, visibility bad. The stunt is supposed to eventuate tonight. Our planes busy. The Bty. in a rotten position, shelled almost every day. One of our Sgts (Crane) and a driver (Redmond) sent to R.B.A.A. for instructional purposes. The road pass our lines very busy, always a stream of traffic, day and night, and strange to say, the enemy has never shelled it.\n","105":"\n\nMerris is ours. Our Infantry captured the village early this morning, 200 prisoners. Hundreds of men going into the line, mostly\n\nScottish. Twelve wagon loads of ammunition to guns, Lieut. Irwin to go to Bty., and Lieut. Gates to come to wagon. Fine man Lieut. Gates. He is an original Light Horse man, was badly knocked on the Peninsula, and returned to Australia. He rejoined, and is now an Artilleryman. Our Bty. position shelled. Great movements of troops.\n","106":"\n\nThe anniversary of our first battle around Ypres. Today is fine. A rumour that we move out by the end of week. A few shells flying about, the first for a number of days. One mule sent to Vet Mobile Section, kicked on stifle. Four wagon loads of ammunition to guns. Major Byrne inspecting wagon lines.\n","107":"\n\nMarching orders recieved, move out tomorrow at 8-30 p.m. We are relieved by B Bty. R.H.A., ","108":" Divisions. Enemy aircraft exceptionaly busy last night. Twelve Hun prisoners passed here today.\n\n2-8-1918, Left Le Brearde\n\nBoot and saddle at 7-30 p.m. Move off at 8-30 p.m. Raining in torrents. A bit of an argument with the relieving Brigade. L Bty. is now in possession. Our guns all in wagon line. I believe we go 16 Kilometres tonight.\n\n3-8-1918, Point Asquin\n\nRained in torrents just before leaving last wagon line. Landed here 3-30 a.m. Had a bad treck during the night. The night was as black as ink. A man riding a grey horse in front of me, and I could not see it. We simply allowed our horses to have their heads, and pick their own road. During the last couple of Kilometres, several wagons fell into the ditches alongside of the roads. They were left there, and rescued at daylight. When seen in daylight I wondered how we ever got through, only inches to spare in some places. Everything is in order again. Breakfast at 11-30 a.m. Dinner at 4 p.m. No shoes off only one sprung. We are here for a couple of days only and then entrain. Destination unknown. We are near Wardecques.\n","109":"\n\nFine day. Moving to entrain tomorrow, en route for the Somme. All Australians are moving from this front.\n\n5-8-1918, Badringham Camp\n\nMoving off at 12-45 p.m. to entrain at Arques. Just finished trucking horses when the rain started. Left Arques at 4-30 p.m. Arrived at Hangest 7-45 a.m. on","110":"\n","111":"\n\nDetrained at Hangest, moved off 2 hours later, arriving at St. Saveur 2-30 p.m. Guns will move off at 5-30 p.m. for position, wagons following at 9 p.m. Raining.\n","112":"\n\nTrecking on night of 6th & 7th through Amiens. Town deserted, no civilians, all houses locked up. All furniture and domestic utensils left in houses. The only people I saw were traffic controle, at diffrent cross roads. Arrived at Loungueaue 12 midnight, 14 Kilometres from line. Weather fine.\n","113":" Longueaue\n\nReveille 4 a.m., move off 7 a.m. Stunt started this morning at 4 a.m. 3 Divisions of Cavalry passed us on the road, Australians, Canadians, and Americans hopped over at Villas Bretnaux. The battle was very successful. Today was the first time that I saw R.H.A. and Cavalry working together. A sight never to be forgotten. Thousands of Hun prisoners passing. All sad and weary. We have passed through the Village of Warfussee all in ruins. Hundreds of our planes flying about. Some large shells falling in front of our line. All of the Australian troops in France on this sector.\n\n9-8-1918, Harbonieres\n\nChasing Huns, got him on the run, quick move 6 a.m., another at 7 a.m. Moving wagon line and guns. Three horses killed, in one gun team. Rough shop, hundreds of cavalry horses lying dead in the open country. Machine guns doing a lot of damage. Our tanks rushing up. Officers in\n\ncharge all over grease and muck. Shells falling, men getting skittled, Infantry going up to line, ammunition wagons everywhere, Horsemen galloping about; And in all this confusion a poor unfortunate rabbit, jumped up, and started to run away towards firing line, followed by a howling mob of Infantrymen.\n","114":"\n\nStill advancing. Huns fighting a rear guard action. Guns again out of range, moving them forward. Terrific Hun bombing last night. Terrific was no name, it is simply Hell let loose. Twelve men wounded in","115":" Bty. 18 horses killed in 54th Bty. We moved from those lines at dusk, to take up a new position. An 11 inch gun on train complete captured, also two trains load of reinforcements. The enemy is fighting hard. Another 8 in. gun with motor wagon attached filled with clothing, pieces of leather & etc. captured. The Infantry made a raid on the wagon. Captured field guns\n\nwith teams complete. The German drivers bringing them down under escort of cavalry men. Dead men and horses strewn about all over the fields. The tanks are doing good work. I am writing this on what was enemy country only yesterday morning. I can see smoke rising in Fritzs lines, apparently he is burning his material.\n","116":"\n\nOur advance still going. Objectives gained, 200 yards. Terrific artillery fire. Weather fine, hot. Hundreds of dead Huns about, and tons of German equipment. Saw one of his carts capsized into a ditch, both horses killed, the cart was full of brown bread. Left just as it fell. German prisoners burying their own dead. Saw 14 put into one hole. One of our tank accounted for 150 men, and goodness knows how many machine guns. The Huns rushed it and poured petrol on it, and then set it on fire. The occupants were roasted alive. Dozens of our tanks out of action.\n\nOne in particular, had a direct hit on post hole, the hole that the driver used. His brains, hair, and skull was plastered all over the machinery, awful sight.\n\n12-8-1918, Rozieres\n\nOne of the enemies large R.E. dumps captured at the above named place. Our wagon line is about ¾ mile in rear, and our gun position is just on left. Very hot place. Fritz is all the time shelling this dump and trying to destroy it. The Canadians suffered severe losses, on the field where I am writing this, numbers of their dead, still unburried. The Hun counter attacked, on Canadian sector, and gained 50 yards. The Canadians then attacked and drove the enemy back 500 yards. He is now on his 1917 line, and putting up stubborn resistance. The Prussian guards are against us. Some prisoners captured, and made bury their dead, says, that they walked 20 miles to front line, and then hopped over, tired men. Large numbers\n\nspeak English fairly well. The Vet Officers Orderly’s horse kicked a German bomb, about 6 yards from where I was working, made a terrific noise, no one injured. Vet Sgt. returned to duty. Terrific bomb dropping by the enemy during the night. Already we have moved from three wagon lines, just at dark, and other troops have taken them over, were bombed awful, and had heavy casualties in men and horses. The Germans are putting a desperate struggle. Our aeroplanes are having a lot of trouble with his, he has now rings with a little black cross in centre, making it difficult for our people to pick him up. He has caught several of our baloons with planes so marked.\n","117":"\n\nThe advance hung up. Weather hot and dry. Night bombing by the enemy still severe. He opens fire on horse lines with his machine gun. Still shelling villages and roads in rear.\n","118":"\n\nGuns moved forward again last night. A number of tanks passed our wagon line, late last night. Enemy shelling heavily. Bomb dropping eased off a little. Our search lights well forward. Saw an aeroplane come down in flames. Weather is very hot for this country.\n","119":"\n\nEleven horses killed and nine wounded in third Battery last night with bombs. Our lines about 20 yards away never got a scratch.\n","120":"\n\nReveille 2-30 a.m. Left Rozieres at 5 a.m. Arrived at Aubigney 10-30 a.m. Camped on bank of river. First good wash for a week.\n","121":"\n\nGenerals Glasgow and Anderson inspecting. Nothing doing only cleaning up and reorganising. All of the Australian Artillery camped here. Weather fine.\n","122":"\n\nMorning showery, evening fine. Troops permitted to bathe in river. Things quiet.\n","123":"\n\nWeather dull and cloudy, indications of rain. Working hard shoeing my horses, ready for the roads. Some wear the shoes out in 3 weeks.\n","124":"\n\nMove off at 6 a.m. cancelled, move now at 7-30 a.m. Weather fine. We are moving into action. Arrived at wagon line 1 a.m., wagons were then ordered to gun position, returned to wagon line 6 a.m.\n","125":"\n\nWhere we are now is where the British were stuck up, could make no advance, and little wonder, considering the nature of the country. Very rough, somewhere near Bray. No village within miles of us. Water for horses 2 miles away, river Somme. Weather very hot, foggy in the morning.\n\n22-8-1918\n\nTwo men killed and one Officer (Capt. Laidley) wounded in 1st Bty. ","126":" Bty. shelled out of wagon line. A big bombardment on this\n\nmorning, over on our left. Successful advance 5 Kilometres. Without doubt, we have Fritz rocking. The quantity of material lost by him in this stunt is astounding. Guns, rifles and ammunition strewn broadcast over the country. Water point, shelled this evening, some horses killed not our Bty. Thousands of horses water there.\n","127":"\n\nOur stunt carried out this morning at 5 oclock. 2,000 prisoners, all objectives gained. Capt. Laidley died from wounds. One of our drivers, hospital, bomb dropped near him last night, shell shock. Hun planes over bombing, one plane dropped 14 bombs.\n","128":"\n\nGuns going forward 3,000 yards tonight. The casualties in our side very light. Weather still fine. Enemy plane over, dropped some bombs very close. 1st Bty. cut up yesterday. Baloons gone forward. Some 5.9 are turned on the enemy. Hundreds of rounds of Hun ammunition laying about. Another\n\nbig dump fell into our hands. A horse belonging to machine gun company, fell through a dugout, covered with sheet iron, had to be destroyed. Cut himself horribly. Horse flesh is getting scarce. Horses and mules cost the Authorities £70-0-0 per head, and the estimated cost of horses brought away with us, that is price paid and maintenance is £600-0-0. Drivers Muir and Proctor also General’s groom, going on 6 months furlough to Australia.\n","129":"\n\nStanding too, ready to move wagon line forward. Weather fine but hot. Great complaints about rations, which are very light indeed. A long time since I have heard so many enemy aeroplanes over in one night, and so little bombing. Strong smell of gas about our lines this morning. Great movement of vehicles both horse and motor. The traffic here is extraordinary.\n","130":"\n\nGuns to advance. Huns retreating. Terrific\n\nthunderstorm last night. All artillery moved forward. Just saw enemy plane bung down one of our baloons £1,000 gone.\n","131":"\n\nSix miles the distance our wagon line is behind our guns, likely to move forward any time. Hun planes over during the night. Showery this evening. The 13th Light Horse has gone forward. The remains of one of the Huns big Bertha, is on our sector. She is dismantled and burst.\n","132":"\n\nMove wagon line, Boot and saddle 2-30 p.m. went 7 Kilometres.\n\n29-8-1918\n\nGuns moving forward again this morning, out of range. Saw what I considered the largest gun captured in this war. The piece itself was 15½ inches (the bore) and the length 80 feet in length. It was completely destroyed. I did hear, that German prisoners say a premature burst destroyed it, and again I hear, that the enemy blew it to\n\npieces. Anyhow what ever was the cause, the gun and fittings are in our hands, and the capture claimed by the 3rd Battallion","133":" Australian Division. A little further away is another great sight, in the shape of 5 trucks burned to a cinder, standing on the rails. Apparently an ammunition train either bombed or shelled, and caught fire. Thousands of charge cases laying about, and alongside is one of our planes riddled with machine gun bullets or shrapnel. The weather yesterday was showery. Today is fine. All troops moving forward. Bdr. Rawlinson killed. 2 horses killed and 5 wounded.\n","134":"\n\nWe are camped in a forward wagon line. Huns barage dangerously close. In amongst a lot of shell holes, the old Somme battle field. Boot and saddle 3-45 a.m. moved out at 6 a.m. Broke three poles on diffrent vehicles getting out on to the road. Bdr. Rawlinson burried at day break. The shoeing smiths and saddlers dug the grave\n\nand Bdr. Swanson read the burial service, the trumpeter sounded the last post. All the officers were present. Three horses to mobile. Now at Sailly Laurette, on the Somme, after a treck of 20 Kilometres.\n","135":"\n\nShowery, still resting in good camp, nothing doing.\n","136":"\n\nRaining almost all night. This evening is fine. Colonel Dean back to Brigade. We have just come off the road to Peronne. This sector was held by the French last year. I hear that we are 6 miles beyond that town.\n","137":"\n\nShowery, went to a concert in 2nd Brigade lines. The party was of the 31st Division. The men are getting a good spell out of action this time. Reveille 6-30 a.m., Stables 7 a.m., Parade 9-30 a.m., next parade 4 p.m.\n","138":"\n\nA quantity of comforts arrived. Weather fine nothing doing.\n\n4-9-1918\n\nMajor reteaming horses. 10,000 prisoners captured yesterday. Gambria occupied today. Weather still fine.\n\n5-9-1918\n\nBattery manoeuvre this morning. Hot day. Stuck up for shoes. Kicked by a horse, just above knee, very sore. Capt. , promoted to Major, in charge of 3rd Bty. Capt. Duffy, also Major, in charge of 4th Bty. Great dissatisfaction in 3rd Bty., counted out their late Major (Christie). He had the Bty. going day and night, no half holidays. A bit of a thunderstorm, very light rain. Two men in 1st Bty. killed, messing about with a trench mortar bomb, Grs. Hughes and McDonald, blown to pieces. 2nd Brigade sports on this evening.\n","139":"\n\nErecting a marble head stone, at Bdr. Rawlinson’s grave. Engraved by Corp. Souter, Trench Mortar\n\nBty. Moving camp tomorrow, further forward. Estimate that we are 30 Kilometres behind firing line.\n\n7-9-1918\n\nLeft Sailly Laurette at 9 a.m., went about 20 Kilometres, arriving at Suzanne at 1-30 p.m. The 2nd Division camped here. Passed some captured guns, 8 inch and 5.9 Howitzers (two). Weather fine.\n\n8-9-1918\n\nToday showery. Move off tomorrow for Clery, 11 kilometres away. This is an old German camp, very comfortable, dugouts on the hill side, horse lines in the wood on the flat, a lot of Hun ammunition lying about, 8 inch and 10 inch.\n\n9-9-1918\n\nPulled in at a place named Hem, arriving there at 11-30 a.m. We are now a reserve Brigade.\n\n10-9-1918\n\nRaining all night, and showery all day. I and 3 more Sgts. are well off this weather, we\n\nmade a tent out of trench covers, we carry it about with us and erect it each night. Move forward again tomorrow. The 1st Division, relieving the 3rd, and the 2nd Division the","140":" We are on the road to Peronne, although our troops are well in advance of that town. Saw a number of Frenchmans graves, men who fell in 1916. These graves were dug up and the bones strewn about. Presumed that they were dug up by Germans. A large number of the enemies captured guns about here. A lot of shooting with service rifles on the banks of a lagoon, one man on opposite side shot in abdomen, and several horses wounded. A dirty Hun trick was worked off on some of our burying party. It appear that a party of our people were detailed to burry the dead, they saw a dead Hun on a stretcher, ready for burrial, they naturally went to carry him away; Both were blown to pieces, the stretcher was attached to a bomb.\n\n11-9-1918, Hem\n\nReveille, 5-30 a.m. Move off at 9 a.m. On the outskirts of Tincourt. About a 16 Kilometres treck. Guns went into action at 4 p.m. Our Infantry knocked back a little. Great deal of shelling on ridge in front of guns. The Huns making a bit of a stand. Hun aeroplanes over last night, dropped some bombs. Ordered to dig in here on account of bombing.\n\n12-9-1918, Tincourt\n\nHeavy showers, all day. Gr. Hobbs slightly wounded. Twenty two Baverian prisoners captured by our Infantry. Our Infantry advanced 2,000 yards. Terrific bombardment, starting early this morning.\n","141":"\n\nWagon line shelled heavily last evening, one horse wounded. A man from 2nd Brigade, visiting a mate in","142":" Bty. was also wounded. This happened at 5-30 p.m. The shells continued all night, every 2 hours. Another stir up at 11 oclock this morning. Two dugouts blown up. All horses were taken off the lines\n\nand every man sent to a flank. Two sets of harness blown to atoms. The mens kits were absolutely blown to fragments. After dinner we moved camp; now camped in a wood, seem healthy enough. Some shells flying overhead. When on the road to this wagon line, we passed a Hun wagon park: Hundreds of vehicles of all descriptions. Huns retreated 1,000 yards. Some American Divisions and one French Division, made a good advance, 16 miles and 10,000 prisoners.\n","143":"\n\nThree enemy planes, brought down last night. A new stunt on. They catch a plane in the searchlight, then one of our plane attack it. That was how they were brought down last night. The cheers of the troops could be heard a mile away. 9,000 prisoners down Verdun way. Moving guns forward again tonight. Six men on leave to Australia.\n","144":"\n\nShoeing smith Hooper gone on Blighty leave. Two of our baloons brought down in flames.\n\nWeather fine. No horseshoes available, shoeing all behind. Repairing a G.S. wagon today. All teams out tonight, moving guns forward. Last night’s move was cancelled. Enemy shooting at our baloons. Some big stunt coming off shortly. A few shells flying about, one just missed our wood.\n\n16-9-1918\n\nEnemy planes bombing last evening. Killed and wounded some men in 8th Battallion, a few hundred yards away from us. Guns going forward tonight. Smoke shells to Bty. ","145":" Division pulling in. Lieut. Duffy slightly gassed, he was in charge of wagons last night. There will be five Divisions covering 1,000 yards front in this coming stunt, which is booked for the","146":" inst. 9 casualties in 1st Bty. Capt. Archer wounded in spine.\n","147":"\n\nGunner Fulton wounded in abdomen, not expected to live. Capt. Staley, our Capt., to take charge of","148":" Bty. German aeroplanes over\n\nlast night, dropped dozens of bombs. Terrific thunderstorm, midnight. The big stunt coming off tomorrow morning. A lot of dummy tanks made of Hessian and battens, to be used. Asked today, by Lieut. Irwin if I wanted to go to Australia.\n","149":"\n\nBoot and Saddle 2 a.m., move up in the dark to gun position. The position we were to take up was shelled heavily with gas and 8 inch high velocity. Raining in torrents, wet to the skin. Zero time 5-20 a.m. Exactly on time, the guns opened fire, we were heavily shelled, guns moved forward. Now 11 a.m. we have advanced 6 Kilometres. All objectives gained. 600 prisoners. Weather now fine 12 oclock noon. 2,000 prisoners captured by Australians. One of our baloons brought down in flames.\n","150":"\n\n3,500 prisoners, 1 8 inch gun, 6 9.5 guns, a number of 77 guns, and numerous machine guns. This was the capture on our Sector.\n\nWeather unsettled.\n\n20-9-1918, Roisel\n\nJust heard that Lieut. Delaney, one of my old mates, was killed by shell on the","151":" We are camped near the village of Roisel.\n","152":"\n\nGreat stir up last night. 6 bombs fell in our lines. Two horses wounded. One, the Major’s charger, an original horse, was so badly wounded, that he was destroyed. The other horse, Lieut. Gates, was wounded in rump. One bomb in particular, made the largest hole I ever saw in the bomb line. About 20 feet across, and 10 feet deep. Our guns were also bombed, two men casualties, Gr. Haliday and Izzard A Sub. Guns out of action. Saw an enemy plane come down in flames, one of our night scouts got him.\n","153":"\n\nWarned to proceed to Australia on leave at 7 a.m., move off at 8 a.m. Went to D.A.C. Head Quarters. Left there at 9-30 a.m., went to Peronne in G.S. Wagon, now\n\nin reinforcement camp at Peronne. Fifteen men from 2nd Bty. Raining a treat, trying to find shelter. Put the night in, in a dugout (German).\n","154":"\n\nOn the road, making for Bray. Arrived there 12 noon, after an 18 Kilometre march.\n","155":"\n\nStill at Bray, Billeted in a concert hall. Nothing doing, filling in time until the 27 inst. We then entrain for an 8 days train journey.\n","156":"\n\nFarewell by General Birdwood. We move off tomorrow. New pay books issued.\n\n26-9-1918, In train\n\nLeft Bray 10 a.m. Passed through Amiens. 27 men in horse truck.\n","157":"\n\nGoing strong, passed through Versailles and Troyes.\n","158":"\n\nStopped St. Germain, 2 hours. Had\n\nbreakfast at 7 a.m. This is a rest camp for English troops, going and coming from Salinica \n","159":"\n\nStill in train, weather warm. Passed through Marsailles 6 a.m. Now approaching the Italian frontier. Country under grape vines, which is in full fruit. Our rations are good, Hot tea and stew on train. The Y.M.C.A. on board issuing cigarettes, tobacco and biscuits daily. Just passed through Toulon, a fine large town.\n","160":"\n\nOn the night of the","161":" we passed through the noted watering place of France, named Cannes. The most beautiful place in France, and then on through Monte Carlo and Nice. Arrived at Italian frontier 10.45 p.m.\n","162":"\n\nArrived at Faenza 8-30 a.m. Had breakfast in rest camp. The troops were allowed to bath, shave, and clean up generally. Before leaving we had dinner, and then\n\nmarched through the town, back to our train.\n","163":"\n\nStill in train, making for the town of Taranto, which is at the gulf of Taranto. Weather changed, raining.\n","164":"\n\nNearing train journey’s end. Arrived at Taranto rest camp 4 p.m. after 8 days and 7 nights on train. 8 p.m. warned for baggage guard, up all night.\n","165":"\n\nOn board boat Ormonde, 15,000 tons. All Sgts. in cabins.\n","166":"\n\nRaining. No word of sailing.\n","167":"\n\nTaking on board 250 English Officers, bound for India. Now on board approximately 2,000 troops. Boat stations and life belt drill this morning.\n","168":"\n\nUp anchor at 9-30 a.m. Moved from inner\n\nto outer harbour, and dropped anchor again. War news recieved by wireless this morning was, that Germany wanted an armistice, and she was willing to accept president Wilson terms, except six. In all 14 out of 20.\n","169":"\n\nStill in harbour, weather fine, escort waiting for us, Japanese Torpeodo boats.\n","170":"\n\nUnder steam 7 a.m. Left Taranto harbour escort of 2 Japenese.\n","171":"\n\nAt sea, everything going smoothly. Passed drifting boat, empty, ship’s gunners shot practice. Some good shooting. Weather hot. Strong head wind. Our speed average 16 knots.\n","172":"\n\nIn the real danger zone, 90% of the boats sunk happened about here. Expect to reach port tomorrow morning.\n","173":"\n\nReached port 5-30 p.m., Port Said. Scores of boats laid up here, a few sunk outside port, masts and spars sticking out of water.\n","174":"\n\nSailed again at 1 p.m. Weather very hot. The troops for India disembark this morning. Arrived at Kantarah 7 a.m.\n\n14-10-1918, Kantarah\n\nAll sick taken on shore this morning. British troops going ashore. Extraordinary big camp and dumps here, thousands of niggers working here. We also land here. 400 feet of steel rope twisted around propeller blades; Divers working on it. Disembarked at 5 p.m. Entrained and moved off at 8.45 p.m.\n","175":" \n\nIn dirty, lousy, open trucks. Arrived at Suez. Moved into rest camp. The troops counted the boat out.\n","176":"\n\nEntertained by a concert party. The whiz bangs. Australian Light horse.\n","177":"\n\nVery hot, and dusty. Went through the oil\n\nrefinery, making petrol. I also went through the date plantations, plenty of ripe fruit. Saw an Indian cremated.\n\n18-19-10-1918\n\nStill in camp. Watching the airmen stunting.\n","178":"\n\nLeft Wabour El Maya camp 9 a.m., entrained and proceeded to Port Suez. On board the Port Sydney, moved to outer harbour at 5 p.m. Steamed off on our journey 8 p.m. Small boat but good food. All Australian.\n","179":"\n\nDay fine, passed some boats.\n","180":"\n\nA storm at 8 a.m., mostly wind, a bit rough. Rain and wind again at 7 p.m. Sea very rough. No men sea sick.\n","181":"\n\nArrived at Colombo 9 a.m. Taking on coal, and water; Men granted leave this evening. I am warned for guard, so cannot go ashore. Weather terrebly hot.\n","182":"\n\nLeft Colombo on night of","183":" at 10 p.m. Took on board, Potatoes, fruit, meat, coal and water. A big roll on, ship very light.\n","184":"\n\nRecieved news by wireless that the armistice was signed. No excitement on board, just read in a casual sort of way.\n","185":"\n\nTroops on board all fitted with new clothing. Weather very windy, sea rough.\n","186":"\n\nArrived at Freemantle at 2 a.m. Ship quarantined, some cases of Spanish Infleunza on board. Very rough last night. Sent a telegram home.\n","187":"\n\nThe West Australians went ashore to quarantine at 11-30 a.m. We moved out from Freemantle at 3-30 p.m. Sea rough 1,874 miles to Melbourne.\n","188":"\n\nArrived at Portsea, 7-30 p.m. In harbour\n","189":"\n\nQuarantined for seven days. Taken ashore on a launch. On arrival at quarantine wharf, each man was handed, two packages of cigarettes, the morning paper, and an apple and orange. The accommodation is excellent; Food first class.\n","190":"\n\nEvery one had to pass through inhalation chamber, yesterday and today. Today was very strong, making your nose and throat sore. Stop in chamber 10 minutes. A meeting of Sgts. and men this evening, protesting against going on board the ship, as we hear that some of the crew are going sick, when we arrive at Sydney. Their idea being to have Xmas in port.\n\n1-12-1918, Portsea\n\nAll disputes settled, no quarantine in Sydney, except in case of more influenza breaking out. Going on board ship this evening at 3-30 oclock. Steamed out\n","191":" oclock, midnight.\n","192":" \n\nUnder full steam. All going well.\n","193":" \n\nHeavy land fog on, passed the heads. The skipper found himself at Broken Bay. Hailed a lighter and got this information. Alongside No. 1 wharf Woolloomooloo at 11 a.m. Whirled away in motor cars through the city and landed at Anzac Buffet Domain.\n\nFinis.\n\n"}}