{"Document Name":{"0":"Diary_0466","1":"Diary_0466","2":"Diary_0466","3":"Diary_0466","4":"Diary_0466","5":"Diary_0466","6":"Diary_0466","7":"Diary_0466","8":"Diary_0466","9":"Diary_0466","10":"Diary_0466","11":"Diary_0466","12":"Diary_0466","13":"Diary_0466","14":"Diary_0466","15":"Diary_0466","16":"Diary_0466","17":"Diary_0466","18":"Diary_0466","19":"Diary_0466","20":"Diary_0466","21":"Diary_0466","22":"Diary_0466","23":"Diary_0466","24":"Diary_0466","25":"Diary_0466","26":"Diary_0466","27":"Diary_0466","28":"Diary_0466","29":"Diary_0466","30":"Diary_0466","31":"Diary_0466","32":"Diary_0466","33":"Diary_0466","34":"Diary_0466","35":"Diary_0466"},"Date":{"0":"unknown","1":1160.0,"2":1161.0,"3":1162.0,"4":1163.0,"5":1164.0,"6":1165.0,"7":1166.0,"8":1167.0,"9":1168.0,"10":1169.0,"11":1170.0,"12":1171.0,"13":1172.0,"14":1173.0,"15":1174.0,"16":1175.0,"17":1178.0,"18":1179.0,"19":1180.0,"20":1181.0,"21":1182.0,"22":1183.0,"23":1184.0,"24":1185.0,"25":1186.0,"26":1187.0,"27":1188.0,"28":1189.0,"29":1190.0,"30":1191.0,"31":1192.0,"32":1193.0,"33":1194.0,"34":1195.0,"35":1196.0},"Entry":{"0":"\n","1":"\n\nI heard to night that we are shortly to be transferred from this front to another. In fact the transports have orders to see that all their equipment and gear is in readiness for the\n\nroad in case the Battalion had orders to leave here (Armentieres)\n\nCaptain (Chaplain) Davidson returned to day from Marseilles where he had been in an officers convalescent home. He is looking well after being away about 6 weeks. \n\nI believe he had the scaveys. \n","2":"\n\nThere was a heavy frost last night. The street was all white this morning until near dinner time. It is very cold today. Part of our battalion is going into the trenches to night. Some of the Pioneers are also going , but a few are wanted in the town. I have not heard whether I am to go or not.\n\nSgt. Robinson got a letter from C. F. Cunningham: He is now in England, and may\n\nloose his big toe which was frost bitten.\n","3":"\n\nI was up very late this morning. There was another heavy frost last night. In the morning I helped to bag up a lot of coke & charcoal to go to the trenches.\n\nBefore dinner I went to the Transports camp about 3 miles away in one of the limber waggons with driver Tom Devereaux\n\nI had dinner there. In the afternoon I cleaned the wheels of two cookers and one water cart in readiness for painting with wood preserving oil which I will do tomorrow. The hut I am camped in consists of a wood framework covered with black canvas. \n\nJ. Mathews is in the same hut with me.\n","4":"\n\nA dull cloudy day.\n\nIt is not so cold today and the mud is getting soft. The ice is melting. There is a light covering of water on all the ice in the drains & creeks. I painted the wheels of the two cookers and one water cart this morning. The paint consisted of a mineral wood preserving oil. The paint keeps out the water. There was an inspection of the Transports this morning by a Colonel of a British Transports core \n\nThis evening I cleaned and oil painted 1 Limber and 1 spring dray. To night it has started to rain. It is a very light but warm rain Last night there was a terrific bombardment by our artillery. Some of our big guns are stationed near here. I saw one very big gun yesterday\n\non my way here covered up with straw to prevent it being seen by enemy aeroplanes. It has a terrific bark when it is fired.\n","5":"\n\nA dull cloudy morning but warm. A thaw has set in, and all the ground is soft and . There is mud everywhere over the boot tops. To day cleaned 3 limbers , and oil painted two.\n\nThis afternoon I went with the transports to Armentieres and from there to near the trenches to help put down a brick wall and load 3 limbers. It was 20 minutes after 10 when we got back and had our tea.\n","6":"\n\nA cold misty morning and the mud is still softer. It is very wet & sloppey underfoot. Last night I received\n\na parcel from Miss Irene Ping of Merrigum, containing one large scarfe. It will come in very handy this cold weather when travelling at night. It is one of the misfortunes of the army that the soldier has to work 7 days a week. Yesterday (Sunday) I was working all day and part of the night. In fact I did more work yesterday, than I had done in a month previously. To day I oil painted one limber wagon and two cookers.\n","7":"\n\nContinuous light misty rain all day from breakfast time till dark. As it was too dirty to do any painting to day I was put on nailing up new canvas on the side of the stable.\n\nThis afternoon Mr Cox who is now O.C. of H.Q. Details came out here\n\nand paid the Transports and others who were working here. I was paid 10 francs 7\/2, and also issued with a new book. I was considerably overdrawn, hence the small pay. We have received no newspapers since Saturday. There is all sorts of rumours about, one of them being that Germany is asking for an armistice.\n","8":"\n\nA dull misty day but much finer than yesterday especially in the afternoon.\n\nTo day I was doing odd jobs and helping to repair a bridge and make approaches to it. I believe the whole Battalion is to be removed from this front very shortly, in fact the Transports have received orders to be in readiness to move at any time. We are also to get leave very shortly.\n","9":"\n\nA very dull cloudy day with a light misty rain. There has been very little bombardment during the past few nights. The front in this sector is very quiet at present. With J. H. Mathews and A. Ashley I was putting down duck boards for a path near the stables this morning. W. H. Handcock is still working in the stables putting in new feed boxes, and general repairs.\n\nAbout 4 o’clock this evening I with others went with 2 limber wagons for straw to a French farm. It was in sheaves. We got 500 kilogs (1\/2 a ton) and delivered it in Armentieres at the Head Quarters of the 38. Batt. It was a cold drive on top of the load. we got back about 8.p.m. and had our tea. Most of the work was in the dark.\n","10":"\n\nA cold foggy world, or rather morning. The fog is very dense to day. There was to be an inspection to day, so we had a general clean up of the whole camp and stables. I posted a letter to my Father to day. The newspapers came to hand this morning. For some unaccountable reason there was no papers since last Saturday.\n\nThere had been scarcely any artillery activity during the past few nights.\n","11":"\n\nA dull cloudy morning but scarcely any fog. There are big guns booming in the distance and close at hand at regular intervals all the morning. In the morning I was doing odd jobs and cleaning up. I had an early dinner & went with Roy Partridge\n\nto the Engineers dump a few hundred yards from the trenches. We quarried 6 waggon loads of bricks from a ruined Brewery. Early in the war this brewery was used as an ammunition dump but the germans put a shell in in blowing up half of it and burying a number of men in the ruins of the cellars. An effort was made to recover the bodies but without success. When peace comes and the factory is rebuilt, and the debris removed their bodies will be recovered. Some of the buildings are now used as an engineers store and another part is occupied by the 9th field ambulance. While we were there and about 5 o’clock the guns in the vicinity started a \n\nterrific bombardment and kept it up for about an hour. We loaded all the waggons after dark and returned to our camp about 5 miles away riding on top of the bricks. We got home about 9 o’clock having had nothing to eat or drink all the time. Needless to say we were ready for our tea.\n\nLast Sunday I took over some washing to a French woman, and got it back yesterday. There were two shirts a pair of drawers, a pair of socks, & a pocket handkerchief. They were all very dirty. She washed them beautifully clean and darned the socks, and for the lot she only charged 1 franc 10d.\n","12":"\n\nA cloudy day. There was slight frost last night, and a thin layer of ice on the water this morning. I am cooks\n\nfatigue to day. The first time since I have been in the army. It is a very good job. The only drawback is that in our transports the cook’s fatigue is also Latrine picquet, which occupies about 20 minutes in the morning.\n\nTo night all hands had an early tea as about half the men are going out with the waggons. Some of our men are coming out of the trenches to night. a few came out last night. Not all our Battalion have been in the trenches this time. A few men from all the battalions in the 10th Brigade and known as X Battalion have been holding the trenches while others have been drilling and attending various schools in preparation for a big raid on\n\nthe enemie’s trenches, which may come off at any time. While I was down at the \nenemies\n trenches yesterday I saw a german rifle that was captured by a soldier in the 39. Battalion This man was taken prisoner by a german and while he was taking him away, our soldier had the german with his fist, a fight ensued, our man got the best of it, succeeded in getting the germans rifle and bayoneted him through the neck. He then returned to our trenches triumphantly bringing the rifle with him as a souvenir. The rifle is lighter than ours. The stock and butt is made out of one piece of wood, and does not go along the barrel all the way. The mechanism \nis\n of the\n\nmagazine and breech is different, and is equal if not superior to our rifle.\n","13":"\n\nA cloudy but fine day. It is now much drier underfoot. There was a chapter of accidents this morning commencing before most of us were out of bed. Leonard Sheean was trying to get Valentine a company driver to get out of bed. This Valentine disliked and he swung a heavy boot round his head, not with any intention of hurting, but unfortunately it struck sheean over the eye, and he droped like a stone striking his mouth on a board and knocking a piece off a tooth. He was dazed and could not speak He was helped up and his wounds dressed\n\nby Don Patterson an A.M.C. man attached to the transports. After breakfast as he was no better and could not remember anything he was driven to the doctor and put in Hospital. Later in the morning Driver Borthwick got his fingers jammed against a post by a horse pulling back. His 4 fingers & thumb were badly squeezed and necessitated them being all dressed and bandaged. I was on light duties all day.\n","14":"\n\nA cloudy day. There was a heavy artillery bombardment last night about 10 o’clock which continued for about an hour. Later it was renewed again with increased energy about 12, and again early in the morning but I did not hear it as I was asleep. There was a raid\n\nof the German trenches last night by 800 of our men from the 37 and 38 Battalions. It was very successful. I heard that Snowey Mortiminer of B. Company was very seriously injured. Last night my feet were very sore so I paraded sick this morning. The doctor a major, ordered me to the hospital and I was driven in this afternoon by one of the 40th Bat. Transports to the 10th. Field Ambulance Hospital in Armentieres for another rest and medical attention. I took all my kit and gear with me. The name of the village where our transports are located as well as other transports of the Brigade is A. L’Epinette.\n","15":"\n\nI am a year in the army to day. During that time I have had a variety of experiences and have travelled some thousands of miles, mostly by sea, but also some hundreds of miles by train, and many a weary mile on the march. I have been in several different countries: - Cape Colony St Vincent Island, England, Ireland, and am now in France, and worse luck in Hospital I have been in hospital three times, once at Perham Downs Salisbury Plains, with measles, once at Sternwerck with chilblains, and now at the","16":" Field Ambulance Hospital Armentieres with sore feet. Otherwise I am well. I have had several narrow escapes from shells, shrapnel and machine gun bullets, and have lived admidst\n\nsnow and ice, and experienced all sorts of weather. A soldiers life is not one to be envied, or to choose from among others. It is a hard life and a risky one. I will not forget my years experience of a soldiers life. Nevertheless I have had many pleasant experiences, have travelled half way round the world, seen many beautiful places and cities, towns & villages, which is a pleasant and profitable education. I hope I will not have to put in another whole year in the army, and that I will be safely back in Victoria before the year is out. I am not downhearted, far from it, and I don’t regret coming, but if there is another war in my time, they will have to manage without my assistance.\n\nTravel and experiences are all very well, and in civil life or in peacetime it would be delightful, but in war time, though it is more exciting, there are many hardships, restrictions, and a lack of home comforts, not the least being the lack of the society of my dear wife and friends. But these I will regain when I return home and put on my civic clothes again. \n\nTo day the weather is very dull and cloudy. This hospital is fairly comfortable. There are plenty of blankets, and an abundance of food. The patients are mostly wounded soldiers from the big raid of Monday night. They are only slightly wounded in this ward which is numbered B and contains 17 beds. This morning I had my right foot dressed and hot fomentations\n\nput on my heel and big toe. There are open sores on both, and there is difficulty in getting them to heal, when walking about. With rest and attention they will soon be all right.\n\nThis hospital is in very large buildings that in peace time were used as a school and called \"Ecole de Filleret Salle D’asile that is a school for girls a hall for sitting.\n","17":"\n\nTwo months of the year have gone by. The war is still far from being finished. It is now at a critical period, any day might bring peace nearer or further away, but the ultimate end will be victory for our side this summer or thereabouts, or if we are luckey before then.\n\nThis a fine day. The sun is shining.\n\nI had my foot dressed last night and again this morning. It is now very much better but aches at times very much. There was a captain in this ward from one of the Battalions to see the wounded this morning. I heard that W. Stubbs is in England suffering from shell shock, and that in the recent raid german prisoners were taken.\n\nThis afternoon I met on the stairs young Popple of Merrigum. He is in the","18":" Field Ambulance and is looking well. Later on W. Herring also of Merrigum & now a Lieutenant in the 38 Batt. came into the ward to see some of his wounded men. He was in the recent raid & escaped without a scratch.\n\nThis evening there were some enemy\n\naeroplanes about. I saw one driven off in a great hurry by anti aeroplane guns & also by 3 of our planes. Later it or another one returned flying at a low altitude over the Hospital towards A. L. Epinette and fired on the observation baloon there. The man in it jumped out in a parashoot and gently glided down to earth. The aeroplane quickly turned round and again fired on the baloon. It was then quickly hauled down but I believe it was hit by the machine gun fire from the enemy aeroplane. It then made off and escaped. \n\nHarry Ryal formerly\n\ngardener at Dookie College is in the 10th Field Ambulance, and only left this Hospital this morning to go to another one. I did not see him or know that he was here until he was gone. I am told he will be back in a few days.\n","19":"\n\nA dull cloudy day. The street is wet this morning, there being a little rain last night. The 10th Field Ambulance is moving out to day and this Hospital will be taken over by the 11th Field Ambulance. Some of there doctors are already here and are being shown around the different wards, also the orderlies.\n\nSaturday March 3. 1917\n\nThere was a severe frost last night, and it is very cold to day. I see by the \"Daily Mail\" that the British have had good successes in\n\nFrance, also in Mesopotamia I had my foot dressed again o day. This time no hot fomentations were put on it, but a piece of lint dipped in some disinfecting liquid.\n\n I was to have gone to the D.R.S. at Steinwerck this afternoon, I got ready to go, and then word came along that we were not to go until tomorrow, as there were no car available.\n","20":"\n\nIt was very cold last night also to day. The \"Daily Chronicle\" announced that the British at Kut have achieved a great victory over the Turks who are retreating in great confusion to Aziza on the way to Bagdad. America is greatly angered by the discovery of a german plot to engineer an attack on the U.S. by Japan & Mexico. The House of Representatives\n\nhas passed a Bill empowering the President to arm merchant ships. The Tribune says war is inevitable. Sunday in Hospital is a very tame affair, in fact every day is the same. I spent most of my time reading, and don’t get out of bed until about 10.30 or later. Then after a wash and my foot dressed I go back to bed with my clothes on to keep warm. My big toe is very painful to day owing to the astringent solution (usual) that was put on it.\n\nthe papers in England are increasing their prices owing to the scarsity and increased cost of paper & other materials. The \"Mail\" is increased from ½ d to 1d but every issue is to be 8 pages. Most other papers are also increasing their prices. The \"Chronicle\" proudly states that there will be no increase in price, but a slight reduction in size, though it will continue to be a \"complete paper, giving all the news & the fullest versions of\n\nof special war cables\" I was to have gone on to the D.R.S. to day but the car could not take us all so I will have to remain here until tomorrow.\n","21":"\n\nThere was a heavy fall of snow last night, and it is continuing to fall to day.\n\nThere is not much news to day in the papers. The Premiers Uncle Richard Flynn, who was his foster father has died and was buried on Saturday. The Premier says he owes everything to him. This afternoon at 2.30 a motor ambulance came to the Hospital in Armentierres situated in the Ecole de Filleret et Salle D’asile and took us away to a D.R.S. (Divisional Rest Station) at\n\nIt was 4.30 when we arrived as there was a lot of time lost in calling & waiting at various Hospitals\n\nto pick up patients. I then had tea & went to bed. I was not there very long when Harry Ryal of Dookie came in and we had a long talk about old times.\n","22":"\n\nA cold cloudy day, and windy. I stayed in bed nearly all day as it was easier to keep warm there. Several were discharged from this hospital to day and others admitted.\n\nWe had sliced pineapples and sauce for desert at tea to night There is plenty to eat but unfortunately most of it is bully beef made into stews, though to night the stew was made with fresh meat. This Hospital is in charge of the 10th Field Ambulance and Dr Webster who came with us to England on the \"Persic\" is one of the medical officers here\n","23":"\n\nIt was very cold and windy last night. But it is worse to day. The wind has increased in violence and is bitterly cold. The mud is frozen hard again by the icy wind and the water in buckets has a coating of ice on it all day. Most of the patients are staying in bed all day, while others only get up for meals.\n\nIn Hospital one hears various tales of the trenches and experiences of Hospitals and these exchanges of experiences and adventures help to pass the time away. Cards and draughts have their devotes, but today the games are not continued long for it is too cold. I played a few games of draughts to day, and won them all. I only lost one game yesterday.\n","24":"\n\nIt was very cold and windy last night. Early this morning snow fell in thick flakes and continued until near dinner time.\n\nA patient in a bed next to me – a blacksmith in the Pioneer Battalion was told by one of the doctors who examined him this morning that he had got a Blighty. He was hurt in the hip years ago and it is coming against him now. The cold weather and a long march he had in England and another in the rain at La Havre is telling against him.\n\nAmong the remittances I heard today was the case of a pioneer who was gradually getting worse. He paraded sick several times, but the doctor always put him down for duty. When his mates backed him up and spoke to the \n\nO.C. of his company, he was put on light duties for a few days. Then he got leave of absence for a few days, went to London, and then into the Hospital. He was dead in a fortnight. He was a young Englishman who enlisted in Australia. All this time his Battalion doctor did not know what was wrong with him, or if there was anything wrong, although his mates could see he was wasting away. Another case was that of a man who paraded sick and returned to duty. At pack drill the same day he died in the lines after two hours drill. These cases shows that some of the doctors are not fitted for their work, but most of them are capable men and are not deceived by a malingerer.\n","25":"\n\nIt is very cold this morning but not so bad as yesterday. A german aeroplane flying low came over the Hospital at about 11 o’clock. The anti aircraft guns fired at it but most of the shots went wide of the mark. The aeroplane got away but she appeared in a damaged condition. There is no question but the German aeroplane is superior to the British in speed. To ours they are as a race horse to a draught. Their new tactics of flying low prevents our gunners being able to hit them for buildings and other obstructions obscure the view.\n\nVarious articles issued by the Victoria red cross were distributed today. I got a pair of socks, slippers a pair of pyjamas & coat and a face cloth for washing. In the pocket\n\nof the coat was a note from Dorothie Edwards Grovedale Via Geelong, saying for \"the comfort of a brave boy at the front, wishing him God speed and a safe return home to Australia\"\n\nThere was an inspection of the Hospital this afternoon by one of the Heads – Godfrey. There was a general clean up and new slips put on the pillows He came but did not enter our ward No 5, though he inspected the others, and evidently found them satisfactory.\n","26":"\n\nIt is not so cold today and the weather is much more pleasant. The ground is getting soft again. There are no newspapers today. An English doctor visited this ward this afternoon on a tour of inspection. This ward is built of wood with an iron roof and the ceiling and sides are lined with soft wood.\n\nThere are 4 windows on each side with a door in the centre on the side. There are no windows on the ends. The building is about 20 feet wide by about 50 feet long. There are 30 iron beds in the ward, and 4 or 5 blankets to each ward. There is a stove near the centre of the building and attached to one corner outside there is a small latrine for the use of patients at night & those who cannot walk very well. \n\nThe ward is fairly comfortable, but in very cold weather the best way to keep warm is in bed. The other wards are similar in construction. There are two orderlies on duty in the day time and one at night. The doctor visits the ward in the morning & evening. There is also an inspection by a medical officer every day, whose duty is to see\n\nthat the wards are kept clean and tidy. There are 5 wards in all. I am in No 5 ward & my bed is No 28. I have been playing draughts all day, lost a lot and won a lot. The newspapers came this afternoon.\n","27":"\n\nA very nice morning but a few showers in the afternoon. After dinner I went with Pte Smith – good draughts player – to a farm house a few chains away and had 4 one penny glasses of beer. While there we heard the anti aircraft guns at work and looking out we saw several of Fritz’s machines attacking our observation baloon with machine gun fire. The man in the basket jumped out in a parachoote and descended. One machine was flying very high and the other circled around the ballon\n\npouring in machine fire and evidently threw some incendiary booms for suddenly the baloon caught fire, and was instantly ablaze. Vast clouds of smoke ascended on high, and the baloon slowly fell to the earth its speed accelerating as it was consumed. During all this time our guns kept up a barage of fire, and as the aeroplane made off smoke and a flash of fire was seen at the aeroplane, but whether it was hit or was merely the explosion of our shells opinions are divided. All the patients who could walk & the ambulance men watched the whole seen. Some cheered lustly, whether it was at the skill of our gunners or Fritz’s it would be hard to say, for both events happened simultaneously. However our fellows have a great respect for Fritz’s skill, - as they are sports they give him credit for his bravery and\n\nand skill. Be that as it may we got even a few minutes later, for some miles away, one of Fritz’s observation baloons was brought down.\n","28":"\n\nThere were some artillery activity last night by the big guns in this sector, but not very much. To day is dull and cloudy. There was a smart shower this afternoon, but the weather is not cold. I have spent the day playing draughts & have more than met my match in Pte. A.C. Smith of the 34 Battalion. A number of patients were paraded to the Baths at Steinwerck this afternoon. I was not able to walk that distance, so could not go. \n\nThe food in the hospital is generally better, especially dinner & tea than in the army, owing to the comforts sent by the Australian red cross. We sometimes get preserved apricots, also oranges, and the other day fresh beans, the first time I have tasted them since I have been in the army. For breakfast we get the usual ration of bacon varied by bully beef stew. In addition we get porrage made out of ground biscuits, varied by\n\noatmeal porrage which is quite a treat.\n\nA new baloon rose up this evening in place of the one that the Germans burned yesterday.\n","29":"\n\nA dull cloudy day but otherwise fine. There is a pioneer from 39 Battalion in this ward now. He says he does not know what is the matter with him. He says they have been acting as stretcher bearers lately for his battalion. A number of patients left the hospital to day including Smith the draughts player \n\nBlack\/Green Batt.\n\nThe \"Daily Express\" of yesterday announce the capture of Bagdad by the Brittish. It is a crushing blow to German aims and an irretrievable blow to Turkish Prestage. It is a very old and important city and crowns with success the long British campaign in Mesopotamia. The British have had another success at Bapaume capturing a fortress with prisoners and booty. The French also have succeses on champagne, and the russians in Persia.\n\nby oatmeal porrige, which is quite treat\n","30":"\n\nThere was some heavy rain last night and early this morning, I slept well last night & heard very little of it or the noise of the artillery, though I believe it was very considerable in preparation for a raid. It is reported 2000 men went over in the raid. From all accounts to hand, It was a ghastly failure, there being about 150 casualties, only 8 men reaching the enemies trenches. Houplines was a few days ago reported to be evacuated by the enemy. It was here and at square farm that the raid took place. Our troops were caught by the enemies barage. Evidently the enemy had some well laid plans or got information through spies.\n","31":" march 15.1917\n\nThere was a little rain last night. There is a change in the weather to day. It is bleak, cold and windy. To day is the 954 day of the war, and our position and that\n\nof our gallant allies are better than ever. Count Bernstorff late german ambassador in New York is now in Germany. He is angry with the British for his ship being searched,bn and the mystery trunk seized. The Turks are driven beyond Bagdad, & a new position captured. The Turks abandoned their wounded. Dismay in Germany at loss of Bagdad.\n","32":" March 16.1971\n\nThe sun shone out bright and early this morning but later it again became cloudy.\n\nThe British are now 30 miles beyond Bagdad, and it is reported though not yet in the papers, that Bapaume is fallen. I hope it is true. \n\nI am always getting boxed up with the points of the compass here. It is not an easy matter to tell where you are by the sun in the North Hemisphere \nby the sun.\n In Australia the sun travels across the sky overhead, & a glance at the sun will always tell the aproxaminate position. But in Northern Europe it is different especially in the winter time, for the sun travels around the sky at no very great height above the horizon, and it is not easy to tell whether the sun is rising or\n\nsetting, or in other words whether it is in East or West. When the sun can be seen in the early morning & again at night one’s position can be ascertained, but in these cloudy regions the trouble is to see the sun. At 12 oclock the sun is in the South.\n\nThe \"Daily Sketch\" says China has broken diplomatic relations with Germany, and has taken possession of 6 german merchantmen in chinese waters. This is the outcome of Germany’s declaration in favour of intensified piracy. The American steamer Algonquin was sunk without warning off Scilly Isles last Wednesday by hun submarines. The pirates refused to tow steamers boats to land. Whether this outrage constitutes the overat act rests with the State department of U.S.A. The real issue is expected when a U.S.A. armed ship encounters a Hun submarine.\n\nBernstorff met with a chilly reception in Berlin. Hun press pointed out he gave too many interviews on the voyage & think he will retire from the diplomatic service. The Duchess of Connaught died Wednesday night at Clarence House at 8 \n","33":"\n\nBright sun shine this morning. There are some of Fritz’s aeroplanes about this morning, our guns fired upon them, and a piece of the shrapnel went through the roof of No 4 ward, but no one was hit.\n\nAbout this time last year when I was in camp at Seymour, my sister Marther died in the Hamilton Hospital. It was on a Saturday & I think the date was 18th.\n\nTo day is St.Patrick’s day.\n\nAfter dinner I went for a walk to Sternwerck with another patient. It is about half a mile away. My foot stood the walking all right, though it was sore at the start. While there I got my hair cut by a french barber for 3d. They are very good at their work and the saloon was full. Shaving is 1½ d. I also bought a note book at 7d. a much larger one than this.\n\nThe principal news in the papers today is the revolution in Russia. The Dumna and the people supported by the army have taken possession, imprisoned the cabinet for being incompetent, and the czar has abdicated the throne.\n\nThis will be the making of Russia, and will speed up the Army.\n\nThere are two men of the Transports in this hospital Jack Boon in this ward with a sprained ankle, and H. McGee with some stomach trouble in No 1 ward. Lance Corporal A. Ashley came up today to the hospital to see one of them.\n","34":"\n\nTo day there is a cold wind blowing from the North, and the sky is overcast. It is a miserable day. Saturday’s papers to hand this morning give further and more details of the Russian Revolution. It now appears it started over a week ago. The army navy, and people are united and supported the Duma provincional government. It is proved that the old government was incapable, and some of their members traitors, aiding and abeiting Germany, and in secret league with German agents. The police supported the old reactionary party, and a few regiments who eventually came over to the people. There was a lot of street fighting, and loss of\n\nlife in Petrograde the jail railway station and some other public buildings destroyed. Order has b een restored, and the loss of life considering the magnitude of the revolution has not been great. Moscow and other towns joined the provincional government without any bloodshed, and several princes also. The dynasty is doomed. The Tzar is missing but he has not yet officially abdicated, and all political prisoners have been liberated. All cases of treason to the country is to be tried in open court, and freedom of the press and liberty of speech, with the right to strike granted. The new Government is hailed with joy throughout Russia. The soldiers in the trenches cheered when they heard the news. It marks a new area in Russia, and shows the determination of the army and people to win the war. The Provincional Government who aim at a limited monarchy on the English pattern have received a cogratulatory telegram from England signed by many leading men. Long live Russia, Good Luck to her.\n\nI started to learn to play chess to day. It is a very complicated & difficult game. I did not go out anywhere this afternoon. A church service was conducted in the by one of the chaplains.\n","35":"\n\nIt is very wintery to day. Sundays papers confirm the news of the abdiction of the Tzar, and pathetic farewell to his people. The Regent the Grand Duke Michael states that he will accept the regency temporarily until the Russian people shall have decided what form of Government they desire. If chosen by a constituent Assembly of the people he will accept the throne.\n\nBapaume has been taken by the British. The town was entered on Saturday after a heavy battle. The place was in flames, the germans having evidently made plans for setting fire to it when they were forced to retreat.\n\nLe Transloy and Achiet-Le-Petit are also reported to be in our hands. The \"News of the World\" says Bapaume sets\n\nthe crown up on all our victories on the Somme\" and Peronne will be ours before very long.\n\nNews came in before dinner though whether true or not I cannot say, that the British have made an advance of 10 miles along a front of 40 miles, and were pursuing the enemy with cavalry. This is glorious news if true. \n\nThe Tzar has appointed the Grand Duke Nicholas to the Supreme command of the Russian Armies.\n\nThe weather this afternoon is very stormy and there has been frequent showers. It is a miserable evening and I stayed indoors. There is every prospect to night being cold and showery.\n\nMy foot is very slowly getting better. It is really very little better than when I went into hospital 3 weeks ago tomorrow. It is very backward in healing up. There has been a lot of doctors attending to it and each with different treatment. It has been fomented, or rather the sores dressed with powdered\n\nwith boracic powder again fomented, dressed with boracic ointment, painted with iodine, and lastly again fomented. The foments clean it but makes it raw again,and the boracic treatment causes pus to form, when it is again fomented to make it clean. The iodine and the boracic ointment is the best and if continued would soon cure it.\n\n"}}