{"Document Name":{"0":"Diary_0324","1":"Diary_0324","2":"Diary_0324","3":"Diary_0324","4":"Diary_0324","5":"Diary_0324","6":"Diary_0324","7":"Diary_0324","8":"Diary_0324","9":"Diary_0324","10":"Diary_0324","11":"Diary_0324","12":"Diary_0324","13":"Diary_0324","14":"Diary_0324","15":"Diary_0324","16":"Diary_0324","17":"Diary_0324","18":"Diary_0324","19":"Diary_0324","20":"Diary_0324","21":"Diary_0324","22":"Diary_0324","23":"Diary_0324","24":"Diary_0324","25":"Diary_0324","26":"Diary_0324","27":"Diary_0324","28":"Diary_0324","29":"Diary_0324","30":"Diary_0324","31":"Diary_0324","32":"Diary_0324","33":"Diary_0324","34":"Diary_0324","35":"Diary_0324","36":"Diary_0324","37":"Diary_0324","38":"Diary_0324","39":"Diary_0324","40":"Diary_0324","41":"Diary_0324","42":"Diary_0324","43":"Diary_0324","44":"Diary_0324","45":"Diary_0324","46":"Diary_0324","47":"Diary_0324","48":"Diary_0324","49":"Diary_0324","50":"Diary_0324","51":"Diary_0324","52":"Diary_0324","53":"Diary_0324","54":"Diary_0324","55":"Diary_0324","56":"Diary_0324","57":"Diary_0324","58":"Diary_0324","59":"Diary_0324","60":"Diary_0324","61":"Diary_0324","62":"Diary_0324"},"Date":{"0":"unknown","1":937.0,"2":938.0,"3":939.0,"4":940.0,"5":941.0,"6":942.0,"7":943.0,"8":947.0,"9":958.0,"10":959.0,"11":960.0,"12":964.0,"13":965.0,"14":966.0,"15":967.0,"16":968.0,"17":969.0,"18":993.0,"19":1007.0,"20":1116.0,"21":1118.0,"22":1133.0,"23":1134.0,"24":1232.0,"25":1320.0,"26":1321.0,"27":1322.0,"28":1323.0,"29":1324.0,"30":1331.0,"31":1336.0,"32":1344.0,"33":1350.0,"34":1381.0,"35":1397.0,"36":1418.0,"37":1420.0,"38":1421.0,"39":1422.0,"40":1423.0,"41":1426.0,"42":1427.0,"43":1428.0,"44":1429.0,"45":1430.0,"46":1431.0,"47":1432.0,"48":1437.0,"49":1439.0,"50":1440.0,"51":1441.0,"52":1442.0,"53":1447.0,"54":1448.0,"55":1452.0,"56":1475.0,"57":1477.0,"58":1480.0,"59":1481.0,"60":1482.0,"61":1483.0,"62":1488.0},"Entry":{"0":"\n\n","1":" A wet, windy morning, pavements and streets shining and slippery under horses, and pedestrians few, trams crowded, and footpaths a moving forest of umbrellas where there were no verandahs to shelter the passers by from the inclemencies of the weather. With Kit Bags and equipment up, I made the best of my way down to the P. and O. wharf, where lay the S.S. Mongolia, which was that morning to bear me away to where so many of our \"boys\" had gone before me, personal contact, with, and personal experiences in (to be chronicled hereafter) \"The Great War\".\n\nThe Mongolia was to sail at 10.30 and we had arrived at the Wharf in good time. Due at the wharf at 9.30 and accompanied by friends\n\nspent the time intervening between arrival, and going on board, while embarkation papers etc were filled up. Finally the word came to proceed on board, goodbyes were said, and what goodbyes there were amongst the crowd assembled. Little tots held up in Mothers arms to say goodbye to a \"Daddy\" whose relationship with them was not yet comprehended by the baby mind, and who, chuckled and crowed in his arms, (while he (poor fellow) hugged them and Kissed them with the yearning wistfulness of one who might never look on them again) did not realise that \"Dadda\" on that morning might be passing out of their lives for ever. \n\nBut Wife and Husband realises it, and bravely comforted each other, while the emotion they would not, for each others sake, give vent to, struggled for expression. Young girls saying goodbye to Sweethearts, their dream of happiness put off indefinitely because he had responded to the call of Country while he told her he would be back in no time, and she smiled through her tears as she clung to him.\n\nGray haired Father and Mother saying goodbye to a stalwart lad perhaps the last of many Sons or to their first and only born and with a look of pathetic pride on the old faces as they parted with him. On to the big ship, down narrow stairways to the close smelling troop-deck, Kits put in place, and then up again on deck to wave a last goodbye. And now the Gates of the wharf are opened and eager crowds rush in, while others\n\npossessed themselves of various vantage points where they could obtain a last view of the liner. In a moment the ships side was festooned with Gay streamers the bands struck up, and \"Tipperary\" sung from hundreds of lusty throats. A long drawn out \"cock-a-doodle-do\" from the ship answered by dozens of other boats in the harbour a furious threshing of the water by the propellers and slowly, very slowly the big ship edged away from the wharf. \n\nThe bands changed to \"Auld Lang Syne\", the song was taken up by the men on board, last Goodbye’s were shouted, the wharf became a flutter of white handkerchiefs and broken many coloured streamers and to the toots from hundreds of boat whistles and the cheers of those on shore and the lads on board, we swung out into the harbour, the tug came alongside, and we were off. Gradually we drew opposite each beautiful bay and promontory, so well know and loved of the Harbour and passed out of our view, until we were through the principal gateway to Australia, the Sydney Heads, and into the open sea. On board there were few minds which were not busy with the question \"When shall I see these shores again\".\n\nThe promise of a bad morning had developed into a glorious day, and through the most tranquil of seas we pursued our way, and thus the afternoon and evening of our first day at sea wore away, and at night the greater majority of us had our first experience of slinging hammocks, and sleeping in them. I kept waking through the night, with a haunting \n\nsensation of tipping over, and falling out on the floor, but morning dawned and found me still in bed.\n","2":"\n\nThe second day at sea was enjoyable, but uneventful. The weather good, but very cold, with the sea calm. Am hoping for a bit of rough weather.\n","3":"\n\nArrived in Melbourne at day light. The Mongolia drew up at the new Pier at Port Melbourne. A wet miserable morning. We were granted leave from 9.30 till 12 midnight, and on the whole, had a very enjoyable day. Took aboard a good crowd of lads here, and left Melbourne on the","4":" at about 3.30 P.M. The farewell was not very demonstrative, but there was a good crowd down on the Wharf to see us off. It was rather amusing lying in hammocks at night, and listen to the various comments on Melbourne by the Sydney boys, and the replies from the Melbournites these replies worked. Quite a wordy warfare ensued, until that great Arbitrater, \"Sleep\", descended on us all, and quiet reigned supreme.\n","5":"\n\nSaw a most beautiful sea early this morning. On our starboard side, was a long low range of hills, with a high conical peak standing out by itself in the midst crowned with heavy clouds. Between us and the shore, the sea was like a\n\nsheet of dull glass. Then, as the light became stronger, it became a plain of burnished silver, changing in a moment to all the colours of the rainbow. Suddenly out from the conical peak ashore a great column of fire shot up, and remained hovering over the mountain, as though it was being poured in a fiery stream from its bowels. As the Sun rose higher, the everchanging cloud wavered and broke into a fleecy mass of brilliant colour the ragged edges brilliant in burnished gold and purple. A glorious sight.\n\nThe day was quiet and uneventful, we had our first \"roll\" in the Sea to day, some of our fellows started on 6 meals a day three down and three up.\n","6":"\n\nHad to day in Adelaide. Only had four and a half hours leave here Caught the train at outer Harbour, where the Mongolia lay, and went into Adelaide three-quarters of a hours journey in the train. It was the first time I have seen Adelaide and I found it a charming little city, with wide streets, much wider than Melbourne, splendid footpaths, beautiful public buildings, and homely people. With hills at the back, it reminded we somewhat of Ballarat, Vic with old Mt Buni-nyong in the background. At a little after 6 P.M. we set sail for Freemantle, the longest trip on the coast. We took about sixty men aboard here.\n","7":"\n\nArrived at Freemantle about 7 o’clock in the evening. Were only staying about three hours. Troops who were coming on board here had already begun to assemble, and there was fine crowd in the wharf. No leave was granted at first here, but finally we were give an hour and a half ashore. Found this place to bear a great deal of resemblance to Sydney, with its narrow, crooked streets, but being night time, and leave being so short did not have time to see anything much. A crowd of our boys made a rapid acquaintance with \"Swan\" beer here.\n\nGoodbye Australia\n\nThe bold outline is growing dimmer\n\nIn the Sunsets Golden glimmer\n\nJutting headland, rocky slope & winding bay\n\nAnd the troops all gathered forward, with\n\nStrained eyes gazing shoreward\n\nJust to catch the last glimpse fading with the day\n\nAnd a passionate devotion, strong and boundless as the ocean\n\nFor a Home of Homelands glorious and free.\n\nWith a solemn, strange insistance, as we swing out in the distance\n\nThrills our hearts anew with Sacred love to Thee\n\nAll the tender ties that bind us, all the memories that remind us\n\nOf thy shores thy sunkissed lands, thy beauty rare\n\nEvery Golden recollection, strong chords of deep affection\n\nBuilds anew the hearts high Throne, and sets Thee there.\n","8":"\n\nHave, I fear, neglected my diary a great deal. I had intended keeping it most religiously during the trip, and am now a long way behind, so far, indeed that I wonder if I will be able to pick it up. After all, every day entries would, I fear become very monotonous, as the daily round on board ship is much the same.\n\nThe monotony of the ship, the lack of every day regular employment would at first sight seem conducive to effort in this direction, if only to fill in time, and yet such is the perversity of human nature, that the very unemployment which is so galling, seems to take away from one the desire to work, and the lazy feeling grows apace.\n\nThe journey to Colombo has been uneventful, as indeed, has been each day so far since leaving Australia. We have drifted into the tropics now and into tropical weather, and the troop decks are anything but pleasant places these times. Flying fish etc.\n","9":"\n\nWas on deck this morning before the stars began to pale, watching the lights of Colombo in the distance, wondering just what kind of new world was to bring.\n\nThe swift dawning of a tropical day! Colombo, glorious and lovely bay stretched before us \"Fair as a Garden of the Lord\" is the place, and, like Zion of old \"beautiful for situation As the day broke, objects that have been dim and indistinct, stood out clearly and distinctly, the shadowy draperies of the night, enwrapping the City, fled away, and in the Glory of the risen sun the place in its beautiful loveliness stood revealed. \n\nOn the right stood the lighthouse, or rather one of the lighthouses, for there are two, one at each end of the two breakwaters which form the entrance to the Harbour; and against which the great rollers of the Indian Ocean were breaking impotently, making a thousand snowy waterfalls when their crests streamed over the stone rampart, and forming a strange contrast to the mill-pond stillness of the Harbour where we lay.\n\nOn the right in a grove of magnificent trees, stood the strongest British fort of Colombo, and some fine Hotels and Public buildings. Just here too, is the Governor’s residence, the Gardens, fountains, Palms and well ordered lawns, making it a gem of beauty. \n\nThe main streets are fairly wide and clear with some\n\nvery substantial buildings. Lines of \"rickshaws\" in the Streets, with grubby and rather too energetic owners pushing us for fares, European sergeants evidently in charge of street traffic, mercilessly laying about said owners, a stout, cruel looking cane, whenever the slightest infringement of street regulations took place, crowds of gaily clad natives, dignified Cingalese, in flowing robes, with their hair done up in a knot behind, and tortoiseshell combs on their heads, children and adults both vying with each other in the attempt to sell wares of every description to the new (and therefore soft?) arrivals at fabulous prices, constitute the chief street sights here. Street sellers, and shops both will generally accept about a quarter or half the price originally asked.\n\nWent in Bristol Hotel, and had some beautiful cool drinks. The native attendants wait on one hand and foot. Hotels very elaborate, no drinking in bars like Australia. In this Hotel, an over polite Cingalese, the owner, or lesee of one of the Shops (the Shops are inside many of the Hotels) wanted to sell one a white Sapphire, one stone","10":" Led him on\n\nBeautiful Cocoanut Palms towering above all other foliage were especially noticeable from the Ship on the left of the City. (By the way, had our photos taken in the Rickshaws, then rode back to the Post Office, an hour away 8d each)\n\nWent through the native Quarter both on foot and in the Rickshaw’s. Very hot, and the heat seemed to bring to perfect maturity all the vile smells abounding in this Quarter. Dirt and filth everywhere. Natives\n\nSaw old women, bent and gray, only shadows of womanhood out in the broiling sun, breaking stones by the roadside, carrying the broken material in the baskets, and making the roads. Looks cruel, and has a smack of slavery about it that does not leave a nice taste in a British mouth. One would get used to it I suppose. Women in these parts seem to have a very hard time, in spite of the benefits of British rule. Will it ever be different? One wonders, and thinks of Kiplings lines.\n\n\"For the East is East, and West is West\" \n\n\"And never the twain shall meet\"\n\nYes, a woman’s lot in this country is indeed a poor one, and man is \"Lord of Creation\" here in fact, if nowhere else.\n\nSpent the next day at Colombo, but not ashore. No leave. On the morning of the","11":" left Colombo for Aden, our next port of call. Got into fairly rough seas right away but had a good trip, and arrived\n\nat Aden Port on Sunday. This place as we steamed in in the early dawn looked very picturesque, with its extremely rugged and mountainous shores, and white buildings, and forts, and signal stations, and evidently fortified places perched high up on the sides and tops of various peaks.\n\nThe coming of daylight, however, revealed a very different scene to Colombo. Where in Colombo the daylight had served to reveal in all its fulness, the beauty up till then only hinted at by the dawn, here in Aden, the broad light of day was cruel, stripping the place of its charms, and showing it clearly in all its hideous sterility and desolation.\n\nThey say that the English \"Tommy\" does a term in this place as a sort of penance for his misdeeds. If that is so, it is certainly a refinement of cruelty in the punishment line, to which a horsehair shirt, and the wearing of peas in ones boots would be preferable. Rugged hills, all of volcanic formation, rising some 1600 feet above sea level, without the slightest particle of vegetation to relieve their desolate appearance, form a background to a small town consisting of a few straggling buildings, once \n\nwhitewashed, now very dirty, and unspeakably squalid and mean looking. When these shores took their present fantastic formation, and what Titanic upheaval of the forces of nature brought it about, it would be interesting to know. But it is a place typical of death, desolation and decay. \n\nWe were ashore for a few hours two days in succession. It seems nothing will grow in the Soil. Some attempt has been made to grow some climbing plants along the fortway on the Crescent, and the plants are in barrels in soil evidently brought from other parts, and even then they present a very sickly appearance.\n\nThe unfavourable impression received of the Port from the Ship was more than confirmed on going ashore. Dirt, vile smells, and unsightliness prevail everywhere. The natives seem rather more energetic than Colombo, but not quite so persistent in their endeavours to force their wares on one.\n\nThe Hotels, like everything else abound in filth, and the native attendants wait on one reluctantly, and with evident dislike not taking much pains to conceal the same. We took a motor out to the township of Aden, three or four miles from the Port, but the same conditions prevail\n\nboth there and on the way. The road winds through bleak and arid hills, passing an Arab Cemetery on the way; a veritable place of death amidst death, where the mouldering clay beneath the sod was no more dead that the land surrounding it. \n\nThere is a fine bit of Engineering work on the road known as the Great Pass.\n\nBeyond the township of Aden again there are some wonderful old tanks, said to date from the time of Solomon. Did not have time to go out there, but they tell me they are well worth seeing, though the water is very unpleasant to the taste.\n\nWe have had beautiful evenings here. The place regains its attractiveness at night, with its hundreds of twinkling lights from fort and Signal stations set high upon the rugged mountain sides. It is superb, lying in ones hammock on the open deck of an evening watching these lights, those of the Signal stations never still, twinkling out their messages into the mysterious night, listening to the lap, lap, of the water on the ships side, and now and again the rythmical splash of oars, to the accompaniment of the weirdest of chants by the Arab boatmen. There is\n\na charm about these things that time will never efface from the memory. They will remain there, fixed, indissoluble, only growing more fragrant as \"time, like an ever rolling stream\" bears us further from them.\n\nOn Wednesday, the","12":" we left Aden for what proved to be the last of our journey by boat. Between seven and eight that evening we had passed through \"Hells Gates\" and were in the Red sea. This is generally looked upon as the most trying portion of the journey on account of the extreme heat, but here again we were fortunate, in that a beautiful breeze was blowing, and this continued right throughout our journey through the Red sea, which, by the way had the most deep blue waters of any we passed through.\n\nOn Saturday the","13":" August, we reached Suez, where we were to disembark. Went ashore here with some of the Hospital patients and Captain Shelley in the Motor Boat Roma. Saw the patients safe into temporary quarters, and we turned back to our launch, and lo, and behold, it was already far away from the wharf heading for the Mongolia. Made some inquiries but no boat\n\navailable. We could not even hire one. We were stranded in Suez, with all our belongings on the Steamer, and we had no idea when the troops were disembarking. We roamed around Suez for about an hour, but found the little we saw of it very uninteresting Finally we were put aboard the Mongolia through the courtesy of a Naval Officer, who placed room at our disposal on his launch. When half way across, we saw the barges laden with troops on their way to the shore. So we had to go on board again, and spend another hour waiting before we could get to shore again.\n\nWhen I arrived, found all the other boys packed into open trucks ready for the Journey. There were beautiful grapes in abundance for sale here. For an hour or more we sat in the trucks, and waited in the Sun, for the rest of our Kit bags to be loaded, and the signal to start. Bully beef and biscuits were served out we filled our waterbottles from a neighbouring tap, and finally we were off.\n\nSmiling ebony damsels stood on the balconies or at side doors and waved us off, while Cosmopolitan\n\ngroups of men, Greek, Italian French, Arab and \"Gyppo\" took their fez’s or hats off, and (apparently) gave us their best wishes. So we commenced to get our first glimpse of Egypt. This was not very cheerful looking. On one side we got occasional glimpses of the Canal, the wonderful work over which that talented Frenchman De Lessep broke his heart and committed suicide, on the other side desert, oceans of yellow sand stretching away into the hazy distance; a \"willy willy\" now and then picking it up into a swirling column.\n\nOn the Canal side, the dreariness of the outlook was broken occasionally by plantations of date palms, the great, graceful leaves overhanging the clusters of ripe fruit. These places formed a pleasing contrast to the monotonous desert view, and the sense of relief afforded the eye was grateful.\n\nIt is said that one must swallow his peck of dust before he dies, but if you want to do it quickly, try travelling in any open truck in Egypt from Suez to Moascar. You will get full measure, \"pressed down, and running oer\" The sand, fine almost to powder, gets into one’s eyes\n\nit gets between ones teeth, it is in his hair, down his back, and everywhere else where sand has no business to be, including, of course, that receptacle destined by nature for food of a more sustaining character. I was not sorry when the train finally pulled up at Moascar, and we received the command to detrain, though the Good Lord Knows there was nothing to cheer one in the sight of Moascar. \n\nThe usual sand then more sand, then tents, stretching in long lines from one end of the Camp to the other. Back of the tents the mess shed, long structures built of wood, and covered sides and top with grass matting. Beyond them again, sand, and still more sand, stretching away, limitless, immeasurable, undulating, here shadowy, there shimmering in the heat haze; reaching out into the mysterious silences of the desert, to meet the sun already sinking redly to the level horizon. \n\nAnd so we commence our experiences of Camp life in Egypt. Bully beef and biscuits for tea, and not too bad, either. The tea especially tasted O.K. We had to pitch our tents immediately on arrival. That however, was only a few\n\nmoments work, and we soon settle down. The","14":" 2nd and","15":" A.L.H.F.A. have been put together for the time being and attached to the first brigade. We have arrived a couple of days too late, and so have missed some fun. The day before yesterday Johnny Turk was over here Taube, dropping bombs Pity we missed it. I spend my first night in Egypt sleeping under, (as Patterson beautifully puts it) \"The wondrous glory of the everlasting stars\", and think before I go to sleep, of the Southern Cross, which I \ncannot\n see.\n\nIt is very quiet, the Camp is asleep, the breeze is as balmy as those which the old Hymn says \"Blow soft o’er Ceylon’s Isle\" and whispers through the tents and lingers on one’s face and hair, caressing with gentle fingers. The deep-blue of the sky is ablaze with multitudinous star-jewels, the powdered gem-dust of the Milky Way athwart it all. Truly, the night has a \"wondrous glory\", And I seem to be enjoying it alone. The others are asleep. It reminds me of Browning (is it Browning?) who says, with wonderful insight and with equal candour:-\n\n\"The world is filled with God\",\n\n\"And every bush aflame,\n\n\"But only those who see,\n\n\"Take off their shoes,\n\n\"The others sit around\"\n\n\"And pluck blackberries\"\n\nThe wonder, the mystery, the beauty of the night has got into my soul, and I can’t sleep. But I feel content. Man, I think, has too few moments like these. The claims of the sternly practical side of life are so compelling, they are pressed upon him with such insistence, the strenuous commercialism, the struggle for place and a competence, in a word, the bread-and-butter-meat-and drink side of life is so vivid and compelling, that there is grave danger of neglecting the beautiful, the poetical and artistic side of him, yes, and if you will, the sentimental side of him, and so he becomes less a man, and more of a machine.\n\nWas it not Huxley, when the weight of years was on him, who said, if he had his life to live over again, he would find time to listen to some good music every day?\n\nIt seems as though, with success and fame already his, in those pathetic words he regretted the neglect of the softer gentler side of his nature.\n\nThe moon has risen now, a great yellow full moon, sliding up from behind the trees in the Ismalia Gardens. I am just beginning to ponder, dreamily, on the sights the same orb has seen in this, old old land, when a long drawn, sobbing cry, grotesque, hideous, breaks in upon my reverie, and disturbs the serenity of the night. It is only a donkey, in the stables close at hand, lifting up his strident voice. Perhaps the night has touched a poetic vein in his nature, he sounds as though he has broken his heart, more likely he is appealing for sympathy in his isolation to the rest of donkeydom, but at any rate, he has broken the spell.\n\nI feel poetic no longer, I am reduced to commonplace matter-of-fact clay. I am a soldier, it is getting late, and reveille sounds at 4.45 A.M. It is time I went to sleep.\n","16":" night\n\nMy dreams have been rudely shattered, and my hopes dashed to the ground. Arrived yesterday evening. At six o’clock, this morning we were all on fatigue, digging fifteen foot holes in the sand. The consoling information was given, gratis, that we were likely to be at the same work for a considerable time, and the chances of going to the Unit for\n\nsome time were very remote indeed. And on the boat coming over we were picturing ourselves as being in the firing line almost immediately, now our castles in the air have fallen about us with a crash.\n","17":"\n\nFind the A.M.C. are quite in the fashion as fatigues. Did a days navvying in the sun and sand yesterday, then were put on all night horse \"picket\", and then another full day to day. \"Misquise\" as the niggers say.\n\nHave had some very happy hours down at the Salt Lake (Timsah) of an evening in swimming. This is a beautiful spot, but will not attempt a description here. That will come later, perhaps.\n","18":" \n\nHave had nearly a fortnight in the N Zealand lines at the Anzac Clearing Hospital. The work has been very light, and the N.Z.’s fine fellows, A good deal quieter than the Australians.\n","19":" \n\nWe have had quite a change in the program. After leaving Hospital , we spent one day in the","20":" A.L.H.T.G’s lines, then we were sent up to the","21":" T.G. to work in the Dispensing there. When we received word to go, we were in high glee, Thought we were going out to the Regiment\n\nWe marched out with 24 hours rations, and full Kit and equipment up. The truth was great disappointment to us. Have been here (in dispensary) nearly a fortnight now, and we are wondering what the next move will be.\n\nHave been into Ismalia several times. It is very quiet, but down in the French Quarter, and in the Gardens very pretty. It is said that the Pharaoh of Joseph’s time had his summer Palace here, and that somewhere on the sight of the present town Joseph suffered imprisonment at his hands. I wonder is there any spot in this land that is \nnot\n rich in historic interest!\n\nTwo or three of us went in Company one night to the Mohammedan Mosque here. The preliminaries to be gone through before we were admitted were rather curious. First we were asked at the door to remove our boots. As boot number one was removed, we were requested to put the unshod foot over the low barrier at the door without touching the pavement outside, lest the interior should be defiled, then the other boot was removed and the same process gone \n\nand so, you stood within the sacred precincts. Then our hats were taken, and hats and boots placed together at the door inside. (It seems, by the way, that it is not the boots that offend, but the fact of \nyou\n being in them). Then we were shown into the building, which we found lofty but plain, and very poorly lighted. The floor was spread with clean matting, and on this a number of worshippers of Allah, squatted, stood, or sat. Those who stood, murmuring their prayers, and then sinking onto their knees, bowing their foreheads to the matting, with the invocation, Allah! Mohamet! \n\nWe were also shown the place where all who enter wash before they pray. To the eye there is every appearance of real humility and true worship, but history sadly contradicts the effect produced, and a very casual acquaintance with your Arab proves the metal base. It does not seem to produce the genuine religious article. But then, one might say, what religion taken as a whole, does turn out a really creditable article. A great majority of these followers of Mohamet are the greatest rascals\n\nunhung, but what of that?, do not the same conditions prevail in the countries which are nominally Christian? The English, French, German, Russian, Italian, and Spanish speaking races, together with a host of others, are nominally Christian, but there are many thieves and swindlers, many extortioners and sweat , many adulterers and murderers.\n\nMany a smug faced business man has filled his pockets, and built his fortune on the tears and blood of sweated workers, but he may yet be a pillar and member of a so called Christian Church. So perhaps it is prudent not to judge your Hussein or Achmed too harshly, or to criticize his religious tenets from the standpoint of the Article Produced.\n\nWe witnessed a peculiar ceremony in connection with Mohammedanism one night in Ismalia. We were coming home one evening, when our attention was drawn to a group in a lane. Clean matting had been spread on the ground, a lighted lamp stood at one end, behind which the \"Teacher\" had taken his place. On either side, and in front of him, stood those who were taking part in the ceremony. In a long-drawn\n\nout, weird chant, the teacher sang his invocation to Allah, while to the time of the Chant, the others swung themselves to and fro, forcing out their breath in a great, gasping sob, as they swayed or rather flung themselves from side to side, till the sweat poured from them, and the heavy unpleasant smell of their perspiring unwashed bodies greeted one’s nostrils.\n\nWith repeated cries of \"Allah\" , they keep this up, working themselves up into a perfect frenzy, their monotonous responses to the Chant, rising in a swelling crescendo till it becomes a blood-curdling yell, savagely and exultantly fanatical. Here one will break out into a wild leaping and hand-clapping, till from sheer exhaustion, he falls on the mat, while another, an old man, white beard and locks flowing, throws himself onto his knees, bows his forehead again and again to the dust, his hands spread out in supplication. All the while the wild chant of the priest continues, though what he is saying, whether a form of words used in a service like this, or quoting the Koran, or improvising as he goes, I was not able to find out. Passers by occasionally stop for a moment, some with a tolerant smile, not a few\n\nopenly ridiculing, and others plainly interested and impressed, but for the most part, the greatest apathy is displayed. \n\nWe saw, also, one evening, while returning home late, a native wedding, or to be correct, the procession following a wedding. This was in the native quarter in Ismalia, about midnight. This the hour your Arab generally begins to wake up, in fact, not only the Arab, but the rest of the population as well. \n\nWe were in town one evening when an Italian patriotic concert was to be given. The second edition of it started at midnight! But I am digressing a little. \n\nOur first intimation that anything unusual was at foot was the hideous din, and the crowd. Lights were in abundance, the foremost of these, carried by two stalwart Egyptians, taking the form of a crescent and single star:- the Egyptian emblem.\n\nOthers were in various shapes, and some apparently without design of any kind, except to light the joyful bridegroom on his way to the bride’s house. A native band headed the procession, discoursing wonderful and fearful music, (this by the way, was the din that first attracted us)\n\nA tremendous crowd of niggers followed, here and there a man stepping into the procession itself to congratulate the bridegroom, on this occasion a boy of some ten or twelve years of age. On either side of him walked a man carrying a huge artificial bunch of flowers, in which a number of lighted candles were placed. The scene reminded me of the Scriptural story of the Ten Virgins, where the Bridegroom went forth to meet the Bride, except that the carrying of acetylene lights had modernised it a little.\n\nHow little has the march of civilization in the world affected men and customs in this ancient land. Still men can be seen with the rudest of ploughing instruments, and the unequal yoke spoken of in Scripture, a camel and an ass, or an ass and an ox, yoked together. Still, in the villages do the women grind the grain between upper and nether millstones.\n","22":"\n\nEgypt. Eternal, wonderful, full, of mystery and perished glories, old in the Arts and Sciences and \ncivilization\n culture when the now civilized world was yet in its savage cradle. The land that has seen and suffered and enjoyed so much\n","23":" many vicissitudes, so much glory, such deep shame, so much poverty, such lavish wealth, so much joy such deep sorrow, where the haughty pride of the Pharaoh was humbled before God, when Cleopatra reigned in such unparalleled splendour, and wooed Anthony to his doom, the land of statues, and tombs Pyramid and Temple and of workmanship unsurpassed and imperishable, thy glories are all of the past. \n\nEverywhere is history where Australians have fought and died, the feet of Moses and the thousands of Israel passed on their way to the promised land.. Into this land too, the gentle Mother of our Saviour fled, when the cruel hand of Herod was stretched out over the Holy Land, in the Slaughter of the Innocents, and near Cairo can still be seen the tree where tradition says she rested in the flight.\n\nBut is one settled apparently for all time in a Detail camp, the country gets on one’s nerves. To the monied tourist, flitting where he will, the country is doubtless an inexhaustible store of pleasure and interest, but to the Soldier, scarcely.\n","24":"\n\nHurrah: after 8 months stagnation in Moascar, and fruitless attempts to get away, The order to move on has at last come. We left Moascar today, after the usual messing round, which\n\nis apparently indispensible to all military movements, we got away about 2.30. Had second class carriage to ride in as far as Kantara, where after a mile and a half, or two mile march, and a wait of about 3 hours , we were put 22 into a cattle truck en route for Gaza, where at present by all accounts our boys are having a rough passage. \n\nAll the most interesting part of the country we have passed through at night time, which is unfortunate. In the half light, however, we are just able to make out the battle field of Romani, and note the heart-breaking character of the country our boys had to win, foot by foot and mile by mile from Jacko. And it is almost impossible to believe as one is whirled along by train, that just a few months ago this line did not exist, but all the bringing up of troops was done on Horseback and supplies by camel and mule.\n\nIt is almost beyond comprehension, and the story of Kitchener to Khartoum seems small beside this gigantic undertaking. Here and there along the line one would see a simple cross, the lonely last resting place of one who had made the great sacrifice sleeping their last sleep, among the desert solitudes. After a journey of about 18 hours we landed at Khan Unis; where\n\nto our great disappointment we were told to get off. We thought we were going right in to business. We are now in Palestine and the Turks are entrenched at Gaza about nine or ten miles away. The sound of the big guns is very plain from here. Just about half a mile away is the ruin of a very old Church said by some to have been built by the Crusaders about 500 years ago. By others it is said to have been built earlier, before Christ. \n\nJust in front (about 10 or 12 miles is Gaza, the Gates of which Samson dealt with so summarily in days gone by, when the Philistines had encompassed the City.\n\nThen there is Samson’s Ridge, of which the Turks hold one half, and we the other. This is where tradition says Samson slew the Phillistine with a Jawbone. Wanted: a few more Jaw bones to smite Abdul. After being in Khan Yunis for about five weeks we have packed up the whole camp and are now at Rafa. By train we went to New Rafa, and after being there a couple of days packed all our gear onto Camels, and moved Camp to Old Rafa\n\nabout three quarters of a mile away. Here we had to dig in, in view of the loving visits Bro Abdul pays, and the habit he has of dropping affectionate messages from the skies. We are now where the battle of Rafa was fought, a great achievement our boys having to advance across an open plain in full view of the enemy, and exposed to all his fire. Several quiet graves are about here, containg the last remains of brave lads who paid the great price. Simple crosses are raised over each, with the number, name and regiment carved on them, and here the heroes sleep, and in their death pass on a message of courage, faith, and devotion to a cause which might well stir all our hearts. \n\nLooking on the graves one is reminded of Macaulay’s lines\n\n\"And how can man die better\"\n\n\"Than facing fearful odds\"\n\n\"For the ashes of his fathers\"\n\n\"And the temples of his Gods\"\n\n Our stay at Rafa has been very short. Barely a week here when once more we pull up our tent pegs, and move away again, this time to Beni Selah, about 3 miles past Khan Yunis.\n\nHere we are to start an Anzac Receiving Station for the Division. The Camp is in a good situation right on the banks of a Waddy. Personally a Hospital is the last place I ever hoped to be in, but we all have the consolation we are not to be here very long. Here, too we have to dig in. We have accomodation for about 100 patients Major McLaren being the O.C. Every day regularly a Taube pays a vist, but merely a visit of inspection. He does not attempt any bombing.\n\nRed Crosses are flying by day and set out with red lamps at night, so it will not be any mistake on his part if he does bomb us. Yesterday we witnessed a very exciting fight between two of our battle planes and a Taube. The Taube had been paying his usual afternoon visit and had received an exceptionally warm welcome from out Anti-Aircraft-Guns, and was making towards home when out of the blue came with a throbbing hum two machines, one on each side of him. With characteristic daring; the\n\nTaube altered course and made straight for them. Our machines were above him. Immediately one swooped diving straight at the Taube like a huge hawk at mouse. It looked as though the machines would crash and come to the earth together. By what looked a very small distance they passed, both firing their machine guns. Then the second one swooped with a devilish rattle of machine gun fire, and immediately the Taube turned and dived like a stone, nose down for the earth, his exhaust shooting up a column of smoke as he went. There was great excitement at the Hospital, Everyone was crying out \"He’s hit, They’ve got him. Indeed, it seemed so. Those who had glasses however said that the Taube only dived as a ruse, for after descending about 500 feet he straightened out and proceeded on his course.\n\nRumours have come in to day that he was damaged and fell either in No mans Land, or just inside the Turkish Trenches, but the truth is not yet known\n\nThere is very little doing on the front. The other night about a week ago, the rest of Samson’s Ridge was taken from the Turks. By the sound of the gun fire it was fairly warm while it lasted.\n","25":" \n\nOnce more I am about to move to \"fresh fields and pastures new\". Either to day or to morrow we move our Camp down to the beach near Khan Yunis, and take over the Anzac Rest Camp. I say, to day or to morrow, but is quite likely that it may be a week hence, owing to the glorious uncertainty characterising military procedures. The most we know at present is that the","26":" L.H.F.A. are to come with their stuff on Camels, and dump it on the site we have been occupying, and that \nwhen\n they arrive, we depart. Some of our chaps have already gone, and have had a couple of days to disport themselves in the briny. \"Oh what must it be to be there\"?\n\nEverything is very still in the heat this morning. Down in the waddy a couple of lizards (very like our frill-necks \n\nonly smaller, are disporting themselves, and in the steep bank another is basking in the strong morning sun, every now and then moving his head up and down sharply with those strange spasmodic jerks, which seem to be peculiar to the lizard tribe. The action is very evidently one of watchfulness, as in doing it he stands erect on his front legs, thus raising his line of vision by an inch or so, and all the while his sharp eyes are peering in every direction. And they are sharp eyes. Not a movement escapes him. I have a fly net hanging down in front of my \"bivvy\" but I am sure from the attention he is bestowing on this corner, that he can see me through it. Very little frightens them, and they disappear like a streak of light into some crevice or crack in the banks of the Waddy.\n\nThis part of the country (Beni Selah) is alive with all forms of insect life which hardly (as the reader will imagine) tends to the Billjims comfort. The worst of the crowd is a large black scorpion, very similar to an Australian specimen I have seen, with long lobster like claws in front, a long\n\nflexible five jointed tail, with a wicked curved sting on the end, and an evil leering eye. His sting is more than uncomfortable, it borders on the dangerous. Spiders are plentiful. The old common house-fly is as affectionate here as elsewhere, having a love for your person that can only be destroyed by slaying him. \n\nThe worst trouble of all, though is the ants, little brown fellows who have made their nest in our \"bivvy\". Day and night they are on the move, especially, I think at night you are just dropping off to sleep when one or two discover you, and proceed on a minute inspection. It is vain to be still, and take no notice, in the hope they will crawl off, as expeditiously as they crawled on. Evidently they have a motto, \"What you do, do well\", and the most ticklish portions of your anatomy are sure to be discovered sooner or later, and they remain there, making little erratic darts in all points of the compass, but eventually getting round like a lost man, to the point they started from, until in despair, after vainly tried to put your finger on them in the dark\n\nyou are forced to sit up strike a light, and look for them. This time quite likely, they ","27":"\n bolt, and you are balked of your revenge after all. But after all, there is not much pleasure in killing him. There is not enough of him. One touch of your finger, and he is gone. If you could only make him understand what he was to die for, and then kill him slowly, inch by inch, and hang his dismembered body up in front of his nest as a solemn warning to his fellows, it would be some satisfaction. But you can’t. \n\nDeath he meets quite cheerfully, and there is an endless reserve of him to draw upon, and when he is dead, he only serves to stock the larder of the others, which is \"internal economy\" with a vengeance. This last act of his, carrying off his own kith and kin to stock his food cupboard, shows him in disposition and tastes to be very much like our friend the German, hence there is no insect I abhor ","28":" much as the ant, except the German\n and despise, (while giving him due credit for his thoroughness and methodical ways) so much \n\nas the ant, except it be that other more contemptible insect and fellow cannibal, the German. \n\nCrickets abound too, the old familiar kind, with the old familiar piercing song. Spiders, snakes, huge black beetles, facitiously dubbed \"tanks\" by the boys, abound. The latter enjoys another name \"dung roller\" from his habit of collecting the manure from the horse lines. He is really the Scarab sacred to ancient Egyptians. This he rolls backwards, standing on his front legs and using his back ones to roll his burden along, which he does at a remarkable pace. \n\nThese beetles are great fighters too. I have several times put two of these together, and to do so is to immediately bring on a battle royal, a most scientific proceeding. They indulge in a form of boxing, their blows rattling like castenets on their opponents shell armour. All of a sudden there is a sharp \"click\", and before you can see what actually has happened, one beetle has been knocked quite a foot away, his opponent, who has been guarding his precious load all the while, immediately taking advantage of the lull in the proceedings to commence his rolling operations with renewed rapidity. The other \"Roller\" however, never loses his sense of direction but is round and after him immediately. They\n\nfight till one is done for it is a fight to the finish when the other claims the treasure and rolls it home in triumph. Well, after all, history has instances of where men have spilled blood for less.\n\n\"A Visit to the French Camp\"\n\nThe desert is noted for its heat, and its dryness, and these two combined generally continue to create a thirst that one would not sell in the Colonies for pounds. This, and the hope of being able to get a little French wine, led me one evening to walk down to the Khan Yunis camp in the search for Frenchmen willing to part with the desired commodity for a consideration. After much fruitless gesticulating and interminable \"Oui, Oui\"ing I found one who spoke English. \n\nThis man was an Englishman but had spent 24 years in France, and was now a member of the French Army. From him I received the welcome tidings, that if I would come down to his Camp, which he said was quite near, on the morrow, he would get me a pint of wine. On my return, I imparted the joyful news to my friend \"Sam Porch \" one of the hardest cases one would meet in a day’s march, and we decided to take a water bottle on the following afternoon, and visit my new found ally. Well the following afternoon we started about 2.30 for Khan Yunis. It was very hot, though a slight breeze was coming in from the \n\nsea, about six miles away. About half way between us and our destination a solitary gum tree showed, distant on the skyline. Towards this we directed our steps. Underneath it a small company of Frenchmen had their Camp. These we greeted in our best fashion with Bon soir at which some of them laughed. I always had heard that a Frenchman was noted for his politeness, but I doubt the truth of that rumour. Just because we said \"Good night\" to them in the middle of the day, why should they laugh? \n\nOne attempted to engage us in conversation, and poured out a perfect torrent of language upon us. We both knew only one French word in reply, so we said it, simultaneously \"Oui\". Evidently it was wrong. When you only know one word of a language it difficult to put it always in the right place at the precise moment. At all events, our French friend became vastly excited, waved his hands and arms, as though he was finished with them, and wanted to wave them off, made faces, pointed to the sky, the ground, the solitary tree, the sea in the distance, himself, us, in fact everything within sight, all the while treating us to another torrent of eloquence. A bright idea struck me. I suddenly\n\nremembered another French word. It might be he was giving us some information, it would be right to thank him. At any rate, it would show him we knew \nour\n manners, if they had forgotten \ntheirs\n, So I nodded my head wisely and \"Merci\" said I. Great heavens! worse and worse. He became hysterical, took his helmet off and pulled his hair, while the perspiration trickled in beads down his long nose and limp moustache. The someone at the back put in a word, which calmed our Voluble friend a deal, and he finished up by taking one of our hands in each of his, and saying Australia! France! Bon!\n\nThis we understood, and said \"Oui\" again, which was right this time. So we parted good friends. Anyway we felt sorry for him, with his absurd language and extravagant gestures, and as Sam remarked commiseratingly as we walked away, \"Poor devils, they don’t understand English\".\n\nAfter this we proceeded on our way to the main Camp, where we made enquiries for our friend. Now I had omitted to ask his name, being so sure of finding his Camp at once. In this however, I was mistaken, we had to begin asking questions, and with the questions the fun started. After nodding our heads and\n\nwaving our arms at sundry French Soldiers we were led into the presence of the Lieut to whom we made our wants known. He brought us a pencil and paper and intimated we should write it down. I did so. He then produced an English French dictionary. I had written down \"Soldier, little man, small moustache speaks English\". After five minutes hunting, he puzzled it out. Then he started on another search to find a reply. This is what he wrote \"What which you want him?\" I replied still in writing, of course. \"We wish to speak to him\". More frantic searching, then he wrote down \"He found not yet is\" Of course he wasn’t. How could he be when no one was looking for him. At last they led us to the Captain. They compared notes, more dictionaries were brought out and finally the Capt directed us to another tent. In the meanwhile these two Officers had brough out two envelopes to us with their address on. Sam begged these as souvenirs, and we arranged to see them again on the morrow, and bring them some Australian stamps, which they asked for. They took an infinite amount of trouble with us, and were gentlemen both, courteous to a degree. Next we proceeded to the tent the Captain had indicated when we found\n\na French Officer who spoke perfect English, gave us our man’s name, and showed us his Camp. Right, we were in high spirits, thought by this time very very dry. Another weary, perspiring quarter of a mile across soft dust ankle deep and we were at his Camp, and saw our friend, but alas, their wine ration had not been issued, or so he said, and we could not get any. I have always disbelieved that man’s statement He is a villain, I am sure. Weary and disheartened, and dryer than ever, we started back, after shaking the dust of this false friends camp off our feet. \n\nOur road home led us through another portion of the Camp and just here, right in a corner we saw a tent and some barrels and a Corporal outside, busy washing. We looked at each other, and I saw hope dawn anew in Sam’s tired eyes. I expect he saw the same in mine. We walked right in, nodded, and said \"Bon Soir’ He didn’t laugh, but he replied \"Bon jeur\" Sam carelessly dug out a handful of small change, after a pantomime of pointing at the Sun, and wiping the sweat from his face and uttered the magic world \"Vin\" in a questioning tone, at the same time holding out the \n\nmoney. Jacques wouldn’t hear of it, shook his head and himself most emphatically, saying \"Non non\" over and over. We argued with him in English, he refused in floods of eloquent French. Finally he pointed to the Seat. We obeyed joyfully, for we felt the battle was won. He disappeared into the tent, and presently came the sound of hammering Jacques was breaking a cask open. By this time our thirsts were tremdendous. Then he came out, and called, and a soldier appeared carrying a length of rubber tubing. Our thirsts were now out of all bounds, enveloping us, blotting out the landscape.\n\nThey both disappeared into the tent, and again Jacques emerged bearing a tin mug in his hand full to the brim with wine. Sam went first. He drank it right down, and handed over the empty mug with the most heavenly smile I have ever seen. Then Jacques brought mine. I drank it slowly, revelling in it. It was beautiful. Then I too smiled. I could not help it, I was at peace with all the world. But our friend would take no money, not he. We tried him, but not a cent would he accept. We had found, (Oh, wonder of wonders, not to be told of in Gath) we had found an honest Quartermaster\n\nWe returned to our seat and awaited developments. I had a water bottle with me, and we were anxious to have it filled Jacques came and sat down alongside us We told him in Arabic and in English that all Frenchmen were good that we had always adored them from childhood. His face remained blank, though he said something about Australia which we didn’t understand. Then I remembered the French word \"Bon\" which we had heard earlier, and told him Frenchmen were \"Bon\" He lightened up at that, and smiled happily and said \"Australie Bon\" \n\nThinking the moment auspicious, I produced half a crown tapped my water bottle, offered him the money and asked, Vin? No, he was as violent in his refusal as ever. He wouldn’t come at it at all. That half crown, if positions were reversed, would have been reposing in an Australian Quartermaster’s pocket two minutes after negotiations were opened, and no questions asked. Not so Jacques. He was absolutely immovably \nhonest\n. I could not take my eyes off him, for an honest man is a great curiosity. He them remembered an English word, and let it out at us, with a finality that admitted no \n\nquestioning \"Finish\" he said. Then it was that Sam, the resourceful was struck with a brilliant idea. He produced the envelopes addressed to the Captain and Lieut in quite a casual way, and showed them to the Q.M. You never saw such a transformation in a mans face. He smiled gesticulated, called his cobbers, and showed them the marvel. In a second they had made it understood by pantomime that if we got permission from the Captain, he would give us as much wine as we wanted. You can bet we lost no time. \n\nWhen we got to his Camp, the Captain was out. I sat down while Sam went in search of him. What perfect gentlemen these Frenchmen are. The Captain returned, brought by Sam, and he was still smiling (Imagine an English Officer under like conditions. The daring French private would surely have been in Gaol) We explained to him what we wanted, and this kindly gentleman not only gave us the chit we required, but actually paid the ten piastres for the wine, and refused to take our money. So we got our bottle filled, and an additional mug into the bargain. Later on, in the seventh heaven, we started for home. As we journeyed blissfully on our way Sam turned to\n","29":" with love in his eye, and said \"Blue, I for-forgive you for all the tramping roun’ \"We’ve (hic) had a glorious time. A glorious time (hic) my boy\"\n\nWe had arranged, you will remember, to take the French Captain some Australian stamps. on the evening following the events related in the last chapter, so after tea, we set out by the old way for his Camp. On arrival, and enquiring for him, we found the Captain was still at his tea. Would we wait, we were asked (by signs of course) An Officer came along, pointed us to a seat, told an orderly to bring some wine and drank to our health. We rose and gave the toast \"Vive la France\" We had not long to wait before the Captain put in an appearance, and greeted us most warmly. Sam had brought Australian and New Zealand stamps of various values (he is an ardent stamp collector himself) I had taken some photos and an Indian coin the only one I could rake up. The Captain was delighted with the stamps, but would not accept them until we had accepted some from him. When I produced the photos and after showing them offered them to him, he was all for refusing, but I eventually had the pleasure of seeing him\n\naccept them. Then nothing would do him but we must go into his tent, and look at his photo’s of which he had a good collection. He insisted on pressing three or four of these on to each of us, after writing the subjects on the back and signing them. I have never owned a photo which I valued more. You must remember that we were two ordinary Australian privates, and that he was a French Officer, to fully appreciate, as we did, his kindness, and the spirit of comradeship which he displayed.\n\nSome little time before his Regiment had been on the beach, and three of his men while swimming, had been carried away by the current and drowned. An Australian trooper had gone in after them, had brought two ashore, too late, alas, to save their lives, and in going in again after the third had sacrificed his own life. This story the French Captain had told us, with many eloquent gestures, and a few English words. The good fellow’s eyes were wet as he told us. He had the trooper’s name in his pocket book. He would never forget it, Australia would have an honoured place in his heart on account of that gallant deed. He emphasised the bravery of the deed\n\nagain and again until our hearts would have been stone indeed had they failed to respond. We made him understand how much we appreciated his kindness to us and his friendliness. He took our hands and said French Officaire, Australian Soldat, Brothers, all brothers, all soldiers. And so, is that the secret of the greatness of the French Army and the French people Brothers. No wonder Germany with her arrogant, self deified Officers, and whip driven men failed to conquer her Such a spirit will make her always victorious.\n\nFinally he got our names and addresses in Australia, gave us his in France, and told us to write him when better, more peaceful days should come. We rose to leave, but he stayed us. The French-English dictionary came out again and he looked up the words \"Come back\" and indicated the seat. We were to come and see him again, and so we will Captain, and there are two Australians at least, whose hearts will always treasure as a precious fragrant thing, the memory of your kindness, large heartedness, and unfailing courtesy, and\n\nif we are both spared, to get each to our own land, when those days of peace are upon us of which you spoke, I am going to send you some of the finest and most real, Australian souvenirs that I can procure.\n\nThe Meals of the Army\n\nAny account of military life, whether at home or abroad, would hardly be complete without some reference, however slight, to that most indispensible of Autocrats, the Camp Cook, and his handiwork. The health and strength, the fighting capabilities. The general fitness of a body of troops, is so absolutely dependant not only on the quantity and quality of food provided, but on the manner in which it is prepared, that the Cook is rightly a very important person in a Camp. He is a good man to make a friend of, and rash indeed is the man who wittingly makes an enemy of him.\n\nTo day is the","30":" of July, and we are still in our Camp near Beni Selah. When we will go to the beach is still somewhat of a mystery. As for myself, I have to day received joyful tiding, I am to go out to the Unit the day after to morrow, at last. So I will have a chance of seeing some fighting\n","31":" Have been three days now at Gamli, about four miles south east of Sheik’s heran Railway station. I am feeling very happy over my work here. I have always loved horses, and the chance of working among them, and I have it here. I am pursued by a dread that they will try to put me into the Tent Division, but am determined not to leave the lines without a struggle. I am with the bearers now, and ought now to see some work to my taste. Of course, I know, there is always the possibility that after my first scrap, I may never want to see another, the same as many others have been before me.\n\nHere I have had one days grazing, the horses are taken out, each man riding one, and leading two, about three miles to water, and then another mile and a half further on, are turned out to graze, being minded, of course, all day. There is some good picking here, the old crops (barley) left by the Turks being plentiful, though all lying down on the ground. The horses enjoy the freedom from the lines, and get a great tuck in into the bargain. But what a dusty track. Some months\n\nago when our boys first came out here, the country was a picture to look at. Green with grass and knee deep barley. Now there is not a blade of grass to be seen within miles of the Camp, owing to the immense traffic (horses and wheeled) which is daily passing over it. It is a marvellous sight here. One can see for miles in some places, and everywhere are Camps. Thousands of men and horses scattered everywhere here. \n\nGreat dump heaps, pumping stations, Railways reaching out everywhere, networks of communications, one stands amazed at the wonderful evidence of the power and virility, and organization behind the British front here in Palestine. I wonder, since I have come out here, and have seen all this with my own eyes, what kind of an effect these huge preparatory measures have on the Turkish Airmen when they come flying over, as they do nearly every day. For over 60 years the Railway has been an acceptable mode of travel from place to place, yet the Turk has only between 150 and 200 miles of desert separating\n\n \n\nPalestine from Egypt and has never in that time linked the two countries up with a railway. It has remained for Britain and Britain at war to do. Surely no more sufficient proof of Turkey’s inability to rule could be found. Now lines of railways branch everywhere, double lines at that in many cases. Some of the Stations are miniature city traffic lines judging by the network of tracks. The weekly growth of one of these places, is beyond belief unless, one sees it. To day you pass over a place where a railway track is surveyed. To morrow you pass again, and there is railway line with trains running on it, a mile or two beyond where you crossed it a day before. It is amazing: The Egyptian Labour Corps has rendered Yeoman Service in this respect.\n\nI have now had a little initiation into those wearying trips towards Abdul’s Country, called \"Stunts\" On Sunday, the","32":" August, was the first long one of these. We left, four bearers, and two, sand carts at about 3.30 in the afternoon, and reached the\n\nWadi Ghuzzi, after travelling in a nor nor easterly direction for a distance of some eight or ten miles, in time to water the horses, and feed them, and at the same time have a hasty tea ourselves. Billy tea, toast made at the dying embers of the fire, and bully beef. Then a cigarette. We were to move off at nine o’clock. By this time the horses had finished their feed, and with bits out, were gazing round the recumbent bodies of their owner. \n\nEvery five minutes out of the saddle is a chance to snatch a moments sleep on these stunts and some of the old hands have it brought down to a fine art. They sleep anywhere and at any time. For myself I find it difficult but do not experience much discomfort from the loss of one nights sleep. Now the order is passed along to \"Mount\". By this time of course widely thrown screens and advance guards have gone, one with every detail, such as connecting files etc all complete Then comes the order, \"All lights out\" A thousand points of light glow picturesquely in the gloom as a final draw of pipes and cigarettes is taken, And then put out for the night, then we move\n\nforward under the stars. Everything is very still and quiet. Our course is shaped now almost due north for about five or six miles, I should judge, with frequent five minute stops to rest the horses. We have not gone far before one of the Machine Gun pack horses lies down and refuses to get up again, Colic probably, She has put in perhaps a twelvemonth, or eighteen months of useful service on short rations a great part of the time, and often without water, on stunts for many hours at a stretch. It does not avail her now. The harness is transferred to a spare horse, the poor faithful brute is given a dope, that will end her career, and the troop moves on, and she is left to die alone. Such is one of the indirect cruelties of war. No time to minister to the sufferings of a patient, dumb animal here. We are on the march. She must die. After all, it is the kindest form of cruelty.\n\nPresently we strike the bank of another Wadi, a little too high for the crossing, and we follow its course in a south easterly direction till we reach a place where it is crossable. The\n\nsand carts jolt noisily over the stones in its bed and the horses strain at the traces in the pull up the opposite bank. Once across we proceed due east. Behind us all the Signal Squadron is running out miles of wire as we go, Communications, of course.\n\nIt is a rather strange experience this, riding on and on under a canopy of blue set with a myriad star jewels over a The light effects are especially peculiar. Every little while the starlight seems to glow with a strange whiteness as if the moon appeared at intervals, or was switched on with a button, and as suddenly switched on again. Others wiser than I on these matters may explain it, I cannot, but it is quite common on these night marches. As one gets a little drowsy too strange optical illusions, mirages by starlight, pass before him. Just a few dozen yards away to the right a troop appears to be riding by the banks of a running stream. Reflections and all are complete. One stares at it for quite a while before it vanishes. So the world rolls eastward, and under the stars all night, the momentum \n\nseems almost imperceptible. In the early hours of the morning we come suddenly on to a Bedouin house, built of stone, a high stone wall surrounding it, and surmounted by a flat roof. Figures are seen in the dim light moving hurriedly about the roof. Then the place is surrounded and entered and a number of Bedouins made prisoners of war. The women sit on the floor, and stolidly refuse to move. They are left behind for the time being at any rate. \n\nThe stars are paling now, and we must be at our journeys end by daylight. We have not far to go. The sound of horses feet scrunching and scrambling among loose stones reaches us from on ahead, then next moment we too, are down, sand carts and horses, floundering among the round stones of a Wadi Bed. On the other side, and yet in the Wadi, we pull up and the horses are outspanned, So we can lie down, daylight has come with a rush, as it does always in these parts. We get overcoats or blankets off our horses and lie down to snatch a few moments sleep, if\n\npossible. Six o’clock or half past sees us out again. Our horses must be watered and fed, and we need something to eat ourselves. There is water about two hundred yards away, someone says, in a well, so we untie our horses and set out. There is water, abundance of it, but it is quite seventy feet down to it, and it takes all our neck ropes bridle and cart reins to reach it. We have one horse bucket, holding about a gallon, and we have fourteen horses to water. \n\nThis well must date from time immemorial, almost. It is walled all the way down to the water with solid lumps of stone square faced. On the edges of the well, this solid stone is cut into anything from three to six inches, with the friction of the ropes that have been used to draw water through the Centuries in which the well has had its being. This is not in places alone, but all round. The stone edges are like the teeth of a giant saw. How many years of laborious drawing of water is represented by\n\nthese grooves, it would be hard to say, but in all those years no one thought of a windlass. The way Jacob and Abraham drew their water, is quite good enough for the inhabitants here. Change is unknown. We have to draw up five buckets for each horse, and it is no easy task, but at length we are finished, we return to our waggons, \"feed up\" is ordered, and then we are free to attend to our own needs. Soon a fire is going, billies are boiled and we sit down to our bully and bread, and it tastes good, too. We have journeyed all night without breaking our fast, and it make one surprisingly hungry. \n\nWe are quite close to the Turk here and are expecting his planes over any moment. Then comes the roar of a big gun, Johnnys first shot this morning. Others quickly follow, each one nearer. No planes appear, and Abdul reserves his shells for the men who are creeping up towards his position, though we are within range, and he must surely guess that the Wadi is sheltering\n\nno inconsiderable number of troops and led horses. A rumour went round that we were to move off at nine o’clock. That is the worst part of these stunts. You ride all night, to the weariness of a thirty or forty mile ride is added the loss of sleep, and then you are at your objective a couple of hours, and you go back again. It is all very necessary of course, but very disappointing especially to the new man who is looking forward to his first \"stouch\". The \"old hand\" however, is generally very content to go home without any active demonstration on the part of our \"friend the enemy\". \n\nWe were already to move out when the order was passed along for a couple of sandcarts and bearers to go out, as there had been some casualties. We had not gone far before we met the first case; being carried in across a horse in front of a trooper. He was lying on his stomach across the horses withers, limp legs and arms swinging, and his head rolling with a horribly grotesque significance from side\n\nto side. A stretched was lowered and he was laid on it, his wide open eyes staring, but staring sightlessly into the fierce sun whose power to make them close was gone for ever Stone dead. Killed instantaneously , they said a high explosive had burst low, and right over him, and that was the end. My first sight of war, and the cruelty of it. In a few hours the message would be humming over wires cable to Australia, and yet another Australian woman would know herself widowed and her children fatherless. As I looked into his staring eyes and drawn face a moment, I could not help thinking more of her than of him. \n\nOne of the other cases was serious, five wounds, two gaping under the right arm, two on the arm itself, and one on the leg, all from fragments of shrapnel. This man had a ride of about thirty miles in a sandcart before the Motor Ambulance could pick him up.\n\nOn","33":" we left Gamli and went to the Beach at\n\nEl Marakeb for a few weeks spell. I have not enjoyed it very much. True the surf is good, but every day there is some parade or other on Regimental lines, and we seem to do more here than when we were supposed to be working.\n","34":" we left El Marakeb and went to Fukhari. There was a rumour afloat that we would not be there long, that our horses were unfit for the front line, and we would have to go back to the Beach. El Arish was even mentioned in this connection. Contrary to most rumours this one turn out to be correct, with the exception of the El Arish part of it.\n\nOn the","35":" we left Fukhari for the Beach once more, this time near Raffa, at a place which I believe is called Beri-el-Kufer . Here we put in three weeks, and had a glorious time. Being away from the Division we had no Regimental Parades, or inspection by numberless \"Heads\", and it was a relief.\n\nWe left the Beach again on the","36":" and reached Abassia-el- the same night. Here we stayed two days and two nights, leaving on the","37":" at 3.30 P.M. and reaching Essani at about 1.30 on the 27th.on the","38":" .left Assani at about 5 o’clock on the evening of the","39":" and reached Kallasa the same night. Left Kallasa the following day","40":" and reached Aslug the same evening. This place is a fort at one time in possession of \n\nthe Turks. Neither the garrison not the fort however appear to have been very formidable. The country here is very bleak and arid. The Wadi’s banks are limestone for half their depth, and in some cases for the whole depth, and the country generally which is very hilly has the appearance of having been swept by a bush fire.\n\nFrom here we commenced on our long all night trip to Beersheba, where the work of pushing the Turk back is to begin in earnest Valley of Dead Bones (Camels). We reached Beersheba, or rather our destination which was well behind the town among the hills, just after daylight in the morning. Almost immediately machine gun and rifle fire broke out on our left, where a small scouting party had come into contact with a Turkish Patrol. We passed down the Wadi over a rotten track right round the town and after reaching a hill top were able with glasses to see part of the engagement. \n\nIt is not worth while setting down here my partial view of what will be fully described by someone doubtless with a thorough knowledge of the position and action from the commencement. After a long dreary wait, we moved on again, and at last came in sight of Beersheba itself. The Ambulance took up a position on a hill overlooking the town, and waited for orders. We were placed on the usual position for the Ambulances. We are either put down alongside\n\nor placed where troops are moving in force. This is a peculiar thing, and it is hard to see the end in view. On this occasion the hill we were on was one round the brow of which reinforcements came for the firing line. We had just had dinner when some squadrons of Light Horse made their appearance over the hill and divided into 2 parties one passing in front and one behind the Ambulance. Almost immediately there was a dull boom from the hills where Jacko’s artillery was placed and a shell came shrieking over, to drop about seventy yards away, in front of the bearers horses. This was followed by another only half the distance away. \n\nIt was time to move. The order rang out \"stand to horses\" then \"Mount\" and at the trot we moved, and fell in on the left of our original position with a twenty yard distance between each waggon. And we were not a moment too soon. We had scarcely moved when a shell fell \"plonk\" where our carts had been. The next two or three whistled over our heads and scattered the horsemen to right and left. Several were injured. Next to appear was a Tommy Battery which met the same welcome. There were, on the whole, very few casualties that day, but the night was to tell a different tale. Beersheba had not yet fallen, but it was to be taken \n\nthat night at any cost. Late in the evening while the Transport section s were coming up, a Taube suddenly appeared, dropping bombs among the teams with dreadful effect, and using his machine gun. Some teams had not a horse left. One man was just feeding three horses. Two were killed instantly, and the third injured, the man was untouched but the rush of the explosion so close was as the breath of the world had whirled by in one roaring gasp. \n\nThe wounds of the men were sickening. Here a headless body quivered in a painless death throe. There a leg or foot was gone or an arm, or a man choked and spat blood through a torn throat and shattered jaw. The cases coming into the Clearing station afterwards were pitiful. I helped to lift one man out of the Sand Cart, whose shattered shoulder bones were protruding through the raw lacerated flesh, one foot was twisted and broken. All night \nthe Doctor a\n nearly the Sandcarts brought in their ghastly loads of suffering and misery, and all night the doctors and bearers and tent Division toiled. There were dreadful sights seen that night, and dreadful things experienced by those who so courageously suffered. Beer Sheba, however, fell that night. \n\nThe next morning I was awakened early by the rattle\n\nof machine gun and rifle fire, and thought at first the Turks were counter-attacking. It was however, two Taubes, who had paid an early morning visit, and who were bombing and emptying their machine guns into the squadrons camped below them. They were flying low and were subjected to a storm of Machine Gun and rifle fire from our own troops. One Taube was brought down. The Pilot was killed, and the observer, clambering down into his seat, could do nothing but bring the machine down. \n\nIn the evening they were over again. We were just returning Carts, with which we had evacuated our wounded from our Clearing station to the Turkish Hospital in Beersheba, when two Taubes appeared and open fire on the squadrons by which we were passing. We did a \"higgery\" without standing on any ceremony, either. Just as well, too perhaps, for after bombing the Regiment, one Aeroplane flew over the","41":" Field Ambulance and dropped three bombs among them in quick succession. There was not the slightest doubt about it, it was a deliberate attack on the Red Cross. The height at which the machine was\n\nflying made it impossible for the Aviator to be able to distinguish the Sand carts and Red Cross. Several men in the Ambulances were severely wounded.\n\nBeersheba itself is very small but there are one or two very fine buildings, noticeably the Mosque and the fine Turkish Hospital. The lower part of the town is typically Arabic, closely confined houses, dirty and evil smelling. The newer portion on the hill, is cleaner, and of a different type. There is a very fine Railway Viaduct over the big Wadi here, also a fine water supply, pumping stations, and houses complete with troughs.\n\nWe remained here for a couple of days, the Ambulance being encamped on a hill overlooking the town, and resumed our march on","42":" our objective being Derea, when it was reported the Turks were concentrating in the hills. We started at midnight and arrived at our destination after one of the roughest trips I have had yet for the Sand carts, at daylight we camped, lit our fires, boiled up and had breakfast, and fed our horses. Then some of the Sand carts were told off to go out after wounded, and the rest of us retired to a sheltered spot behind a low hill, where with\n\nthe aid of the Sandcarts tipped up and some blankets, we made a temporary dressing station. We had hardly completed our arrangements when the first wounded arrived. The Turks had a very strong position here, a strongly fortified redoubt, being the chief difficulty. They also had possession of the water supply. Some of our lads had been out here since the morning before and only one bottle of water in that time. All day the struggle for this position went on, and all day the wounded kept pouring in. \n\nSome were bad cases, but the spirit of the Australian boys when wounded, is a thing to marvel at. Never a word of complaint, never a grumble escaped any one, and the eagerness to stand by and wait while someone they reckoned worse than themselves, was inspiring. What wonderful unselfish spirits they are. Several good Officers were lost here. Shot dead. \n\nOh, it is a \npitiful","43":" thing to see a fine young fellow, all his life before him, talents and physical strength second to none, to see him brought in on a stretcher, with his brains bespattering the canvas and calling perhaps in a voice pitifully weak for a loved whose voice he will never hear again in this world, whose hand is too far away to soothe\n\nhim by a touch in this hour of suffering, but even then no word of complaint, not a murmur would pass his lips. I remember at Derea one young fellow being brought in with a bullet right through his head. The canvas of the stretched was saturated with his blood, his brains were protruding from a ragged hole in the back of his head. We lifted him gently from the Sand cart, and as we did so, the other patient who was in with him said \"This chap died on the way up\". But he was not dead. There was a feint sign of life as we laid him down near another man, also on a stretcher. Suddenly he opened his eyes glazing already with the film of death, stretched out his arm and with convulsive strength of the dying grasped the stretcher near him. I tried gently to loosen his fingers, but could not move them, he dragged the stretcher to him with the other man on, then his grip relaxed and he lay still. \n\nAnd still statesmen and Parliamentarians and gasbags all over the world speak of \"civilized\" warfare. It is a damned lie. There never was and never will be the slightest approach to anything civilized in the maiming and murdering by one man of another, no matter\n\nwhat the means are that need to be employed. That night through there being no water, we had to return to Beer-sheba. The Infantry relieved our boys.\n\nAt this place the Turks showed very definitely just the amount of respect they have for the Red Cross and wounded men. All day as our Ambulance went to and fro they were made the target for shells, machine gun fire and sniping. The Turks had possession of a very strong redoubt on the hill, and to get to our wounded the Sand Carts had to pass directly under this hill and cross an open space. This was when they suffered. One team had three horses out of the four shot another one had one, and several others had horses wounded. \n\nThe escape of the drivers was nothing short of wonderful. One of them showed a wonderful spirit. He was wounded, a bullet struck him in the thigh travelled downwards and came out the lower part of his leg. His cart was still in an exposed position. He said to his mate, \"Come on, I can hang on till we get these men to shelter\" thinking of the wounded in his cart. He did, too. He lasted until a sheltered place was reached and then collapsed. Strangely\n\nenough while others were recognised for the part they played in this days work, this young lad’s recommendation was turned down. Some things are hard to understand. 3 M.M’s here \n\nAt Beersheba in the old Camp we stayed the night and then were on the march again, Reaching Sherea on the morning of the","44":" (Rough road). Here were piles and piles of ammunition left behind by the retreating Turks. Their haste was undoubted. Ground sheets, gas masks, ammunition, medical stores, blankets, dried fruits, and goods of every description were strewn along the way. In some places one would come across a Turkish Field Kitchen with the evenings meal still in the pots uneaten. They had been surprised while supper was cooking, and fled incontinently throwing all their gear broadcast. Transport of all kinds littered the Wadi’s . This was ground across which the Infantry had driven the Turk the night before and dead Turks were lying around everywhere. They had had a terrible time. Some were lying terribly wounded. \n\nWe met with a warm reception when we pulled up in a Wadi for Breakfast in the early morning. Johnny was considerate enough to let us light our fires and have breakfast, and then without any warning a shell\n\ncame whistling over. This was followed by a regular procession of them each getting more and more uncomfortably close, and it was deemed advisable to clear, and clear we did, in double quick time too. Johnny did good shooting that morning, and if his ammunition had been good there would certainly have been casualties to record. As it was many shells lobbed right close to us, and never exploded, happily for us.\n\nWe moved on to another Wadi, and from there were called out. On our way we witnessed a splendid charge by some of the light Horse which resulted in the capture of an Ammunition dump and a large Turkish Field Hospital. We received word here that Derea too had fallen. There were very few casualties in the 1st this day","45":" One man was brought in across a horse dead. A shell cap had struck him in the back, breaking the back bone and tearing a hole you could put both hands in Death for this poor fellow was of course instantaneous. A couple more were brought in a little later whom we carried to our dressing station at Sherea. \n\nOn our return the Ambulance had moved on. Jemama had fallen, and with it an abundance of drinking water, and pumping plant complete fell into our hands. It was while\n\nwaiting here in the afternoon, near Sheria, that we saw an impressive sight. Suddenly out of the west like a swarm of huge dragon flies, there appeared a fleet of British aeroplanes some 25 or 30 of them. It was a grand sight. What was our surprise and consternation, however, when just over the ridge from us, they just started dropping bombs on our lads. A horse came tearing over the ridge, and pulled up near, nostrils distended, foam dropping from its lips, and terror in its eyes. From its flanks a copious stream of warm red blood was flowing from two great jagged rents in the poor creatures flanks, where it had been struck by pieces of bomb.\n\nThen came two men, one slightly wounded, the other seriously. The latter staggered over the rise, and fell in a shapeless heap. He received attention on the spot, and he was one of the men we conveyed to the Clearing Station. We had hardly got over the shock and surprise of it, when the planes commenced bombing another squadron a little distance away. In all 8 or 9 men were seriously injured by our own planes, on this day. The behaviour of one of them was very strange. In the morning we were going to water, when this plane flew backwards and forwards over our heads\n\nat a terrific pace, and then opened fire with a machine gun. He was not more than 100 feet above our heads. Colonel Ryrie’s batman was wounded in the thigh. These occurrences gave rise to a great deal of comment amongst the boys as one can readily imagine.\n\nFairly late that same evening we reached Jemama. What a blessing to have plenty of water. It was very cool that night yet it was a pleasure difficult to equal to be able to strip off and have a real good bath. \n\nThere is an extensive orchard here. the pumping plant being a privately owned concern, set up in the first place for the purpose of irrigating the orchard. The Austrian who owned the place was captured and when we arrived was doing good service in the engineroom.\n\nWe were sent on the following morning after a couple of wounded Turks who were in a Wadi close at hand. One was shot through the stomach, the other through the lungs from behind. Where the second man was lying was an immense quantity of material of all kinds, eloquent testimony to the haste with which Johnny had \"quitted\". We were directed to take them to the village of Huj some four or five miles away, and to leave them at the 2nd ALHFH Clearing Station. For a start we were directed onto a\n\nwrong track, and very rough. We retraced our steps and finally made Huj at about 2 o’clock in the afternoon, only to find there was no second Field Ambulance there. We had met the","46":" Amb. earlier in the day, going to establish a dressing station near Jemama. We had dinner, fed our horses and set our faces towards this place, and delivered our patients there. Then we made for Jemama and camped there for the night. By this time we had no idea where our Brigade was and we could find nobody who did, though we found many strays, who like ourselves, were looking for it. However we set out, and at midday reached the village of Ocherden, or some such name. We passed through several villages that morning whose names I do not know. Here the villages seem to be a little better than the places we have passed so far. All have an abundance of water and a few trees. \n\nPrevious to reaching this village, however, we passed what had been the Headquarters of the Turkish Army. There were some elaborate dug outs here, built into the side of the bluff with sawn timber, ovens for baking bread, fowl houses, and everything that spelt comfort in the field was here. There were however, the same evidences of hasty flight that\n\nwe had seen right along the route. It was directly after passing Turkish HQ that we reached the village I have spoken about. If any further evidence was needed to testify to the Turks hast in retreating, it was supplied here. Transports of all description littered the valley at the foot of the village. Arms of all kinds, haversacks, wallets gas masks, loads of bombs aircraft and others, saddlery lay about in reckless confusion. Dozens of oxen driven to the last stages of exhaustion by the fleeing enemy had been abandoned, and the poor brutes lay around here dying. In many instances the unfortunate brutes had worn a great hole in the hard soil in their vain struggle to rise. While we were there, some Mounted Troops appeared, and some well directed shots at close range effectively put a merciful end to their dumb agony. \n\nThe state of the transport stock, (abandoned) we have passed along this route has been deplorable. It is a truly Turkish act to leave them to die of starvation. In the dry season this country affords no grazing whatever. Here we were joined while at dinner by one of our lads who had been sent to lead us to where our\n\nBrigade was camped. So directly after dinner we saddled up again and proceeded on our way. Half a mile’s journey brought us to the village of Basseema. A great place is erected here right on the edge of the Wadi in which is the tomb of some great departed. It is the source of the utmost annoyance and disappointment to me to have to pass all these places by without so much as a cursory glance at them and their contents, but of course, one has no choice. \n\nThe bearers are better off than drivers in this respect, then so of course are the mounted troops. They can hop off and have a look at any place of interest, and nobody is any the wiser or would, but for a driver to stop means delaying the rest of the Transport. So while inclination pulls strongly one way, duty pulls another, and Duty, perforce wins the day. Some day it may be my pleasurable lot to wander amid these same scenes as I will and when I will, with none to hinder, but for the present, it is out of the question. \n\nJust out of the village a flock of mixed black and white sheep were grazing. One of our number went over and asked the old man in charge of them what he wanted\n\nfor one. They were his own as it happened, and he very generously gave us one. Three miles further on we halted to Water. The well was tremendously deep, and one of those curious old affairs that are so common in this country, a bucket on the end of a long rope on a round log of wood with axle fixed into uprights and a place to hook a horse or donkey on to the end of the rope. Then you walk your horse out the distance it takes the bucket to reach the top, unswing your bucket and tip it into a stone trough at the side. Then turn your horse, and lead him back to the well’s mouth again and make a fresh start. It is a slow and tedious process.\n\nA Company of Yeomanry were waiting when we arrived, so as it would be at least an hour and a half or two hours before we could get our teams watered, the sheep was killed and dressed and in a very few minutes the smell of savoury chops cooking pervaded the evening air. At last the Yeomanry were out of the road and we prepared to water. My team was the first in. They were watered and the big bucket was just being hauled up to start on another when\n\nthe rope snapped, and the bucket disappeared with a dull thud and rattle to the bottom of the well. That was, of course the finish of the watering. This was all the more disappointing in view of the fact that the teams had not had water for 36 hours. This is the heartbreaking part of these stunts. The way the poor horses have to suffer. Very often (Chaff) is unprocurable and the horses only have their \"Iron ration\" i.e. about 7 or 8 double handfuls of grain three times a day to live on. In addition to this they often as in this case 24, 36 and 48, and in some case 60 hours without a drink, and yet they stand it marvellously. The Australian horse is a wonder. No matter how long he has been hungry, how long he has been without water or what work he has been doing one can always get a gallop out of them as required and it is hard to know your horse is hungry, and in spite of all your foraging you cannot find , to know he is thirsty and see the dumb appeal in his eyes for both food and water and you can give him neither. A man very often goes short himself. Transport of rations is a great difficulty when troops are moving forward at the rate ours have been the last few days but there is hardly a man who would\n\ncheerfully go without, if thereby his horse could be fed. That night we camped about a mile away from the well, fed up our tired and weary horses, boiled the billy and had some bully and biscuit ourselves and turned in. We were on the way early next morning and at about 11o’clock in the morning came up with the Ambulance and the Brigade at Eshdud (the Biblical Ashdod) . This is a place abounding with interest from a Biblical point of view. Askelon is just behind us, Gath lies on our right, what bloody battles have been fought in and around these places in days that are gone. \n\nWhen the King of the Philistines matched his might against Israel, when Israel, deserting God and in consequence temporarily deserted by Him went to the Wall before their heathen adversaries when they lost the Ark of the Covenant. It stirs one to think of the momentous events that have taken place around here. Now nothing remains of the place’s former glory. It is a village of mud huts grass roofed, abounding in filth and unsanitary conditions. Only a few\n\ngrey ruins still rear their heads proudly defying the ravages of time and human spoilers alike. It is very easy to identify the old genuine ruins from places of Bedouin or Arab construction however old. Many of the places I should think are Roman and many of them are remnants of the days when the Crusaders marched through this land.\n\nWe remained one day in this place. That night we went just outside the village to pick up a few of our men Machine Gun who had been killed by a high explosive shell in the afternoon. We moved out in the darkness and came to the place, by the side of a small Wadi. One stark form was lying by the side of the road, alongside his dead horse. Several more men and horses were lying around. Some were only wounded. The suffering of some of these poor lads, who perforce have to be out for a considerable time are terrible. After we got the wounded aboard, we had to find our way in the darkness to Julius , where the","47":" Mounted Clearing Station was with them. The road was terribly rough, and none of us had any but the vaguest idea of where the place was. It took us some time and\n\none poor fellow, shot through the stomach died in the Sand Cart just before we arrived. The Sand Cart is by no means an ideal conveyance for wounded men in this country. They were good in the sand, but on this hard soil, intersected with ruts, and small gullys or Wadi’s, they are fearfully rough. \n\nA storm has been brewing all the evening, and we had hardly arrived and discharged our patients when it burst upon us. There were about 100 men in this station wounded and sick, and not a tent of any kind to shelter them in, no operating gear, nothing at all, a terrible mess-up. Shelters of a kind were hastily constructed for the night. We camped here for the night, and next morning early returned to Camp. We chose the road through the village coming home. There was no object of interest here, there never is in the purely Arab villages unless one is interested in seeing to what depth of dirt disease, and depravity the human race is capable of sinking.\n\nWe passed a few captured Turkish rolling stock on a light Railway here, immense stacks of wood. We had a few hours rest after reaching Camp at\n\nAshdod again, and the same night","48":" started for the beach, when it was rumoured we were to have a few days spell, for purposes of re-organisation. A couple of hours brought us there, and after feeding up almost the first thing I did was to have a plunge in the briny. It is impossible for one who has never been through the experience to imagine the feeling of deep and utter satisfaction that takes hold of one, when you have been travelling three or four days without even a wash, to be put down in a place where there is plenty of water. You feel you could live in it, roll in it, revel in it in an excess of happiness And the cleaning that is done Clothes are washed, baths are the order of the day, week, and fortnight old beards are shaved, and everyone is clean and happy once more. I never knew before that water could be so precious. I shall always look on it with different feelings after these experiences.\n\nThe rumour of a few days spent here, though, proved like most other Army rumours, or \"furfies\" as they are called to be \"a lying jade\" and the next day we were on the move again. This time we did not stop at Eshdud, but went passed it and around it,\n\nand camped near a village whose name I do not know. We passed a beautiful little village just on our right. There are several of these about here, occupied for the most part by Russian Jews. They are very clean. White houses with red tiles and clean streets. It is a wonderful relief to get into one of them again after passing through these interminable Arab villages. \n\nOn the morning of the","49":" we started on our way again passed through the village of Yebna, where there are some beautiful oranges, which were to be had at a very reasonable figure. Some of course, got them at an extremely reasonable price, the trouble of getting them themselves. After passing through Yebna, we came out into a sloping wide valley beautiful and green with a coarse kind of grass very like our ribbon grass without the stripe. It was of the few bits of green that we have seen on all this wearying trip. Directly afterwards we camped in sight of the village of Deiran. Wide spreading orange orchards, with wattle hedges round them. Snow white houses, with red tiled roofs, a few public buildings up on the highest portion of the town\n\nfairly wide and clean streets various kinds of green trees growing about, to come suddenly onto this was like coming in sight of the Garden of Eden. The people here were very glad to see us. Many of them spoke English. There are French, Russians, Poles, Spaniards, Greeks here mostly Jews and the Turks, they say, gave them a pretty rough time, as they passed through. I rather marvelled that they came off as well as they did. \n\nWe were able to purchase bread here, and after living on biscuit and bully beef, it was a most welcome change. The bread is brown and rather heavy, being a mixture I am told of whole wheat and lentils. We were paying 1\/- per loaf for it. Late at night they started to charge 2\/- for it. The spirit of Isaac, Abraham and Jacob was too strong for them, and overcame their love for the \"Inglaise\". The \nopportunity\n temptation to\" look at the profits\" was too great. The leading spirits of the village to their credit, stopped this, and it was only right too. The price the Deiran people paid for their bread before we came, a young girl who spoke English informed us, was three ha’pence a pound\n\nthreepence a two pound loaf, and they were charging us a shilling. The townspeople could not buy bread. The bakers would not sell it to them. Some of them must have been glad when we moved on. It was good to see people moving about dressed decently, and clean in themselves, especially the women folk. I fancy it must have a deteriorating effect upon one to dwell long in a place where the womenkind are inferior, and looked upon merely as chattels or household goods for which a man pays so much, as it is here in this country. \n\nOn the","50":" with many feeling of regret at leaving this little place where we had had this pleasing glimpse of civilization we moved away through the township and on to the next village, Ramleh. We did not stay here, but passed straight through, and on to Ludd. Ramleh would have been interesting to stay awhile in, I should think, dirty as it is. On the highest point in the village is situated a splendid building \"The Hospitalis Nicodemus Arimathea\" . One man in Ludd, who spoke English very fluently, said that Ramleh was the birthplace of Joseph of Arimathea, the man who\n\nhad the supreme honour of placing the crucified body of Our Lord in his own new tomb, and that his (Josephs Tomb) was under the Monastry at the present day. I though perhaps he was confusing Joseph of Arimathea with Nicodemus but in the limited time I had, could not assure myself on the point. Just outside the village is the stately ruin of a great \nChurch\n Cathedral built by Richard Cour de Leon. The massive tower, square at the base, octagonal midway, and round at the summit stands today, as firm as ever, and from its top a splendid view should be \n\ncloisters underneath. These have been very spacious, and their preservation is no doubt due to their extra strength. The walls are immense. There are two portions only left. A man hole in the ground, and you go down by timeworn steps in what had been the great basement of the Church. Here are rows of immense arches. In the second one I counted a double row of these arches, each about 12 ft long and, I suppose 20 to 25 high. There were 13 arches in length 26 in the double row. \n\nAs I came up into the sunshine again, the first thing I saw was an old Mohammaden, in the centre of this ruined Christian temple, with his garment thrown on the ground as he knelt and offered his midday prayer, to Allah, and Mahomet. His prophet\n\nI had the privilege of afterwards going down to Ramleh, and having a few moments to spare, had a choice of the ruins or the monastry to go over I chose the ruins. The great square Norman tower is in splendid presentation and looks capable of seeing many a century out yet. The place covered originally an immense area. All the walls are falling to pieces now, less, I imagine, as the result of time, as pure vandalism on the part of the inhabitants. The Arab or Egyptian has no respect for antiquities. This has ample proof all through both Egypt and Palestine. In this instance, the walls have been destroyed, and the stones used in building the hundreds of Arab tombs in the graveyard which almost completely surrounds the old ruin. An interesting feature was the\n\nobtained if I could only find the time to get there. The great cloisters below the Church are still intact, and well they might be, for the walls are seven or eight feet thick, solid masonry. They knew how to build in those days. Visited afterwards. Stones pulled down to build arab cemetery No respect for antiquities Mohommidans pray in the square Double row of arches 12 feet each use as stables crumbling walls etc.\n\nAt Ludd (the Lydia of the Bible) is the Church of St George, an imposing building. \n\nGreek priests minister here most beautiful looking men these are too, tall and stately with clear olive skins, and magnificent black beards falling over their robes. Their eyes are bright with the clearness and lustre that only good living and perfect health\n\ncan give. They have the look of the spiritual enthusiast too, lurking in the depth of their quiet, clear eyes. They came to see us when we pulled in to camp for the night, and through their interpreter told us how pleased they were to see us, and as the priests of the place, in the name of the Greek Church welcomed us and invited us to a St George Commemoration day in the Church the following morning. We arrived in the village the day before St George’s day and so next day they celebrated it, with much thanksgiving, for the first time in their years St Georges tomb is here in the Church, which was built in the","51":" Century by Baldwin and Edward the Fourth of England.\n\nSome of the boys went to the Service next day, I was unfortunate. It fell to my lot to have to cart some wounded Turks back to Ramleh, and when we returned the Brigade had moved so we had to go straight on. They tell us the interior of the Church is very beautiful \nand the\n as is also the marble tomb of St George in the crypt below. From here we moved on, on the","52":" to within five or six miles of Jaffa. The country around here is changing as \n\ngo along and becoming very fertile and beautiful. Fruit growing in abundance, peach, fig, oranges, lemons, etc. and each place has an almost complete irrigation system of it own. Water is procured at various depths almost anywhere. The wells are generally sunk on the top of a hill which means of course an extra depth, but also assures easy irrigation of the slopes surrounding it on which are the orchards. \n\nThe water is drawn in most cases in wooden buckets on an endless chain. On the horizontal beam on which the buckets run is placed a huge double wooden wheel connected with rungs (like a circular ladder) at intervals of about 15 inches. The end of the windlass beam is secured to a substantial cross beam, supported on rough masonry at either end. Underneath it another large beam (all of them are a foot or 15 inches in diameter) is half buried in the ground and secured by the masonry. Into these two cross beams, top and bottom, circular holes are cut, into which an upright is fixed as an axle, on which is fastened a wheel similar in size to the double one on the windlass beam, but single, and fitted with spokes instead of rungs. A long wooden lever is also secured to the upright, to which a camel is attached\n\nThe animal walks round in a circle, the spokes of the single wheel catch in the rungs of the double wheel and the buckets are set in motion, and the water is set flowing down concrete troughs round the orchard. From these troughs it is distributed when and where required. Most of the well structures have a stone reservoir built into them capable of holding perhaps four or five thousands gallons of water. The soil is very rich, chocolate, red and black with proper encouragement for the grower, and men who know their business on the land, this country would grow absolutely anything.\n\nA move of a couple of miles nearer Jaffa was made from here, and in that camp we remained until","53":" when we returned to Ashdod which we reached on the","54":" On the","55":" we retraced our steps to our present camp alongside the village of Rishon miles from Jaffa. This journey to Eshdod from Jaffa and back again here was made through the most beautiful country. For several miles we must have passed avenues of wattles surrounding orange orchards. Here and there were plantations of real Australian gum trees. For a couple of days in our\n\nfirst Jaffa camp it had been raining. Each day the sky had been grey and dreary with heavy rain clouds, and it looked as though the wet season was coming upon us right away. On the third day however, the sun rose in a cloudless sky upon a world washed sweet and clean from the dust that had been clinging to it for many dry months. So our trip back to Ashdod was made under the most ideal conditions and surroundings. Free for the time from the irritating dust, we made our way \nunder ideal weather conditions\n in the glorious sunshine under a sky unflecked by a single cloud. \n\nOn either side were the wattle hedges all aglow with the golden bloom, behind then the dark green of the orange orchards mingling with the foliage of \npalm\n date palm, banana trees and English poplar and nestling among the luxury of growth a big white house with red tiles. It was a picture of nature at her best, bestowing her treasures with a reckless prodigality, a sight one would not easily forget, a scene and a day to make one very much in love with life. It did not require much imagination to fancy oneself back on Australia again, and when we passed a plantation of real Australian gum trees the\n\nthe illusion was complete. The sighing of the gentle breeze in their branches was like the voices of long lost friends, and the sight and the odour of them, the key to unlock the secret chambers of the memory, and to bring into being, to revive into warm pulsating life, and bring from the tomb of the past, where they had long since lain forgotten, a host of scenes \nand\n some pulsating with the joy of life, and again throbbing with a great sorrow, scenes pathetic, and ridiculous and associations that one thought had passed out of his life for ever. How strange and wonderful is memory. We leave the past behind us and we imagine we can forget, and lo, a snatch of an old song, a voice, a face, a perfume, and voices that have long been silent, faces that long have mouldered into clay, friendships whose golden links have sundered for many, many years, start out of the shadows of the Past, and live with us again. Such is the power of the law of association.\n","56":"\n\nI have neglected my diary for quite a number of days now, and yet it is hardly neglect; for there\n\nis nothing to write about. About ten days ago we moved from our Camp outside Rishon, into the Township itself, and here we have remained ever since. Last night the third lot of rain we have had this \nyear\n season commenced. Throughout the night the rain was only slight, but this morning it came down in torrents. Thunder and sheet lightning accompanied the downpour, and there was also a sharp fall of hail. It has ceased for the present; but the skies are very \"cold and drear\", Great grey, rain laden masses of cloud are suddenly across the sky driven by a very cold south-easterly wind. Soldiering is not exactly the acme of comfort under even ideal conditions, and with the present state of affairs, they are inclined to verge on the strictly uncomfortable. Fortunately \"Bivvy\" (bivouac) sheets have just been issued. These are purely and simply a copy of the Turkish bivyy sheet, though not as good material. The Turkish sheet is canvas, ours is a khaki calico affair. On all the four sides there is a row of buttons and button-holes. This provides a double row of fastenings when two sheets are fastened together. The sticks supplied are useless. Seeing the Australians copied the Turks sheet so\n\nclosely in other particulars, they would have been wise had they copied these sticks also. These are in sections with band of steel each end. They fit into one another and by means of them a bivvy can be made any height one chooses. Our issue bivvy sticks were barely two foot six in height, in one piece. One would have to be a lizard to get into the bivvy when it was completed. One would have to be a lizard to get into the bivvy when it was completesd. The sticks were the only original things about the issue, and they were failures. However, the material, so long as one does not touch it on the inside when it is wet, keeps the rain out all right. \n\nThis village of Rishon is one of the Baron Rothschild schemes. There are many of them in Palestine. I am rather sorry I have come into contact with the Jews here. I used to have a excellent opinion of the Jew, but it has been scattered to the four winds of heaven as a result of my stay here, that is, at any rate the Palestine Jew. They are modern Shylocks with a vengeance. They tell us how the Turks ill treated them, how glad they are to see us, and how they thank God for the British Army; and then they turn round and rob one hand over fist; They seem to be honest, in this respect, I do\n\nnot think they would steal anything lying about, but you can never get a quarter of your money’s worth out of them. Their children come round selling their heavy brown bread at 1\/- a loaf, so called ‘cakes’ made of uneatable pastry with figs inside, six minute pieces for 1\/-. They come round begging for sugar, for cocoa, cheese, white bread, etc, and will take all you give them with never a word of thanks, and then want to sell you some rubbish for six or eight times its value, a sixpenny towel they will ask you 5\/- for, a gilt watch guard 10\/- a beer bottle of honey 8\/-. Everyone is sick to death of them. Of course, it is only right to say that in the townships there a better class who do not pester us like this. I think the majority of them believe we have plenty of money, and they spend their days and nights scheming and planning how to get hold of it, and it easy to imagine them gloating over it when they do get some of it. The Egyptians, the Bedouins, and the Arab are much preferable to them in the boys opinion to have any dealings with.\n\nIt is some days now since Jerusalem fell, and there was a rumour afloat that we were to go there. In fact we\n\nreceived orders to stand by for the road, and then to our intense disappointment: I wonder when we will get there With what an intense interest I have looked forward, and still look forward to the day when I shall see Jerusalem.\n","57":" It is raining again. The world is wrapped in a cold, bleak, mantle of grey. The last few days have had occasional glimpses of sunshine, but to day is different. It is not raining heavily, but steadily and persistently. It looks as though it had really set in The wind is very cold indeed. It is one of those days that make one think longingly of home, and a cosy room, a big fire crackling merrily on the hearth, an easy chair, a pipe, and a good book. How often has the remark been passed in my hearing lately \"By Jove I never appreciated all the little comforts of home until I came away from them, but just wait till I get back\" Especially now, as Xmas comes upon us once more, do thoughts of home and loved ones come crowding in upon us all, perhaps a little feeling of home-sickness (very, very rarely admitted) accompanying our reveries. I wonder will our comforts arrive this year. We are all wondering, and hoping they will too. But we have moved so far ahead, and without the Railway transport is such a tremendous thing, that there is still a doubt as to whether they can be brought\n\nup in time for Xmas. It is wonderful how eagerly these gifts from the Australian people are looked forward to by us all. The gifts are quite simple, yet useful, but they represent Home to us, they represent to us all the loving feminine hearts and hands that have planned and toiled unceasingly for our good throughout all these dreary months of war. Behind each simple gift there is Self Denial, and Sacrifice, and a world of patient, loving toil and thought, that makes each article of infinite value. And we do not forget. We have not the Gift of Tongues, and we can not express our thanks in eloquent phrases, but from our innermost hearts we pay tribute to the noble, unselfish love of the women of Australia.\n\n8.30 P.M. Am just about to turn in. Outside my bivvy a big fire is going. Round it a crowd of the boys are singing \"Why do the girls love a Sailor\" \"My ain Folk\" \"Rally round the banner of your Country\" All sorts and conditions of songs are sung, rag time, sentimental, comic, sacred, all in our glorious medley. \"Mother Macree\" \"Swanee River\" \"Way down Dixie etc Many a lad on days to come will sit with some old crony, and the recollection of the Sing-songs round the Camp-fires in Palestine will always be a fragrant memory.\n","58":" It is the day of Xmas Eve. Squally weather came \n\nup in the night, a cold swirling wind with an edge like a knife, round the bivvy’s and bringing with it gusts of rain that pattered almost incessantly with varying force on the taut bivvy sheets. Sometime in the middle of the night the end of my bivvy was blown loose, and I woke to find the lower part of my blankets and my feet wet with the driving rain and cold – I was as cold as a bally frog. No change came with the dawn. \n\nAs I write these lines, sitting on my bed with my overcoat well wrapped me, and my feet like two blocks of the Arctic Pole itself, the wind is humming round my shelter, and the bivvy sheets thrashing and flapping in a manner which makes me feel thankful they are new and strong. All the while the rain is coming down, not so incessantly now, but in short, sharp angry gusts, as though it were being thrown at us in spiteful handfuls. What a rotten thing a cold Xmas seems. Of course, I know these are the absolute reverse of ideal conditions under which we live, but still chucking plenty of comfort in, and snow instead of sleety rain, I know that I should infinitely prefer the warm glow and beauty of an Australian Xmas day than any other style. I have been trying to impress upon myself that Xmas day is so near, but I must confess I am lamentably lacking in any\n","59":" feeling. Of course there is no doubt it is Xmas, the calendar says so, but it is incredible nevertheless. But one thing I find it easy to do, and that is, to imagine you all at home, and just how you will spend it. The toys for the kiddies have been purchased or you are doing it to night, and to night they’ll hang up their stockings and steal to bed just as blissfully as ever. But on the older folks faces are shadows. How can it be otherwise. The hand of War is heavy on us, and many who were with you last Xmas are away from you this one, and in peril and great danger, and many more stalwart sons, are sleeping beautifully under the sod of some scarred field in France, or in the great and lonely solitudes of the Egyptian desert, and others are to day being buried beneath the soil of the land which bore Him who gave Xmas to us. Yes, there will be a great deal of sadness, but you will still have Xmas, saddened a little but still the same old season, with its exchanges of good-will and presents, all the Church bells ringing in the quiet air, and the people going to some place of worship or picnicking, or seeking other forms of pleasure, just as their tastes lead them.\n\nFrom where I sit writing I can see one of the \"Gippo’s a member of the Egyptian Labour Corps with his head sticking out of his bivvy on the other side of the paddock, busily engaged picking \"chats\" or \"scotch \n\ngreys\" out of his singlet. He has picked 20 odd, but has not killed any. He just deposits them very carefully outside the door of his shelter. Bye and bye they will crawl back again.\n","60":" 11.45 Xmas day 1917 is almost a thing of the past. It has been a most miserable day. Raining nearly all the time, with thunder and lightning, and a cold biting wind. For dinner, roast meat, boiled potatoes, pudding and jelly. That is better than we expected, but the rain and cold takes the enjoyment out of everything. The Rothschild distillery people provided free wine for all the Soldiers this morning. That \"Jollied \" them up a bit. With what they procured elsewhere, that has kept some more than happy all day. I am on picket to night, one hour and a quarter. To morrow we leave here for the vicinity of Eshdud again. This move of course, is owing to the difficulty of transport to where we are.\n\nI am sitting shivering in my wet overcoat to write these few lines on the edge of my bed before the morning dawns. Wet feet, wet overcoat and to top it all, wet blankets. A Happy Xmas, Oh, Yes, certainly, and a shift in the rain to morrow. I forgot to mention that my cobber (young Billy Beasant) and I to day went into the Synagogue to have a look round. It is the first time I have been inside a Jewish Synagogue. The mens seats below, are of some light wood, varnished. The womens seats upstairs are of painted deal The roof is blue and set with golden stars.\n\nIn the centre of the building below, is the pulpit, or what we should call the pulpit, where the Rabbi reads and expounds the law. At the back of the building, set into the wall is a recess, surmounted by a crown and lion rampant. From what I could make out, it is the place where the \"Book of the Law\" is kept, and in front is the light which is never allowed to go out. Apart from this altar work at the back, the interior is very plain.\n","61":" At an early hour this morning we were aroused, and ordered to get ready for the move. It is a job to bring wicked thoughts to the head of an Archangel, this morning in the wet. It was not actually wet, but everything around was. We got a move out at about 10 AM. The roads were fearful. All day we splashed and squelched through black mud a foot or more in depth churned by the endless traffic to the consistency of thick cream. One trooper who had looked too often on the wine when it \"moved itself aright\" before leaving, came a beautiful cropper in one of the worst patches of mud we struck. To make matters worse his nag politely trod on him, and on his face at that, as he reclined in the slime. He was a pretty picture indeed when he was assisted to his feet. No features were discernible\n\nat all, only a mud \nbeplastered\n mask from which a slimy mop protruded from which the ooze dripped like pea soup from the whiskers of a domain \"dosser\" in a fourpenny restaurant, and a stream of blood trickling from his nose. This member, by the way, was broken and no wonder, one of the worst things out for a nose is to allow a horse to tread on it. His clothes were in the prettiest condition imaginable. I don’t know how he felt after the mud dried, but I do know that when someone condoned with him, and said he was \"stiff\" (unfortunate) , he flared up and said he didn’t want anyone \"slinging off\" at him. Evidently he felt the \"stiffness\" keenly. \n\nThe poor horses were completely done up when at last, with the greater part of the journey accomplished, we halted for the night. Next morning we resumed the march. The worst of the trip was over, although there was a good deal of heavy pulling to do before we reached our Camp high and dry on the Sand.. In the hot, dry windy days that are gone for a time at least, the Sand has been responsible for a flow of rhetoric, a facility of expression, a wealth of lurid invective, seldom, if equalled in the history of war, and certainly never excelled. Whether the new words that have been coined during this period will appear in our Dictionaries to enrich the English language, I do not know, but all\n\nopinions of the sand have been altered now. We look on it these times as our best friend.\n\nOne sees some interesting and instructive sights in the Sand, bare and devoid of life as it appears to be. In reality it is teeming with life. One cannot step out into the Sand, especially is this so in the dewy freshness of the morning without being made aware of this fact. Myriads of tracks are everywhere lizard and little silver haired rats called, I think \"jerbills\" and bird, marking the desert with a pattern of the most delicate tracery. In the darkness and coolness of the night myriad forms of life have been busy, and the desert, spread out, like a vast and ancient papyrus, bears a record of this activity. \n\nThat yellow tint that one always finds associated with the Sand on Postcards in Egypt, is very noticeable here. It is beautiful in the evenings. Over the yellow sand are the tops of the green trees, and away out beyond, miles away, the great barren hills that lie between us and Jerusalem. When the sun is setting these at their highest points are bathed in the golden light and the hollows are filled with purple shadow all gold crested would make an artists name and fame if he could put it on canvas \njust as it is\n.\n\nLast night the full moon rose like a \"painted moon in a painted sky\". From between the strata of slate coloured clouds, the tip of the orb, like a circle of fiery flame. On\n\na bright moonlight night I have seen the sand further back in Egypt where it is whiter than here glowing like a lake of purest silver, the shadows lakes of blue water. There is a beauty in the loneliness, the vastness, and desolation of the desert, which is peculiarly her own. Byron sang\n\n\"There is a pleasure in the pathless woods\" etc and there is too, some strange, subtle influence that kindles the heart in the ever shifting burning sands of the desert. There is a pleasure even in her tracklessness, there is an eerie rapture in the silence and mystery that brood over her and enwrap her eternally and a society, intangible and unexplainable, and yet existent in her unbroken solitudes\n","62":"\n\nThe dawn of the new year sees the camp seething with wild rumours, as to our the War, and ourselves Some of the ‘furfies’ are wildly extravagant. At first we were staying here a month, then it was two months, then we were moving in two days and going back to Belah. By night fall this had grown until we were going back to Tel-el-Kebir, where we were being demobilised, and all sent home to Australia. Later on, France was our destination. Now we are to move on Friday the 4th and are going into the trenches then dismounted. I wonder which will be correct. The latter, I think. \n\nWell all the festive seasons have past, but the Australian Comforts did not arrive. A few did, but their\n\ndistribution has been somewhat erratic. One of the Regts the 3rd got 70 cases of Comforts for five hundred men, the Ambulance got 3 cases for 130 men. Doubtless the somnambulistic nature of our Q.M.’s were responsible for this. It is still very cold, with occasional rain, but much more pleasant here on the sand than in the mud. The latest \"furfies\" is that in 2 months we will all be on our way home, the War being over. All these wild reports, are invariably founded on the very best and most unimpeachable authority. \"The message just came over the wireless from G.H.Q.\" or \"I was talking to an Officer from D.H.Q. and he told me in confidence etc\". One could fill a volume with \"furfies\" of all descriptions without any difficulty It might prove rather amusing too.\n\n"}}