{"Document Name":{"0":"Diary_0340","1":"Diary_0340","2":"Diary_0340","3":"Diary_0340","4":"Diary_0340","5":"Diary_0340","6":"Diary_0340","7":"Diary_0340","8":"Diary_0340","9":"Diary_0340","10":"Diary_0340","11":"Diary_0340","12":"Diary_0340","13":"Diary_0340","14":"Diary_0340","15":"Diary_0340","16":"Diary_0340","17":"Diary_0340","18":"Diary_0340","19":"Diary_0340","20":"Diary_0340","21":"Diary_0340","22":"Diary_0340","23":"Diary_0340","24":"Diary_0340","25":"Diary_0340","26":"Diary_0340","27":"Diary_0340","28":"Diary_0340","29":"Diary_0340","30":"Diary_0340","31":"Diary_0340","32":"Diary_0340","33":"Diary_0340","34":"Diary_0340","35":"Diary_0340","36":"Diary_0340","37":"Diary_0340","38":"Diary_0340","39":"Diary_0340","40":"Diary_0340","41":"Diary_0340","42":"Diary_0340","43":"Diary_0340","44":"Diary_0340","45":"Diary_0340","46":"Diary_0340","47":"Diary_0340","48":"Diary_0340","49":"Diary_0340","50":"Diary_0340","51":"Diary_0340","52":"Diary_0340","53":"Diary_0340","54":"Diary_0340","55":"Diary_0340","56":"Diary_0340","57":"Diary_0340","58":"Diary_0340","59":"Diary_0340","60":"Diary_0340","61":"Diary_0340","62":"Diary_0340","63":"Diary_0340","64":"Diary_0340","65":"Diary_0340","66":"Diary_0340","67":"Diary_0340","68":"Diary_0340","69":"Diary_0340","70":"Diary_0340","71":"Diary_0340","72":"Diary_0340","73":"Diary_0340","74":"Diary_0340","75":"Diary_0340","76":"Diary_0340","77":"Diary_0340","78":"Diary_0340","79":"Diary_0340","80":"Diary_0340","81":"Diary_0340","82":"Diary_0340","83":"Diary_0340","84":"Diary_0340","85":"Diary_0340","86":"Diary_0340","87":"Diary_0340","88":"Diary_0340","89":"Diary_0340","90":"Diary_0340","91":"Diary_0340","92":"Diary_0340","93":"Diary_0340","94":"Diary_0340","95":"Diary_0340","96":"Diary_0340","97":"Diary_0340","98":"Diary_0340","99":"Diary_0340","100":"Diary_0340","101":"Diary_0340","102":"Diary_0340","103":"Diary_0340","104":"Diary_0340","105":"Diary_0340","106":"Diary_0340","107":"Diary_0340","108":"Diary_0340","109":"Diary_0340","110":"Diary_0340","111":"Diary_0340","112":"Diary_0340","113":"Diary_0340","114":"Diary_0340","115":"Diary_0340","116":"Diary_0340","117":"Diary_0340","118":"Diary_0340","119":"Diary_0340","120":"Diary_0340","121":"Diary_0340","122":"Diary_0340","123":"Diary_0340","124":"Diary_0340","125":"Diary_0340","126":"Diary_0340","127":"Diary_0340","128":"Diary_0340","129":"Diary_0340","130":"Diary_0340","131":"Diary_0340","132":"Diary_0340","133":"Diary_0340","134":"Diary_0340","135":"Diary_0340","136":"Diary_0340","137":"Diary_0340","138":"Diary_0340","139":"Diary_0340","140":"Diary_0340","141":"Diary_0340","142":"Diary_0340","143":"Diary_0340","144":"Diary_0340","145":"Diary_0340","146":"Diary_0340","147":"Diary_0340","148":"Diary_0340","149":"Diary_0340","150":"Diary_0340","151":"Diary_0340","152":"Diary_0340","153":"Diary_0340","154":"Diary_0340","155":"Diary_0340","156":"Diary_0340","157":"Diary_0340","158":"Diary_0340","159":"Diary_0340","160":"Diary_0340","161":"Diary_0340","162":"Diary_0340","163":"Diary_0340","164":"Diary_0340","165":"Diary_0340","166":"Diary_0340","167":"Diary_0340","168":"Diary_0340","169":"Diary_0340","170":"Diary_0340","171":"Diary_0340","172":"Diary_0340","173":"Diary_0340","174":"Diary_0340","175":"Diary_0340","176":"Diary_0340","177":"Diary_0340","178":"Diary_0340","179":"Diary_0340","180":"Diary_0340","181":"Diary_0340","182":"Diary_0340","183":"Diary_0340","184":"Diary_0340","185":"Diary_0340","186":"Diary_0340","187":"Diary_0340","188":"Diary_0340","189":"Diary_0340","190":"Diary_0340","191":"Diary_0340","192":"Diary_0340","193":"Diary_0340","194":"Diary_0340","195":"Diary_0340","196":"Diary_0340","197":"Diary_0340","198":"Diary_0340","199":"Diary_0340","200":"Diary_0340","201":"Diary_0340","202":"Diary_0340","203":"Diary_0340","204":"Diary_0340","205":"Diary_0340","206":"Diary_0340","207":"Diary_0340","208":"Diary_0340","209":"Diary_0340","210":"Diary_0340","211":"Diary_0340","212":"Diary_0340","213":"Diary_0340","214":"Diary_0340","215":"Diary_0340","216":"Diary_0340","217":"Diary_0340","218":"Diary_0340","219":"Diary_0340","220":"Diary_0340","221":"Diary_0340","222":"Diary_0340","223":"Diary_0340","224":"Diary_0340","225":"Diary_0340","226":"Diary_0340"},"Date":{"0":"unknown","1":1388.0,"2":1389.0,"3":1390.0,"4":1391.0,"5":1392.0,"6":1393.0,"7":1395.0,"8":1396.0,"9":1397.0,"10":1398.0,"11":1399.0,"12":1400.0,"13":1401.0,"14":1402.0,"15":1403.0,"16":1404.0,"17":1405.0,"18":1406.0,"19":1407.0,"20":1408.0,"21":1409.0,"22":1410.0,"23":1411.0,"24":1412.0,"25":1413.0,"26":1414.0,"27":1415.0,"28":1416.0,"29":1417.0,"30":1418.0,"31":1419.0,"32":1420.0,"33":1421.0,"34":1422.0,"35":1423.0,"36":1424.0,"37":1425.0,"38":1426.0,"39":1427.0,"40":1428.0,"41":1429.0,"42":1430.0,"43":1431.0,"44":1432.0,"45":1433.0,"46":1434.0,"47":1435.0,"48":1436.0,"49":1437.0,"50":1438.0,"51":1439.0,"52":1440.0,"53":1441.0,"54":1442.0,"55":1443.0,"56":1444.0,"57":1445.0,"58":1446.0,"59":1447.0,"60":1448.0,"61":1449.0,"62":1450.0,"63":1451.0,"64":1452.0,"65":1453.0,"66":1454.0,"67":1455.0,"68":1457.0,"69":1458.0,"70":1459.0,"71":1460.0,"72":1461.0,"73":1462.0,"74":1463.0,"75":1464.0,"76":1465.0,"77":1466.0,"78":1467.0,"79":1468.0,"80":1469.0,"81":1470.0,"82":1471.0,"83":1472.0,"84":1473.0,"85":1474.0,"86":1475.0,"87":1476.0,"88":1477.0,"89":1478.0,"90":1479.0,"91":1480.0,"92":1481.0,"93":1482.0,"94":1483.0,"95":1484.0,"96":1485.0,"97":1486.0,"98":1487.0,"99":1488.0,"100":1489.0,"101":1492.0,"102":1493.0,"103":1509.0,"104":1510.0,"105":1512.0,"106":1513.0,"107":1514.0,"108":1515.0,"109":1516.0,"110":1517.0,"111":1518.0,"112":1521.0,"113":1522.0,"114":1523.0,"115":1524.0,"116":1529.0,"117":1530.0,"118":1531.0,"119":1533.0,"120":1534.0,"121":1535.0,"122":1538.0,"123":1539.0,"124":1540.0,"125":1541.0,"126":1556.0,"127":1557.0,"128":1558.0,"129":1559.0,"130":1561.0,"131":1562.0,"132":1571.0,"133":1572.0,"134":1573.0,"135":1574.0,"136":1579.0,"137":1580.0,"138":1581.0,"139":1582.0,"140":1583.0,"141":1584.0,"142":1586.0,"143":1587.0,"144":1588.0,"145":1589.0,"146":1590.0,"147":1591.0,"148":1592.0,"149":1593.0,"150":1594.0,"151":1595.0,"152":1596.0,"153":1597.0,"154":1598.0,"155":1599.0,"156":1600.0,"157":1601.0,"158":1602.0,"159":1603.0,"160":1616.0,"161":1617.0,"162":1618.0,"163":1619.0,"164":1620.0,"165":1621.0,"166":1622.0,"167":1623.0,"168":1625.0,"169":1626.0,"170":1627.0,"171":1628.0,"172":1629.0,"173":1630.0,"174":1631.0,"175":1632.0,"176":1633.0,"177":1634.0,"178":1635.0,"179":1636.0,"180":1637.0,"181":1638.0,"182":1642.0,"183":1643.0,"184":1644.0,"185":1645.0,"186":1646.0,"187":1647.0,"188":1648.0,"189":1649.0,"190":1650.0,"191":1651.0,"192":1652.0,"193":1653.0,"194":1654.0,"195":1656.0,"196":1657.0,"197":1658.0,"198":1659.0,"199":1660.0,"200":1661.0,"201":1662.0,"202":1663.0,"203":1664.0,"204":1665.0,"205":1666.0,"206":1667.0,"207":1668.0,"208":1669.0,"209":1670.0,"210":1671.0,"211":1672.0,"212":1673.0,"213":1674.0,"214":1675.0,"215":1676.0,"216":1677.0,"217":1678.0,"218":1679.0,"219":1680.0,"220":1681.0,"221":1688.0,"222":1704.0,"223":1707.0,"224":1710.0,"225":1711.0,"226":1712.0},"Entry":{"0":"T","1":"\nLeft Lark Hill 10.30. Amesbury 1.25 Arrived Southhampton 3. Left Southhampton 7.30pm. ","2":"\nWeather better. Arrived Le Harve 4.30am. Left 6.30. Arrived Camp (Harflour)? 10 were issued with steel helmets & respirators, then had vapour baths and then wrote short letters to home & Kay, Gave same to Sergeant Graham to post in Blighty for me, They say we might go up the line on Friday. ","3":"\nWent to the Bull Ring and were drilled in use of gas helmets. Returned 4.30. In the evening looked around and went to service at YM. ","4":"\nIn morning at 7 went to Holy Communion. After breakfast were issued with ammunition. Draft was read out. Have been put into 2nd Division. Left camp 5.45. Arrived Havre 9pm. ","5":"\nLeft Le Harve by train 2am. Arrived Rouen 5.30am. Left Rouen 5pm. ","6":"\nStill travelling passed through Bethune where we stopped for about ½ hour. It is a beautiful day everything seems so peaceful. Arrived Caistre 3pm. Marched out to Anzac Camp & stayed the night. Had a look around the village. Air raid which lasted for about 4 hours took place in the vicinity. ","7":"\nArose at 7am. Although we are 18 miles from the line we can clearly hear the guns and have been able to do so for the past 36 hours. Entrained 10 arrived Poperinghe 12. This village is in ruins and had been badly bombed last night. Arrived at D.A.C. Hqrs 3. Went into ‘Dugouts’. Stewart came over from Ouderdam and we had a great yarn. At 9pm The Huns commenced air raids again and kept up till well after midnight. ","8":" 1917-","9":" Reveille 6am. Fatigues during day. Went to bed 9. At 10pm were wakened up and sent up the line with the teams. Left here (wagon lines) 11pm. And went to ammunition dump & loaded then ‘went up’. Baptism of fire which was very solid. Wagons stuck in shell holes etc. unloaded at Battery finishing about 5.30am Officer & driver wounded. Big shells were falling near throwing up clumps of earth and smoke. The trip back was run under heavy fire. Shells bursting along the roads which Fritz had well recorded. Fervent prayers for protection to God were answered. We got safely back to camp at 7.45 am. The journey took us through Ypes which is in an inconceivable state of ruins. Had breakfast & then slept until noon. Cleaned limbers & wagons in afternoon Retired 8pm. ","10":"\nWeather dull & drizzling with rain. During day cleaned wagon. Am on guard mounting at 6.30. This morning the British & Aussies(?) attacked. So far we have heard that the first objectives have been gained. About 200 German prisoners went past this afternoon, guarded by Australian Light Horse, one of whom told me that things were going on alright & that there was a large number of prisoners up in the bird cage. ","11":"\nOn guard prisoners still coming through to the number of about 900. Quite a number of them are mere boys. Artillery seemed to be heavily engaged at various times during the day. Came of guard at 6.30. Weather cold & wet. ","12":"\nLast night & this morning were very cold. Fritz has been sending big shells into Poperinghe during the night. Weather was changeable throughout the day. ","13":"\nLast night strong air raids took place and a dump was set on fire near Poperinghe & the explosion continued for some hours. The shelling again took place. The sun is shining nicely at present (8.30pm) but the air is cod. No church parade on account of weather. Wrote to Kay. ","14":"\nWet all day, mud simply awful. Helped to paint limbers & wagons. ","15":"\nNothing much doing. Wet weather plenty of mud. Last night Fritz again raided & bombarded. ","16":"\nPainting wagons again during the day which was cold wet & muddy but cleared up some towards night. During this night the guns were heavily engaged. Last night Fritz again raided and also sent has big shells into Poperinghe very frequently. This morning 120 more German prisoners sent through.","17":"\nToday the weather has been very pleasant although on the cold side. The guns seemed to be busy last night. Today 2 of our drivers were killed & 1 wounded which makes 9 casualties since our arrival. Several new………. came today. ","18":"\nStill wet & muddy. Went on guard at 6. Very wet & cold night. Prisoners went by today. ","19":"\nWeather changeable. Some more prisoners went through. Wrote to K & also home. Had a letter from Aunt Ben. ","20":"\nUsual routine during the day which was fine and pleasant. At night more air raids took place. Wrote to Aunt Ben. Received a letter from Mrs N Boyden. Another air raid at night. ","21":"\nPainting G S Waggons during day which was fine and pleasant. Night more air raids took place and bombs were dropped very close to us. During the day Fritz came over several times and the guns were in action about 4 tomes but without success. The German machine seemed to be very high The Gotha looks very big & strong. They are painted a much lighter colour than ours & look almost transparent. ","22":"\nPainting GS Waggons during the day which was rather cold but no rain. Were issued with blanket. This morning there was a frost. Another air raid & bombs dropped about 500 yds away from here. ","23":"\nMorning bright & fine about 11 o’clock we witnessed an air fight and a German machine was brought down with a wing shot off and a fire. The pilot jumped out before reaching the earth and we could easily see the body hurtling down to earth. Our machine immediately hovered over the spot and descended. The airman was dead of course & burnt, & the machine & the pilot’s body was found 150 yards from the machine. About 20 minutes after another was brought down which however we did not see. Another batch of RFTs came in. ","24":"\nWeather still fine & at night a watch was told off to go up to the batteries. However was not included. Small air raid at night.","25":"\nMorning broke fine but about 8 became cloudy. Some drivers were ordered up to the forward area. ","26":"\nFine day. Usual routine. On guard tonight but was detailed to go to a party to Boulogne to get horses to leave at 7 in morning. ","27":"\nLeft camp at 8 am. Walked to Poperinghe and then entrained arrived at Boulogne at 6. Went to a large hall there for sleeping quarters etc. Had leave & went up town & had a feed. Town in darkness on account of raids. Went back to billet to sleep 8pm. ","28":"\nMarched 7.30 out to Vet hospital about 5 miles out & took over the horses & mules. I got a mule -240 animals altogether and units beside F A were with us. Left at 12 & rode to a place called Desures (9miles) arriving there about 3.30. Put up for the night at a big cement works. Had leave into the town bought some postcards. ","29":"\nLeft Desores at 10. Raining heavily during morning but fined up about midday. Went through beautiful country. After halting for lunch for ½ hour pushed onto Therouannes about 21 miles from Dedures. Portuguese billeted here. Had leave and had a meal in the village. Returned to the horse lines at 9. ","30":"\nLeft Therouannes 9am. Rode all day & arrived Azabrouck at 5pm. Raining here but Cousins & I went into the town & had a meal. It is a large place & has been bombed some (16 miles). ","31":"\nWhen harnessing up in the morning one man was kicked by a horse & had his leg broken. We left at 10 & pushed on until 6pm when we arrived at wagon lines then mounted again& returned to DAC arriving 7.30pm (about 25 miles). The trip thus ended very much enjoyed myself. Found 24 letters awaiting me. ","32":"\nAt morning parade was warned for draft to battery & left about 12. Arrived at wagon line 5pm. Slept there the night. Before leaving sent off a few lines to Mother, K & Aunt Ben & Edie. Heard today of the death of Arthur Brewer. Was much upset about it.","33":"\nThe mud here is simply frightful and the whole place is pitted with huge shell holes which are filled with water. Mucked around during day. ","34":"\nCamp or rather wagon lines moved back about a mile today to an old Canadian redought where the ground is higher & the position is better. ","35":"\nHad a decent sleep last evening. In the morning was making horse lines ","36":"\nMucked around. Weather rather cold. ","37":"\nWent to Ypes for bath and called on Stewart on the way home. In evening went up to see him again. He knew Captain Taylor up there. Cousins went with me. ","38":"\nCamp cold & foggy. At 2pm left for the gun pits arrived about 5.30. Had a rather lively night, when on guard got a dose of gas. ","39":"\nWas a runner this morning at 5.30. Worked in pits during day. At 11 till 2 were heavily bombarded but was mercifully protected. At night about 7 further heavy bumps and had to take refuge up the road at Pill Box. Got more gas. ","40":"\nEyes very bad as result of gas. Worked as usual. Weather good. ","41":"\nWeather still good & work as usual. The whole place is filled with shell holes which are half filled with water. The German Pill Boxes which are numerous are very powerful. ","42":"\nWeather good. Went over with party to old position to try & pull out guns but had to abandon it. \nTUESDAY 6 NOVEMBER\nFired 1 ½ hours","43":" Saw Frank Semple passing battery & had a yarn. Rest of day quiet.","44":"\nWeather good & enemy rather quiet. Received a great batch of mail. During period up here received about 40 letters. ","45":"\nRather quiet day. Numerous airplanes about & lots of the enemy too. Saw one hit by shell and it simply disappeared in sparks. Do not know whose it was. ","46":"\nTalk of drawing out in next few days. 2 fierce bombs 8am & 11.30. One man wounded each time. The burst within a few feet & knocked one man on top of me, we were behind Pill Box. ","47":"\nLast night at 7 Fritz again heavily bombed & we took refuge up the road again. Barrage fired at 6 to 9.45am. SOS at 3.30pm but I was sent to Hqrs assume trip took 4 hours – fell into a least 6 shell holes once so firmly bogged that had to be pulled out. Also fell owing to defective duck boards & sprained right hand & bumped chin was soaked thru up to waist. Had a quiet night but most uncomfortable sleeping in wet clothes, dug out also partly fell in & there was no tea. ","48":"\nTommies took over battery and we moved back to and took over 44th battery guns. At 2 was told I could go down to Waggon Lines for rest for which I felt badly in need. The gas has left me with a very bad cold & throat & feel played out having done 11 days. Arrived at Waggon Lines safely at 4pm. It was lovely to go to bed in peace. ","49":"\nIn morning dried my clothes & boots & blankets etc. Wrote up diary. In afternoon went for a hot bath which I much enjoyed. ","50":"\nWent to doctor about gas & was marked ‘NO DUTY’ Wrote several letters & did some washing. The day was fine & bright. ","51":"\nAgain went sick & was marked ‘Light duty’. Wrote home during morning. Went on parade in afternoon. ","52":"\nAgain went to doctor & received treatment. Wrote to K. In afternoon again had treatment then did a little work on oil waggons etc. Day fine.","53":"\nWent for treatment. Wrote to Reg Stone and Lal in morning during which it rained a little afternoon worked in gun park. ","54":"\nAgain saw doctor & received treatment. Afternoon parade was not until 3.45 so did some sewing. Still our date of ‘pulling out’ seems indefinite. Today is Lenna’s birthday. I wrote to Stewart. ","55":"\nIn morning worked in Gun Park again. Wrote to Lottie. Afternoon was a holiday. In evening went to C.E. Service held in ‘Kookooburra’ theatre near the Belgian Chateau and enjoyed it very much. Returned at 7.30 & went to bed. Day dull & chilly. Saw one of our observation balloons set afire by German airman. ","56":"\nIn morning went to Ypes for a load of wood which we secured from the ruins of some houses. The weather again dull & chilly. ","57":"\nSpent a quiet day. Rumours that we move out tomorrow seem to be correct. ","58":"\nReveille 5am. Raining heavily. Preparations for moving out as we leave at 11am. Was detailed today with several others as rear party. We left on horseback at 2. Arrived at Steenwerk near Armentieres at 6 after a tiring & wet journey about 14 miles. Quartered in billets on a farm. ","59":"\nThis is a pretty & quiet spot, although we can hear the guns in the distance. The Hun seem to have never got here & the quiet peaceful surroundings are fine after the bustle of the Ypes sector. On guard from 5.30pm till 5.30pm Friday. Weather rather dull so far. ","60":"\nBeing on guard wrote to Lance as things were consequently quiet. Fine & moonlight evening after coming off guard I went into the village of Sailly about 20 minutes walk & had a feed of eggs & chips. Returned about 8 & went to bed 8.30. Had a letter from Aunt Ben.","61":"\nAs soon as we fell in at early parade ordered to have some cocoa and were then marched into Sailly for a hot bath. Quiet day. At night went onto Steenwerk after having tea which cost 3s3- went to see the ‘Anzac Coves Concert’ party who gave a very good show. Returned to camp 8.45pm. ","62":"\nDuring night right foot rather sore. In morning found it much swollen (was mess orderly) saw our medical orderly who thinks it is trench foot. Could not therefore go to church parade. Rested during day. ","63":"\nFoot still very swollen. At 10.30 the doctor came over and pronounced it Septic Foot & Hospital Ambulance called at 2.30 & took me to 5 Brigade Hosp out of Steenwerk. Where I was admitted. The patient next to me is out of the 19th Battery & is in Stewart’s Company. ","64":"\nHad breakfast in bed. Wrote up diary. M.O. has just come in. It is 9.40am. Had foments put on foot & read for the rest of the day. The food is excellent & the company is very funny and the time passed pleasantly enough. There has been heavy firing for the last 24 hours. The weather is dull & cold. ","65":"\nThe weather again is wet & dull. Read during the morning, had hot bath in afternoon & again read. ","66":"\nWeather changeable. Rain morning cold. Having foot dressed. Wrote several letters again read. Against George Brown of …………Base ……………is attached to this ambulance 5th ","67":"\nAgain the weather …….with little rain & again wrote several letters. ","68":"\nWeather dull. In morning Harold Alcock who is with the ambulance came in to see me & again at night time. Had a long yarn. ","69":"\nHarold Alcock dropped in for a minute. He had seen Walter Johnson who said he would come over in the afternoon which he did & stayed for about an hour. Wrote to Mr Johnson in evening.","70":"\nWeather fine & cold. Nothing particular occurred. Fritz was over last night dropping bombs. Received 3 parcels from Len, Auntie Al & Maimie Loder. ","71":"\nFine & cold. Ponds all frozen over. Foot sore again in the evening. ","72":"\nFine & cold. In afternoon several German balloons flew over this part & dropped pamphlet. Foot not so weak this morning. ","73":"\nFine & cold. Wrote a few letters. In evening a gramophone was brought into the ward so we had some music. Fritz put over gas shells last night into villages near here. ","74":"\nFoot feels better think it very probable that I will be discharged today. We expect to go into action again on the 15th of this month. Later- Was not discharged. ","75":"\nStill here in D.R.S. Had a letter from Jim Loder. Wrote to him & Aunt Ben. Day fine & pleasant. ","76":"\nWet & chilly. Usual hospital routine. ","77":"\nWeather fine. Was discharged from hospital and left at 2.30. Fritz was bombing in the vicinity. Arrived at Waggon lines at 4pm. Found that Gordon Cousins had rejoined the battery. Went into Steenwerk to see Anzac Coves concert but could not get in to building owing to crowd so went to Y.M.C.A. for an hour. ","78":"\nAs discharge slip was marked ‘3 days No duty’ today I therefore did not go on parade. Wrote several letters. Weather very cold. Received gloves handkerchiefs from Edie. Parcel also from Ethel with hankies & present from Mary Hunt. ","79":"\nOn duty so wrote several letters. Had feed in evening.","80":"\nToday is Kay’s birthday so of course I wrote to her & also to home. In evening my mail arrived. 31 letters & was awfully glad. 5 Moth 5 Kay 5 Ethel etc also a silk kerchief from Renne. \nFRIDAY 14 DEC 1917\nOn duty. Went out on horses exercising in morning. In evening went across to the 4th Battery to see Lindsay & Walker who had just arrived there. Had a great yarn with Tom & was awfully glad to see them. Had a yarn to Doc Bennett (Mosman) who belongs to our","81":" Battery who has just rejoined after being wounded. ","82":"\nIn morning went to Sally for bath. ","83":"\nChurch parade was held at 12th Battery lines but we arrived too late. Had coffee at an estaiment & returned. Afternoon wrote letters. ","84":"\nUsual parade. Mess orderly in morning. Helped to build bunks in a new hut in afternoon. ","85":"\nParade. Continued bunk building. In afternoon parade till 3.30. In evening went into Stanwerk to see the ANZAC COVES. Returned 9pm. Had a letter from Aunt Ben. ","86":"\nThe battery goes into action tomorrow. Did some writing. Had a ‘feed’ down the way. Went on guard. ","87":"\nRight & centre sections went into action today, the gunners going up to the pits. Was not sent today. Will probably go up with the relief. Frost heavy. ","88":"\nPacking timbers today as we move out tomorrow. Cold & heavy frost. Did a little more writing. ","89":"\nMoved out at 9.30. beautiful day clear & cold. Ice in ditches 2-3 inches thick. Arrived at new quarters 12 noon. Look as though they will be very muddy. Unpacked timbers. One of centre guns was blown out today. We are near Nupple near Steenwerk.","90":"\nReveille 6.30. Very cold indeed during night & did not get much sleep in consequence. Usual routine & on guard tonight. ","91":"\nChristmas Eve. On guard during the day so read & wrote a letter. Relieved 5.30. Received Xmas Box sent by the Lady Mayoress Fund of Melbourne & it was very nice. Went for a walk after tea. \nTUESDAY","92":"\nExercised horses before breakfast broke off at 8.30. Bfast. Next parade was 11.30. had a fine dinner. Wrote in afternoon completing 18 page letter to Kay. ","93":"\nUsual routine. Cold frosty. Roads were very slippery when out exercising, which was a mounted exercise. Several horses fell. Snowed. ","94":"\nWalked to Sailly for bath (about 6 miles each way). Roads very slippery & it snowed slightly. Stables in afternoon & horse exercise dismounted. ","95":"\nUsual routine. Batch of belated mail arrived it having been sent to Aunt Ben. ","96":"\nCold usual ","97":" 1917\nFine day, cols. Mounted exercises in morning. In evening at 5pm was ordered to go to pits & left the wagon line about 6pm.Arrived at pits 8.20. place is different to our last position at Ypes. Our accommodation is much superior & work less. Are in a dilapidated farmhouse and it is ‘jake’. ","98":"\nCold & windy. Was runner to Hqrs about midday. Did short shoot. Tonight were warned that a cloud gas attack was expected. Continued letter home in evening. Sing by boys it being New Years Eve. ","99":"\nFine day rather chilly. Fritz 12 ","100":"\nCommenced duties in office think I it OK question is how I will get on with the officers but will do my best…………………nothing furth.. ","101":"\nWeather dull blowing. Wrote…………………letter. Had a few more……………letters ","102":"\nSince last writing have had a very busy time in the office. The weather has been cold & snowing. Received a little Aussie mail. ","103":"\nStill on the job. Had a decent mail last week and a parcel from Auntie Al & ……from Mrs Suttee ","104":"\nTalk of moving out on","105":" grows more insistent. Saw Stewart a few days ago. He is now Major ","106":"\nFriday","107":" ","108":"\nNothing much to add. Expect to move out in a few days now. Am getting along pretty well with the job & like it. Have written a good few letters during the week. ","109":"\nBeautiful day. Move tomorrow so am packing up. ","110":" ","111":"\nMoved out at 9am. Cold foggy morning. Was frozen almost riding on the limber. Arrived at Merres & stayed until Sunday. Billeted in farmhouse near Bailleul. Saturday afternoon held a scratch football match. ","112":"\nMoved out at 8.30. Beautiful day & pace was quick. Arrived at Ebblinghem at 2.30 and again billeted in farms.","113":"\nOn the move again at 8.30. Travelled well through very pretty country and arrived at Elnes at 4.30. Farms again as billets. ","114":"\nMoved again at 8.15. weather again good & pace very fair. Arrived at our destination Alquines about 12.30. Place is small & in a valley rather secluded. Nothing to see much in the way of interest. ","115":" TO","116":" Very busy with office work. Appointed acting Bombardier which unfortunately does not carry pay. Have received about 15 letters redirected by Aunt Ben. ","117":" 13 THURS 14 \nWeather still bad. Am very busy. Had letters from K, Aunt Al & home. Received 2 parcels from Father & one from Mirrie. Promoted Acting Bombardier on","118":" . ","119":"\nWeather rather better. Got all ready to go into Boulogne but the motor lorry broke down so the trip was off. Hope to go in tomorrow. ","120":"\nWent into Boulogne at 11am. Was a beautiful day and the trip was very pretty. In afternoon met Stewart who has just returned from Paris and was staying in Boulogne for the night. We went to a picture show for a couple of hours. Left at 8pm. ","121":" 18 TUESDAY 19\nFine weather. Rather busy adjusting Canteen accounts. Cold weather. ","122":"\nInspection by General Coscon today. Dull & cold. ","123":"\nFine weather. In afternoon Stewart rode over to see me. I walked part of the way back with him. ","124":"\nRaining & muddy. Things quiet. ","125":"\nFrom this day until","126":" things kept about the same.","127":"\nMarched out of Alquines about 8.30 & arrived at Elnes where we stayed the night.","128":"\nMoved on to Abbe Woestyn, a big fine chateau where we put up for the night. Evidence of wealth of owner in fine outbuildings and number of stock. About 10 German prisoners were employed there. Weather fine.","129":" Moved out at 8.30. Went past St Omer and near large aerodrome and put up at Vieux Bergum where we stayed until","130":" when the gunners went forward to Pits in motor lorries while we proceeded on to the lines at Le Veau occupied by us previous to our moving out.","131":" From this day until","132":" I made no entries. The weather has been beautiful and one mail from Aussie has arrived.","133":" Much interest has been aroused since the 22 instant on account of the big German push on the Somme. Conflicting rumours regarding it keep coming to hand. It is very probable that we shall be moved down there shortly. Last","134":" I went to see Stewart. They were in the midst of preparations to relieve some of the","135":" Division Infantry at Messines. The weather is again wet & windy. On Tuesday I rode across to DIV PAY Office at Ravelsburg. Today I wrote to Cut. From whom I have not heard for some time. Later all kits are to be handed in at 8am in morning. ","136":"\nWet & cold. Reports re battle in Somme still conflicting. ","137":"\nWeather rather better. It seems certain that we are going to move down to Somme on Tuesday or Wednesday. Wrote several letters.","138":" &","139":" Weather improved. Definite that we move out on Wednesday. ","140":"\nMoved out at 8am. Weather rather dull. Guns were handed over at 4pm yesterday to 83rd R.F.A. battery. The famous Lahore Battery.\nArrived at Stenze near Merres at 10am very close to where we billeted at end of first days journey when on way to Alquines two months ago.","141":" 4, 5 &","142":"\nRemained in Stentiele. More tomorrow","143":"\nThis morning Capt Wren told me that he would promote me to Temporary Bombardier which carries pay. Said work was being done very satisfactorily. At 4pm we pulled out. Went through Bailleul which has been much knocked about by long range heavy guns. Arrived Caestre about 7 & entrained. Left at 9pm and travelled rapidly throughout night. ","144":"\nArrived at Amiens about 8am. Raining heavily. People leaving the town which is very large which has been bombed & shelled at intervals. Loads of merchandise being put on trains. Pulled out from here about 11.30. Travelled for remainder of day until 7pm when we arrived at village of Behencourt. Almost all the villagers have left. My office is in an old house which has the appearance of having been left in a great hurry by the owners. They seem to have taken practically nothing with them. Beds left, clothes all strewn around, bird left in cage with door open, sewing baskets and such feminine accessories all left. It is a great shame. Fritz has shelled here and during the night he sent over some shrapnel. ","145":"\nThis morning about 8 or 9 Gas shells have come over and burst about 5 or 6 hundred yards from this billet. There is a great deal of artillery about here and the sound of heavy firing has been continuous. A few yards from here the main road has been mined.\n9 th &","146":" & WEDNESDAY\nStill wet & dull. All sorts of rumours flying about to the effect that Fritz has advanced at Steenwerk estaires ","147":"\nWeather much finer. Rumours that the Germans have taken Balleul- Seems funny as we have just left up there to think of it being in his hands. The 4th Division have gone up and","148":" are about to go. The Tommies seem to have lost a lot of prestige in the eyes of the French while the Aussies are more popular with them than ever. ","149":" SAT\nReceived mail on Friday. Wrote to Kay. Weather changeable. ","150":"\nStanding ‘to’ today as an attack is expected up the line. Last night the bombardment was terrific. Tommy battery here has been standing to their horses all night. It is official about the Hun advance near Armentieres & Steenwerk. Probably our last wagon lines are in their hands it seems almost certain. Fighting at Sailly etc & Neuve Eglise. Today I wrote home & sent away several postcards. ","151":"\nToday it is again very cold","152":" &","153":"\nWeather cold & changeable. Still lots of rumours of German attacks in north. ","154":"\nTonight Ross Jones, Y.M.C.A. came over to see me and we had a good yarn together. He is with the 3rd Division. ","155":"\nNothing doing. Rumours of a Fritz attack to take place early tomorrow morning and most of the batteries are standing to. ","156":"\nFine morning but frosty. Evidently the attack did not take place this morning but The Huns were over bombing during the night. \nSUNDAY\nToday Ross Jones & Bert Polyblank came over to see me. We had a most enjoyable time having tea together after which we walked to Bayelincourt & saw Jack Croughly who has charge of the","157":" Inf Brigade Y.M. Stayed there for about 1 ½ hours and we walked back to Behencourt together. ","158":"\nNothing doing. Wrote to Cut as I had a long letter from him. ","159":"\nWeather fine. Some wild excitement as the boys cut loose a Tommie who was crucified to a gun wheel undergoing punishment. The same thing happened last night. There was a hop over last night. Rumour says by 2 Welsh Divs and that they advance 1000yards. ","160":"\nNothing much since last entry. Some Aussie mail has come. Have heard of Jimmy Loder being wounded. During period met Angus Taylor, Ross Johnson and a few nights back Ossie McGibbon came up to see me. Today is Sunday. We expect to move out tomorrow or next day. Yankees are about. Had a game of cricket yesterday afternoon & enjoyed it. Wrote to Ethel in evening and had a warm ‘tub’. Had a letter from Charlie. ","161":"\nFine. Tommies took over guns but we don’t yet know when we are to move wagon lines & hand over billets. If so this will mean us camping in the fields. Received mail. Letters 35-36 from Kay. ","162":"\nRaining heavily and the prospect of moving into the mud is very rotten. At 12 noon it was not known if we have to do so as much argument seems to be going on as to whether we will vacate our billets. We all sincerely hope not. Would appear we are to be held in reserve. Met Jack Crougly again yesterday. ","163":"\nWeather fair. It seems as though we are to move out this afternoon. ","164":"\nMoved out of billets but did not move horses lines. Bivouacked in field. New D.C. arrived. ","165":"\nWeather fine. Went to Querriew on bike in afternoon. ","166":"\nWeather still fine. We are in mobile reserve. ","167":"\nRaining miserably. Not too comfortable in tent. Cleared off somewhat towards evening.","168":" TUESDAY WEDNESDAY 13, 14,15\nThings about the same. Monday a balloon was set on fire by Hun plane. Tuesday Fritz plane was brought down as was case ","169":"","170":" 17TH\nWeather glorious quite warm. ","171":" morning rode back to Hqrs Heely. \nThursday evening had swim in pond near the Chateau in the village Behencourt. No mail for a few days. ","172":"\nFine weather but very heavy rain in the afternoon. At night cleared off. Went to a Tommie Pierrot show for a few hours rather enjoyed it. ","173":"\nBeautiful day, heavy bombardment during night & some prisoners went through here this morning. Have not heard the details. Wrote to Mother last night. Had a post card from Charlie and letter from Aunt Ben. In the afternoon Fritz shelled the vicinity with 9.3 High Velocity A.P. shells from 2pm to 4.30 at intervals of about 5 minutes. The nearest were about 400 yards away & the craters about 20 feet in diameter and 20 feet deep. A piece weighing about 1 ½ lbs fell near my tent. Another about 20lbs near QM store. The evening was beautiful. ","174":"\nThis morning Fritz opened up with his big guns over to the right of us. Weather beautiful again.","175":"\nWeather fine. Received Aussie …at night. ","176":"\nWeather beautiful. Received a few more Aussie letters. Went to Tommy concert & returned about 9.45. Moon very bright. Fritz planes were over dropping numerous bombs. Around about 10.30 several planes came close and one which we thought was one of our own planes dropped bombs on the camp Killed Lt Abernathy, Corporal Reed & Gunner Blair besides wounding 3 others. Our tent was riddled but I had gone onto a dugout close by, together with Lieutenant Braddon & 2 Digs. ","177":"\nWeather again fine. In afternoon the three bodies were taken to Frenchencourt and buried there. Evening was again brilliant but were not troubled with enemy planes. During the day we constructed a dugout for Sgt Major & self. ","178":"\nRaining all day. In evening wrote to Edie. ","179":"\nWeather fine again. Received 6 more letters & 4 papers. Went to Pierrot at night. ","180":"\nSomewhat cloudy. Fritz put over a few shells last night. Wrote to K & Mrs Spark & Mrs Loder. More bombing at night and also shelling with H.V. a few 5.9. Tank officer in vicinity was killed. ","181":" TO","182":"\nWeather has been fine & warm. Wrote several letters. Heard from Stewart & Mrs Pearson. Had some more air raids. News of big attacks down south. ","183":"\nFine. Went for a swim in afternoon. Fritz bombed again last night. ","184":"\nStill fine. Went to Pits with pay in the morning calling at Heilly Chateau a beautiful old place. ","185":"\nStill good weather. Received a bonzer cake from R which I was beginning to think would not arrive. Had a letter from Rex & Edie. ","186":"\nWent to Franvillers to timber lines with pay. Fritz over at night but not much bombing. ","187":"\nStill the same sort of weather. Wish it would rain I think. ","188":"\nWeather is fine. Nothing to note. Played Tommies cricket myself captain of R","189":" got 22 ND ","190":"\nIn evening Stewart rode over to see me together with a Lt friend of his. He had just come out and had been in the clever repulse of a Hun rid a few days ago. Was in great spirits. \nSATURDAY 8TH JUNE\nIn evening went to see Stewart about 40 minutes walk away. Had an enjoyable time together. ","191":"\nFine day ","192":"","193":"\nStill fine, little rain on 10th. Hop over at 9.45pm on","194":" Rumours say successful. Wrote to Mary, Joyce, Con Kay & Lena.","195":" THURS FRI\nNothing to note. Night went to the Tommie “Cheerio Boys” ","196":"\nSwimming carnival in afternoon & it was a great success. ","197":"\nReceived Aussie mail up to 21\/4\/18. ","198":"\nWeather fine. About 9pm enemy shelled wagon lines with HV and killed Dal Lindale & 2 men of D.A.C. ","199":"\nWeather dull. Threatening storm. Shelling by enemy of back areas seems active but we were not shelled till evening. At 6pm we buried poor old Lindale in Frenchencourt Cemetery. Wrote to Dal & Nelson Lack. ","200":"\nRained heavily during the night. Wrote to Aunt Ben. Shelled again at night for a while. ","201":"\nStill wet. Shelled again a little. Commenced letter to K. ","202":"\nWet again. Received another letter from K & finished one to her. Not shelled today. ","203":"\nFine with strong breeze blowing. ","204":"\nShelling nearby again. At 11am just as we were to have church a shell landed among our horses destroying five & wounding 8. In afternoon it was quiet. ","205":"\nLetter from Uncle Wm. No shelling today am thankful to say. Battery played 20th Battalion football and won 9-6. ","206":"\nFine","207":"\nPlayed 105th Battery cricket & won. Fritz shelled 4 bursts of 2 rounds during the day & bombed at night. ","208":"\nFine. More bombing at night. ","209":"\nWarm weather. The last few days there have been lots of Americans here working & completing the construction of trenches in the vicinity. ","210":"\nAfternoon played cricket against 12th Battery defeated them by an…….. I scored 23 innings & 28 runs. ","211":"\nWeather fine. A little bombing near us last night. Received 5 parcels from home. ","212":" &","213":" &","214":"\nFine. Wrote home on Monday ","215":"\nLast night a very heavy bombardment in the village of Albert. This makes about the 4th during the past week. ","216":"\nAust advanced this morning. Two small batches of Huns went by this morning. Rumour says 850 were captured on Corps front. Had letters from Kay & Mary last night. ","217":"\nNothing to mention. In afternoon played","218":" Battery & defeated them by an innings & 50 runs. ","219":"\nWent Church parade in morning. The football team defeated DAC & cricket team defeated a Tommie team in afternoon. ","220":"\nWarm & sultry","221":"\nPulled out & went down to position at Glisy near Villers Brettoneux the gun position being near the latter place. ","222":"\nAgain pulled out. Have had 3 trips to the Pits & met Jim Donnelly one day up near the position. Have also seen Leon Greenberg. ","223":"\nSaw Stewart. ","224":"\nAs I write the gunners are leaving to take part in the big attack in the morning the","225":" from which we are hoping for big things.","226":"\nThe stunt today\nCamped at night behind Bayon Villers.\n"}}