{"Document Name":{"0":"Diary_0244","1":"Diary_0244","2":"Diary_0244","3":"Diary_0244","4":"Diary_0244","5":"Diary_0244","6":"Diary_0244","7":"Diary_0244","8":"Diary_0244","9":"Diary_0244","10":"Diary_0244","11":"Diary_0244","12":"Diary_0244","13":"Diary_0244","14":"Diary_0244","15":"Diary_0244","16":"Diary_0244","17":"Diary_0244","18":"Diary_0244","19":"Diary_0244","20":"Diary_0244","21":"Diary_0244","22":"Diary_0244","23":"Diary_0244","24":"Diary_0244","25":"Diary_0244","26":"Diary_0244","27":"Diary_0244","28":"Diary_0244","29":"Diary_0244","30":"Diary_0244","31":"Diary_0244","32":"Diary_0244","33":"Diary_0244","34":"Diary_0244","35":"Diary_0244","36":"Diary_0244","37":"Diary_0244","38":"Diary_0244","39":"Diary_0244","40":"Diary_0244","41":"Diary_0244","42":"Diary_0244","43":"Diary_0244","44":"Diary_0244","45":"Diary_0244","46":"Diary_0244","47":"Diary_0244","48":"Diary_0244","49":"Diary_0244","50":"Diary_0244","51":"Diary_0244","52":"Diary_0244","53":"Diary_0244","54":"Diary_0244","55":"Diary_0244","56":"Diary_0244","57":"Diary_0244","58":"Diary_0244","59":"Diary_0244","60":"Diary_0244","61":"Diary_0244","62":"Diary_0244","63":"Diary_0244","64":"Diary_0244","65":"Diary_0244","66":"Diary_0244","67":"Diary_0244","68":"Diary_0244","69":"Diary_0244","70":"Diary_0244","71":"Diary_0244","72":"Diary_0244","73":"Diary_0244","74":"Diary_0244"},"Date":{"0":"unknown","1":363.0,"2":364.0,"3":366.0,"4":367.0,"5":368.0,"6":369.0,"7":370.0,"8":371.0,"9":372.0,"10":379.0,"11":380.0,"12":381.0,"13":382.0,"14":383.0,"15":384.0,"16":385.0,"17":386.0,"18":387.0,"19":388.0,"20":389.0,"21":390.0,"22":391.0,"23":398.0,"24":400.0,"25":401.0,"26":403.0,"27":406.0,"28":410.0,"29":411.0,"30":412.0,"31":415.0,"32":416.0,"33":430.0,"34":434.0,"35":435.0,"36":436.0,"37":437.0,"38":443.0,"39":444.0,"40":454.0,"41":455.0,"42":456.0,"43":457.0,"44":460.0,"45":461.0,"46":465.0,"47":466.0,"48":467.0,"49":468.0,"50":469.0,"51":470.0,"52":471.0,"53":472.0,"54":473.0,"55":474.0,"56":475.0,"57":476.0,"58":477.0,"59":478.0,"60":479.0,"61":480.0,"62":481.0,"63":482.0,"64":483.0,"65":484.0,"66":485.0,"67":486.0,"68":487.0,"69":488.0,"70":489.0,"71":490.0,"72":491.0,"73":492.0,"74":493.0},"Entry":{"0":"\n\n \n\n","1":" This is the start of perhaps the most adventurous period of my life, \nperhaps\n and it is even very likely the last period. I say the start, because though it is now 3 months since we took the momentous step and embarked on a \nsoldiers life\n soldiering career, yet for the first time we may be said to have really begun the game in deadly earnest, for the remainder has been all preparation, hard preparation it is true and a ceaseless round of real hard work, but yet only preparation and not the real thing.\n\nThis is written on the troopship, the SS Ulysses on board of which there are some 2000 of us perched, and we are now outside Port Philip in beautifully calm weather steaming along slowly, for where we have not the slightest conception. But let me begin at the beginning.\n\nOn the 9th Sept it was that F. Leans’s & myself presented ourselves at Victoria Barracks, Sydney, to enter a new life, and formed into line with as motley a crowd as it is possible to imagine.\n\nI suppose that nothing short of such a great international crisis could have brought together and made bedfellows of such a queer mixture of human beings. Out of works, deadbeats, sailors, an odd man or two in uniform, farmers, a few clerks, stiff collars and a correct cut here, a ragged coat and unwashed face there. Out of such a weird gathering it seemed impossible that an army could ever be formed, and yet immediately I heard it said that they were excellent material, and such indeed they subsequently prooved. Of the many funny little incidents that occurred for the next few days, my memory alas tells me little, for to a larger extent the whole of that time seems now, though only 3 months ago, something of a dream, the faint recollection of which seems to come through a haze from light long since gone.\n\nBut one impression remains, one of indefinable chaos and confusion. There \nis\n can be no doubt that in these early days, “the authorities” that \n\n ( I don’t know who they are or were) proved themselves absolutely incompetent to deal with the situation and for at least a week the newly joined recruit found himself being bandied about from pillar to post, sometimes finding a blanket and a place to sleep, having to fight for meals like a wild beast, being sometimes drilled and sometimes not, but everything confusion and bustle, nobody knowing anything and caring less.\n\nIn this state of confusion, somehow both my friend and myself became full blown corporals, and got out of the ruck, only Actg. of course. This early appointment of NCOs was to say the least of it funny.. In one case I know of a newly formed Company the question \nask\n was asked “Is there anyone here who would like to act as sergeant?” and thus they were obtained.\n\n Still living in the stables at Roseberry Racecourse, everything seemed to soon find its level and in our own particular stall we soon settled down and made the best of our circumstances. Soon we had our own little circle and what\n\nwith bridge played by the light of a guttering candle, and even a sing song or two aided by an accompaniment of a mouth organ a few pleasant hours were snatched out of the turmoil and a great many good friendships made. In those days we thought we would be together always, but alas the fellows of that little mess are even at this early date scattered to the four winds. Several left us to fill vacancies in the first, and the remainder are scattered everywhere, Infantry, Light Horse, or in the thousand and one small corps that make up an army.\n\nIt was Roseberry that we first got broken in to the everlasting Camp Stew. Soldiering fare even in peace time is not conspicuous for variety, and breakfast stew & bread, dinner stew & bread, tea bread & jam, while filling leaves sometimes a longing for the little things left behind, not the least of which is a clean plate.\n\nFrom Roseberry we drifted to Rosehill, and here at last we could claim a name & address,\n\nand even, but this came later a number. Rosehill Racecourse, what pleasant & delicate memories it brings- rain, wind, & sickness. It seems extraordinary that though the camp was condemned medically from the first day of our arrival, yet we hung out there week after week, 75% coughing and sneezing. On one occasion it rained, and rained for days, and the camp was a seething mess of deep black sticky mud ploughed & mixed to a beautiful even consistency by the tramp of thousands of feet,\n\nFrom Rosebay to Liverpool, another step. By this time we had become reconciled \nto\n and had to a certain extent settled down to the routine of things and to the fact that we were evidently not to go as soon as we expected. Liverpool, compared with any other camp we have been in yet is an absolute paradise, with a broad flowing river, right adjacent to the camp, green grass everywhere, no mud and no dust. From Liverpool eventually good byes were said and we went to \n\nBroadmeadows in Victoria and here in we spent the last few weeks of our life in Australia. I will not give a detailed account of our life in camp here, for one military camp is like another and of our training in sham fights manoeuvres & other things, it is only a recapitulation of what is happening every day amongst volunteer corps. \n\nOne thing strikes one prominently however, and that is the absolute farce of compulsory church parade\n At Broadmeadows the only outstanding impressions were mud, thick black slippery mud, and plum jam. It does seem extraordinary but absolutely the only jam supplied to the troops in this locality was plum. We had Light Plum and Dark Plum, Egg Plum, Greengage and several other varieties but all plum.\n\nSundays always brought the inevitable Church Parade and I cant help but think how absolutely farcical is this custom of compulsory Church Parade. For one thing, amongst us many\n\nmen, it is impossible for more than a comparative few to hear a word of the service, and of these not one in a dozen listens. At Broadmeadow with the whole Brigade present, and some 200 or more men to preach too, the whole in the eyes of the men was a \nbore\n useless bore to be slept through as much as possible.\n\n(In fact on one occasion at Liverpool one party of 4 were caught & admonished for playing 2up in the middle of the sermon.)\n\nOn the last Sunday before leaving the whole Brigade was in a state of slumber as usual, \nand\n when the preacher raising his voice above the usual drone exclaimed loudly “You live on bread.” Everybody woke with a start and \nlike\n from end to end of the Brigade \nwithout pau\n simultaneously \ncame a\n from 2000 throats came a muffled whisper “And jam”\n\nOn the","2":" we embarked on board the Ulysses and are at the time of writing this well at sea \na\n and more or less sea sick.\n","3":" Five days at sea - Christmas over and nearing Albany. The weather has been delightfully calm, the Ulysses is as steady as a rock, and everybody on board is happy and well fed. \n\nAfter the grimy dust and Broadmeadows, ship fare and life is an absolute paradise.\n","4":" Early this morning we arrived at Albany after an mainly fine trip, and are now anchored in the bay outside the town. We are not alone, however, for anchored all around us are 7 other transports, and the \nsm\n hull of another is just visible on the horizon. About 8 o’clock also we felt we were not altogether unprotected, as the Australian sub-marine AE2 steamed rapidly across our bows, throwing a wall of foam on either side of her as she went. It is a pretty bay we are anchored in, with steep wooded hills and islands all round, and a few long beaches. But nevertheless \nI\n\n we all hope sincerely that we will not stay too long, for there is to be no leave under any pretext.\n\nRoutine on a troopship is anything but arduous. Reveille is at 6 a m, breakfast at 8, Parade at 10 a m, an almost immediate dismissal, and except for the company and the few others on duty, freedom for the day. Orders are strict about certain things, gambling for instance, but nevertheless this goes on to a very great extent on board ship, and in various corners such games as Crown & Anchor and others are waged furiously. One Sgt of my acquaintance lost £13 in one fell swoop, and others have won or lost various amounts, mostly lost.\n\nThere is a good canteen and a good deal of the pay finds itself here. \nThe \n No grog of any sort is sold but soft drinks, sweets, biscuits and other edibles. With such a crowd, the small window of the canteen is naturally much congested, and it reminds one very much of the theatre, the long line patiently waiting its turn\n\nto be served. It is necessary sometimes to wait for half an hour or more before ones turn comes, and the fortunate one by that time is generally overwhelmed by long lists \n\nof commissions given to him by his less fortunate companions outside the line. No paper bags are used for weighing purposes, and biscuits are generally served into hats, cardboard boxes or anything available.\n\nThat we are on active service now is brought home to us somewhat by the fact that a strict censorship has been established on all correspondence, and \nletters\n even a date on top of a letter is now prohibited. It makes letter writing very difficult, as there are so many things which one puts in letters, which though harmless, are still absolutely spoilt if seen by other eyes.\n\nThe QMS of the","5":" is an Irishman, and it is on record that he sought a fatigue party on one occasion and demanded of the occupants of \none\n a tent. “How many of yez in there.” The answer came back \nof\n “Five” “Well half of yez \n\ncome out”\n","6":" All the transports are now arrived and there are 16 all told in the bay, a larger fleet than has been seen in this Port, I expect for some time.\n","7":" Left Albany at 8 a m for ? As we steamed into the open sea, it was a fine sight to see the fleet following each other in a long line, and as we turned to round the rocky headland at the entrance, we got a full view of the whole line, each ship rising to the swell some 600 to 800 yds in rear of the one in front. As we reached the open sea, the ships in front slowed down and the others closed up and formed three abreast, the Berrima towing the submarine AE2 which as far as we know is as yet our only escort.\n","8":" has come and gone, and we are steaming in a NW direction so it was surmised that our next Port is Ceylon. New Years eve was fairly lively on board, and lights were allowed until after midnight. The band went from troop deck to troop deck, and the strains of Auld\n\nLang Syne could be heard from one end to the other.\n","9":" saw a half holiday to all hands, which event was celebrated by a cricket match","10":" V","11":" battalion. Deck cricket of course is a very well known pastime but this particular game may perhaps be distinguished by the keen interest \n\nmustered\n displayed by the partisans of both sides. Excitement was keen as wicket after wicket of the 14th who batted first fell, and when the last wicket fell for 7, the 13th were jubilant, but alas wickets fell equally rapidly and 1 was still required to equalise when the last man Sgt Momson hero of many fights went in. And great excitement he got 1, and then the innings ended 7 all. At the next knock, runs came more freely and the 14th made 23 and the hopes of NSW went down to zero. But yet once again the runs came freely and with a total of 41, the 13th won by a handsome total of 18.\n\n4th Jan 191\n4\n 5. Gentle reminders that we are on active service come to us now and again. One of my own particular crowd who has been a bit on the unruly side found this to-day, and when spoken to for coming late on parade answered in an insolent manner. It is horrible to have to always be on this police court business, but still discipline must be maintained; as a result he went before the Ships Court and 14 days cells will give him time to think things over. \n\nA very different affair to the ordinary Civil Court is this quick and lively military affair. The word of an NCO is practically final, and the stern faced Colonel who sits at the table asks a brief “Guilty or Not Guilty” (this of course is not a Court Martial) then “Sergeant what are the facts of this case? And Prisoner have you anything say? a brief admonishment and “14 days cells. The whole is only in most \nmatters\n cases a matter of 3 or 4 minutes. Life on ship board is rather monotonous. Day after day we go\n\non over the same old flat sea, but the usual monotony of the horizon is relieved by the odd presence of the rest of the fleet, for whichever direction we look in we see some ship or other. Three lines abreast and six deep, the whole is fairly impressing.\n\nWe have lectures on board and endless parades, the former being chiefly employed in telling us our responsibilities and duties as Fire Unit Commanders. These we listen to, and wonder afterwards how much will really be applied in the firing line. \n\nWe have to absolutely control the fire of the men under us, give them their targets, range, when and how to fire, and have to see to the reservation & distribution of ammunition. How much will we be able to \nremember\n apply it when we get into the real thing, I wonder. Still it passes the time & pleases the officers.\n","12":"\n4\n5. In the tropics, nearing the equator, and evidently bound\n\nfor Colombo. It is perhaps interesting at this stage to discuss what our prospects may be at the front. Looking at the result of the last 4 months training it must unfortunately be admitted, that as a force we are \nyet\n not yet by any means perfect, and even to my own inexperienced eye, our imperfections are such that they may be a source of grave danger to us on active service. The faults are spread and each class has its own officers, NCO’s and men.\n\nThe fairest are perhaps with the latter. Taking the Officers for instance, of course the chief lack is an entire ignorance of the conditions we are going to. That of course is inevitable. Then again \nthe\n many have been drawn from walks of life, in which they have had no opportunities to study raw mankind or bump up against real men. Those that have had volunteer experience to a large extent can’t get over their Saturday afternoon playing at soldiers, \nin\n which \nwhere\n everybody has taken to as a hobby, and in which accuracy of dressing is of superlative importance. Going up higher, there is unfortunately a general\n\ntendency to a lack of decision, and a want of unity in orders. This has led to a series of small injustices and irritations amongst the men, who belong to usually the most independent class in the world, that has shaken their confidence \nto the\n in their superiors, and been very detrimental to discipline.\n\nAs instance of this, the matter of dress for parades. This has been on many occasions laid down definitely in orders, and when \nat the last\n all the men have been ready, orders have been changed at the last minute and all has been confusion. On occasions as many as 3 opposite orders have been issued in the last 20 minutes before parade, simply the men don’t know whether they are standing on their head or their heels, and their criticism of their superiors has been well to say the least of it fluent.\n\nBut perhaps the biggest fault lies with the N. C. O’s. There is no doubt that on the whole, the Sergeants are either too young or too inexperienced, and are not the type to command\n\nconfidence and respect from their men. If we ever get the firing line, we are going to hell incarnate, yet there is no apparent realisation of this amongst the majority. Some of the N. C. O’s have \nbeen\n held commissions amongst the trainees in the Citizen forces, and ","13":" not quite realise that they are not \n while their knowledge of the drill book may be excellent, they do not yet quite realise, that they are not now dealing with a lot of boys still at or just leaving school, but with adult men of mixed and often very definite personality, the handling of whom is a matter of great difficulty.\n\nOr else like myself, they are too inexperienced in this matter of soldiering, and how \nf\n expensive the purchase of this will be God only knows. \nThe best of\n Fortunately there is a percentage of old soldiers amongst them, men who have already fought in one or more campaigns, and these give a stiffening to what would otherwise be a very mediocre lot.\n\nTo particularise types - one Sergeant, a bank clerk - had up to the time of his enlistment spent his whole life - days in the bank- evenings in\n\nsuede gloves and cane, doing the block, in fact a typical knob, his mother’s darling also, and spoilt and selfish and greedy, and unfortunately bringing these qualities into the army with him. His idea of a great man is a man with a big banking a\/c, and apparently he has never met a real man in his life. Having worn a pretty uniform in a volunteer regiment \nhe g\n and memorised some of the drill book, he has got his stripes. \n\nHe is the extreme of a type of which we have many and if war can make real men of these, it is indeed a great justifier.\n\nComing to the men, two main types are represented, the first largely old country \npeople\n men a large number of which are Scotch who have e\nim\n migrated to Australia within the last few years. A certain number of town men, who have occupied \nkno\ndecent positions in the city with these make a group on the whole steady & reliable and amenable to discipline. On the other hand are\n\nthe country men, big sturdy fellows for the most part, used to hard pysical work, resourceful, cheerful under hardship, but independent and possessed of a natural \n\npredudice against authority, and as a result a most difficult man to control. Of the best method of dealing with him I cannot quite say, but of this I am convinced once he is in hand no better \nmore\n material exists in the world.\n\nA percentage of the men are wasters, ne’er do wells, who are in the game because they think it is a fairly easy way to live, and who dodge all the work and all the drill they can. For these there is only one course, hard stern discipline, applied remorselessly.\n\nIn our company are clerks, an ex-parson, blacksmiths, jockeys, farmers, \nand a few\n three professional pugilists, and a large number of laborers, and numerous other callings including a few sailors and professional soldiers.\n\nFinally if we can hang out for 3 months of actual service without a horrible disaster, particularly if a few of the heads get shot, and we can discover \n\na sufficient number of natural leaders we may evolve into a highly effective fighting force.\n\nA good example of our way of doing things is given by “Lights Out” .Orders are that Lights must be out at sundown, or else the portholes must be masked. \nDa\n Silence must be maintained also. Result is that while the former portion of the order is strictly observed with regard to the troop decks, from every portion of the ship occupied by the crew, lights blazon from the portholes and effectually negative any other result.\n\nThe same inconsistency applies to the censorship. All letters etc are strictly censored, dates, name of ship all are cut out, yet before we left it was known everywhere that we would leave on the 22nd Dec, that our troopship was “Ulysses” \nA\n No. A38, and of our probable destination we know no more than them.\n","14":" Latitude about 0º odd number N very hot, as a result of which we have been ordered to parade in full marching order, khaki, boots puttee full pack & everything. As we \ndid\n had \n exactly\n the whole blanky outfit on the day before yesterday, it \nreflects\n offers another example of the eternal cussidness of our heads, whose whole idea seems to be to irritate the men with an endless series of useful orders.\n","15":" Gambling is very prevalent on board, and goes on openly, large sums of money changing hands. There is a lot of talk about putting it down, and every now and again the authorities issue orders with dire penalties attached, but so far anyway there seems to be but little determined effort made to do so, Crown & Anchor, Banker and other games are run in organized schools, and many of the men are heavy losers.\n\nThe fitting up of a troopship is in itself a big & expensive undertaking. The majority of the interior fittings have been removed, cabins taken down and the upper portion of\n\nboth forward & aft\ner\n holds been decked. The main deck has had all the port and starboard cabins removed, and the space thus obtained \nhas\n is divided into large dormitories called troop decks, holding on the average about 150 men.\n\nTables run\n The floor space is taken up by tables, running across the ship, each table constituting one mess, and accomodating from 16 to 20 men. From each table 2 men are told off as orderlies and these draw the rations & wash the dishes and clean up generally. The men sleep in hammocks, which are slung from hooks in the roof and when all are slung the air space is very crowded. But many of the men prefer the floor, and as permission is granted to sleep out\nthe deck space every available foot.\n The decks are crowded at night with sleepers. This, however, is not an unmixed blessing, for it rains in these latitudes at least once\n\nin the 24 hours, and what with decks being swept in the small hours, sleep outside is often fragmentary. \n\nFirst experiences of the hammocks were in many cases funny, and it is a wonder some necks were not broken by the process of clambering in & out.\n to see a man\n It was no uncommon sight to see a man mount on a form, climb carefully into his hammock on the one side only to be shot out as from a catapult on the other. Profanity on such occasions is I think justifiable.\n\nWe are in the middle of a great tug-of-war competition. Each coy supplying a team of six. So far our “G” is doing very well & have to pull “A” for the championship of the Battalion. Then the winner pulls the best of the 14th for the champ of the ship. Excitement is running high & bets are being freely made.\n","16":" We are in Colombo, having arrived at 8 a.m. yesterday, and the small harbour presents a very\n\nbusy sight, as all the transports are inside. Considerable soreness is felt by some of the troops at not being allowed ashore, but of course under the circumstances such a thing is \nnot\n hardly practicable. However the native boats are allowed alongside, and, as parades are not being held, bargaining for cigarettes, & cocoanuts, goes on practically uninterruptedly from morning to night. \nLast night\n In the afternoon the Governor came aboard, and as I happened to be one of the Guard, I had a good look at his Excellency. He observed as usual that we were \na\n fine type of men etc. This we sort of expected as our due now, \nbut I would\n and we all smile at it, but I wonder what we’d think if somebody said the opposite.\n\nLast night considerable excitement was caused by a number of bold spirits endeavouring to get ashore\n\nby climbing down the rope from the stern to the buoy to which we are anchored, and from these to \nth\n a Japanese steamer also anchored to the same buoy. After a while, however, this was blocked, and some placed under arrest.\n\nAll night, the search light from the North of the harbour swept far out to sea, and it is evident that every precaution is being taken for our safety. This morning another of the rumours so prevalent, went the rounds of the ship, and it was said that General leave was granted to all on board. However leave or no leave, a great number made up their minds to go ashore, and \nbo\n numbers of native boats left the side laden with troops, chiefly belonging to the 14th. Many others were stopped, but there must have been 200 or 300 who successfully got away. Of these some were arrested ashore, some got back without detection, others were arrested on\n\narrival, and so have been left behind. The last few hours were spent in gathering them in, boats remained around the ship to which ropes were lowered from friends on the ship, escapees were hauled in through portholes or scrambled up a rope to be \nhauled\n lost in the crowd immediately. There is consolation however in the fact that our battalion to a large extent stood out, and only a very few participated.\n\nSome lively scenes took place on shore. One incident \nis\n was particularly Australian. One man, when being arrested, turned on his captor, who despising the weapons authority had given him, threw down his rifle & bayonet and in turn waded in. A glorious mill followed in which \nthe\n authority was vindicated and a much battered prisoner marched off to the ship. During the fight moreover, which took place in the middle of the street, two\n\nsgts calmly waved the trams back, and regulated the traffic so no interruption took place.\n","17":" After laying anchored outside the harbour all night of the 14th we started during the morning of the","18":" Last night all lights were masked, and some excitement prevailed as we suddenly changed our course to the North. Rumours of all sorts were floating about, about strange lights, searchlights, and messages supposed to have been sent & received, but of what is true we know nothing.\n","19":" 1\n","20":" We are still travelling with utmost precaution, and all lights are masked at night time – really masked this time. Court marshals are in the air. Yesterday on parade, about 30 men appeared before the Colonel for breaking ship and all but two pleaded “Guilty” and remanded for sentence until we land. Most of them seem to think that they will get off lightly but this I doubt, but a lot will depend on their behaviour on the \n\nvoyage. Gambling has at last been caught, and the big drum major, a huge, sullen useless lump of a man, is under arrest. ","21":"\n It has been well known for some time that this man has been running the bank and has made about £100 out of the troops, and most of the decent chaps were glad that he has been caught. Our course is still Northwards, and we are going along the coast of India. Apparently to get to Aden we are making a big detour to get out of the regular trade route of steamers.\n","22":" About 800 miles from Aden after day with calm seas, and same old routine. – Another church incident last Sunday. The preacher was explaining how we lived from day to day – not knowing what the next would bring forth. For instance he said “you don’t know what we will have for dinner to-morrow – and as one man fully 100 men exclaimed out aloud “Stew.” And as they said so it came to pass.\n\n","23":" At Suez. In the last 8 days, we have passed Aden, anchored there a few \ndays\n hours, spent a more or less monotonous hour and arrived here. A little excitement was caused a day or so before reaching Aden, by the appearance on the starboard side of a grey painted ship, looking at first like a warship, & going the same way as ourselves. As at first she ignored our signals, the Sub AE2 which is still with us was ordered to attack unless she did so, & on her signals going up she proved to be an Indian transport off for the war also. Much dissatisfaction was felt going through the red sea, as every night the ports were closed & masked, and as the weather was fearfully muggy, to remain below became very unpleasant. Are the powers that be suffering from nerves.\n\nOne of our officers who was on shore at Colombo, has been telling us some of the particulars of happenings at that place. There can\n\nbe no doubt the troops behaved disgracefully, at least those that went ashore. Drink was of course the chief attraction, and as much of that obtained was evidently of not the best brand, in a little while many went mad. Some tore through the streets stark naked, women were mauled, and such was the conduct generally that the name of Australia will I am afraid be ruined for a long time. This is a great pity, and I cannot help feeling how much to blame the recruiting officers have been. I remember when I joined \nthe\n and later, the number of men who were obviously undesirables and yet who were passed into the forces. Men of the lowest type some of these, whose nature was so obvious, that I cannot understand their admittance. Many of these later became discharged, or as often happened when rejected from one unit, became transferred to others. Some deserted, but there are still many unfortunately in our ranks, and it is always this minority that is at the bottom of our trouble, for the great\n\nmajority are decent chaps, amenable to reason & reliable not to make either beasts or fools of ourselves.\n\nFrom Cairo comes the news that there is desultory fighting along the canal, and to prevent damage from stray shots, a barricade of bags of flour has been built on our bridge, but I don’t suppose anything will happen.\n","24":" \n All\n Most of the day we have been steaming slowly through the canal, and are now anchored at \nIshmalia\n Ismailia. The canal is held by some 20,000 troops, mostly Indians and New Zealanders, and all day we passed parties of these along the bank. Both sides of the canal are held, and the whole length particularly the Western side is strongly entrenched, while the various encampments are protected by wire entanglements, in addition to trenches. Many and varied were the cheers & greetings we got as we came by, and one party of New Zealanders gave us a most impressive war cry. From our own boat, came such inquiries as\n\n“Do you want any stew,” and “We can let you have a chief steward if you want one. In the canal we also passed three French warships and their crews led by their officers cheered most heartily. It must be good for them to see their allies coming as it were from the end of the earth. The Indians along the canal \na\n seem a particularly fine lot and consist largely of Sikhs, Ghourkas and Panjaubers – hill tribes. The trenches for the most part are cut in the top of the sand embankments, caused by dredging the canal, and command a good field of fire over the desert. How the Turks are coming over the awful desert looking country which lies to the East, goodness only knows, yet it is reported that \nNo Turks are\n three columns of the enemy are already within a few miles of Kantara to the N.E., and already there has been a small brush there in which four of our side have been wounded. The last French vessel we passed was named the Requin, and I was\n\nlucky enough to get a photograph of her. \n","25":" At Port Said. Another day spent along the canal. Last night an edict was passed against photography so have been deterred from getting a record. As in the more southern portion of the canal, \nthe\n both banks are strongly guarded, mostly by Indian troops, with Territorials & colonial troops interspersed. The railway runs along the Western bank of the canal, and at each station, a strongly fortified camp is usually situated on the other side. As a rule also windows exposed to the east are barricaded with bags of sand against possible rifle fire. With all the boats we passed similar precautions have been taken, and we passed also another couple of war vessels, of an old type, but still no doubt formidable against land troops. About midday, we passed Kantara, near where the fighting took place a day or two ago. This village \nwa\n is exceptionally well trenched &\n is\n together with wire entanglements would be a formidable nut to crack.\n\nAnchored almost alongside the shore at Port Said, it is hard to be still cooped on board, particularly as the \n\nshore is so close, & looks so inviting. \n\nThe town is a fine one, with many good buildings, & viewed from the water is very picturesque. All our chaps are very much interested, and hang over the side watching the niggers. No boats, however, are being allowed alongside, and the brisk barking of Colombo, Aden & Suez is absent, the traders with their boats full of cigarettes, Turkish delight etc, being disconsolately just out of reach.\n\nSome of our boys are along the canal. We know they were by the following incident. A short “What sort of place is this” from the ship was answered by “ A b----- b------ of a place. This was sufficient and it was immediately passed around that some of the Australians were amongst the guardians of the canal. There can be no doubting our own Native language when \nwh\n we hear it.\n","26":" At last we have reached our Port, and are about to land at last in a strange country. Alexandria\n\nis a white city, rising out of the sea, very beautiful indeed from afar off, but what it is like on acquaintance, of course we can’t say. Anyway all we have seen are numbers of Egyptians on the wharf alongside, and I can’t say I like the look of ’em much. Already the right half of our battalion has disembarked, and we follow I believe this afternoon, our destination being Heliopolis, 20 miles from Cairo.\n\nSome of our officers are absolute pigs, and have no idea how to speak to men. Of such is Major Ellis, a bundle of red tape, with a studied pose, and a fierce expression, that has evidently taken years in front of the glass to cultivate. I often wonder what such a man is in private life. This particular one, on one occasion at Broadmeadows, wouldn’t allow some extra tents to be put up for the men, who were fearfully crowded because they were of a slightly different pattern to the rest. And the pity of it is that the Colonel, who isn’t a bad-hearted sort if an awful messer, is largely led by \nthe\n such men as the Major.\n\nI can see the Newspaper articles of the future, “The Australians\n\nwent into action as if on parade. All was a state of horrible confusion.\n","27":" Heliopolis near Cairo. The impressions of the last two days are rather confused, but I will endeavour to extricate what I can from the confusion of ideas natural on entering a strange world. We entrained from Alexandria about 4 pm and in the two hours of daylight left, passed through some thousands of years of time. The intensely cultivated delta of the Nile, brings home how important this river is to Egypt, and yet looking out from the train, we might well be in a period some 2000 years or so passed. The indescribable groups of mud buildings covered with straw & all huddled into a heap, amongst which donkeys children, cows & goats seem indiscriminately mixed, \nmight\n with a few palm trees rising out of the centre & the whole covering \nf\n apparently about six acres- this constituted a native village – and might belong to any period in the world’s history. After an hour or so of this, darkness\n\ncame on to us and we saw no more. On arriving at some railway station near Cairo, a three mile march through the desert brought us to our new camp, at which we arrived about 1 in the morning.\n","28":" In the interval between this and the my last entry in the diary, many things have happened, and this evening offers the first opportunity of recording them. Our new camp is situated in the desert, the real unadulterated Egyptian desert, quite close to the modern city of Heliopolis, this latter place in fact being quite within bounds. The particular part of the desert we are in is stony, that is a mixture of \nst\n pebble & sand, which is I believe infinitely preferable to the real soft sand, which constitutes much of the Sahara, but still we are bathed in dust, we swallow it, it chokes up our eyes & noses, and already we are turned grey not with age or worry, but with a sort of immovable coating of this same universal substance. By means of native\n\nmats we have to a certain extent made our tents comfortable but still there is no getting away from the dust.\n\nAlready the heads are working us solidly, and six hours a day parade is enough for anybody, in fact it is rather monotonous. In the morning we do an hours physical exercise before breakfast, and this is rather welcome, as the nights are bitterly cold, and we have not overmuch blanket supply. \nBreakf\n The messes are held in sheds specially built for the purpose, one company to each shed, and this is certainly an improvement on the old system \nwhi\n and the awful scramble for something to eat is a thing of the past.\n\nAfter breakfast three hours in the morning and 2 hours in the afternoon, mostly spent on the new drill & organisation used in the British army. Then we are free, 20% to go to Cairo, the remainder to Heliopolis or stay in the camp. \n\nIt is a great pity to record, but I am afraid it is only too true, that the Australians have not earned a good name in Egypt, and as I have remarked before, apparently nearly the whole blame rests with the recruiting officers. Of this I shall have more to say later. \n\nHeliopolis is a fine town as far as architecture goes, and is only about ½ a mile from the camp, its fine white buildings rising from the desert itself. Apart from the shops, the remainder consists of private residences, and there are streets and streets of these, quiet & sedate, every building tall and of \nfine\ngreat architectural beauty. And here also are innumerable gum trees, small of course, for the town is only a few years old, but still reminiscent of dear old Australia, a real breath of home.\n\nBut Cairo is Egypt, and in my only two visits, I have already \nsee\n had more experience of one kind, than the whole of my life put together. The first night, two of us wandered and\n\nwandered through main streets and various lanes, into beautiful shops full of beautiful goods and into the most awful dens of vice it is possible to imagine. The wickedness of Cairo surpasses description, and there can be no doubt that \non\n many of our troops revel in it. \nOne of Going down\n We wandered into one place, a whole block which they call a bazaar, a sort of market in which one street, \nthe\n or rather lane, for they are only about 2 yards wide, with buildings several stories high on either side, was occupied by silversmiths another by goldsmiths, another by scent sellers etc. One of the latter, a venerable old man, showed us his wares and gave us an amber cigarette each. These which are very expensive, are flavoured with ambergris and I suspect drugs of some sort, anyway they are very strong and a few puffs satisfied me with mine.\n\nGoing down one of these narrow streets, a house fell down in\n\nfront of us, that is to say about 50 yds. There was immediately a wild rush on the part of the shop keepers to get their shutters up, and a blinding wall of dust came rushing down the street. Before we could get out we were enveloped in it, and very pungent it was as we fought our way out into wider spaces. I wondered at the time how many hundreds of years perhaps it had been accumulating there.\n\nThen we went down the various streets in which every house was a brothel. Girls in hundreds stood at the doorways, and the effect of red paint on brown cheeks was very \nhorrible\n hideous. It was hard work to get through many of these places, for the girls are very enterprising, and endeavour to almost drag one into their dens. \nA\n In many cases they are successful, and \non\n I saw one \ndrunken\n half drunk soldier with about six around him, loving & cuddling him, a by no means unwilling victim.\n\nHe was only one of many, and\n\nalready these places have done enough damage to our forces, as six months active campaigning could, for they are reeking with disease of the vilest description.\n\nCafes are innumerable, and in the lesser streets, their proprietors rush out and flourish their bills of fare under the nose of soldiers as they pass. In fact amongst all but the first class shops, this seems the custom, for in one place it is handkerchiefs that a would be seller flourishes wildly around, in another cigarettes, or walking sticks, or edibles, anything in fact. Everything is bargained for, which is to be expected in a land where barter is almost as much used as coinage. A gaudy \nha\n handkerchief about 5 feet square will be waved in front with a cry of “Ver goot” 10 piastres ( a piastre is worth 2 ½ d.) Then as we pass on unheeding – \n\nit will be 7 piastres, 5, \nand\n 3 and as we pass out of earshot a faint “two” \naj\n comes to us from the distance.\n\nWe witnessed for 1 piastre “The cancan”, a dance supposed to be very horrible, but I thought the whole performance too silly to be even disgusting. Two naked women paraded \nin\n with a sort of slow ungainly step around the room accompanied by the beating of a kind of drum or tom tom. In this place earlier in the evening I was told, one girl who had offended an Australian soldier in some way, had been most cruelly maltreated by him, and was even then in a state of collapse in the same building. Truly there are some beauties amongst us.\n\nAt our own camp, we have a good canteen, and at last we are away from wowserism, for\n\nbeer can be procured here for the humble sum of 1 piastre a pint. Lemonade is ½ a piastre so is a cup of tea, and it is possible to obtain quite a lot to eat for a few pence. ","29":"\n Talking of our own lot, there can be no doubt, that now drink is available everywhere, for every second place in Heliopolis & Cairo is a drink place of some sort, drunkenness is far less prevalent than it was, and the very fact of the abundance of liquor seems to do away with the desire.\n\nYesterday we visited the Pyramids & climbed to the top. For once in a way, I was not disappointed, because when one heres much of a place or thing, realisation generally fails to come up to anticipation. From afar we could see a steady stream of climbers, trooping like a line of ants on a wall, for yesterday was Sunday, and many of the troops had leave.\n\nIt is a long way to the top, and when half way up, it feels very nice to keep ones hand on the rock to make sure it is there. It is at this spot I was struck with the immensity of the affair, for even at this height the world \ns\n is spread at ones feet, and \nthe immensity of\n the bulk of the pyramid reaching downwards and upwards and sideways seems terribly huge. The view from the top I will not describe. Sufficient to say it is wonderful. How many armies have camped in its shadow. Visions of Marmaluke & Napoleon amongst the late ones, and now nestling right at its foot almost the long lines of tents of the First Australian E F. There is practically an army division camped in this spot, a \nhu\n considerable army at one period, but now a mere \nitem\n pawn in the great game of Nations which is going on. I wont speak of the Sphinx or the other sights,\n\nthey have often been deserted but soldiers were everywhere, piled on camels, riding on donkeys with natives running behind, walking, talking & even playing football on a green patch near the tram terminus.\n","30":" To-day I have been Batt Orderly Sergeant, and amongst multituding duties, has been that of giving an hours pack drill to various defaulters \nDispl\n Discipline is tightening, & in place of the old 5\/- fine, it is 4, 8 or even 24 hours pack drill. This means that after afternoon parade, perhaps a long march, these defaulters have to parade with full pack, rifle etc and \ndrill for","31":" up and down for an hour without a spell, commands such as “right turn” “left turn” “about turn” etc following at intervals of a few seconds. It is a most effective punishment, but takes practically as much out of the unfortunate NCO\n\ngiving it, as the recipients.\n","32":" A nasty, dusty windy day. I wouldn’t mention this except for the usual conduct of the battalion heads, the Colonel & Major Ellis. After church parade, the order was given. All tent flaps to be rolled up, and kits piled outside the tent door. This is supposed to be for purposes of hygiene, but as the dust is about 5 inches deep outside, the consequence is that the tents which were tolerably clean & neat before are now rapidly becoming filled with dust, clothes, blankets and gear is getting messed up with it, and all the men are thoroughly uncomfortable for the day. This laudable object achieved, our beloved? heads are no doubt happy. \nfor the day,\n And the NCOs are blamed that the men are discontented & grumble at the officers. There seems to be no petty way of bickering & annoying them that is not practised by the hopeless bundles of red tape\n\nwhich govern this battalion.\n","33":" It is well to sample every side of a soldiers life, \nconsq\n consequently a fortnight or so in hospital, is perhaps not an unmixed curse, certainly it is something of a rest. To corrupt Gilbert it might well be said\n\nTaking one consideration with another \n\nA Sergeants life is not a happy one.\n\nCertainly it is that we act as an everlasting buffer between the Officers and the men. No matter how nonsensical an order is, and with due respect, more than one have been well on this side, even to the limited intelligence of an N.C.O., yet ours is the job to see that it is done, and except amongst ourselves, ours is not even the privilege of growling.\n\nIf it is not done to the letter, ours is the blame, and if it is done, the men curse us, and \n\nseem to think it is with malice aforethought that we act. At the beck & call of everybody, first up in the morning, last to bed at night, always on the qui vive lest we do what we ought not to do, and the Pvt Smith or Jones says “Oh Sgt So-and-so does it, we’re alright,” in truth a Sgt earns his pay.\n\nBut this is by the way. The causes why this particular individual is in hospital have little to do with it, and are not of much importance, suffice to say an attack of Influenza & a temperature of something over a hundred, were deemed sufficient entrance fee.\n\nThe main or base hospital at Heliopolis is the Palace Hotel, and I don’t suppose under any other circumstances would a humble person like myself have an opportunity of staying in this glorious building, which when used as such is one of the biggest hotels in the world. Our ward is in the ballroom, a magnificent\n\nhall, with a great domed roof, with a clearance of fully \n100\n 90 feet from the floor, and a marble gallery, supported on marble pillars running round the four sides. Fine archways, beautiful carving & high pendant lamps, all with an oriental look about, \nmake\n have a most imposing effect.\n\nHospital life is I suppose the same everywhere, but I must pay a tribute to the care & devotion, with which the sisters look after their patients. Theirs is perhaps the most arduous work of all, and in the future, if we get to the front, they will have an awful time of it, but \neven now\n already they are showing how equal they are to the task, for the hospital is well patronised by the troops. Personally I never shall forget how kindly we are treated by the sisters, and in the hard thankless work of a soldiers life, my stay in hospital will be as an oasis in a desert, and we in\n\nEgypt are already beginning to know what that means.\n\nThis climate is not a healthy one, and the troops are feeling it. Perhaps living in the desert, with the \ncorresponding\n natural adjunct of a dust diet may have something to do with it, \nbut a great many men\n also a little bit too much work in the way of training, but certainly the percentage placed hors-de-combat by such things as pneumonia, bronchitis, pleurisy etc is rather light.\n\nHowever rumours are to the effect that next month will see us en route for somewhere, possibly France.\n\nField training is now advanced and is made up of Divisional training, in which the whole division is moved about to schedule times, or such things as bivouacs with sham fights at the end of them.\n","34":" There have been great doings in the land. Am out of hospital now and once more in harness. The last few weeks have been an endless succession of Field days, dealing with the concentration of the Division, sham fights between battalions or brigades, the digging of trenches, night attacks, long marches through the desert, and at last we are being given hints of probable departure. Nay more than hints, for from announcements by the Brigadier, it seems probable that early next week will see us on our way to ? It will be well if it is so, for the men are chafing at the delay and ofttimes are difficult to hold. Drink is very easily obtained and what with \n\nthe example of the already confirmed topers, drunkeness & its usual results is a bit too common Also venereal diseases are beginning to exact toll & in many cases it is the good men who are bitten. So action will have the effect of working off this looseness which is apt to prevail. The brigadier yesterday however complimented us on our turn out etc yesterday, and on the fact that we are considered sufficiently competent to be grouped with troops with much longer training. Our division under M\/General Godly, is at present constituted of","35":" Aust. L.H, NZ LH, NZ Inf,","36":" Aust Inf. Brigade (Bns 13 14 15 16), N Zealand Artillery, &","37":" Field Hospital.\n\nWork in this country is hard, terribly hard, the dry dusty sandy desert being very hard\n\nto march over, but the men on the whole are sticking it well & cheerfully, though sore eyes, bad throats & ears are rather common. \n\nSham fights have their funny sides, as indeed their make believe nature would lead one to expect. The varying state of enthusiasm of various officers is to a certain extent responsible for this. Our particular man, Capt Simpson is most keen, and his bump of humour is at times deficient.\n\nPicture to yourself the enemy sitting & lying at ease some 200 yards away, buying cigarettes & oranges from the natives who follow us everywhere. Our men in extended order blazing away at them as if the battle were indeed being lost. Every now & again came the order “At the troops on the left front, 2 rounds fire,” and away would go the rifles, but of all this\n\nthe aforesaid troops took not the slightest notice.\n\nThe marching of the","38":" Battn has been absolutely ruined by the Colonel. He has some absurd notion that we should take 18” steps and about 140 to the minute. As a result the long swinging step our men use naturally is always being broken into &has degenerated into a nondescript sort with nobody in step & varying \nover\n in \npace\n time every few seconds.\n\nAnother hobby of his is to march us to attention through the desert for miles, \noft\nat such times as after musketry etc. One day we had just gone past as the Brigadier noticed us & I heard him call Major Ellis over & say “Major Ellis can you tell me why those men are marching to attention” and at once it went down the line “March at ease”. But alas the Brigadier is not always at hand to save\n\nthe men unnecessary fatigue.\n","39":" A couple of days ago we had a board, not the wooden sort, unless heads count as wood, but a real military one to sit on a missing bayonet. This consisted of Capt Simpson Capt Herring & Lieu Marks. With great solemnity a couple of hours were spent in taking evidence, numerous witnesses were examined and when on the point of arriving at a momentous decision, the missing bayonet was found in a box on which one of the members sat. Really & actually & literally the board sat on the missing bayonet.\n\nPunishments are rather inconsistent, for instance Major Ellis when presiding gives punishments somewhat in accord with the offence, but the Colonel \nor\n “Claret” as we call him, has some queer idea. For one thing he refused to hear of the discharge of a man yet with the dismissal of about 20, 75% of crime in the battalion would be removed. The same few men come up time\n\nafter time, drunk, resisting arrest, absent from parade, refusing to obey orders, striking an NCO, etc, and every time it is a few hours pack drill, to which they are now becoming accustomed & a months gaol in Abassia would perhaps steady them but it would be well for the battalion if we could be definitely rid of them. \n","40":" We are still in Egypt, and as far as we know, there is no evidence that we are yet to move. Rumours are still in the air, in fact the air is full of them. Major General Godly has told his Officers that he believes we will be in the firing line in a fortnight, but he does not know definitely. Apart from this, we are still being hard worked, too hard in fact, and there is a spirit of unrest abroad. The programme as laid down is alright, that is to say, there are perhaps three divisional or brigade days in the week with night attacks, trench digging etc. The remainder are at the discretion of the C.O. and in the other battalions at\n\nleast one day is generally a holiday. But \nwhen this\n with the","41":" Batt. such opportunities are taken to march the men miles into the desert and double them over soft sand. When we do stay in on the other hand, it is still parades and the men are always being fallen in to have their feet inspected or to oil their boots and then they are kept hanging about for an hour or so until Major Ellis or some such johnny comes round to \nlook\n approve. Saturdays with the other battalions are always half holidays, but with us there is always a parade of some sort, and perhaps about 3.30 or 4, “Granny” as the men call Colonel Burrage says we can have half a holiday. Even our pay is never on time, and the others are always paid before us.\n\nThose me\n No wonder there is a state of unrest, in fact though the heads wont realise it the men are very near mutiny. Last Tuesday, the pay being as usual overdue, the men held a mass meeting,\n\nand spokesmen being appointed, \nthey found\n practically the whole battalion paraded & marched down in an orderly fashion before the Brigadier. Every thing was most orderly, in fact comments were made to this effect by officers who witnessed the proceedings, but nevertheless it does not reflect great credit on the heads. The result was that \nthe\n after Col Burrage had been sent for, the Brigadier promised that the men would be paid next day, and they marched off satisfied. They were paid, but with the added confidence gained by their success, the spirit of unrest grows. Sickness grows too, the men are being worked too hard, and if the present state of affairs continues, they will be badly wanting a rest just as they embark on perhaps the hardest campaign of their lives.\n","42":" Last night I met rather an interesting personage, in the form of the son of Gen. de Wet of S African fame, & now a private in the","43":" Battalion AIF.\n\nThis yout\n This young chap has had rather an interesting career, for after the conclusion of peace, owing to the continued bitter hatred borne by his father towards the English, he went to England & had four years in the Leicesters, & after buying his discharge returned to Australia. His final severance with his people took place over his marriage with an English girl, and finally he joined the Australian force to fight with his former enemies. It was very interesting to hear the exchange of reminiscences between Sgt Morrison & young de Wet – who by the way does not bear this name regimentally. Morrison himself has had an adventurous career and was the commandant who brought de Wet in on the occasion of his surrender. He remembered young de Wet well and it was curious to hear such things as “You gave us a bad time of it – or “We captured your transport at such and such a place. De Wet related\n\nhow once when he and some comrades were making coffee, a British 6 lb shell \nknock\n came & knocked all the cans etc off the fire. They did not wait for more. Another incident: – On one occasion they caught an Australian knocking the gold teeth out of his dead comrades’ mouths with a bayonet. When captured young De Wet was for shooting him but the old man let him go. No doubt some of the reported atrocities of the Boers were occasioned by incidents of this kind.\n\nOn Monday our division was reviewed by \nthe\n Gen Birdwood and the High Commissioner for Egypt. Out in the desert looking round, the long lines of khaki troops gave one impression – they looked eminently serviceable. Our clothes are not \ngoi\n well fitting and are now very shabby, but the men themselves alongside the little Territorials look veritable giants, and moreover they are as they\n\nlook extremely tough & hardy. Trench digging is one of the things we excel at and our battalion can I believe \na","44":" a little more than hold its own against the others, but all the Australians can dig & dig rapidly & intelligently. And march – I doubt if any troops anywhere will beat the rapid untiring swing our chaps get up over the soft sands of the desert.\n","45":" A horrible report in the camp to-day. One of the numerous monkeys kept as pets in the camp is great pals with a puppy \nto-day\n, and I am afraid the terrible fact is beyond dispute, that the puppies youthful & chaste innocence was in the presence of several disinterested and unbiassed witnesses, rudely & shockingly violated. The accused was at once placed under arrest.\n","46":" Last Monday we were reviewed by Sir Ian Hamilton, and my impressions of the old soldier, were of a little wizened man on a big horse, with a habit of stooping forward & driving his questions home with great vigour, and a keen glance that wandered everywhere & seemed to take in everybody. On Tuesday we departed from our usual routine & went forth into the country. After the dry dust of the desert everybody greatly appreciated the change. Through long avenues of green trees & even Casuarinas, the long khaki line threaded its way, and the scent of the \ngre\n eucalypts was a real breath of home. We halted amidst a group of native villages, the dirt of which was indescribable. Mud walls with a roof made as far as could be judged of straw, no doors but just a \nw\n hole in the wall, and the inside apparently a mingled mass of human beings, fowls and \n\n (a poem inserted here)\n\nRations (Tune Wee Doc & Doris)\n\nThe brigadier gets turkey\n\nThe colonel he gets duck\n\nThe officers they get chicken\n\nWith a little bit of luck\n\nThe sergeants the get eggs\n\nSometimes a little ham\n\nThe poor old b----- private\n\nGets bread and b----- jam.\n\nPrayer of the troops\n\nOh Lord if its within thy power\n\nPreserve us from the far third tower\n\nAnd if it be within thy hands\n\nPlease keep us fro off the desert sands.\n\ngoats. Everywhere we go, we are accompanied by a sort of second line of transport in the form of hundreds of natives who sell oranges (4 for 1 piastre), lemonade, chewing gum etc. These follow us for miles through the desert carrying sometimes big loads, and it is rather funny the persistence they display in selling their goods when we halt. They are not allowed in the lines and somebody is generally\n\ntold off to chase them away. \nIt is\n This is usually done with a stick or whip and it is nothing unusual to see a dozen scared natives fleeing before an irate sentry, while others take the opportunity to sell their wares on the other side.\n","47":" \n For Easter Saturday Last ","48":" Yesterday we marched out for many miles into the country, and bivouacked amidst a large grove of palm trees. Apart from sand, through which we had to march many miles the trip was a very enjoyable one, for in the evening the band came out and gave us a concert. It is funny to see the old ploughs, & the primitive water wheels, for methods of cultivation have apparently not changed for \n2000 yards\n thousands of years.\n","49":" This day was given to trench digging, an operation for once most enthusiastically carried out. The reason for this was due to the site chosen for the training, an ancient burying ground last used during the Roman\n\noccupation some 1500 years ago. The whole ground was honeycombed with tombs, and the trenches \nwer\n in many cases cut through the old graves, for every now & again human bones, sometimes very well preserved. As a rule, however, time did not permit of these being properly explored, but a number of porcelain beads, a ","50":"\n porcelain doll or two, and a few human teeth were carted away as relics.\n","51":" night saw a serious note in Cairo, particulars of which \nare\n being based on heresay, are rather fragmentary. As far as can be judged, the trouble began as usual in the \ndemimonde\n under world, and a crowd of some hundreds of soldiers, for what reason goodness only knows, commenced to wreck some houses. Wardrobes came crashing through windows some stories up & smashed in the street below, bedsteads, furniture of all sorts all came hurtling down, and were piled in a heap \non\n in the centre of the street. This was then set on fire & the fire brigade was called out.\n\nBut the rioters not to be denied, drove the engine off after cutting the hose. Eventually order was restored by the prefects after many attempts, but not before several shots were fired, and at least one man was killed & several wounded. About 50 were also arrested, but apparently the","52":" at anyrate was out of it, for we have missed none of our men. It is a great pity for the name of Australia, but it is a comfort to think that there was a goody proportion of New Zealanders & Territorials amongst the crowd, & the blame is not wholly ours.\n","53":" The camp is anxiously awaiting marching orders. It seems to be a bit more than rumour this time, for the officers have all packed, likewise the PM stores are all in boxes, & everything is ready for moving at a moment’s notice. So far the date expected is Thursday at midnight, (this is Wednesday morning) & the fellows are much incensed that they are not being given a spell, but are being made to go out on parade\n\nand do ceremonial drill, and this within possibly a week of the real thing. The first man in our company to go, passed out yesterday at dinnertime from pneumonia, a very decent chap too, and now everybody seem to have a little thought stowed away somewhere, as to the probability of a good many of us following him within a week or so.\n","54":" At last there is a date fixed & early on Monday \nmornin","55":" morning, that is the day after to-morrow will see us en route for the war. It seems a time to sort of recapitulate impressions of Heliopolis & Cairo. In one way our going will be a blow for Heliopolis, for our stay has sort of roused business a bit, and evidences of our occupation are everywhere, chiefly in the form of restaurants. \nNear\n Between the camp & the town, on the \n\nintervening desert a veritable street of mushroom shops has sprung up, \nchiefly\n mostly barbers, soft goods stores, an odd ice cream place, chemist, photographer & such like. In the town also, & likewise in Cairo, it is nothing but places for soldier. On either side of the main street in Heliopolis, it is one succession of such names as “United Kingdom Boot Polishing Saloon” “Great Britain Tea & Grill Room” “Triple Entente Stores” “Heroic Belgium Café” “The Great Restaurant Kangaroo” “The Allies Saloon” & so on while \nmore than\n at least one enterprising tradesman has blossomed into poetry – \n\nThe British ever to the fore\n\nHere you’ll ever ask for more\n\nBe it eggs or be it ice\n\nEverything within is nice\n\nOr else they by flattery for instance \n\n“Australia for ever”\n\n“Australia will be there, never fear”\n\nThe term “Special prices for soldiers”\n\nat first rather a lure is now taken \nsometimes\n somewhat ironically, and indeed in many cases are the prices special – in fact I believe it is the case that many articles have doubled in value since the arrival of the Australians, due no doubt to the freedom with which our chaps spend their money.\n\nArabic will not I am afraid be introduced to Australia per medium of the troops, but a few words have stuck & no doubt will be added to our vocabulary chief of these is Emshee meaning “Go” or better still “Emshee yalla” meaning ordinarily “Go quickly” but the way our chaps say it, it generally means “Go to------,” for whenever we leave the camp life is one long incessant “Emshee” due to the pestering of the hundreds of bootboys, beggars & hawkers who won’t take no for an answer unless made with great emphasis, and a wave or two of the stick.\n\nFlags abound everywhere in Heliopolis & Cairo, most of the restaurants sporting some outside the doors,\n\nUnion Jacks, French & Belgian predominate.\n\nTo day we packed all our gear and now are ready for the start.\n","56":" Tomorrow night has now definitely been fixed for our removal, and as usual our beloved (?) head is celebrating the occasion by keeping us to the last minute drilling. The men need to rest but still it is the endless round of parades, 7 to 7.45, 9.30 to 10.30 & 2.30 to 4.30 pm, and this in spite of the fact that the medical authorities have recommended that the men be rested between 11 and 3. It would probably be a surprise for the Colonel & major both if they knew what the men thought of them. But still here we are, in a broiling vertical sun in clothes intended for the Antarctic, drilling away as if we were new recruits, instead of men on the brink of a big campaign & badly in need of a day to write letters, wash their clothes & rest. It recalls how the colonel on the brink of departure from Liverpool refused the men leave\n\nuntil they took it & how he kept back their pay in Egypt until they paraded before the brigadier for it, how at Rosehill & Liverpool the men weren’t even allowed a Sunday afternoon off, but even the sermon was cut short to allow extra battalion drill before dinner. Luckily the men are a good lot, but judging by the remarks being now passed around me, their colonel & major are absolutely despised. Well may we be called Bill Burrages circus. Everyday here our operations remind me of :– \n\n“The king of France went up the hill\n\nWith twenty thousand men\n\nAn when they reached the top,\n\nHe marched them down again.\n","57":" 1 a m in the morning. At last we are in the train waiting patiently for it to move. The day has been one of bustle, the packing & stowing of bags, overhauling equipment, rolling blankets & downing tents, and we are off. The Light Horse are very sore but our chaps are in great heart, and for the first time I heard\n\nthe quarter before the final parade cheered. \nIn\n Everybody was waiting about at 8, the hour we moved off, and there was a general rush for equipment. In spite of this at the last moment two men missed the bus in my platoon, & their places were filled by reinforcements. They turned up before we left very drunk but terribly anxious to go, but in spite of entreaties were not allowed to go.\n\nAs we marched through Heliopolis towards the station the whole town turned out, and in one place a large French tricolor dipped to us as we passed & our chaps cheered enthusiastically. Everybody is bucked by the immediate prospect of active service, and special precautions had to be taken to prevent Light horse & others slipping in & stowing away to get to the front. For the last few days troops have been continually moving, & the trains have been taxed taking them to Alexandria. It is now an open secret that \n\nour destination is the Dardanelles, and that we are part of an army containing 40,000 or 60000 French, & many English troops to act in conjunction with a Russian army moving from the other side. \n","58":" Were off. Last night we bivouacked on the wharf alongside & a nice mess we were in in the morning. The whole ground was coal dust and with a heavy dew, everybody was decidedly grimy this morning & much chaff was occasioned thereat. Alexandria from the waterside is now a decidedly inspiring sight, and is packed with shipping, French, Australian and British transports for the most part. Dozens & dozens of steamers, great liners, old tramps, all sorts & kinds of ships all intended for troops were on every hand, and the big letters F 12 \n\nB 19 or A 39, showed the nationalities of the transports. Ours, the A 33 is alas an awful affair; very different from the sumptuous Ulysses we came over on, but as we are now embarked on the real thing nobody minds. She is the Ascot, an old\n\ntramp steamer of perhaps 5000 tons burden. Into this something over 1000 men and about 300 horses are crammed and certainly there is not much room for moving about. The horses moreover have the best quarters, that is to say the \nde\n main deck and the deck below, while the men are one layer below this. Our quarters are in one of the after holds, two stories from daylight, and into the small space of this some 219 of us are jammed. \nTo\n Moreover the iron decks are greasy & unclean, and the deck above is leaky, so that in some places there is a continual trickle of horses urine. Tucker now consists of biscuit and bully though we get tea every meal, and some jam and cheese.\n","59":" We are now in the Aegean sea, with land in view on either side. Our first port I believe is to the Island of , where we are to call for orders. The last two days have been very uncomfortable particularly as a choppy sea has caused a few meals, including my own to be lost overboard. There\n\nis no room on board for anything, and generally life in this transport is anything but pleasant. In spite of this the men are quite cheerful and there is no grumbling. There seems to be a general feeling abroad that \nthe\n now we are embarked on the real thing minor discomforts don’t count. On board our transport are three companies of the 13th, B, C & D and the","60":" Army Service Corps. Of course it is an absolute impossibility under the circumstances to keep clean, yet the Colonel complains that the men are not turning out spick & span. Yesterday each man was served with 200 rounds of ammunition, and we are ready for anything.\n\nAll day we have been steaming through the Aegean sea very slowly. Past the Island of Rhodes, then some open sea, and up to nightfall past numerous monotonous islands. One only wishes one had a knowledge of Grecian mythology, for the names of Crete with visions of Theseus and Rhodes with the Colossus, make one realise that probably\n\nevery one of these islands has its numerous legends and myths, for these are the waters Ulysses sailed to say nothing of various Grecian heroes. The islands are all steep & mountainous, with occasional red roofed houses nestling into their sides, and are all cut into by narrow precipitous ravines. Further details we \ncould\n were never close enough to see, but I would give worlds for a few hours ramble over their steep sides.\n\nOur pace has been gradually slackening on this old tub of ours, and it transpires that the crew of Greek firemen cannot keep a proper head of steam on. Consequently a call for volunteers has immediately filled the stoke hold with a new crew, and we hope soon to make better progress. It has been heartbreaking to-day, to see the way we were overhauled by two other transports, for they passed us as if we were not going at all.\n","61":" To days orders are out, 4 ½ pages of them, and as is heard on everyhand. Hullo! The Circus is going to perform again. But it seems criminal the way the men are heckled & worried. Within a day or so of probable action with the enemy, and after 8 months of strenuous training, we are again to be given endless parades. From 10 to 4.30, once more the endless lectures on musketry and a hundred other subjects read for the most part from the F.S. Regulations. The men are fed up. They are not unwilling, as shown by the readiness with which they volunteered for service in the stokehold, but this useless worrying is destroying their patience. If it were not for the prospect of immediate action, there would be a mutiny, in fact I cannot but help hearing that there is talk of counting the colonel out at this mornings inspection. Personally I hope they do, though being a Sergeant, I am in honor bound not to say so aloud.\n","62":" Yesterday for some reason or other we made a big detour to the west, almost to the Greek coast,\n\nand this morning finds us in the harbour of the Island of Lemnos, which we have approached from the West. \nAll\n Last night, \nwe\n no lights at all were allowed on the ship, and much confusion was occasioned finding places in the dark hold. The harbour is absolutely full of warships and troopships, a most imposing sight. Near us one British warship the Agamemnon is doing repairs to one of its \nfull\n funnels which is slightly battered & gaping in one place. The entrance to the harbour is barred across except for a narrow passage with \nbuoys\n a line of buoys, which we can but surmise is a line of mines for protection from submarines & suchlike.\n\nThe true facts about our scare last night are to hand. Troopship B 12 which is close to us had a very narrow escape. A Turkish torpedo boat, which somehow got out was waiting for us \nand sigh\n (that is the transports generally) and sighted the B 12, firing three torpedoes at her. ","63":"\n Luckily Turkish marksmanship is not so good, and she escaped, after sending out calls for help which were answered. Unfortunately in the scramble for the boats, which were ordered out, some 50 men were drowned. Immediately all\n\ntransports in the vicinity changed their course ourselves included. Later we have heard that the destroyer paid the penalty, and was run ashore, so she won’t do it again anyhow. \n\nLast night as we lay in the dark, the following strains were heard to the tune of “Onward Christian Soldiers.\n\nOnwards ragtime soldiers\n\nFed on bread and jam\n\nFor our b----- colonel\n\nWe don’t care a damn.\n\nSee our gallant major\n\nStrutting on ahead,\n\nAnd our only prayer is – \n","64":" God strike him dead.\n\nChorus: – Onward etc.\n\nThis mor\n To day has been \nto\n a busy one, and all hands have been bustling – doing nothing. All blankets had to be rolled & and have been removed & stowed in the holds. Now at 3.30 pm comes the order\n\nAll blankets to be taken out and distributed. The attitude of the men is now a sort of amused contempt as they obey these orders, though some have not yet lost the habit of swearing at useless orders.\n","65":" Still in Lemnos Harbour, but I believe we are to sail at midday, and will probably land tonight, maybe under fire. The circus has been \n\nperforming as usual during the last three days, but yesterday afternoon it relaxed a bit, and the boys were allowed ashore for a swim. The ships boats have been in the water since our arrival, and are somewhat waterlogged, but 35 to 40 men crowded in each & with great merriment made for the beach \nso\n a few hundred yards distant. I think the outing did everybody good to say nothing of a wash. Personally I was a bit late on the spot, and apart from the crowd splashing about in the water, the first sight that greeted my eyes was \nth\n a long row of serious men sitting each on a rock with a shirt or pair of trousers on his knees and patiently searching for – yes we’ve all got ’em, for the few that managed to keep clear on land have no longer done so in our crowded quarters.\n\nAs may be imagined “Lights Out” is a cause of some noise and amusement in our crowded hold, and the late arrivals from deck, stumbling over their recumbent comrades often occasions somewhat sulky ejaculations. At times on some mysterious impulse the men break into a wild outburst of cheering app\narentely\n arently with the same idea\n\nof making a noise, at times it is a chorus of one of the popular airs – there are only about four or five of these that the crowd catches on – apart from “Tipperary” & “Australia Will be ther”, maudlin songs sung with the peculiar nasal intonation, supposed to be so expressive! As a rule, the noise soon dies out, and except for the thumping of the horses hoofs overhead, quiet more or less reigns. One fool of a young officer, noted for his officiousness, came down last night & tried to stop the noise, but was greeted with a loud outburst of laughter, catcalls and other things. The silly incident might have caused trouble only our skipper, who is a quiet old chap with a dry quaint humour of his own, \ncame and is\n which makes him rather popular with the men, came down & asked the boys to settle down which they soon did. It is hard to anylyse feelings at this stage, for we are probably on the eve of a big engagement, in fact General\n\nBirdwood refers to it in a circular letter to the men as one of the hardest problems, military or naval, faced in modern times. But everything goes on as usual, and I don’t think, in spite of the fact that things are discussed pretty minutely including what the Turks will do to any they capture, that the fellows quite realise \ntht\n what the life and death of Active service means, and the insecurity of each individuals span on earth. It is always the other fellow that is going to get shot, the fact that a bullet might get oneself in a vital spot is somehow inconceivable.\n\nThursday 22nd April 1915 Still in Lemnos. The last two days, it has been blowing very hard and evidently the weather is not suitable for our \narrival\n landing. Every morning we roll our blankets ready to put them in the hold, for they don’t go ashore with us, and we could now leave the ship at a moments notice. The load a soldier has to carry is an enormous one. And we are prepared when we land to do without transport of any sort for at least 3 days,\n\nbut possibly it may be a week. In addition to the ordinary 150 rounds which our equipment carries, 50 extra are carried in a special bandolier, the haversack is bulged with rations expected to last at a pinch 4 days, water bottle full, the pack is itself no mean burden, and on the top of it we must carry \nfirewood\n a bundle of firewood. This with rifle & possibly a pick or shovel will make a huge load, and I am afraid we won’t be able to march too far with it. The weather has quieted down, but I believe the glass is still low, and evidently we are not leaving to-day at anyrate. Washing is a matter of considerable difficulty on the Ascot, for the water is only on during certain hours and though there are about 20 taps, water will only run out of \nthem\n about 10 of them. Consequently 6 a m sees a long string of men waiting for the taps to run, & great is the bustle to get a little water for a wash. Greek bumboats are now\n\nallowed to approach, and a great \nsale\n business is effected. The result is that our biscuit & bully is supplemented by bread (at 1\/- a loaf) figs, nuts, raisins, Turkish delight, etc. The figs in this part of the world are threaded like beads on a long strand of tough grass & are very good. They cost about 6d. a lb.\n\n23rd Apr 1915.\n\nForce Order \n\nSpecial\n\nGeneral Headquarters\n\n21st April 1915\n\nSoldiers of France & of the King!\n\nBefore us lies an adventure unprecedented in modern war. Together with our comrades of the Fleet we are about to force a landing upon an open beach in face of positions which have been vaunted as impregnable.\n\nT\n\nhe landing will be made good, by the help of God and the Navy, the positions will be stormed, and the War brought one step nearer to a glorious close.\n\n“Remember” said Lord Kitchener when bidding adieu to your Commander, “Remember, once you set foot upon the Gallipoli Peninsula you must fight the thing through to a finish.”\n\nThe whole world will be watching\n\n \n\nour progress. Let us prove ourselves worthy of the great feat of arms entrusted to us.\n\nIan Hamilton\n\nGeneral.\n\nThe above is a copy of the printed order read to the troops this morning. I wonder how prophetic it is. We are still in Lemnos, though the weather is beautiful.\n\nHow changed the personel of our force is. We have been in no engagement, and disease has not been remarkably prevalent, yet of the old company which formed originally in Rosehill, I don’t suppose more than 2\/3 remain. After the first general weeding out, it has been a case of a man here & there. An occasional discharge, one or two accidents, a few from sickness & even the morning we left Melbourne a desertion at the last moment, all these have been replaced by reinforcements. \nEven\n Again later in Egypt, a few from \navoidable\n venereal disease, a few from other sickness, & again at the last moment, two\n\nmen who turned up late & drunk & whose places were filled, caused other alterations. They come & go & are forgotten a day later except when after “Lights Out,” in \nconversations\n nocturnal we recall the old faces and often try to recall names, & wonder what has become of the old faces. Even here we are not exempt, for amongst our NCOs only, one sergeant gone to hospital with a bad ear, another with a poisoned hand, another with a broken arm, have caused vacancies. Another in Egypt gone to take a commission in the British Army, and so on. There will be other vacancies no doubt, in a few days, but day after day slips by & we are still here, still in suspense as to what lies before us, and at this time comes a mail, letters from home, and hundreds of men retire into corners to read from mothers & sweethearts, things which make one very homesick. \nIt is\n I hope it will be better later, because though one doesn’t let on much the suspense makes one very susceptible to sentimental influences & makes the heart ache a bit at times. I notice there is very little shame or shyness amongst soldiers \n\nwhen referring to love affairs, and no hesitation in admitting that such & such a letter comes from “the girl,’ nor of the pleasure it gives.\n\n25th April 1915. Off at last. For the last two days transports have been slipping out one by one, \nand\n occasionally passing near enough for us to give them a cheer, and by now no doubt the invasion of Turkey has begun. Amongst the last few come ourselves, and we are wondering what will be left for us to do. Somewhere on the southern portion of Gallipoli we are to land, and I expect in an hour or so, we will be told exactly what we are to do. Meanwhile we have been lectured & lectured as to what we are to do, in what order we are to land, and particularly how careful we are to be of tucker & water, for once ashore we may get nothing for a week. Everybody is exchanging addresses, and cotton wool has been issued to save the concussion of the big guns, for if we go into action immediately it means that the guns of the fleet will be thundering overhead until we almost reach the enemies trenches.\n\nOur going has not been unmarked by incident, for two of the bumboats which were doing business until the last moment, got foul of our propeller, and were chopped up. There was much excitement & the \nbulwarks\n rails were crowded consequently I did not see quite what happened, but I believe two poor beggars were drowned. Anyway here we are on our way, with the band playing, and no thought, though it only happened a few minutes ago, of the poor devils we have \n\n2 pm. We can hear the guns, a low booming, though they are probably a good 30 miles away. \nEy\n Everybody says “Hear that,” but nobody seems to worry much.\n\n4 pm. We are in sight of the bombardment at the mouth of the Dardanelles, though a long way off. It is a beautiful warm afternoon, the sea is dead calm & blue, Oh! so blue. Away in front of us and to our \nright\nleft, lies the low shore of Gallipoli Peninsula, with the \nentrance\n higher land of Asia Minor, extending away to the right. The coast in the centre is all covered by a haze of smoke, out of which it is hard to pick the battleships, somes of which are almost out of sight within the entrance. The roar of the big guns is incessant. In the far distance, the ships seem to be very pigmy and magnificent, but where\n\nthe shells are landing it must be somewhat of an inferno. Through the glasses a little more is discernable and I saw one shell burst on the top of a ridge, lifting as it seemed to me the whole top off. Some 30 troopships along the shore are no doubt landing troops but we are too far off to discern details.\n\n6 pm. Steaming up the coast some 9 miles to the North of the above, we have come on our own objective, & can now watch two bombardments at once. At about a place called Fisherman’s Hut, all our own transports have gathered, & some are already landing troops. Nearer to the shore & all along the coast belching out shells, and after the flashes which we can see quite plainly follow many seconds later the reports, and away up on the hills the explosions. The coast here is rather steep, in fact the hills tower above the beach, and a number of Torpedo boats are firing shrapnel. We can see it burst, but of course are too far away to judge results.\n\nAs far as can be judged, there is no answering fire & the pontoons laden with troops are effecting a landing without opposition. A little later: – the bombardment has now ceased from the big guns though shrapnel is still bursting along the hill top.\n\nAbout dusk the firing again became very heavy, and it was a wonderful sight to see the hillside literally swept by shells, while the thundering of the big guns was almost intermittent. Troops were still going ashore in loads on Torpedo boats of which some half dozen are operating, and from the bridge came the report some were having a rough passage. We can’t ascertain what return fire there is, but we could see several shells land between the boats going ashore, and several plumped into the water about ½ a mile shorewards of us, sending colomns of water into the air. About 11 pm, it is nearly our turn for a torpedo boat is alongside & we are standing by ready to go aboard, but I believe a lot of the \nreal\n preliminary work has been done, and the hill is now occupied by our troops.\n\nEverybody is in the best of spirits and joking & singing in the troop deck.\n\n26th Apr 1915. 12.30 a m. Still on board, though B & C Coys have gone. For the last three hours firing has been \nfi\n very fierce over the hill at periods of 20 minutes or so, and the distant rattle of musketry is making everybody very keen on getting to it. Evidently the Turks are making terrific efforts to regain their lost ground. Over to the right one warship keeps sweeping one patch of ground with a searchlight, backwards & forwards always over the same area. This is a place where the big guns were firing this afternoon, and there is evidently a \nbattle there\n battery or so there. Interspersed with the rattle of musketry is the more continuous roll of machine guns, but whether our own or the Turks it is impossible to say. Amongst the men is a sort of suppressed feeling of excitement, but there is much chaff about cold feet, and in one corner of the troop deck one group playing cards are apparently oblivious of everything but their losses & gains.\n\n6 a m. We’re ashore, a rather weird landing. In the dark we filed downwards into a Torpedo boat destroyer, some 200 \nyards\n of us, and silently slipped through the water towards the shore. Everybody was very quiet, and also a little damp, for it was raining. As we passed ship after ship of the transports it got lighter & lighter. Closer into shore we transhipped into boats & a string of us towed to the beach where we landed. The beach presented a busy sight. In front the clay hills are partially covered with bushes & amongst these the troops are being concentrated as they land. Lines of pack mules laden with ammunition, red cross men, smaller units filing into their places, everything busy but no bustle & no confusion. A few wounded men are on the beach, & a pair of boots poking out of a bit of sail shows that we are in for the real thing.\n\nWe are now on the side of the hill, but as I write this, there is a scream overhead, which makes everybody duck, and a shrapnel bursts a few hundred yards in front. This continues for a while, and it is wonderful that though the water is crowded with boats nothing is hit. We are now hearing\n\nstories of the fighting yesterday, and it must have been pretty warm, to judge from all accounts. As far as can be judged the \nboa\n first boats landed yesterday morning under a heavy fire from \nthree\n shrapnel & three machine guns on the beach. The enemy apparently expected us to land further north for they had a howitzer battery there. Anyway our boys fixed bayonets in the boats, and jumping ashore waded straight into the enemy. \nwe\n They lost heavily but more boats coming in \nthey\n stormed the hill under cover of the \nenemies\n warships guns & got the Turks on the run for a mile or so, but like many other engagements of this sort they overeached themselves & got cut up some by shrapnel. The \nwarships hav\n firing line is now about a mile ahead, and the rattle of musketry is incessant ahead. The warships have now commenced firing again & the roar of the Queen Elizabeths guns, which is \nof\nletting go is terrific.\n\n8.45\n\nWe are on our way to the firing line up a road cut by the Engineers in the side of a hill, & are stopping \nsom\n half way up. \nA I f\n As we sat down a little buzz overhead made me\n\nlook up to see what insect it was \nthere\n but nothing was there. Then some more \nbut I d\n and it was some time before I realised that they were bullets not insects. Stretcher bearers keep passing us on the downward track bearing limp forms, some inert, others quite cheerful with perhaps a damaged leg or so. We have met many isolated soldiers looking for their battalions, and about a dozen of them have all stated that they are the ","66":"\n sole survivors of their respective battalions. But the \nworst\n","67":" particularly I believe caught it very hot, and there can be no doubt that their achievement was a very fine one.\n\n11.30 Up in the firing line. It has been a long way. Right up a long winding gully with steep hills on either side, with shells screaming overhead. Just as we left the beach, a shrapnel shell from somewhere on the right burst just above where we had been sitting, & there was a general scatter of the troops near. Right up the valley, past numerous stretcher bearers all bringing burdens to the rear. Somehow I don’t feel ","68":"\n scared\n\nor even exerted though the concussion of the big shells almost knocks one down. Some of the stretcher bearers have caught it pretty hot. One showed me his pocket book with a hole clear through, pretty close. Eventually we had orders to reinforce the left flank, and in the winding valley it was hard to say where to go. Anyway we started climbing a steep hill to the right & hard work it was, and when near the top, suddenly shells from our own warships started to burst right amongst us. I saw one of our chaps get picked off his feet & rolled down the hill by one from which we \ng\n all got a dirt bath, and a young chap called Weedon in our platoon got hit by a piece of shell or something in the arm. Everybody beat a bit of a retreat & in the excitement got separated. Wandering on & up I at last got near the firing line, only to get the same experience. This time\n\nI saw a man lifted fairly into the air by a shell & hurled down the hill. What happened to him I don’t know, but \nI\n somebody said he wasn’t badly injured.\n\nAt last by frantic signal \nwas\n a signaller passed word of what was happening on, and now our own fire is passing just nicely overhead onto the ridge where the Turks are. The line is rather crowded so I have made myself a comfortable little dug out beneath the crest & can watch the enemies shrapnel bursting over near the beach.\n\n5.30 p m. Still alive. It has been a very trying day & my head is throbbing with the firing & concussion of the shells. We are much troubled with snipers who find their way in on our flank. A few minutes ago, a poor chap along near me to whom I was talking stopped one in the ear. He isn’t dead, but very nearly so. Another time a shrapnel, I think a chance one, caught four of our chaps just in front of me. All are badly wounded one or two I am afraid fatally. They were pretty smashed up, three of them in the head. \n\nThe machine gun man who is just alongside me now, had his periscope smashed in his hand, but wasn’t touched. All I got was a shower of dirt. Away in our rear, the Indians tried to get a mountain Howitzer up a steep path, but I saw one shell hit it fairly and bowl it down the slope. \nWere\n It has been touch & go on our left flank, across a steep valley, several times, and our fellows have been forced to retire, but reinforcements arriving have made their way back. This is a good thing for us, for if they get that ridge & enfilade us, it will knock most of us out. At present three of us are jammed together in a small trench right on the crest, and when not firing keep our heads pretty low, for the bullets whiz without cessation just above our head.\n","69":" It has been a trying night, and a trying day to follow. Last thing we saw last night was our chaps charging across a plateau to our right. \nand it\n Across a green patch in the centre of this we could see the lines of men in extended order double & the setting sun reflected gleams of silver from the bayonets.\n\nShrapnel was bursting above them the whole time, and I am afraid \na g\n they have had a very bad time. From 6 to midnight we got what rest we could, but cramped in a trench there is not much room to stretch. From midnight to 6 we were in the firing line and now we are busy improving our trench against \nsh\n possible shrapnel. All night long \nwe\n fire continued, and the whiz of bullets overhead is very insistent. \nWe\n The Turks are only about 100 yards in front, and in the intervals between firing, we can hear them talking. The still moments between the bursts of rifle fire are weird, & eyes & ears are strained for traces of the enemy. One dead Turk is about 10 yards in front of the line, & his knapsack is just discernable if we look over. We are fairly secure against shell fire here, but it is a solid strain. It is now 48 hours since any of us had a sleep, and it doesn’t look as if we’ll have any for another 48. Another man hit in the same place as the one yesterday. The enemy now has a machine gun in the line opposite us, and its rattle adds to the volume which fly over us.\n\nWater is likely to be a trouble for firing is dry work. Luckily we were able to get some up in tins \nso\n this morning & our bottles are now full. News has come of some of our chaps. Poor Jack Copland an awfully decent chap in my battalion, a \nSco\n tall Scotchman & one of my good men has gone. Sgt. Morrison is very badly hit and there are a number of others I believe killed & wounded. We are having a rather serious time now, for the enemies guns are unsubdued & both our flanks seriously threatened. \n\nLater. I had to end abruptly for all of a sudden there was some movement of our chaps on the right flank, and the Turks had to pass across our front. The fire was terrific, but being behind the line I could not see what was happening. One of the Sgts (of the","70":" I saw, \ng\n stand right up and fire deliberately for perhaps several minutes. Suddenly just as he fired, he pitched forward with arms outstretched, stone dead. In the next few minutes several\n\nchaps were hit & \none\n another killed. Three of us are right on the flank watching for snipers & I have killed my first Turk. It is great. I fired right at 6 o’clock on the bell, and he flung his arms about & stretched out his chest & rolled right down the hill. A moment or two later we got a couple more, but so many fired I could not say who got them. One chap was only wounded & tryed to get away into the bushes but a dozen bullets must have hit him in the following few seconds. The New Zealanders on our left have been attacking \nf\n & retiring now for hours, but at last they are apparently established & their machine gun has opened fire. The Turkish snipers are very bold. One was for some time only a few yards below us & we couldn’t get him, for as soon as a head was poked over he’d fire. The chap alongside of me had a very narrow escape from the fellow for \nt\n a bullet \nshaved\n scarred the top of the trench & nearly caught his ear. Another\n\nhit the trench in front of me & nearly blinded me with the dirt. Our warships are doing great work, for their shells though fired at long ranges pass just over our heads to land perhaps 400 yards or even much less in front We can’t see what damage they do but as they always land on the places we know the Turks to be, they must have accounted for a lot.\n\nDark. Still the firing goes on The New Zealanders have established themselves & are entrenching on our left. A chap in the trench with me has just had a regular duel with the sniper opposite. I can’t get him from my side of the trench, but they must have exchanged about a dozen shots each, our chap having several very narrow escapes, but he got the Turk at last, much to his jubilation. Their snipers are awfully hard to pick out in the bushes, & they are not bad shots, having already done a lot of\n\ndamage. Our total casualties for the \nday up to m\n morning was 4 killed & 3 wounded in our little corner of the trenches but some more have been hit since.\n","71":" I am out of the game and on board the Galetea, A 14, with a bullet through the foot. But to go back & follow events. The night of the","72":" was another rotten night, and most of the fellows were very tired for lack of sleep. It was bitterly cold also, and without greatcoats we felt it very much. There was no relief in the trenches also, for w everybody \nwas\n had to be ready with fixed bayonets, supports & all. The enemy were evidently trying to rush us all night, for we could see their shadowy forms in front several times, while their cries of Allah, Allah, Allah were going on all night. It was magnificent to see our chaps, for they had settled down, and as cool as cucumbers, their firing being deliberate, low and aimed, so that the ground \nmust\n in front of the trenches must have been literally swept by fire. All night too their bugles kept sounding, charge amongst other things, for they evidently wanted us\n\nto come out of the trenches. Mostly \nthe\nthey crept forward carrying bushes in front of them, and in this way got within 30 yards of the trenches. Once in front of me, they threw a hand grenade. I watched it rolling along the ground and it exploded about 10 feet in front of the trench supports & \nall\n were all this time crouched behind the firing trenches waiting for them to charge, but they couldn’t face \nthe fire\n our fire which was terrific & accurate & must have killed hundreds of them. Our fellows were praying for the bayonet, gripping their rifles, and if the Turks had got near enough, would have given them hell. The Turks try all sorts of dodges, it is the German officers I think. \nWhen the\n A favourite one is to creep under cover of darkness & yell out in good English, false orders. As a rule somebody of course would pass these orders along, & considerable confusion was caused thereby. These orders were chiefly such as cease fire. One German officer \n\nin this way sang out “The Australians will not fire another shot tonight, as the French are advancing across their front. This message was passed right along, and fire did actually cease for a while. Another German approached & said Don’t fire I’m an Australian”. What battalion was asked? The","73":" The result was exit German. Some of their snipers have collared uniforms from dead Australians, and it is very hard sometimes to know when to fire. Another chap\ns\n who yelled out “Cease fire” didn’t have a good enough accent and the Lieut. in charge consequently gave the order “Three rounds rapid.” Anyway the night wore on, a very tiring night, the third as a matter of fact without sleep. About 3, things began to get very warm for the snipers were at us again & quite a lot of damage was done. In fact about a dozen were hit just round where I was, \nand\n chiefly in the fire trenches, for these\n\nwhich are right on the crest of the hill, have very little back cover. One chap alongside of me got hit in the groin, and as I was getting his field dressing, I got it in the foot. The shock jarred me from head to foot, and \nI\n rolled me down the slope into a trench fair onto the top of two rifle with bayonets, leaning against the trench. Luckily the fellows in the trench saw me coming and caught me, having to lift me off, for I was beautifully spiked about a ¼ of an inch deep. A couple dragged me out of the \ntrenches\n way along the hill a bit, for I was out for a time, but coming too, I started to crawl down the hill towards the dressing station. It was a horrible experience, for snipers bullets were whizzing around, and it was beginning to get light. Once down the hill & crawling along the bottom, it was better, though daylight came\n\n \n\na bit too early for my liking. In one place I got a fright, for my nerves weren’t too good, and & in the twilight of very early morning, I thought I saw a Turkish sniper right the middle of \nthe\n my track. I was too weak to make back, or go right or left, so I lay still for a minute or two, and at last in sheer desperation I went forward to find my supposed enemy a stump with a stick for a rifle. \nI s\n Through beds of mud & slush I had to crawl, or else pull myself along by branches of bushes. It must have taken 3 hours or thereabouts to crawl a mile, \nbut\n for 3 to 5 yards represented my maximum effort at the last, but at last I saw \nthe\n a party of our chaps ahead & sang out to them, and they helped me to the Dressing station. \nFrom\n After having my wound dressed & resting, I next got a ride on \na mule\n one of the Indian mules used for carrying ammunition,\n\nand eventually arrived at the beach where I took my place amongst numbers of other wounded. Here we were dressed more or less, and then sent out to A14 in boats on which some 300 or 400 of us are now stretched along the deck in long lines.\n\nIt is interesting to exchange experiences, for everybody has seen something that the others have not. The wounded brought in so far total about 3,500, but there are many others, that can’t be got down, and I am afraid a lot of them will die. We are to go to Alexandria, I believe.\n\nBeing wounded has its humorous side. One young chap got a bullet in the cheek, which made a considerable hole & stripped his top jaw of teeth. He was very anxious to have a smoke, but as he explained, the hole in his cheek caused a draught\n\n \n\n& spoilt the draw, so he had to press with his hand against his cheek to get a puff.\n","74":" We left last night for Alexandria, and soon the boom of the guns died away.\n\n"}}