{"Document Name":{"0":"Diary_0284","1":"Diary_0284","2":"Diary_0284","3":"Diary_0284","4":"Diary_0284","5":"Diary_0284","6":"Diary_0284","7":"Diary_0284","8":"Diary_0284","9":"Diary_0284","10":"Diary_0284","11":"Diary_0284","12":"Diary_0284","13":"Diary_0284","14":"Diary_0284","15":"Diary_0284","16":"Diary_0284","17":"Diary_0284","18":"Diary_0284","19":"Diary_0284","20":"Diary_0284","21":"Diary_0284","22":"Diary_0284","23":"Diary_0284","24":"Diary_0284","25":"Diary_0284","26":"Diary_0284","27":"Diary_0284","28":"Diary_0284","29":"Diary_0284","30":"Diary_0284","31":"Diary_0284","32":"Diary_0284","33":"Diary_0284","34":"Diary_0284","35":"Diary_0284","36":"Diary_0284","37":"Diary_0284","38":"Diary_0284","39":"Diary_0284","40":"Diary_0284","41":"Diary_0284","42":"Diary_0284","43":"Diary_0284","44":"Diary_0284","45":"Diary_0284","46":"Diary_0284","47":"Diary_0284","48":"Diary_0284","49":"Diary_0284","50":"Diary_0284","51":"Diary_0284","52":"Diary_0284","53":"Diary_0284","54":"Diary_0284","55":"Diary_0284","56":"Diary_0284","57":"Diary_0284","58":"Diary_0284","59":"Diary_0284","60":"Diary_0284","61":"Diary_0284","62":"Diary_0284","63":"Diary_0284","64":"Diary_0284","65":"Diary_0284","66":"Diary_0284","67":"Diary_0284","68":"Diary_0284","69":"Diary_0284","70":"Diary_0284","71":"Diary_0284","72":"Diary_0284","73":"Diary_0284","74":"Diary_0284","75":"Diary_0284","76":"Diary_0284","77":"Diary_0284","78":"Diary_0284","79":"Diary_0284","80":"Diary_0284","81":"Diary_0284","82":"Diary_0284","83":"Diary_0284","84":"Diary_0284","85":"Diary_0284","86":"Diary_0284","87":"Diary_0284","88":"Diary_0284","89":"Diary_0284","90":"Diary_0284","91":"Diary_0284","92":"Diary_0284"},"Date":{"0":"unknown","1":896.0,"2":906.0,"3":966.0,"4":967.0,"5":968.0,"6":981.0,"7":982.0,"8":983.0,"9":984.0,"10":985.0,"11":996.0,"12":997.0,"13":1000.0,"14":1001.0,"15":1002.0,"16":1016.0,"17":1017.0,"18":1018.0,"19":1019.0,"20":1020.0,"21":1021.0,"22":1022.0,"23":1023.0,"24":1024.0,"25":1025.0,"26":1026.0,"27":1027.0,"28":1028.0,"29":1029.0,"30":1030.0,"31":1031.0,"32":1034.0,"33":1035.0,"34":1036.0,"35":1037.0,"36":1044.0,"37":1067.0,"38":1068.0,"39":1069.0,"40":1070.0,"41":1071.0,"42":1072.0,"43":1073.0,"44":1074.0,"45":1075.0,"46":1076.0,"47":1077.0,"48":1078.0,"49":1079.0,"50":1080.0,"51":1081.0,"52":1082.0,"53":1097.0,"54":1098.0,"55":1108.0,"56":1109.0,"57":1110.0,"58":1115.0,"59":1116.0,"60":1121.0,"61":1179.0,"62":1183.0,"63":1191.0,"64":1287.0,"65":1386.0,"66":1388.0,"67":1389.0,"68":1401.0,"69":1402.0,"70":1404.0,"71":1405.0,"72":1406.0,"73":1421.0,"74":1426.0,"75":1429.0,"76":1464.0,"77":1540.0,"78":1555.0,"79":1556.0,"80":1606.0,"81":1705.0,"82":1718.0,"83":1749.0,"84":1750.0,"85":1765.0,"86":1839.0,"87":1840.0,"88":1860.0,"89":1863.0,"90":1864.0,"91":2006.0,"92":2007.0},"Entry":{"0":"\n\nEgypt ","1":" arr.in Eng.","2":" & amnow just about to boxon with the Huns.\n\nThis is not a bad place this England (Christchurch)but France would bemuch better than thisdrilling business.\n\nToday they gave usjust what we neededfor the front. We are notallowed to leave thecamp in case we leaveany minute.No stoppingin the camp for meso out I went dodgedthe police & over the fence.\n","3":"\nOrders came throughvery early this morningthat we were to leave\n\nat 10-30 tonight. There arealtogether 116 officers &men going. At 9-30 wewere all medicallyexamined. At 2 pmwewere inspected in fullmarching order at 3-30we were paid a poundeach & I managed totalk the guard over& got out of camp at10 oclock I went backto camp & fell in. Wellit was a sight. Everybodyor very nearly was drunk.There were fights in galore.No orders could be heardat all. Everybody wastalking at once. Someonegave the order to formfours & march & theydid or rather tried to\n\nIt was the funniest thingimaginable. Most of theboys had their girlswith them. People werecheering & crying. I thinkI would have been a littletouched if it hadnt beenfor the fun we werehaving The New Zealandersstarted a frightfull noisethe called a war crybut somebody turned ahose on them that finishedthe war cry To describethe march or ratherthe scramble down tothe station would takeup too much space butanyhow we eventuallyarrived there. The trainleft at 11-30 and we started on our way\n\nI suppose it will getplenty of knocking aboutup in the lines. I havebeen spending my moneylike water. BecauseI am shureI don'twant to snuff outwith any on me. Ihave made my pack aslight as possible. I supposethere will be plenty ofmarching to do.We just fell in & weretold off to our differentunits. I am to join the","4":" Field Engrs","5":" Division\n\nSeperated from all mymates. We heard thatwe are going to \nArmenter\nArmentiers.\n","6":"\nWe were up at 3 a.m.\n\nballoon & aeroplanes whichoccasionally had shotsfired at them. We arrivedat our destination about 7-30and were billeted for the nightin a barn where the moonpeeped in through theshell holes through theroof and walls.\n","7":"\nIt rained heavily so I hadto shift my quarters Wewent for a swim in a canalnext morning & wasn't itcold. I shivered myselfwarm. There is someshelling going on buthappily none have strayednear us. I was innoculatedtoday & it's giving mesomething a swollen armsplitting headache. A man\n\nfeels like dying. One ofour aeroplanes was broughtdown in flames today.\n","8":"\nI had a bad night lastnight with my arm.I feel half dead.\n","9":"\nWell we are going intothe line today. I joinedup No 3 Section 15 Fld Coy 5th Division.\n\nWe got a warmreception. There seemedto be a big battle on& the shells weretooclose to be comfortable.\n","10":"\nThe Germans shelled usa lot this morning. Theyknocked over the Cook house& four guns. Last night\n\nThree course meals every night. As long as I get mytummy full I don't mindhow the war goes.\n","11":"\nRaining hell for leatherup to our waists in mud\n","12":"\nWe received a rude shockthis morning we werewoke up at 3 a.m.to go to the front line& collect every pick &shovel we could see.They were going to laya cable right in thefront lines. What rosyjobs I fall into. Itwas a foggy morningso when I had thechance I sneaked overthe parapetinto\n\nGerman guns it fell a fewhundred yards awayso Iwent up for souvenirs&Fritz opened up on it. So I discovered I had morepressing business elsewhere& beat an undignified retreat\n","13":"\nA day of days I receivedmy first letters since I leftAustralia. The excitementalmost turned my head\n","14":"\nIs not counted as the Sabbathhere worse luck. Work just thesame. I wish they wouldstick to the 10 commandmentsespecially the one \"Thou shallnot kill.\"\n","15":"\nA pretty quiet day. One fellow killed in the Coy.\n","16":"\nWe were issued with anotherblanket today thats twonow\n","17":"\nA couple of Fritz snipershad a shot at me todaybut missed\n","18":"\nAnother parcel today &another blowout\n","19":"\nPay day again happily. Im broke!\n","20":"\nPretty hot day today. Threeof the infantry workingwith me were killed. Today I was lucky again\n","21":"\nA nose cap of a 9.2 knockeda piece of the rim off\n\nmy tin hat. I am constantlyshaking hands withmyself.\n","22":"","23":"\nIt rained cats & dogstoday. Thats means apleasant day for us.\n","24":"\nStill raining\n","25":"\nWe don't walk to workwe swim now. It's muchquicker\n","26":"\nToday is a repittition ofyesterday only more shells.\n","27":"\nRain cleared off today.It is getting muchcolder.\n","28":"\nOld Fritz is up to his\n\nold games again. He compelledus to leave the line ina very undignified mannerthis afternoon. So we gavehim something good fordinner in the shape ofpineapples & plum puddings\n","29":"\nSwimming in mud not only water is very essential in this soldiering especially with the jobs I get.\n","30":"\nThere are rumours aboutthat we are going outof the line for the WinterI sincerely hope so\n","31":"\nThey hadme on gaspicquet which is a goodjoke as the cook houseis very handy\n\ndrink anything I think.\n","32":"\nOrders came throughthis morning to pack up& move off. Argumentsin galore are going on asto where our destinationis. The Somme is mostpopular. But I thinkit's Ypres. I see thattoday is the","33":" I hopeits lucky.\n\nWe moved off at 4 pm& camped in Lailly.\n","34":"\nOff again this morningat 10-20. The whole Coyare together now transports& all. We marched about4 miles to Estaires wherewe are now billeted. The whole","35":" Division\n\nWe bivouackedforthe night. Oh Heavensit was cold. The bitingwind pierced everything. I put sevenTommies overcoats overme & still I wasfreezing.\n","36":"\nOff again early thismorning. Marched 7more miles to Montaubonwhere we are nowcamped. To describethe scene. The roadsare one endless streamof transports & troopswho are smothered inblood & mud all shiveringwith the cold. Deadhorses & men are allover the place. It is\n","37":"\nOver 14,000 prisoners werecaptured in the last twodays. Word has comethrough that the Scottiesare in Bapaume station. Needless to say. The casualtylist is frightfulon ourside. The village & fieldsare littered in dead.\n","38":"\nA shell came over thismorning & killed 14 &wounded 11 four milesbehindthe line.\n","39":"\nI feel very down hearted.My old mate PaddyMcLaughlin is missing.\n","40":"\nI had my first experienceof snow tonight. It\n\n\n\nwas freezing cold. Iwas on guard out inthe loo. We are still onstarvation rations.\n","41":"\nWe are working onthe railway still & havevery nearly completed it.But the cold is terrible.The mud has all frozenhard.\n","42":"\nA piece of shell knockedmy hat off today & nevertouched me. Shook handswith myself again.\n","43":"\nThey are sending us intothe line again shortely.An aeroplane fell ontop of our hut yesterdayof course both were\n\nsmashed to pieces. Three fellows inside were killed.\n","44":"\nNo 1, 2 & 4 Sections movedoff closer to the linetoday we stopped in topull down the huts.Some of the boys raided theQuartermasters stores & pinched4 jars of rum. And didn'tthey have some fun. Iwas the only sober onethere because I don't likerum. When the shellscame over they cheeredthem.\n","45":"\nWe moved off today toour new camp in Water-lot Farm just nextto Delville Wood.\n","46":"\nWe were busily engagedtoday in building ournew home. The 24th Coyare back from their spellI might here mention thateveryone in the Divisionbare the Pioneers & ourCompany has been out fora spell to Amiens for afortnight.\n","47":"\nWe went out today repairingduckboards. These boardsare laid on the ground& covered with wire toprevent slipping.\n","48":"\nIt started raining today.How miserable everythingevery thing & everybodyis when it rains\n\nNeedless to say we weredrenched to the skin. Butto crown all Fritz shelledus on all sides & killed& good many of the workingparty.\n","49":"\nIt rained not cats & dogsbut cows & horses. I don'tthink a man can stickthis business too longwe have been in just onsix weeks now. If theworld only knew whatwe are going through\n","50":" '16\nWe have been put onanother job. It was shellsshells all day. We werelucky again. We werechased all the way homewith High Explosive\n\nshrapnel. It nearlydeafened me. A NCO in No 4 section wasknocked today.\n","51":"\nWe came to work thismorning & found deadbodies & equipment lyingall over the place. The32nd Batt. were cut topieces going in last night.The following will show themens indomitable spirit.\n\nAn infantry chap whowas covered in mud &slush & looked half deadwith the cold was comingout of the line eating abiscuit & eating it withas much relish as onewould steak & oysters. Whenhis eye alighted on\n\nan oldish chap. A halfstarved poor miserablelooking half human beinghe looked.He was justpassing us when the chapeating the biscuit stoppedhim & gave him the biscuitsaying. Here you are boy.You need it more than I.Thats the stuff the Australiansnare made of. Caked in mudalways & shivering & yetalways a smile. We got home without a shell.\n","52":"\nWhat a bitterly coldday it was today Mynose nearly froze on myface. The wind piercedthrough clothes & all.\n\nIt was too cold to work.We had to walk\n\nhow we can do it. The constantstrain of the shelling which isalways heavy is almost too muchfor us. Everyone is complainingnow.\n","53":"\nShells & shells all day. Wehad to retire several timesthroughout the day. Weare working on a roughjob surrounded bybatteries which are firingall day & of course Fritzis replying.\n","54":"\nOld Fritz sent them overin galore. Today at about 12 oclockso we discovered we hadbusiness to attend to elsewhere.It's really funny to watchthe boys when Fritz putshis 9.2's over. There is a\n\nour reward. Needless tosay everyone was drunkthat Xmas Eve. BeforeI put tomorrows routine inI might say that this diaryis not as clear as it mightbe. For instance I have putvery few personal experiencesnarrow aqueakes etc. I havenot done so either becauseI have forgotten or else beentoo lazy. There were timesfor instance when Inever touched my diary fora week or so sometimes I nevermissed a day for a month orso. It all depended on whatkind of time we were having.\n\nTaking our little campagneright through It wasn't tooclever and these yarns aboutour air supremacy & artillery\n\nsuperiority are all rot. I saweasily as many of our planesbrought down as Fritzs & hisshooting was absolutely superb.But there is some truth aboutthe yarn the Germans aregiving themselves up.\n","55":"","56":" & I fell as sick asa dog. (why) could not get upor eat anything. We hadtwo parcels to share betweenfive men. I ate none of minenor drank the champagne ourofficer brought us.\n","57":" till","58":"\nWe are having a good timebut it is too uninterestingto put in the diary. It isNew Years Eve\n\n1917","59":" till","60":"\nWe are working drilling\n\nSince last writing wehave had two raids. Thefirst one two of No 1 Sectiongot a military medal. Theywere in No Mans Land for19 hours. I fell into theother one. There were 50 ofthe 57 Batallion & anotherSapper & myself. We wentover about 9-30 at night.\n\nI had a revolver & two Millsbombs. We crept over NoMans Land & into hisfront line without beingseen. There was no sentrywhen I got in so I creptalong to a dug out where Idetected a light shining. Ipulled the pin out of oneof the bombs & threw itin the dug out. It was alucky shot must have\n","61":"\nWe took Fritzys first linelast night killed fiftyor sixty & captured amachine gun & thirty threeprisoners. About fourtycasualties on our side.\n\nWe expect to go againtonight to capture theridge.\n","62":"\nHad just finished a harddays toil digging trencheswhen I with three otherswas told to be ready byseven o'clock to fix fourbombing shelters in thefront line. It was a brightmoonlightnight. We startedfrom Rose Trench & got intothe communication sap. Wegot about half way through\n\n\n\n& were congratulating ourselveson getting through withouta shell when the fireworkswent off. Not a aound wasto be heard. It was as stillas death. The only sound wasus four & the Infantry partywho were carrying the materialcreeping through the mud.\n\nOn account of the brightnight we had to go forwardon hands & knees to preventbeing seen the sap being onlythree feet deep. In most placesit was only shell holes linkedup. Well anyway my backwas getting pretty tired soI thought I would riskit & stand up & stretchmyself. I stood up almoststraight my head & shouldersjust above the sap when\n\n500 yards from the front linewith enough water to supplythe allies for the duration.\n","63":"\nPoor unlucky me wentinto the front line againthis morning. This is theworst I have had to putup with. Its bad enoughgoing into the line in thenight but they sent us inbroad daylight sheer murder.We waded through slimymud past our waists. Howwe got through God onlyknows. Going in we passedfour chaps sliding a matethrough the mud. Comingback we found the fivelying dead. We nevercrawled on our hands &\n\ninto the trench. What asight it was. Shatteredbodies lay all over theplace. One fellow wasalive out of the lot. Wesat there in the thin mudfor a while our bodies wereas wet as our clothes & weweren't cold! Wellit was impossible to workso the Corp suggested going back.\n\nWe had to go back one atthe time but none seemedanxious to take the lead asFritzy was now heavily shellingthe saps. But I was gettingvery cold so thought I wouldrisk it first. Shells burstwithin feet of me butluck was with me & I gotthrough. Well I arrived atwhere I had to meet\n\n\n\nI entered it about an hourafter. I then went back toMillers Son .I went overthe old battlefield. Wewalked this morning whereyesterday we feared to crawl.What a sight it is. Insome places the deadbodies are three or four deep.They were mostly Tommieswho fell in November.\n\nThere are fires everywhereon the horizon. Old Fritzseems to be leaving a trackof destruction behind him.The infantry have gone righton & are still advancing.The guns have been rushedup & are now in position.There is no end of excitement& smiling faces. We arenow busily occupied in\n\nwhileseeing.The peoplefirst stared at us saying\"Bon Soldat\" meaninggood soldiers. Just aswell someone thinks that.\n\nThe Froggies took us inthe Estaminets & filled uson Champagne & the bestof everything. A soldierslife is not so bad after .all\n\nLast week in","64":"\nWe have been doingPontoon bridgeing on thecanal all the time.\n\nYesterday our section beatall records by throwinga bridge over the SommeCanal 96 yards in 6 min9 seconds. There was tobe an inspection by GeneralHolmes so the three Engineer\n\nIt was stormed in no time.\n\nThere arethree objectives.The third was reached at1 o'clock. About 4,000 prisoners.I believe the Fritzs ran likerabbits The advance wasabout 2 miles. Thecasualties were very light.\n","65":"\nWe went up into Yprestoday. They haven't told uswhat for but it is thestuntfor shure. What abeautiful city it has been & nowa mass of shattered ruins.There is not a houseleft standing. The Cloth Halla once beautiful structureis now levelled to theground. We are billettedin the Post Office, one ofthe Highest buildings.\n","66":"\nWe have been working up in the line on a mule track since the stunt. Every day was as bad as the","67":" We have now consolidated the positions won and are going back today for a brief spell to Dominion Camp.\n","68":"\nWe have been in this Camp for just a week. Out for a spell & bombed by the 'planes day & night. The Division is reinforced & reorganised again, so we are going back to Ypres today.\n","69":"\nIn it again all nearly knocked too. We were walking along the Coudrayroad (about 16 of us) when a chap suggested getting\n\nblocking the traffic. A Pioneer Officer seeing we were Engineers called on us to give him a hand. We all got on to it. One shell landed on the side & killed three but anyway we got it out, as soon as we did I off although the officer tried to stop me. When I got home I found out that the officer had taken three of my mates names & was going to recommend them for a decoration. I was a mug not to give him mine.\n","70":"\nWe were put to a nice little job today building a Divisional baths at Ypres. We have a chance here as there is a bit of cover when he shells.\n","71":"\nI forgot to mention that the bodies of Lieut Turner & Sgt Elliott were found together in the","72":" Brigade Sector.\n","73":"\nHooray I going on leave to Scotland. Soldiers life for me.\n","74":"\nAm writing this in the Anzac Buffet in London. What a great time I am having. Don't know how to spend my money.\n","75":"\nHave crushed my right toe badly & have now gone into hospital.\n","76":"\nIts no use me putting anything in my diary.\n","77":"\nI won easily last night & am going to London tonight.\n","78":"\nI overstayed my leave by 11 days & came back two days ago. I was find 39 days pay. On","79":" aeroplanes came over & bombed London by the starlight. Luck is still with me as one bomb demolished a house two doors away from where I was. I came back to camp the next day.\n","80":"\nYersterday was Anzac Day. We had some boxing & Sports. In the night I boxed & won a great fight with a Bert Fisher.\n","81":"\nI won a fight at the National Sporting Club last night against an American named Wills.\n","82":"\nHave had three more fights in London & won them. I am on draft once more & am a cert to go this time.\n","83":"\nWe left Brightlingsea by the 5.30 train tonight. Everyone without an exception was drunk. We left London Bridge Station at 3 am for Folkestone.\n","84":"\nWe have arrived at Boulogne & had an air raid the first night.\n\nseven casualties there. But I was nearly put out of action early. A piece of shell as big as my hand hit a horse, only about 4 feet away from me, in the side. The blood simply hosed out of the hole all over me. I was covered in the horses blood. It nearly turned me sick.\n\nWell we captured Bellicourt in the first rush & now are held up at Estrees. Our Section are now waiting in an old Pill box to go up into Estrees.\n","85":"\nLast night I had an awful time of it. I got lost and nearly wandered int Fritzs lines. I was out laying in a trench in the biting cold all night.\n","86":"\nWe left Sutton Veny camp at 3 o'clock this morning for Liverpool we are going back on the S.S. \"Saxon\".\n","87":"\nWe are going round via the Cape. We are anchored now at Sierra Leone taking in water, we are leaving tonight.\n","88":"\nWe arrived at Cape Town this morning. We are coaling so we will be here for a long time.\n","89":"\nYesterday","90":" we left Cape Town what a roaring time\n\nwe had. I went to the races New Years Day & backed four winners.\n","91":"\nIt is a long while since I touched my diary. But I think I'll finish it off. I was discharged from the Army on the","92":" & am now a full blown civvy.\n\n"}}