{"Document Name":{"0":"Diary_0437","1":"Diary_0437","2":"Diary_0437","3":"Diary_0437","4":"Diary_0437","5":"Diary_0437","6":"Diary_0437","7":"Diary_0437","8":"Diary_0437","9":"Diary_0437","10":"Diary_0437","11":"Diary_0437","12":"Diary_0437","13":"Diary_0437","14":"Diary_0437","15":"Diary_0437","16":"Diary_0437","17":"Diary_0437","18":"Diary_0437","19":"Diary_0437","20":"Diary_0437","21":"Diary_0437","22":"Diary_0437","23":"Diary_0437","24":"Diary_0437","25":"Diary_0437","26":"Diary_0437","27":"Diary_0437","28":"Diary_0437","29":"Diary_0437","30":"Diary_0437","31":"Diary_0437","32":"Diary_0437","33":"Diary_0437","34":"Diary_0437","35":"Diary_0437","36":"Diary_0437","37":"Diary_0437","38":"Diary_0437","39":"Diary_0437","40":"Diary_0437","41":"Diary_0437","42":"Diary_0437","43":"Diary_0437","44":"Diary_0437","45":"Diary_0437","46":"Diary_0437","47":"Diary_0437","48":"Diary_0437","49":"Diary_0437","50":"Diary_0437","51":"Diary_0437","52":"Diary_0437","53":"Diary_0437","54":"Diary_0437","55":"Diary_0437","56":"Diary_0437","57":"Diary_0437"},"Date":{"0":"unknown","1":1496.0,"2":1499.0,"3":1506.0,"4":1516.0,"5":1526.0,"6":1546.0,"7":1559.0,"8":1574.0,"9":1579.0,"10":1583.0,"11":1585.0,"12":1586.0,"13":1587.0,"14":1602.0,"15":1604.0,"16":1609.0,"17":1614.0,"18":1620.0,"19":1631.0,"20":1634.0,"21":1643.0,"22":1658.0,"23":1659.0,"24":1660.0,"25":1661.0,"26":1675.0,"27":1679.0,"28":1684.0,"29":1686.0,"30":1705.0,"31":1708.0,"32":1710.0,"33":1711.0,"34":1712.0,"35":1713.0,"36":1721.0,"37":1722.0,"38":1728.0,"39":1729.0,"40":1807.0,"41":1808.0,"42":1809.0,"43":1810.0,"44":1818.0,"45":1819.0,"46":1820.0,"47":1822.0,"48":1823.0,"49":1841.0,"50":1842.0,"51":1843.0,"52":1844.0,"53":1928.0,"54":1929.0,"55":1952.0,"56":1961.0,"57":1962.0},"Entry":{"0":"\n\n","1":"\n\nLeft Moislains marched with full packs, and blankets to Peronne (5 miles) entrained at midnight, travelled all night. Detrained at Bailleul about 6 a.m. marched about four miles to Struzeele, all in good billets.\n","2":"\n\nLeft Strazeel 8 a.m. entrained, detrained 9 a.m. marched about a mile to Tournia camp, near Voomezeel billeted in bow hut a Splendid camp.\n","3":" \n\nLeft Tournia camp entrained in light railway 3 a.m. left train 4 p.m. at Spoil bank marched up to Hill 60 then broke into sections and moved into Shrewsbury Forest firing line at dusk too over R.A.P. from 47th R.M.O. in old German concrete Aid Post in front of Gheluvelt. Supplies perfect.\n","4":"\n\nRelieved by the 49th Battn moved back to Spoil bank at dusk took over 49th R.A.P. in tunnels Battalion billeted in tunnels. \n","5":"\n\nMoved back to Ridgewood camp near Voomezeel camp in bow huts good camp \n","6":"\n\nMoved back (2 miles) to Kemmel Shelter near Locre in bow huts. Good camp.\n\nSick Parade List, March","7":" 18, 1918\n","8":"\n\nLeft Kemmel Shelters about 4 a.m. marched with full pack and blankets about 2 miles to Locke got into motor lorries started off about 8 a.m. travelled all day. Left motors about 5 p.m. to Gouy. Billeted in village.\n\nLeft Gouy at 9.30 p.m. after dumping packs and blankets marched in fighting order all night and stopped a couple of hours at Forceville, at 9 a.m. had a drink of tea. continued marching until 3.p.m. broke into artillery formation near Henencourt. Battalion moved into supports. Dug an R.A.P. off sunken road in Henencourt word.\n","9":"\n\nMoved to position on other side Henencourt to over R.A.P. from 52nd in Aerodrome near Baizieux two companies out in trenches two in Aerodrome on the","10":" Shell explored on beam killing & wounding 37 all clear in 2 hours commandeered 3 motor Lorries ambulance sent 2 cars\n","11":"\n\nMoved forward to Lavieville took over R.A.P. from 47th Bttn in Quarry.\n","12":"\n\nMoved to Buire firing line took over R.A.P. from 52nd Bttn in same post\n","13":"\n\nMoved back along the Amiens road to wood near La Chousoze slept in open\n\nMoved to Corbie about 4 miles town deserted took over from A.A.P. from Lancashire Fusileers Yankee Doctor Men billeted houses\n","14":"\n\nLeft Corbie march back 3 miles to Daours found new R.A.P. in factory men in good billets\n","15":"\n\nBig German attack. Daours heavily Shelled had to move out into open. Moved forward about noon to wood near La-Petit Blangy. moved forward to attack at 9 p.m. 12 amb. bearers with us at rear of Battalion 10.30 p.m. under heavy Shell fire at corner of Cachy moved forward on to tape. Bttn just off. M.O. Cptn Sewell went forward alone to B.H.Q 100 yds ahead. was never seen alive again found in Shell hole 3 day later dead with bullet wound through throat 300 yd from B.H.Q. amb. Bearers unable to carry back to cars 3 miles away. carring wounded to cellar in Cachy, formed R.A.P. in Cellar\n\nof Cachy, at midnight. 2.a.m. 52nd R.M.O. connected up with us, about fifty stretcher cases in cellar 10 a.m. 60 stretcher cases in cellars amb: bearers just in touch. 52nd M.O. slightly wounded Many regimental bearers wounded 6 p.m. all wounded clear, 52nd M.O. evacuated. Detail ordered to leave cellar unit join up with 49th M.O. regimental bearers carring 1½ miles. joined .49th R.A.P. at midnight in sunken road worked under Cptn Crisp until relieved on the","16":" when we moved back to Blangy Tronville 21 regimental bearers were carring 1 killed 15 wounded. Battn causalties were 8 officers wounded 170 men \n","17":"\n\nMoved up to Petit Blangy Wood, sent guide to find R.A.P. moved forward at 9 p.m. with B’n and guide to Villers Brettoneux took over R.A.P. from 45th a good post 500 yds from firing line, guide led in without trouble. \n","18":"\n\nMoved back 2 miles to R.A.P. in White Chateaux Bn in trenches as reserves. Took over R.A.P. from 52nd B’n.\n","19":"\n\nMoved back 8 miles to Querrieux\n","20":"\n\nMoved out into fields R.A.P. in tent. \n","21":"\n\nLeft camp near Querrieux, marched to Daours camped in open all day, sent guide forward to take over R.A.P. at Buire, Battn moved up at night took over R.A.P. from","22":" Battn in Dug. Out. Good Post. Supplies plentiful\n\n \n","23":"\n\nMoved back to Daours took over RAP from 45th Battn\n\n \n","24":"\n\nLeft Daours moved up into firing line on left of Villers Bretonneu took over R.A.P. from","25":" Battn good post.\n","26":"\n\nMoved back to Daours\n","27":" \n\nLeft Dauours moved to Hamel took over R.A.P. from 44th Bn New post. \n","28":"\n\nLeft Hamel moved back to Daours RAP in mill\n","29":"\n\nMoved back to Camon RAP in deserted cottages\n","30":"\n\nMoved from Camon & took over support line from French in front of Gentelles Wood. R.A.P. in tunnel on Roye road\n","31":"\n\nIn the night left R.A.P. Roye road & removed over to right of Villers Brettonneux ran two R.A.P.s in dug outs from the","32":" &","33":" Battns. \n","34":"\n\nLeft Villers Brettonneux R.A.P. & went back to Blangy Tronville.\n","35":"\n\nLeft Blangy Tronville & went into a R.A.P. on right of Cerisy. Stayed one night. Went into Quarry – rear of Brag. Formed our own R.A.P. \n","36":"\n\nLeft R.A.P. in quarry rear of Bray & went back to Sailly.Le.Sec. for one night, went in motors next day to Harbonnieres, walked about six kilometres north east of Rosiers.en.Santerre.\n","37":"\n\nTook over R.A.P. from Americans in a quarry. N.E. of Rosieres.en.Santerre, Battalion in reserves. \n","38":"\n\nLeft R.A.P. in quarry N.E. of Rosieres.en.Santerre.\n\n\n","39":"\n\nCaught motors at Caix & rode back to Rivery. Battalion billited in town R.A.P. in a cottage. \n\n \n\n \n\n \n\nLocation of Companies\n","40":"\n\nLeft R.A.P. for Hangest 10 am leaving Ferrieres. Entrained Hangest for Tincourt. Detrained Tincourt 10 pm on the","41":" Established R.A.P. in bow hut","42":" kilometre from Tincourt.\n","43":"\n\nLeft camp for Tincourt Station 8 am. Entrained on Light Railway on which we travelled for four hours, detraining at Brancourt. Marched three kilometres to Fresnoy le Grand. Battalion billited in village & R.A.P. established in three roomed house. \n","44":"\n\nShifted from Fresnoy le Grand at 7.30 am reaching our destination at St Souplet at 11.30 am having marched 10 miles. R.A.P. in house. Sick Parade for sore feet held at 2 pm 71 men on it.\n","45":"\n\nLeft St Souplet 9 am marching until 1 pm & then dinner to 2 pm. reached destination Friaches 4.30 pm R.A.P. in house. Sore feet done by Coy S.B.s only two on Sick Parade. Distance marched during the day 15 miles.\n","46":"\n\nPetit Fayt at 10.30 distance about six miles. 6 m afternoon foot Parade only six. RAP in loft over house. \n\n\n","47":"\n\nMoved from billits 9 am halting for dinner at midday finally reaching our destination Sains at 3 pm Battalion billited in factory previously used by the Hun as a Hospital. RAP in small room in corner of building.\n","48":" \n\nMoved from Sains at 9 am halting for dinner at midday & then proceeding to destination on outskirts of Sivry \"Belgium\" RAP in two rooms of furnished house\n","49":"\n\nShifted from Billits at Sivry 9.30 am, resting for a hour at midday for a meal finally reaching destination Boussulez Walcourt at 3 pm R.A.P. established in one rom of house in village.\n","50":"\n\nShifted at 9 am to St Aubin travelling twelve miles RAP in house in village. 30 on foot parade.\n","51":"\n\nShifted to Weillen about 15 kilometres one man evacuated on the march RAP in village. \n","52":"\n\nMoved to our destination Dinant arriving before midday. Temporary RAP in one room of house. \n","53":"\n\nLeft Dinant in fighting order and halted at midday for lunch arrived at our destination, Denee at about 3.30 R.A.P. situated in a small house off the main road. \n","54":"\n\nLeft Denee 8.30 marched fighting order to our destination halted 1 hour midday for lunch arrived at our \n\ndestination about 3. oclock. R.A.P. situated in one room of a school (Suare Estauch \n","55":"\n\nLeft Sart Eustache at 2.30. moved over so the 51st Batt. joined 51st R.A.P. in Private house at La Raua \n","56":"\n\nLeft Le Roux in Morning and march to Aiseau Aid post in Cafe and made Aid Post for the","57":" Brigade.\n\n"}}