{"Document Name":{"0":"Diary_0183","1":"Diary_0183","2":"Diary_0183","3":"Diary_0183","4":"Diary_0183","5":"Diary_0183","6":"Diary_0183","7":"Diary_0183","8":"Diary_0183","9":"Diary_0183","10":"Diary_0183","11":"Diary_0183","12":"Diary_0183","13":"Diary_0183","14":"Diary_0183","15":"Diary_0183"},"Date":{"0":"unknown","1":297.0,"2":298.0,"3":299.0,"4":301.0,"5":303.0,"6":304.0,"7":305.0,"8":306.0,"9":307.0,"10":308.0,"11":310.0,"12":311.0,"13":315.0,"14":316.0,"15":317.0},"Entry":{"0":"\n\nOn the ","1":" October, we embarked on the Troopship \"Euripides\" and the next day we steamed out and away from the land of the Sun, leaving sorrowing Mothers, Wives and Sweethearts - who knew well that some of us would never return, and each of them, I knew, were murmuring prayers that her dear one might be spared to return.\n\nI had parted from my Fiancee when I was sworn in, and she had gone to relatives in Queensland, and when I saw all the weeping, I was glad to be spared the pain of another parting. But she was young and in good health, and my thoughts turned to my dear Mother, who was ill with heart trouble. We had said our farewells two days before, and needless to say we had felt the intense sadness of it all, but Mother is a great loyalist, and a real Briton - her last\n\nwords were - \"Au Revoir, dear lad - smile, smile once before you go - it's a long way to Tipperary, but you'll come back again.\" I gazed a long time at her dear features, as she bravely smiled herself, and I somehow got a firm impression that I should indeed come back home again. On the","2":" as we passed Watson's Bay at six in the morning - looking towards my home, I could see my people waving farewells, and I heard my Mother's \"Cooee\" across the Bay. In the endeavour to get a better view of them, I climbed up on one of the cross poles, breaking my wristlet watch in doing so. I tell you straight, there was a very big lump in my throat as my home got lost to sight. I felt as if someone had suddenly died, and that I had been left absolutely alone without a friend. But I also felt that I was a Soldier, starting out on the great adventure of my life, so I sat back and told myself things.\n\nOur departure was very quiet indeed, no public demonstration - no fuss - and that is how the","3":" Australian Division left good old Sydney Town, for active service bent. We passed through the oldheadlands, and were soon travelling along at 13 knots an hour. Our time for the next two days was taken up in settling down into our separate places and other duties, parading on deck with hammocks, blankets, etc.\n","4":"\nHad a little excitement today in watching two whales, one of which was spouting water several feet up into the air. Some of us had been wondering as to what Escort we were to have, when suddenly at 6.p.m., a Man of War Boat was sighted, and a general ripple of comment went round. It was not long before the Doctors and we A.M.C. men were wanted, and we soon had some patients -\n\nSome had sore throats, some sprained ankles, some were violently sea sick - and a few had the \"pip\" otherwise, homesickness. In all there were 11 of them. A few of our fellows were detailed for Hospital duty, and I made my debut by going on night duty. The Military Band usually gave us some cheery tunes before \"lights out\" was bugled. Private Watkinson was my mate in Hospital work, and a right good mate was he.\n\nOrder just posted that no gambling would be allowed - anyone found guilty would be punished. Australian Bight not all bitey, but very calm, for which the Lord be thanked.\n","5":"\nThe Dean of Sydney, the Rev. Talbot conducted the services to-day. We enjoyed the function well, most of the fellows being present. At 2.p.m. \"Dress ship\" was blown by the twenty Buglers, & the Port and Starboard sides of our ship were lined by Soldiers as if to salutea passing ship. All very interesting work.\n","6":"\nWe entered Albany Heads at 12.30p.m., and dress ship was again piped, and Soldiers posted as on the previous day. Albany is to my mind a miniature of Sydney Harbour, and it did us good to look at the green hills. From we anchored we could see 20 other Troopships and cheer upon cheer rang out in mutual greetings, and Lor' how did we roar. It filled me with feelings I had never known before, and when the Bugles finished playing the \"Salute\", and the \"Stand easy\", and the Band thundered out \"Rule Brittania\" - I think I realised as never before that I was a Soldier of the King - out to do my best for my Country, and my dear Homeland. Lots of other fellows felt the same way, they told me so - and as I saw the steady purpose in the brave, open faces, my very soul leaped upwards, and I knew that we had taken the way that a man ought to take - which is ever the harder\n\nway. Back to nursing duties, and Private Tuck is my mate now. 1.30.pm. - I am listening to one of the deck hands singing (?) \"An Emblem,\" whilst I am writing to my Sweetheart, and the song takes me back to Mother's Music room, where she often played that song for my dear little girlie to sing it. Tender memories surge through my mind, but a patient requires immediate attention, so I was not permitted to remember those things for very long. Heigho' I arise from my dreams.\n","7":"\nGot a grouch, a serious one too. The food on board this old packet is not fit for dogs - much less Soldiers - good stuff ruined by careless Cooks; I had to leave my breakfast, and I was devilish hungry too. Lots of the others did likewise. We all waited anxiously for 11a.m. when we could get a mug of Beer for 3d. You should see the long line of fellows waiting their turn there every day. You see it sometimes has to do for food as well as drink. General \nBirdlwood\nBridges arrived on board - looks pretty decent chappie.\n","8":"\nThe Harbour looked fine this morning - the mists were rising over the valleys and hills, it looked as if soft, white smoke was rolling up in billowy waves. I just love the early morning effects under these conditions. Later on, there was a great commotion on board. 14 Steamers were sighted, and we watched with much interest until they all anchored in St George's Sound, and the cheers that rang out, would have gladdened even the heart of cabbage stumps. They are additional Troops for the 1st Australian Division. During the day, the Ship's boats were lowered, and most of us had rowing exercise which was highly appreciated for our biceps sake. Ye gods, and little fishes!!! What do mine eyes behold!! Pickled pork and spuds!! A feed for an Emperor, and how did we enjoy it! Plenty of it too. No doubt the way to a man's heart is through his\n\nstomach.\n","9":"\nAlas! today is the reverse of yesterday as regards the tucker, no quality - no quantity - and consequently most of it remained untouched. Another disappointment befel us. It was Pay day, but we were only allowed to draw a solitary \"bob\" a day! Lots of it was spent in the dry canteen (perhaps that is the reason we are starved) on Biscuits and cheese, tinned fruit, etc. We must fill the aching void somehow - where the tucker isn't. We have all been turned out on the poop deck for inspection, I guess we looked alright.\n","10":"\nStew for breakfast, (still harping on the same old string) - too oily - much grouching thereat, and many empty bingies. Orders issued that no letters are to be written giving name of Port, or what is being done. Several of the boys wrote letters and they placed them over the Ship's side, hoping that wind and wave would kindly carry the messages to those at home. To-day I am light hearted - a letter from the Mater is the cause, my soul - thank God all's well - all's well.\n","11":"\nNo luck! Meals as bad as ever. Private Beard and self started doing dental work, for all the Ship's company; some pretty rotten specimens of molars to hand.\n","12":"\nLeft Port Albany at 6.30. It was the grandest and most thrilling experience I have had in all my life. We steamed out in single line, our Boat leading, until we were well out to sea, when we fell, as near as I could make out, into the following order -\n\nLeft line\n\nCentre line\n\nRight line\n\nA18 Wilshire \n\nA3 Orvieto\n\nA14 Euripides\n\nC Medic\n","13":" Southern\n","14":" Argyllshire\n\n11 Ascanius\n\n4 Pera\n\n9 Shropshire\n\n15 Star of Empire\n\n38 Armidale\n\n19 Afric\n\n2 Geelong\n\n12 Salalana \n\n24 Benalla\n\n17 Port Lincoln\n\n13 Katuna\n\n22 Rangtarra \n\n10 Karoo \n\n1 Hymettus\n\n16 Star of Victoria\n\n21 Marere\n\n23 Suffolk\n\n20 Hororata\n\n6 Clan Macfarlane\n\n25 Anglo Egyptian\n\n28 Miltiades\n\n\n\nIn the rear came the New Zealanders, and as far as I could ascertain, that Flotilla was composed of the following ships -the Manganui, Tahiti, Rapehu, Orari, Limerick, Star of India, Hawke's Bay, Aranta, Atlentiland the Warmara, -Our Convoy included the H.M.A.S. Sydney, H.M.A.S. Melbourne, H.M.A.S. Pioneer,the Japanese Gunboat Ibuki, and the Minotaur.\n\nThat is how we sailed from the shores of Australia on that day of days,and we all felt that the Great Adventure had indeed started.\n\n2nd \nWe were told just now that War has been declared between GreatBritain and Turkey. May we soon cookthe dear bird.\n\n3rd \nA good stiffbreeze is blowing, and mal de mer is getting too prevalent -must confess that I feel pretty dicky myself. Further news issued -'Rumoured that a British Cruiser has been sunk in the Straitsof Dover.' Pretty close thing that, far too adjacent for England to be considered healthy. Some German sneak mine, I expect.\n\n4th \nFood absolutely unspeakable. If they want to keep men fit,why not feed them on wholesome stuff. It costs enough to train us, and good food is always a sure economy in the long run. We did quite alot of extra actions to-day.A false alarm of fire was given -bugles were blown, and all thesick had to be got up on deck, with lifebelts on. It was good practice, and a very sensible one.\n\n5th \nTwo Troopships, with W.A.Troops on board picked us up just now.One of our Mess Orderlies suggested sending up a deputation about the tucker. This was done, but we got no satisfaction.Soft shoes were issued to Hospital Orderlies, for night wear.It is a grand thing to tumble up on deck of amorning, after a long night's vigil, and look on the four lines of Ships steaming along - a wonderful sight I don't suppose I shall ever look upon the like again.It makes one\n\nthink some. Life is full of interest these days. The \"Osterley\" passed us at dusk. Shelooked splendid, all lights aflame. Cheer upon cheer rent the air, and the boys sang \"Tipperary\" - and they did give it lip, I tell you - and of course the Osterley's crowd responded.\n\n6th \nOne of the N.Z. Boats pulled out of the line - so all the rest had to follow suit, almost to a stop, until the trouble was adjusted. A Funeral at Sea - can anything be sadder. The body was confided to the ever restless waves at 9.30 p.m. Good bye to you, comrade - you have died for Australia, just as truly as if you had reached the front. From grave to gay, an Auction took place from articles in the \" Scran Bag\", wherein are always placed the lost clothing found lying about, etc. A soldier on board composed the following touching little elegy, to be sung to the tune of \"When I lost you\",\n\"I've lost my tunic and trousers,\nI've lost my overcoat too-\nI've lost my boots and pyjamas,\nOh dear! what shall I do?\nI saw some clothes in the Scran Bag,\nI thought I saw mine there too -\nBut I have no hope, as I cannot get soap -\nSo - I've lost you\".\n\nN.T.B. - these initialsalways mean, 'not too bad'.\n\n7th \nA Soldier whilst cleaning his revolver blew his first finger off - so he lost that too! Food N.T.B. to-day - feltquite serene in consequence. Just finished with egg and spoon races, boxing contests, walking the pole, and falling into a tarpaulin filled with water - some of the onlookers were tossed in also. Great fun, the Jollo ended with a potato race - I collared some good specimens for roasting. They are fine eating, with a lump of salt - every man his own crusher. Biceps pretty sore - I pulled some stiff molars to-day - antedeluvian samples I think.\n","15":" \nPrivate Kendallof Bathurst, an ex-Policeman died at 4 a.m. - so\n\n\n\n"}}