{"Document Name":{"0":"Diary_0022","1":"Diary_0022","2":"Diary_0022","3":"Diary_0022","4":"Diary_0022","5":"Diary_0022","6":"Diary_0022","7":"Diary_0022","8":"Diary_0022","9":"Diary_0022","10":"Diary_0022","11":"Diary_0022","12":"Diary_0022","13":"Diary_0022","14":"Diary_0022","15":"Diary_0022","16":"Diary_0022","17":"Diary_0022","18":"Diary_0022","19":"Diary_0022","20":"Diary_0022","21":"Diary_0022","22":"Diary_0022","23":"Diary_0022","24":"Diary_0022","25":"Diary_0022","26":"Diary_0022","27":"Diary_0022","28":"Diary_0022","29":"Diary_0022","30":"Diary_0022","31":"Diary_0022","32":"Diary_0022","33":"Diary_0022","34":"Diary_0022","35":"Diary_0022","36":"Diary_0022","37":"Diary_0022","38":"Diary_0022","39":"Diary_0022","40":"Diary_0022","41":"Diary_0022","42":"Diary_0022","43":"Diary_0022","44":"Diary_0022"},"Date":{"0":"unknown","1":1214.0,"2":1215.0,"3":1216.0,"4":1217.0,"5":1218.0,"6":1219.0,"7":1220.0,"8":1221.0,"9":1222.0,"10":1223.0,"11":1224.0,"12":1225.0,"13":1226.0,"14":1227.0,"15":1228.0,"16":1229.0,"17":1230.0,"18":1231.0,"19":1232.0,"20":1233.0,"21":1234.0,"22":1235.0,"23":1236.0,"24":1237.0,"25":1238.0,"26":1240.0,"27":1241.0,"28":1242.0,"29":1243.0,"30":1244.0,"31":1245.0,"32":1246.0,"33":1247.0,"34":1248.0,"35":1249.0,"36":1250.0,"37":1251.0,"38":1252.0,"39":1253.0,"40":1254.0,"41":1255.0,"42":1256.0,"43":1257.0,"44":1258.0},"Entry":{"0":"\n\n","1":" Last night we lobbed in the trenches such as they are, we crossed the open country in artillery formation, no one was more\n\nurprised than myself when they told us we were there; our trench they called it? why it was no more than 20 yds long & about up to your waist; it seemed so funny after scrapping & fighting so long in good trenches. My platoon took over three of these little outposts with a gap of 60 yds between & 200 between platoons & settled down for the night, we relieved the 59th Bn. when I came to look at our position I did not like the look of things at all for it would not be a very hard job\n\nfor the Huns to sneak round our left flank & take us by surprise I pointed this out to Mr. Champion & he then posted 2 sentries out from us about 100 yards so as they could give warning of anything of that nature.\n\nAbout 12 oclock the Major came round & and said he wanted a patrol to go out & see if they could find any trace of the enemy on the Cambrai road it fell to my lot so I took 2 good reliable men with me & I started off, it was a brilliant \n\nmoonlight night, altogether too much light for safetys sake but that could’nt be helped, we approached the road warily keeping in the shadows & taking as much advantage of the dips in the ground as they would allow, in this way we got fairly close to the last 50 yards we laid on our stomachs & crawled, everything went well until we got within 20 or 30 yds of the road, then all of a sudden a machine gun & some rifles let fly, I could almost feel the hot air\n\nfrom the bullets as they sizzled over me. I flattened out like a pan cake & my one wish was for the ground to open & swallow me up for a while, we all laid there quietly not moving a muscle for a good 10 minutes & old Fritz did not shoot anymore, he could not have been too sure of himself had the ‘wind\" up I think, when everything was quiet I whispered to my 2 men to break back one by one while I covered their escape, they started off slowly\n\n& drew no attention & by degrees got over a little rise & were quiet safe, it was my turn now & I crawled slowly away feet first keeping my revolver ready for instant use, but not a shot was fired, when I got over the little crest I can tell you that I breathed a big sigh of relief or the last 15 mins had been a big mental strain, we had a very lucky escape, got back however & reported progress, & all concerned were well satisfied, especially as I could tell them the exact\n\nposition of the hidden machine gun. All the next day we had to lay as quiet as mice for if the Germans spotted us moving about they would blow the little trenches to pieces & us with them.\n","2":" Put the day in cramped up in an old dugout, Mr. Champion Starkey & myself never got a wink of sleep the whole day for Fritz shelled heavily some of them lobbing uncomfortably close to us, towards evening rain & hail set in & we were faced with a bonza night\n\n& so it turned out, for it was \"Hell’ sleet and hail the long night through, & no chance of getting any hot stuff to eat or drink, in fact all the water we could get was out of the little puddle holes in the ground, for we dare not drink shell hole water as all that had been poisoned by the Boches, we put the night in building a \"strong post\" & wasn’t it a rotten job, but it was a blessing in disguise & practically kept us from freezing, just before \"stand to\" we sent out the garrison 12 \n\nmen in all. \n\nThere are a fair number of German dead lying about our boys must have got to close grips with them, you should see the way the hounds have destroyed things, blew great craters in the roads every mile or so ,& especially at all cross roads, chopped all telegraph poles down cut the wires & smashed the insulators to pieces, all the lovely avenues of trees have also been felled, they even went so far as to pull\n\nall the mangolds & turnips to let them rot so as the English could not get them, & as for the villages they have been thoroughly destroyed before they abandoned them, they are nothing more than a mass of stone plaster brick & scattered over all is the timber etc. they are a dreary & desolate sight & I can quite understand the silent & deadly rage of the French. God help the Germans if the French or for that matter the British ever get within touch of Germany, I have \n\ntried to fathom the reason why the Huns should destroy all the fruit trees, pull the lovely flowers up, destroy all pot plants & do everything in their power to make the country desolate, surely they don’t think that such actions as these will have any effect on the war.\n","3":" Today they blew our Hqrs to pieces in Dioques, killing 3 men and wounding 4 others they had to dig themselves out of the cellar with a pick & he was lobbing his 5.9s home all the while, some \n\nof their phosphorous shells set the whole joint alight, soon she was blazing merrily & explosion after explosion took place as the Germans had left a good many stores of bombs & ammunition laying about in her, mingled with the flames were all sorts of pretty lights, green red, pink white & so on. These were the store of German flares which were also in there, she was a regular magazine & when we got in there we found some \"mines’\n\nwhich had failed to explode these our engineers rendered harmless & put outside a few days ago.\n\nWe were supposed to go over the top tonight, but for some reason or other it was postponed & the","4":" 12th done the trick It was while this stunt was raging that I got my crack. I had been working all night getting my men water & one thing & another, & about 3 oclock I went over to see if our cooks had our hot meal ready, they were cooking\n\nin an old cellar which they had discovered full of china ornaments etc. these they cleaned out & made of the cellar a cookhouse, but they could only cook at night hence my visit to them. I was informed that it would be ready in ½ an hour so I started to go back. I had scarce got out in the road when all of a sudden every machine gun & rifle within miles seemed to burst out firing, & bullets flew thick as hailstones. I could see\n\nI was not in one of the pleasantest places so I just started to make a dash for our trench when \"whack\" a thrill shot through my shoulder like a thrust from a red hot needle & I stopped in my track. I scarcely knew what had happened for a minute then I felt warm blood trickling down my arm. I realised then that I was hit & I \"about turned\" & made for the safety of the cookhouse & there got my wound dressed. I was fairly cool as I took \n\nmy clothes off, for to tell the truth I was rather glad & when I saw I would get away for a little while I shook hands with boys & was as pleased as punch; the cooks put some iodine on the wound & bandaged her up. I then had to wait till the shelling ceased a little & when it did I made a dash for Coy. Hqrs. Just as I got there old Fritz put a most terrific barrage over the very road where Hqrs were, how we escaped being blown to pieces \n\nis another mystery to me for 5.9s were flying and bursting all around us & we could scarcely breath for the dust & foul fumes from these deadly shells what makes our escape all the more marvellous is that we had no cover only a little sunken road, we crept out of her by degrees & once more I breathed a sigh of relief, just as day was breaking I went out through the back of Doiques, the shelling was still very heavy, though not quite so concentrated. I made\n\nmy way slowly down the Bn. Hqrs. & there the Dr. dressed the wound & an A.M..C. man took me down the road a little way & showed me the way to the next dressing station reaching this they directed me to a place where the wounded caught ambulances. had to wait here a fair while & saw some horrible wounds, got away at last in a horse ambulance & so ended Easter Sunday for me.\n\n9th. Continuing our journey the ambulance dropped us at a Field Station & here they\n\nexamined us, & worst of all inoculated us again this time for lockjaw, heavens how it stung the needle was as blunt as it could possibly be & they drove it right home, it made me contract every muscle in my body so painful was, however after it was over we had a good feed of bread & butter & hot tea this was a God send for we were famishing, while we were waiting for the motors to take us further on, down comes Bellchambers with a piece of shell in his foot \n\nour next trip by motor took us down through Bapaume to Pozieres here we were taken off again & another examination & another good tuck in. from here we were put in Red Cross motors & taken and taken down through Albert to \"Edgebill\" a big clearing station with a railway right at its door, here we were examined again & classed. Bell & I were put into the evacuation ward & given a bonza bed, & a good feed. How we slept that night like logs I never woke till\n\ntill I felt someone shaking me when I opened my eyes there was an orderly with a basin of hot water for me, had a good wash & then breakfast was brought on a pretty good one too & we done it full justice. that evening a poor thin wasted Tommy was carried in. how pale & miserable he looked & from what he told us a little later no wonder. it appeared that he had just escaped from the Germans after being a captive since\n\nBeaumont Hamel was taken he told us all the tales we hear of how they feed their prisoners is quite true, he was very lucky getting through the German lines, the 48th Battn. collared him.\n\nIn the morning we were carried out on stretchers, couldn’t walk for they took \nus\n our boots away last night. we were put into motors once more & these ran us down to the Hospital train how splendidly they are fitted up bonza beds & all\n\n& they put me snug into one of them, & there I stopped until the train reached Rouen, hanged if it was just snowing again when we were taken out & driven to the hospital in motors again. I finally landed in No. 6 an English hospital & I never wish to get in one again they are absolutely rotten & the tucker is worse I nearly starved during my few days there & if they hadn’t let me out when they did I would have bolted & \n\ntaken the consequences, that night when they took us in we were put into bed & our wounds dressed, but hang me if they would give us any tea. We were nearly all Australians in there & I can tell you that we kicked up a row\n","5":" Had a rotten breakfast & ditto day, it was dead funny the way our fellows used to get the Tommies going & anyone with half an eye could see that the sisters did not like it either, but that\n\ndid not trouble us at all, in fact all the more \"chaff’ was thrown about, you might not believe me, but it is true that the English are positively jealous of the Colonials, by that I mean the Canadians Africans & etc. they will be more so now the Canadians succeeded in taking the formidable \"Vimy Ridge\". The result of the battle around Arras caused much satisfaction to all of us, we had been expecting it for a long time but had no idea it would \n\nhave been such a great success it just goes to show what we can do when we want to.\n","6":" Another rotten day & to make it worse it is snowing outside like the middle of winter I pity the poor devils in the trenches one cannot help thinking of them wounded are coming in whole sale but they all seem cheery\n","7":" Fed right up to the neck & had a small row with the Dr. & nurses. I wanted to get out of it & after a lot of argument the Dr. consented, how glad I was that evening \n\nwhen after a lot of messing about, I finally got my clothes on again, you should have seen me, a pair of boots 2 sizes too large, a pair of old trousers a faded and tattered 2nd Div tunic but to me it was much nicer than the best Tommy tunic I could have got, for it was Australian old puttees, & a rotten Tommy cap, could not get a hat for love nor money I looked lovely but was quite satisfied, from the hospital we went into one of the worst disgraceful & bully\n\ning camp as ever I wish to see it was run almost by Tommies entirely, with the exception of the Colonials portion. They found through experience that they are a nasty crowd & won’t be bullied, so they set them aside & we have our own heads but the way these cold footed swines dog the poor Tommies is something disgraceful I wouldn’t be in the English army for anything, I would be in the clink the whole time I am sure of that, & the tucker we got at this\n\ngaol was about enough to keep you alive, this is a sample of the Sergts Mess breakfast, a tiny piece of fat bacon & a slice of bread with cup of tea, finish; dinner, boiled mutton with 1 spud, no bread, no tea, & about enough sago to cover the bottom of a saucer, for tea 1slice of bread & butter & a minute portion of cheese, cup of tea and there you are, a jolly sight hungrier than ever, try as you might you can get no more, so we wend our way to the canteen & join \n\nthe mighty crush that surges like an angry sea round the counters swaying this way & that all elbowing and jostling for a foothold & a grip on the counter lucky is the man who gets served under ½ an hours crushing.\n\nAnother detestable thing about this camp is the number of petty restrictions placed on you, this to an Australian who has been used to a free independent life is a terrible irksome affair & makes anyone inclined \n\nto kick over the ropes, where ever you turn you seem to run into some \"red cap\" or other, & you can’t go there & cant go here is the cry of these wasters, I have nearly been grabbed twice already for telling them some home truths, how glad I will be when we get back to our own Australian camp again\n","8":" This morning every Australian put in for a pass to Rouen & they said it was not granted they would go on their \n\nown, this arose because the C.O. of the camp would not give leave \" to any of us & had not done so for some considerable time, & the majority of the boys had no money to buy tucker with & so were nearly starving the Sergts got little enough goodness only knows, but the lower ranks got worse, the C.O. did not know what to make of it, so he sent for R.S.M. O’Loughlin one of our chaps and told him if he liked to put us on our word of honour that we would be back \n\nin Camp by 8 oclock we could all go down in a body so all the men were lined up & the old R.S.M. addressed them & told them the case & all swore they would be back on time. I’ll never forget the way the Tommies opened their eyes when they saw & heard of this happening, it was a wonderful & unheard thing to them They telephoned down to the authorities in Rouen that we were coming & were not to be molested for \"passes\" by the \"red caps\" or others\n\nso we marched down to the tram terminus in a 2 parties the R.S.M. in charge of one & Sgt Stott & myself in charge of the other, 130 men in all & we had a sprinkling of N.Z. S. Africans & Canadians with us, so we were all Colonials reaching the terminus we caught the trams which ran us across the busy Seine up through Rouen & opposite the Park or Gardens we all got out for our Pay Office was quite close here. we were soon paid & then\n\nstrolled off the have a look at the old historic town, to tell the truth she is a much larger & busier town than ever I expected to find, plenty of trams running & crowds of fashionably dressed people thronged the streets I expect the lovely day brought them out for it was nice & sunny walking down one of the streets I bumped into Les Wayling & had a chat to him.\n\nIn the middle of the town is a big market place\n\n& on the corner of one of these there is a big tablet in memory of Joan of Arc. it was here on this very spot that she was burnt by the English as a witch & the French have a great wreath of flowers placed over the tablet & in a half circle over this again the French Red White & Blue hangs while down on the pavement there is a great white block of stone let into the cobles & this also has an inscription on it, as I stood there &\n\nread the tablets I thought in my mind I could see the whole thing being enacted over again.\n\nOverlooking the town perched on a steep rocky little hill with the old Seine quietly flowing beneath, the ashes of the Maid of Orleans rest in a fine little church which has been dedicated to her memory. the burning of Joan of Arc and the execution of Mary Queen of Scots always seems to me, to be black spots on England’s fair name\n\nAfter a while I went and had a look at their Museum & Art Gallery, their gallery is easily the best in my opinion that I have ever seen, it is something beautiful & the pictures are shown off to perfection I wandered for nearly 3 hours through the splendid galleries, it is a work of art the inside alone without any of the magnificent pictures to help it along, there are some halls in there which almost make your blood run cold with the pictures\n\n \n\nin it, scenes from the French revolution & the trials of the early Christians in the old Roman days, the Napoleonic pictures are splendid & such a size & the colouring of them seems almost perfect, in addition to the pictures they have some rare & wonderful old china of the ancients & the porcelain & earthenware of centuries back, such peculiar shape & build they are, & tiles of all sorts & designs, the floor of this building is of hard polished\n\noak, & if you don’t watch yourself down you come. I could have put in all the afternoon in there easily it was so nice & restful, but I wanted to see their Cathedral, she is a beauty as all the big churches of France seem to be, there are some lovely tapestries in there by the time I had been through these places of interest and bought a few little curios it was time to make back so I boarded a tram, & so back to\n\ncamp & starvation.\n","9":" This morning the roll was called of all the Australians who went into Rouen yesterday & only one failed to answer his name, that was a fine record & justified their word of honour, the C.O. was well pleased so this afternoon they are letting the mob who came in yesterday go down.\n\nIn this camp the Australians do no fatigues the Adjutant reckons they are more nuisance than\n\nenough, that is because the Tommies don’t understand our chaps, & start bullying them, that’s the end of things once they start that game for they will work for no one who does that, the ‘Orstralians\" as they call them are a nightmare to the Tommy Sergts here & they are always glad to see the back of them there is no doubt about it the average Tommy is far more tractable & obedient than our chaps, they never dream of answering back etc.\n\nThey also told us this morning that we would be leaving for Etaples most probably tomorrow & the sooner the better Camped in the same tent as I are 2 Bantam Sergts from the battalion we relieved when we first went into the trenches at Fleurbaix & Levantie\n","10":" Woke up this morning to find it raining like blazes don’t know whats come over the country at all, in the last two days we have had 2 snow storms, 3 heavy frosts, 2 fine\n\ndays & 1 wet one, rather a funny mixture \n\nHad a roll call this morning & not a man was missing that was a good record to prove that the Australians can keep their word of honour if they will only trust them. We are all going to Etaples this afternoon, saw Hubie Bowden this morning I should not have known him but he recognized me.\n\nHad an early diner & fell the men in, it was raining steadily at the time, after a\n\na lot of messing about we got the party split up & rations distributed. I had charge of 59 men, we marched down to the station & before leaving tea was served, this was very welcome we pulled out of the station at about 4 in afternoon & crossed the Seine again, she is a wide and deep river here & runs at the foot of very steep hills on one side & on the other flat country, while all along the banks of both sides is simply crowded with shipping mostly \n\nbarges & small pinnances, for just above the bridges leading from our part of town to the other there is a small island which splits the river in two & on the top sides of this island there are two very fine steel bridges one the railway & the other traffic as we leave the bridge we cross a narrow stretch of the town & dive under a hill, this brings us out on the edge of Rouen & into a very rich agricultural valley which extends for a considerable distance, the country on the \n\n average is much more hilly down here than the north, we put the night in the train & we were very tired by the time we reached Etapes which was day break, here we got out & were sorted out. I took charge of the","11":" Div details & marched them up to our camp, where we were all fixed up, saw quite a number of our chaps down here some \"swinging the lead\" & some strutting about with \"bucksheesh’ Sgts stripes up, they don’t kid themselves either\n\nAfter I had finished I had a jolly good wash & this freshened me up considerably \n","12":" This morning we were all classified, I was given 2 days \"light duty\" & then marked Dental\" & after that A class. Have seen a good number of Portuguese round here, they are of a dark brown complexion, & are all of an average size not as fine made men in my opinion as the French, though they seem very active & smart & move about quickly, their uniform is a color between\n\nthe French & German & seems to be of good quality. I have not seen their arms or equipment as yet.\n\nPlenty of good Y.M.C.A.s here they are all practically run by well to do people.\n\nVery cold & miserable first thing this morning but later on it turned out nice & sunny\n","13":" Misty rain has been falling all day long. Got issued with clothing & equipment, so am a soldier once more.\n\nWhat a difference in the way this Camp is run compared to the ones I saw at Rouen run by Tommies, now I was always under the impression that the Australians knew nothing at all about running camps or organising things compared to the British what a bloomer\", for I am satisfied now that we are right out in front of them and have nothing to learn from the Tommies indeed if all their camps \n\nare anything like those fearful things at Rouen, well they should be thoroughly ashamed of themselves it’s a moral that the public of England have no idea of how they are run, or they would kick up a noise for a certainty. I shall not forget them in a hurry. I saw one little instance down there which did not improve my opinion of the English officer as regards treatment towards the men it happened this way \n\nwe had just marched in from the hospital & were standing about in the rain waiting for someone or other to come & take us over. I was standing there with my hands in my pockets along with the rest of the boys, when a Tommy officer walked past us, but we took no notice of him, not a man saluted or even stood to attention, he said nothing but about 30 yards lower down he ran across a poor inoffensive little\n\nTommy who was standing outside an office with a parcel under his arm, as the officer approached I saw the Tommy stand \"to attention\" but did not salute, which he was quite right in not doing, the officer walked past him for a yard or two the he turns round & nearly jumps down the Tommie’s neck for not saluting, after a lot of lecturing he calls one of the cold footed wasters of a red cap over ( who had been standing\n\nthere with his mouth open taking it all in & waiting for the opportunity of putting him under arrest, I suppose instead of making himself scarce) & puts him under arrest\" my blood fairly boiled when I saw this & so did the rest of our chaps who had been watching this little scene, but would have taken little to start them going, they had an experience down here last year of the Australians that they are not likely \n\nto forget in a hurry, & they are going the right way from what I have seen to have another riot, & may they teach the officers & N.C.O.s concerned in it as severe a lesson as they taught them last year.\n\nA fair sized batch came in today from Rouen.\n\n19th Ran across Stan too last night, what do you think of that & he had been living within a stone’s throw for the time I had been here & did not \n\nknow it, it never struck me to go down & ask in the 12th Battn. lines for him how I came to meet him was this way. I was coming into the tent & going to go to bed when one of the chaps in the \" orderly room\" said to me, one of your brothers was here tonight looking for you I guessed who it was straight away, & I started off down to the","14":" Batt. lines to see him I had only just got out of the tent when\n\n I spotted him coming up the line. I recognized him immediately, & he knew me I don’t think Stan has changed at all, I was delighted to see him, & it was very late that night when we went to bed.\n\nHave had a party on fatigue all day & tonight I have to take a piquet into Etaples which I did at about 4.30, she is not a very clean town, for\n\n the population derive their income from fishing which is a great industry here, you can see from the cut of the people that they follow a seafaring life, they seem to be very industrious, women girls and all working everywhere and with a will the women & girls wear clogs & bright petty coats & carry great baskets of fish over their shoulders, while the old women 80 or 90 for\n\nthey never seem to die in France from what I can see of them, make fishing nets etc. Our chaps have great fun here with the fisher girls for the Australian is a great favourite, it’s a peculiar thing almost where ever you go you will see some of our chaps flirting with girls and walking about with them, while other \"’Forces\" can hardly get a girl for love nor money. The French Navy get a lot\n\n \n\nof their sailors from this district.\n","15":" Went up for examination this morning & was passed so will be going away tomorrow & wont I be glad. A big batch of men have just come in from Blighty some of them have been in England for 18 months & more what a \"gutser\" they have come.\n\nAll the Australian canteens down here are seen exclusively for us & Colonials, on the \n\ndoors outside they have chalked up in big writing \"no Tommies allowed in here\" & whats more there is a regular piquet supplied which keeps them out, this seems ridiculous dosn’t it, but it was brought about by the Tommies themselves for they would not allow Australians in their canteens at any price, so we played the same game but now comes the funny part, under \n\nthis heading, \"the jocks\" come, & accordingly should be kept out, but they are not, they are the only British troops allowed in our canteens, & aren’t the English troops jealous because we show such a favour to the \"Jocks\" the canteens are crowded with Scotties of a night time, you have no idea how well the Jocks & Colonials hit it together, they always give us a hand when\n\n \n\nthere is anything doing, & we swear by one another.\n","16":" Last night I saw the list of candidates for the coming election in Australia I hope the Nationalist party win & I think they will get a big majority of the soldiers votes this time for opinion is changing fast. Had an argument with Shaw the Sergt Major of the 1st Bde last night and told him to go to Hell\", tried to put a job on me which it was not my turn to do.\n\nLeft Etaples this morning & marched down to the train, & soon we were bowling merrily along, it was pretty cold for a start, but in the afternoon the weather took a turn for the better. We went through Amiens & Corbie this time & called at Albert about 2 oclock & then marched to the Reinforcement Camp just outside Albert & and here we all got our respirators & tested them, after this I came into Albert & \n\nhere I am in an old Y.M.C.A. with plenty of shell holes in her, scribbling away as if my life depended on it. I went to bed very late last night Stan & I talked nearly all the night & you can bet we had a lot to talk about, seeing as how long it is since I have been home.\n\nJust close to our camp are 30 6 inch guns drawn up along the road they have brought them down from Vimy Ridge to be overhauled\n\nafter the great bombardment they have been putting up.\n","17":" Beautiful this morning & the sun is shining brightly. Had 48 hours rations issued to us biscuits & bully form the greater part of it.\n\nLeft camp about 10 oclock & after a fair march pulled up at Bazentin Le Petit, a place I have been in before, on the way up we passed fairly close to \"Pozieres\" what a difference there is now to when I first knew \"Pozzy\"\n\nhe is all cleaned up and motors are running through her, huts are all over the place, & not a gun or a shell to be seen, but the ground still shows traces of the terrible battle that was fought for possession of this little village, & it will live in memory for it was one of the places that made Australia’s name famous through out the world.\n\nAfter I had a bit to eat, which I might add here consisted of a big dry biscuit & nothing \n\nelse, I thought that I would have a stroll round & have a look at some of the places I was familiar with. I first went down to the big dump, & here on trucks were 5 big \"tanks\" just arrived they only wanted their guns & \"barbettes\" fitting & they were ready for action, they all had names taken from successful shows, such as \"Peg of my heart\", \"The Bing Bhoys\" etc, but what a desolate place the station was compared to\n\nwhen I had known it last gone were the hustle & bustle of thousands of men and hundreds of trams that used to crowd round the dump, the only thing moving was a little engine called \"puffing Billy\" belonging to the \"Anzac light railway\", while there not more than 2 or 3 men on the dump, all the buildings have been pulled down, tents taken away, dugouts everywhere empty, while even the road was deserted, the place looks very desolate \n\n& lonely now, of course the reason for this is very simple it is too far behind the lines to be of any use now the Hun has been pushed back, they have started to clean the mess up in places, every here & there you will see great craters being filled with barbed wire & such rubbish, while the big German dugouts are being stripped of their timber & then blown in & levelled off, we won’t know the place soon for the grass is springing rapidly & will hide all the \n\nugly great shell holes of this battered country.\n\nAway in the distance I can hear our guns rolling & grumbling like thunder, but slowly & surely battering the Hun to pieces, there is no doubt now as to who is going to win, the fingers point very plainly but it has been a hard & costly struggle, but I think we have entered on the last phase of the war, & soon she will be over, & whats left of us sailing for all we are worth away to the \n\nunny South, the place which has been so long the land of our dreams, it is a bonza afternoon & I am sitting by an old deserted dugout full in the glorious sunshine which is pouring golden beams down, making everything beautiful, while above me the larks are singing sweetly & the other birds are keeping company, while everything has a tinge of green telling of fast coming spring, away up in the heavens the aeroplanes are droning as they\n\nas they pass backwards & forwards going to or from the line.\n\n23rd Nearly froze stiff last night it was a great strain sleeping with only 1 blanket after having so many down at Etaples, did not get up till just on 8 oclock then we had breakfast, biscuits again formed the greater part of it, but there was one great consolation & that is the lovely sunny morning, it is beautiful outside, & away over our heads the guns are peppering a German aeroplane \n\nwhich has ventured over our lines in the hope of finding out something of our movements. The artillery was very active last night & it is even more so this morning for it is one continuous roll, a \"drum bombardment\" we call them for it resembles from a distance the roll of muffled drums.\n\nThis afternoon the 1st & 3rd Bde details left camp & if we did not have a long and weary march it was a caution we marched right from \n\nBazentin up through Martinpuich, Le Sars & so up to Baupaume, we pulled up about a mile outside Bapaume at Div. Hqrs. left our officers here, & I then took charge of the Bde & with a guide brought the Bde just on 5 miles further to a place called Velu, we reached this just at dark & the men were strung out for miles knocked right up, here I separated them & sent them on to their different Battns, after I had finished I \n\n \n\nwent along to our Q.M.s & Bill Bradley cooked me a fine tea, bacon, chops, bread & butter & jam, & plenty of good tea, and didn’t I have a set to for I was as hungry as a hunter, having nothing to eat for just on 24 hours after this Bill produced a bundle of letters these were very welcome for I had had no mail for some time finished reading my letters & then turned in with plenty of nap, but I could not sleep for a big naval\n\ngun was quite close to us & she was firing round after round & each time the concussion would nearly deafen one, however I dropped off before morning & slept till nearly 9 oclock, & had breakfast with Freddy Turner our R.Q.M.S. & a good spread it was.\n","18":" Yesterday 12 of the","19":" Battln were blown sky high by a mine which exploded in the cellar & blew the house and everybody to pieces I believe it was an awful affair for the men were in\n\npieces and had to be gathered together, there have been a fair number of accidents from the slow mines since the Germans left these parts.\n\nJust where we are camped there had once been a lovely chateau but the Huns blew it to atoms before they left & destroyed the fine park & gardens. The Division are coming out tonight have seen a fair number of them, they were surprised to see me back so soon. We are going to bivouac tonight in the wood\n\njust close handy we are expecting the Coy in about 12 tonight & I expect they will be done right up for they have had a rough time. It has been a most glorious day & the sun was quite hot. Got 2 parcels tonight.\n","20":" ‘Anzac Day\" broke dull & cloudy, & we have moved off further back very slow for the men are very sore & tired for they had a rough time while in the trenches this time & the march was more in the shape of a procession, the Battn\n\nwas spread over a big area of ground before we finally marched into our camp. I was very crook for I had caught another cold & felt anyhow. I laid down all that day & had a wash just before tea & then went to bed, we had a concert in our little tent to celebrate \"Anzac Day\" some of the boys got a little merry for rum was fairly plentiful. Freddie Turners brother was killed the other day at Arras. He was in the R.M.L.I.s & and was attached to the Tanks \n","21":" Packed our greatcoat & strapped it on our haversack and marched out to support the 2nd Div in the hopover they are supposed to be making tonight, they told us it was only a matter of a couple of miles, but it was nearer six, I cant see the good of telling men these sorts of lies for it only makes them grumble & growl as they climb the never ending grassy ridges & see no sign of the joint in sight only more ridges stretching away in the distance\n\nIt has been a glorious day again & the artillery has been very active, we halted quite close some of our 9.2 it was very interesting to watch to watch them lift up their black snouts & spit for the fire & flame & steel & see them jump back on their recoil springs, & then the gunners jump to the gun & attend to her wants.\n\nAfter we settled down Judd & I went looking for a canteen to see if we could buy anything for tea, but we had very little luck for they were all sold out\n\non our way back old Fritz started to drop some heavy shells at random all over the place, & as we were coming home, one chap said to us you ought to see the size of the base of those shells just look in there he said pointing to an old dugout, so I went across & and walked inside as we generally do, I never noticed who was in there & was busy examining the base, when I heard someone say \"who are you\" I looked up & to my surprise I had walked \n\nright into an officer’s hut & they were having \"mess\" well I had to burst out laughing as I went out the look of surprise on their faces was so funny.\n","22":" Moved back to the tents again this morning & by a much shorter route.\n\nAm on guard this evening & have 8 men in the clink nearly all deserters.\n\nLooks like rain tonight so I got the men digging little trenches round the tents.\n","23":" There was a very heavy bombardment raging all night so I expect there has been a big smash down the line again. Nothing to report today am on \"guard\" & things are very quiet. On of our fast new triplanes brought a Taube down lovely yesterday, the plane came down in our lines & a little scouting plane followed her right down to the ground & lit alongside the Taube to take the occupants prisoner I suppose & to claim the machine.\n","24":" Packed up & left Le Transloy this morning at 9.30 & marched to the same trenches we were in a few days ago, it was a glorious morning & as we slowly marched along it seemed more like a huge picnic than anything else, all over the place horses were quietly grazing on the new Spring grass & they were enjoying it properly while the chaps who were looking after them were lying on the grass sunning themselves\n\nwherever you looked you could see rows & rows of snow white tents & hundreds of men moving busily about & in the air the planes were practicing, looping the loop, corkscrewing & tumbling about as if they were born in it, it is marvellous the way they can handle these things. but there was one thing that we could not help hearing & that was the slow & steady rumbling of the guns away in\n\nthe distance, but they held no terrors for us, only now & again brought us back to earth from our dreams by an extra heavy roll of thunderous reports.\n\nThis afternoon there was a bit of excitement a Fritz plane drove one of ours down but did not damage it. you should have heard our machine guns & Archies open on him the machine guns brought him down, he had a bright red body on this plane.\n\nWe also voted this afternoon held it in the trench, I’ll bet 90% voted for Hughes’s party, they will have a big majority from the soldiers this time.\n\nI believe old Jock is going the England on the Instructional Staff I will be very very sorry to lose Jock for he & I have been great pals & I have always found him a chap worth trusting & a right good fellow few better & honest as the sun, I will be\n\nquite lost when he is gone for I make very few friends that is friends like Jock.\n","25":" Hot & sultry today & feels like rain.\n\nToday we have been doing Coy. drill &etc. & yet in the morning & evening we have to \"stand to\" it does seem ridiculous we are easily 5 miles behind the firing line. Got a bit of a shock the Capt told me that I would be going to England in a few days, but I am not\n\ncounting on it. I will have to be right in England before I believe it.\n\nGot a bonzer parcel from Mrs. Mitchell today & there was a fine cake in excellent condition which was very welcome to us.\n","26":" An almost perfect day bright warm sun with just a cool breeze blowing, it made our drill quite pleasant, though it was very little I done, Jock & I done nothing but stroll about, for the junior NCOs\n\n were being put through their paces.\n\nFor not \"standing to\" of a morning quick enough, we have to get up ½ hour earlier in future, at least they are going to try & enforce it.\n\nPlenty of shooting for the anti-aircraft & machine guns for the German planes have been very busy of late. All this afternoon great strings of men have been passing along the road bound for the firing line I fancy they are 2nd Div.\n\n& plenty of guns have gone up also.\n\nThis afternoon we were all on a job, filling up an old trench which would be handy if ever the Germans managed to get through.\n\nDepina came back from leave today he looks well. \n\n2nd Parade again as usual yesterday, but we put up a rotten time in drilling.\n\nThis evening all the Coy. were on fatigue, had to","27":" miles & reached\n\n \n\n \n\nour destination about 10.30 there were nearly 3,000 on the job which was putting a deep communications trench over a very flat piece of country for we were going to attack very early in the morning, the 2nd Div. was going to do the job & we had to get it down by hook or crook before 2 oclock the men worked real well, & we had a fine deep trench finished by 1.30, while we were working old Fritz put a few rapid salvoes over towards us, but 19 out of 20\n\nwere duds.\n\nWe were very tired by the time we got back to our trench & soon after it was \"stand to\" after this I went to bed and slept till breakfast.\n","28":" The guns opened up last night with a terrific bang. Just a few minutes before \"zero time\" there had been an ominous silence then our guns let fly & before you could look round the whole crowd let fly for all they were worth & the heavens were lit up by\n\nthe flames from the gun muzzles, they stabbed the night with vivid bright red stabs of fiery flame, there seemed to be guns everywhere you looked & the night was filled with an awe inspiring carronade which made the very earth rock & tremble & and the air to vibrate so mush that a candle would scarcely burn.\n\nWe were going to have a bath at 9 oclock this morning & started off merry & bright but we did not get far before a runner came \n\nhurrying over with the news that we were to return at once & get ready for the firing line as the 2nd Div. had been badly mauled, this was a shock to us, but we hurried back & set to & threw our things together, & Sgts drew their bombs ammunition & etc. & issued them out to their men, all was hurry & bustle for a while, but everything was ready in no time & we were ready to march off, which we soon did my platoon leading, the \n\nday was very hot & the roads dry & dusty & soon we were all covered in sweat & were quite white with dust, we marched rapidly for it seemed we were urgently needed but when we reach Vraucourt we found we had to wait till dusk before we could go any further, so we got our men in some old buildings so they could rest & sent the \"orderlies’ down to the \"cookers\" for their dinner I had a new officer with me & all he knew was harmless\n\n& I had to run the platoon practically on my own.\n\nGerman prisoners & wounded were passing through all day & so were our boys the Red Cross cars were very busy & we could see that the casualties had been very heavy, but what could one expect, for breaking into the famous Hindenberg line was a very great feat.\n\nAll day long there has been a most terrific artillery battle going & the roar of the guns is deafening, especially the 60 pounders of which there \n\nare quite a lot close to us There is one remarkable thing I have noticed since this battle started & that is the almost total absence of the German planes, it just shows that we have the mastery of the air, whenever a battle is raging our planes go right over the German lines & engage the Hun over there & prevent him from having a quizz & that is what is happening now as I sit here at the door of our old ruined farmhouse I can see dozens of our planes scouting \n\n \n\n& wheeling about.\n\nLast night some of the 5th Bde machine gunners brought a big heavy machine down, he was very cheeky & came down too low with disastrous results. \n\nThere has been some very heavy fighting around Bullecourt, the Tommies got through all right but failed to hold it, the result is that they have left the Australians in a very nasty position & both our flanks are in the air & that means enfilading fire the worst of all to stand up to & tonight\n\nwe are going to relieve the 6th Bde. & we are going to try & bomb along their trenches.\n\nSome of the officers we have are getting lately have got the \"wind up\" already they would give a man the pip & they would be far better away for all the use they are.\n","29":" Just about dusk last night we \"fell’ our platoons in & Capt. McKenzie sent up for me as he wanted to speak to me before moving off, so down I went, \"Look here Barwick he said tonight you are going\n\nup to the line with a new officer, stick to him all you can & teach him what you know & you will be practically in charge of the men for I can trust you, he told us we were going into a hell & he wanted to give me a good stiff drink of spirits, but I never go in for that sort of thing & it does not appeal to, me McKell was in charge of the Coy & he was already half drunk & took us a long way out of our track, then Jock Mackie got into holts with him & \"told him\n\noff\" properly, McKell was going to play the devil with Jock but nothing came of it & just as well he never reported Jock , for McKell would have got into a lovely row, it was the biggest mix up I have ever seen in my life getting into the line no one knew where any one was & we wandered around all over the place & under heavy fire too the result was that my officer got lost & took nearly all the platoon with him & I landed in the\n\ntrenches with 2 men & myself the portion of trench I was in was mostly 5th Bde & they had the wind up properly as they had lost heavily as the numerous dead lying about showed all too plainly, when we were taking over old Fritz made a counter attack but he was beaten off. I’m hanged if I know where were until day broke for shells seemed to be coming from all sides & flares were going up practically all round us it seemed very queer.\n\nIn the trench you never saw such a mess up in your life there were men from every unit in the 2nd Div. they were thoroughly disorganised & the trench itself the wonderful Hindenberg line supposed to be impregnable you should have seen it, it had once been a fine & deep trench & well supplied with the big dugouts which every German loves to hide in, but after the battering our guns had given it, well it resembled a series of holes in the ground\n\n \n\nmore than anything else I could compare it to.\n\n5th When we were taking over the trenches, we asked them if any of our men were in front & they said no, so a little while after some of us saw some men stealing slowly over towards us Jock McKenzie ordered his men to line the parapet & wait for him to give the order to fire for he wanted to make certain, so he let them come fairly close thinking of course they were Huns going to make \n\n \n\nan attack, when he thought they were close enough he gave the order to open fire, & the boys let fly into them but to their horror they found that they were firing on their own men, the fools in the trench did not know where their own men were to have told us such a thing, luckily however none of the lads were killed, they belonged to the 21st Battn. & they had just been relieved from a trench in front of us by the 3rd Battn. & were on their way out \n\nUp to about 11 oclock the morning was fairly quiet & all the Sergts were busy organising their men & fixing the trench up a little for we all expected to have to fight for it like tigers we got a good number of the wounded out, collected all bombs, fixed posts & reliefs up etc. & soon we were ready for the Hun, we did not have long to wait for he started a bombing attack & things were pretty lively for a time but eventually he was beaten off with\n\nconsiderable loss, & again each time with the same result then we thought that we would take a hand & A Coy. attacked him & after a fierce fight succeeded in forcing him out of nearly 300 yds of trench during this smart little action they captured between 30 & 40 prisoners, all big & young men, picked troops they were which made our boys success all the more creditable some of these Germans must have stood nearly 7 ft high\n\n \n\n& were broad in proportion they were the best stamp of men that I have ever seen in the German Army, it always seems to be the Australians fate to bump into these picked troops but the reason it is very obvious, for there is no doubt about it the Germans look upon the Australians as very formidable troops & therefore they take no chances & put all picked troops against us, consequently wherever the Australians are there is bound to be fierce fighting with heavy losses to \n\nboth sides concerned, you have no idea how his crack troops Guards etc. have suffered from the Australians, & for this very reason I am sure that the bulk of the German Army have a lot of time for the Australians as fighters, although they hate & dread us for they know we will never yield an inch of ground till they are absolutely blown out of it & will fight to the death.\n\nIn the afternoon I saw the prettiest piece of work I have ever seen in my life, it was a bonzer\n\night & we had a good view of it from our trenches for it was no more than 400 yds from our trench & directly in front the 3rd Batt. was responsible for it, it was a fight of bombs purely & simply our chaps attacked a very strong German position & after a severe fight which lasted fully 6 hours succeeded in driving them right out there was one chap in this who deserved a V.C. if ever a man did, we could see him time after time hop \n\non top of the trench & run along & sling bombs for all he was worth fair in among the Huns he had a big overcoat on & he used to carry a lot of bombs in the pockets, its marvellous how he was never killed the best of all to us was that our chaps used their own bombs back on the Fritzs you could see a Mills or two go over & with them half a dozen \"stick bombs\" we also used the Stokes.\n\nI also took a hand in this stunt, practically the first \n\ntime I have used my rifle with any effect since coming to France it was a second 19th May with me for I had a beautiful little possy, highly dangerous but worth the risk for the shooting I got. I laid fair over the parapet exposed to all the Huns but they apparently could not see me, or were too much absorbed in watching the result of the bombing competition. I could see the Germans quite plain. once they were bombed out of their stronghold, watched\n\n \n\nthem as they were forced slowly back turn around to sling a few bombs then go further back as a shower of our bombs would land among them, the beauty of it all was from my point of view that to escape from our men they had to run up an old communication trench & I had a splendid view of this practice enfilading it for a good 20 yds, I could see what was going to happen so I took the precaution to get the\n\nexact range before they started up it, it was exactly 600 yards & at this distance I am no mean shot. I had not long to wait for they soon made their appearance & I had the satisfaction of knowing for a certainty that a few of them would never see the Rhine again, the trench was quite white looking when I started but when but when it was all over there was a great splash of dark blue to be seen, I think I got the majority of the last of\n\nthose who tried to get up that deathtrap for it was nothing more nor less, for the last men had to expose themselves more than the first who went through for they had to rush over the dead who were already in the trench, how they never jerried to me beats the band for I must have been easily seen but only an occasional bullet & a few shells came near me. however when I finished I only had 8 rounds left in my pouches so you can guess I had a few shots. \n\nThe trench we are holding is the main one of the \"Hindenburg line\" & in a few places where it has not been battered down by shell fire a good 10 feet deep & fairly wide, the \"traverses\" are especially strongly built & look like great buttresses of stone, this trench is also provided with big deep dugouts & there are any amount of dead Germans in them these dugouts are more than welcome to us once we get into their trench, for there all our wounded are taken\n\n& they are as safe as can be. Hqrs. also needless to say make use of the big dugouts, the majority of them are 30 or 40 ft. in depth & the whole concern is strong & well timbered. In theses dugouts we find all sorts of things, such as bacon butter, black bread etc. while all their water bottles are full of coffee. I don’t mind drinking their coffee but I could not come at the eatables after what I have been reading in the papers, & I see no reason why we should disbelieve it. \n\n \n\nAll this stuff has been sent from Germany for it is packed in boxes of a uniform size & make, they also have plenty of their sausage they seem to keep this as valuable property the way they look after it.\n\nOn both sides of this powerful trench they have barb wire fully 40 yards in width it is a wonderful affair how our chaps got through it, but they did. We have had some terrific bombardments & the one\n\ntoday is very severe & as the day wore on it got worse and at 7 oclock it reached a climax I’m hanged if you could see 10 yds in front for the dust & earth raised by the bursting shells & this combined with the fumes, smoke, & stinking irritating tear gas of which they put over huge quantities made life almost unbearable & almost certainly very precious men were being killed all along the trench & we were all \"standing to\" for we were \n\nexpecting a counter attack at any minute, the cry for stretcher bearers was very insistent & these brave chaps were kept very busy bandaging & getting the wounded under cover, of all the things I hate to hear in a trench is \"stretcher bearers\" for it always means that some poor devil got a knock perhaps killed & we are never satisfied until we know who it is. Jock & I had a lucky escape while this Hell’ was raging we were standing trying \n\n to talk in the trench when a great shell probably an 8 in. burst fair on the parados behind us certainly not more than 3 yards above our heads hanged if I knew what had happened for a second or two for I did not know whether my head was on or not & how my whole body tingled it is a wonder the concussion never killed us stone dead I can tell you Jock & I lost no time in buzzing round to the next traverse where we overhauled one\n\nanother & luckily found nothing the matter.\n\nThis bombardment continued with unabated fury till about 10 oclock, when they launched their counter attack, it was against the 3rd Battalion & us especially A Coy. that they hurled themselves onto, they succeeded in breaking through the","30":" Battl. But only after a most stubborn fight & after their bombs had run out but it was only a temporary success for a \n\ncouple of hours after they organised a counter attack & aided by A Coy. who had beaten their attack off with great loss succeeded in recovering the lost portion of trench what a night. It was attack after attack they launched against this trench we were holding but every time they only added to the dreadful layer of dead in \"no mans land\" I am not over estimating things when I say that there are 3 Germans killed to every \n\nAustralian in this fiercely contested sector, a trip up the trench we have just captured is an eyeopener, but a terrible sight to even one so hardened to horrible sights as myself, for it is nothing more than a shambles it is absolutely packed with dead Germans & there they are, laying in all attitudes as many as three deep in places & heads & arms are laying all over the place showing the effect of our bombs, it is an awful \n\night & I jolly soon got out of it, for I felt quite sick. The bombardment continued all night long & the air was full of screaming whistling roaring shells for our guns were tearing it in properly & when morning broke we could see great spouts of dark coloured earth shooting into the air & shrapnel lashing all over the ground in front of us, it was fairly hailing down, & so it was on us it seemed as if both sides were revenging themselves\n\non the unfortunate infantry but of course that is always the way, we have to suffer. Things quietened down a little before dinner & we were very thankful for it, now & again they put a burst of whizz bangs over & these generally catch a few men for they catch them off their guard.\n\nDuring one of these quiet spells Bob Creasy & I were sitting in the trench, & the next thing that startled us was the appearance of \n\na number of Germans who seemed to spring from nowhere Bob & I immediately sprung up & came to the \"on Guard\" all this was done in a flash you might say for we never noticed that they were prisoners. We startled the old Huns properly for they thought we meant it, up went their hands & they pulled all their belongings out, but they had nothing of any value, the other boys had \"fanned\" them before they got as far as us\n\nI got a fine German automatic & a few more souvenirs while in this trench\n\nAbout 10 oclock a most wonderful thing happened a runner came hurrying up to Coy. Hqrs with a note to say that Sgt Mackie & myself were to pack up at once for England & we had to report as soon as possible at our Transport; just imagine our feelings when we heard this I was too dumbfounded to believe it for a long while, but\n\nJock & I packed up in a few secs, but we could not leave the dugout for old Fritz was shelling like old Harry it was dangerous to poke your head out, one shell caught a bunch of chaps just as they were opposite the dugout & wounded every one of them, one chap had his leg hanging off as he hobbled down the stairs it was an awful sight but he was as cool as a cucumber, there were no stretcher bearers handy\n\no we set to & bandaged them up ourselves . \n\nJust before we left the Huns done a dirty trick on 2 of our stretcher bearers, they went out with a white flag to pick up a wounded man who was laying in front just as they bent over him one of them got shot in the body & he collapsed his mate then picked him up & started to carry him back to the trenches he got nearly there when a German shot him stone dead\n\nit was one of the most bare faced cowardly thing as ever I have seen close, & if they don’t pay up for it a hundred times over I’ll eat my hat This order was as you may guess one of the most pleasant surprises I have had, & to think that Jock & I should get away together it suited us down to the ground for we have been mates so long now, but we were no ways safe yet for we knew we had to pass through a most \n\n \n\nintense barrage which the Huns were putting over our communication trench, just before we left Jock saw the Major & the Major said to him well Mackie I suppose you & Barwick are pleased you are getting out of it, you know he said it is up to you to have a spell for you have stuck it so long & I hope you will have a good time , a couple of hours after this he was mortally wounded & died the same night, his\n\ndying wish was that all men in the clink should be released if they would go to the firing line to help their comrades & that all fines were to be cancelled, then I’m hanged if 2 of them did not refuse to go up, I would put them up against a wall if I had my way & shoot them likes dogs.\n\nI will never forget as long as ever I live the time we had coming through that awful barrage & I firmly believe that there must be a \n\nkind Providence watching over Jock & I after getting through that hellish wall of fire, 3 times did we stop for a spell going down that lane of death & each time , not 3 secs after we stopped a monstrous shell lobbed fair in the trench & not more than 10 or 15 yds from us, & right at the end of the trench I’ll swear that a 4.2 did not miss my head by more than a few inches I felt the backwash of the air as it shot by\n\n \n\nmy face, all down this trench there were scores of dead men killed while trying to get through the barrage which he puts over now & again however we reached a place of safety at last & threw ourselves down utterly exhausted with the sweat pouring out of us, we rested a good ¼ of an hour & then pushed on slowly by easy stages till we reached Noreuil here some cooks gave us a good meal, it was bonzer for we were famished\n\nit was fairly late in the afternoon when we pulled up at the Transport utterly knocked out, we threw ourselves down on the grass until we recovered then had a good wash & the cooks gave us a good dinner After this we drew our packs & got some clean clothes & went to bed early for we had had practically no sleep for the last 3 nights\n","31":" This morning we pushed off for Bde Hqrs & found it after walking a mile\n\nor two out of our track, from here we had to report at Div. had to go through Baupaume to get to it, at Divisional Hqrs Gen. Walker saw us & told us we had all been selected as longservice & reliable men to send to England to do Instructors work, & he also said when you get over there don’t be frightened to tell them what the Australians have done at Bullecourt for he said the Australians seem to be the \n\n \n\nonly troops who are capable of breaking & holding the line in this particular sector & he said he was very sorry he had to lend these 2 Brigades to the 2nd Div. From here went over to some huts where we stopped for the night.\n\nSaw Tom Flattley & Bill Graham down here & had a good meal with them. During the night a Taube dropped bombs quite close to us, we would have been stiff if we \n\ngot a crack down here\n","32":" Left here for Albert we were lucky for we struck cars & got a ride right into Albert & so saved us a long weary walk.\n\nJock & I went over to Meaulte to see Len, we soon found him he was checking loads of trucks as they went through he was surprised to see Jock & I, we had tea here & I got some souvenirs from Len to take over, after tea we all walked back to our camp. \n","33":" Left Albert about 3.30 this afternoon & I hope I never see it again we travelled as far as Amiens in a truck & here we had to wait for a couple of hours so we strolled up the town dodging the M.P.s & had a meal & a haircut got back in time to catch our train, it was very interesting to look along the platform here & watch the different types of soldiers passing, there was quite a number of\n\nFrench Colonial troops here & they have showy & peculiar uniforms.\n\nThe country on the way down looked lovely for we had just had a heavy shower of rain & it had freshened things up a lot Arrived at Bologne about 11.30 & marched round to a big rest billet where we stopped the night.\n","34":" Jock & I had a good hot bath this morning & just as we were enjoying it, an order came round\n\n \n\nfor all \"duty men\" to fall in at once so we dressed hurriedly & ran upstairs & got our gear on just in time, we were then marched down to the boat, & here we waited for an hour or so before we got on the boat, just as we were getting aboard a redcap spotted the German rifle which I was trying to smuggle across, I pitched him a tale about taking it over for instructional \n\npurposes but it would not work so I had to part with it, after carrying it all the way from the Hindenberg line but I got all the rest of my things over safely.\n\nThe trip across the Channel was nice & smooth & we were never out of sight of destroyers & patrol boats, perhaps this was because we had Haigh & an Admiral on board, arrived at Folkestone after a couple hours run, this was my second trip over here, how nice \n\nit was to be among English people once more, so far this trip had all seemed a dream, but once we arrived in Blighty we woke up, had a bonzer run to London & then we all marched around to \nVictor\n Horsferry Road & reported got fixed up & Jock & I went up to Wellington Barracks where the Guards are Jock had a brother in law there so we left our packs & etc. here\n\nAfter getting rid of the pack I suddenly decide that I will have a run down to Littlehampton for I find that I can catch a train that will give me time to get there & and back by 2.10 tomorrow so I sent a telegram off & went down to the station taking all my souvenirs with me for I am going to leave them down there, am just in time to catch the train & reach Littlehampton by 11.30. Mr. Duke is\n\nwaiting on the station for me & we walk home together he was delighted to see me & we sat up till 2.30 talking & yarning, after this I went to bed slept like a log till 9 oclock then Mr. Duke woke me up for I had to catch the 11.10 train back to London, after breakfast had a look around his garden & lawn & then we strolled down to the station & just caught the train\n\nwhich landed me back in London after a very fast \nra\n run at 12 oclock, went round then & met Jock at the Barracks & set out for Waterloo \nwh\n where we had to meet the others who were bound for Durrington.\n\n10th Had a fairly fast run down to the Plains where we arrived late in the afternoon, we passed through some beautiful country & fine farms, one thing is very noticeable in England\n\ncompared to France, & that is way things are run in this country, especially the way they build their farmhouses, in France all farms are centralized & they work their ground from these centres, thus there is no loss of ground & the people seem to be dependant on one another. England is now just the opposite she is like Australia the farmhouses are all scattered & they have fences everywhere & their farms are much prettier for they allow beautiful\n\ntrees to grow all over their paddocks & lovely green & splendidly trimmed hedges form the majority of their fences, & another thing there is 10 times as much grazing land in England as in France, they cultivate very little in this country.\n\nI have an idea that this independent way of living goes a long way to make the character of the English race what it is today, it is very noticeable after being in France so long, Another thing which seems peculiar to me, & that is you\n\ncan speak to anyone in civilian clothes & they understand you, over in France you see it was quite different for everyone in civilian clothes was a foreigner & could not understand.\n\nWe walked out to our camp No. 8 & reported to the Orderly Room, we then went down to the Mess & had a good tea late though it was, we struck quite a number of chaps we knew some of them had been swinging the lead for a long time\n\n11th Had a good sleep & a fine bed last night & we were very tired, but a good wash fixed us up, had all our shortages taken & then went down to the sitting room attached to the \"Sergts Mess\" a Sergt over here is someone I can tell you & they live like fighting cocks, & their \"lounge\" is a bonzer room all plush & leather seats & lounges, beautiful carpets on the floor fine pictures on the walls plenty of small tables & flowers & regimental \n\ncolours, I was very pleased to notice that the good old 1st Battalion was very prominent & occupied the place of honour, a banner of black & green with 1st Battalion in gold letters on it was spread right across the top of the \"Mess room’\", & the smaller flags were very plentiful & the Battalion deserves this honor, a week ago they had the great honor of being specially mentioned in Army Corp Orders for the fine work done in repelling \n\nattacks at Bullecourt & they were the only Battalion mentioned, although the Brigade was congratulated, this is the third time the","35":" Battalion had this honour, & it is not easily come by I can tell you.\n","36":" Hot & sultry this morning & it feels like rain, Jock & I put a pass in for Salisbury last night & if it was granted we are going to have a look at her this afternoon.\n\nMotored out to Salisbury this afternoon, about 10 \n\nmiles, it was a lovely trip & we had a big \"Sunbeam\" car which done easily 40 miles an hour, you would have laughed if you could have seen us at the way we shot past the Fords & a few more such makes, just simply flew past them, it is a lovely road all the way with beautiful green hedges & fields everywhere, reached the town in no time & pulled up at a Temperance place called the \"Nelson\" it is a very fine place & nice to stop at, we were introduced to the\n\nproprietors as soon as we arrived & nice people they seem to be, it is commonly known as 1st Bde Hqrs for all the Sergts & etc stop there & are thought a lot of.\n\nAfter we had a wash & tidied ourselves up a bit, we went for a stroll around the town & a fair sized place it is, & very ancient, the river Avon runs through her, & if you look over the bridge you can see some very fine trout some of them up to 12 lbs easily, while I\n\nI was there I saw a kid hook a big fellow twice but he broke away both times the water of this river is very clear & pure.\n\nWe made our way along towards the Cathedral we walked through some little narrow streets then all of a sudden a most beautiful view met our gaze, & it looks all the more beautiful on account of its severe simplicity this cathedral is built on a piece of land about 7 acres in extent I should think\n\n& it is as level as a billiard table & as green as it could possibly be the church is built nearly in the centre & is one of the best I have ever seen it dates back to the","37":" Century & strange to say there is no record of the builders, in the Chapter house which is just handy there is the original oak table which they used to pay the men who were employed to build it, these labourers received 1½d a day according to the old records. In the old oaken door can\n\ntill be seen the pellets of shot which were shot into it in Cromwell’s days, & a little further round in the old stone walls surrounding the chapter house there is still to be seen the little dents in the stone made by Cromwell’s \"culverins\" (a small gun of those days), this magnificent church was Catholic originally until Cromwell altered things a fine old man was the Protector in many ways. Over one of the doors there is some stone carving which\n\nabsolutely takes the bun, it is simply marvellous how they done it in those far off days I’m very doubtful if we have anything like it to show these days.\n\nThe Church inside is beautiful nothing showy or tawdry about it, every thing seems to be built so beautifully & plain, one cannot help but admire it, I wandered round about these grounds for a couple of hours & I got in touch with a good sort of chap, a printer in this\n\ncity & he explained a lot of the history to me.\n\nI stepped the length of it just to satisfy myself & it is exactly 180 yards long, all over this lovely ground are enormous great trees & the lawn is covered with daisies buttercups & etc. I can easily say that this is the finest building I have ever seen chucking St. Pauls in & all the French churches there may not be the same amount of carving & sculpt- \n\n-uoring & painting inside, but this Cathedral has qualities which the others cannot boast & once seen will never be forgotten, besides you have no idea of the relief it is to us to be among such beautiful & lovely sights, such a contrast to the torn & battered fields of France & to be among people who speak your own language, well it was more like paradise & I can honestly say that my heart felt lighter than it has for many a long day\n\n& I laid down in the cool green grass & blessed old England for being such a glorious place, whatever her faults may be there is nothing that can rob her of her lovely & beautiful places of interest all hallowed with age & memories of long ago, I can quite understand people calling England \"home\" for she is worthy of it.\n\nI had quite a long yarn with this chap & he & I walked down the street & met Jock on the corner, here we\n\nparted & Jock & I went down the town & had a look at the pictures \"for an hour\" or so.\n\nThe day was very hot & muggy & I think that we must have had about 4 washes during the afternoon & 2 or 3 lots of tea it seems funny over here you are only allowed one helping of food, this is a law that has just been passed in England.\n\nI also bought a Kodak gave £3’3 for it, I have always had a liking for one\n\no I decided to give one a fly. We also bought a lot of little things such as boot & hair brushes etc. for we will have to keep our appearance up whilst down here.\n\nAt 4 oclock we caught our car \nagain\n & soon we were home again. Saw 2 Australian Bands playing in Salisbury & they were very good.\n","38":" Got up late this morning for it was Sunday after breakfast Jock & I went to our little den & wrote the rest of the morning\n\n \n\nIn the afternoon we took the camera out & done some snapshooting, goodness only knows how they will come out for we are both novices, there are some very pretty little scenes around here.\n\nWe live here to some order. breakfast, porridge, bacon & eggs, or chops, plenty of bread butter jam, sauces & etc. dinner roast, soup, fish & a sweet, tea cold ham or beef or something like that & plenty of jam butter & such things besides there is a great variety of dishes\n\nthey reckon it’s the best Mess on the Plains & I believe it for it is really first class. There is a draft going way to France from here tonight.\n","39":" Had us out on an early morning parade doing platoon & Company drill, after this breakfast & an interview with Capt. Foster about our future work & when we start. I think we will go on General Instruction work. Hot & muggy again today wants a good fall of rain to clear the atmosphere.\n","40":" Am taking over orderly sergeant for a while, & it is a rotten job for you have to be so particular about things & you are tied down so.\n\nRather cooler weather today we could do with a good fall of rain.\n","41":" yesterday 3 Germans got away from this camp, we have quite a number here working you know.\n\nWe also have a lot of \"conscientious objectors\", & they look a miserable looking crowd, just the sort of people one would couple with \"wowsers\" & such people\n\nWell I have come to the conclusion that this is about the rottenest run camp as ever I have seen, by this I mean their method of carrying out work from what I can see of it, it looks to me as if it is run for the benefit of a lot of officers & cold footed N.C.O.s I’ll admit that I know little about organisation but I am sure I could manage with only half the Staff at present employed here for they are only in one anothers way, & they are a nuisance\n\nto everyone, I would give something to be let reorganize this Camp & also the work. goodness only knows how many instructors are hanging on here trying to get out of going to France some of them are afraid to look us in the face they have been away from the Battalion so long, thank God I’m not afraid to meet anyone for I have done my bit & little more. & can look them square in the face & not turn all colours \n\n We have a beautiful Sergt Major here the great bully has not been near his Batt. since the","42":" & I expect he is ashamed to go back now, how they would all like to see him kicked out of the Camp he is hated by all ranks. Jock Mackie has gone to Southampton on escort duty he will be away for 36 hours. Have just discovered tonight that we have used the first 2 films in my Kodak the wrong way round (I am learning slowly).\n\n \n\nThis evening I had to scratch a hasty inlying piquet together it was supposed to be 34 strong but try as I would 30 was all I could muster so I marched them down, thinking that there would be a fine row, but as luck had it the officer never counted them, so I marched them back to the lines quick & lively.\n\nIt has been fairly cold today a piercing wind has been blowing across the plains\n\n17th Started to rain early this morning & it is still\n\ncoming down, the country needs it badly for the crops are beginning to show signs of withering especially the forward ones.\n\nYesterday old Tubby Pearce as they call him lined all the men who came from \"overseas\" & told them that if they did not prove themselves competent within 10 days they would be reduced now that’s a thing he can’t do for that sort of thing, it might work all right for N.C.O.s who have only acting rank , but for those who \n\nhave been made in their Battalions & have been gazetted it takes more than that to fetch them down, but he was only trying to bluff them, but the men from France are not to be fooled so easily.\n\nThe N.C.O.s here at present are very jealous of us who have come over from France, I can see through them although they show it as little as possible, this is because they know that they will all lose their jobs shortly\n","43":" Heavens what a rotten day I have had, the \"Orderly Sergts had to account for every man in their Coy, what they were on, & what they were doing, just fancy me just arrived from France & not knowing a soul in the Coy. On my morning \"state\" I was 11 out B. Coy (that is the 2nd Batt) were 15 off C. 9 & D. 1. well I had to go back to our office & find those missing men I found them but it took me till 11 oclock & nearly turned\n\n \n\nme grey.\n\nBut the climax came in the afternoon when we mounted our \"Guard\" they do things here in a grand style you know the Band always leads the Guards down to the Battalion parade ground the Orderly Sergts march them down, & hand them over to the R.S.M. the orderly officer then inspects, well to get on with it I marched the Guard down & the Orderly Officer started to inspect, Jock was the\n\nwas the first man he started on, roared on Jock for not having his brass work clean, he went on to 2 or 3 more, then he sings out \"Orderly Sergt\" & I double around to him, when I get there he says to me, the dirtiest guard I have ever mounted on this parade ground, well you could have knocked me down with a feather, & I thought them so clean, ‘\"look at the brass work, why it is real dull (& you could see your face in it) I then said to him\n\n \n\nwe are on active service even over here & it is against all rules & regulations to polish your brass & buttons at least I have been taught so, \"that’s no good to me he said & I wont forget to put it in my report. I said you can do what you damn well like I’m full of it & will go back to France tomorrow willingly, & I meant it for I am full of this rotten camp life & ceremonial parades bowing & scraping don’t appeal to me, however I said I also will put a \n\nreport in, so there will be two of us, however the Guard mounted in about ½ an hour & old Jock got a proper towelling up from the R.S.M. another --. as soon as the Guard had mounted I slipped away & went up to see Capt. Foster & put the case in front of him he is fine fellow & belongs to the 4th Battn, however he said, don’t worry your head over him it will be alright, personally he said I don’t believe in polishing buttons & brass up, but\n\nthey have made it a rule in this Camp, but he said the Orderly Officer can do nothing much for you are recent arrivals & have to get the run of things \"I said I don’t give a hang myself what he puts in , for I would just as soon be in France as among all the cold feet but those men were clean & I am not going to be insulted for nothing, however it ended at that for the time but it is not all over yet.\n\nI went down to the Guard to have a few words with \n\nJock & found him raving mad I don’t know what he was going to do, I thought once or twice when the Guard was mounting that Jock was going to tell \"him off\" or hit him over the head with a rifle for he was getting as red as a turkey cock it would not take Jock long to do it either for he don’t care whether it is a Colonel or a private Jock will have his say.\n\nWe both decided that tomorrow we would be paraded to the Colonel & lay our case before him\n","44":" Have had a fairly easy morning, there was no early parade, but the men had to wash all the huts out & clean things up. This morning when I took my \"parade state\" down to the orderly officer (Lieut Peel) started smooging to me the crawling swine & trying to gloss over yesterdays affair, started off by saying that the time before last H Coys Guard was terrible, a lot worse than the one we mounted\n\nlast night, I can understand now he said why they were a little dirty (a little mind you after what he said yesterday) for they had been out on the range all the morning & they should not have been, look here Mr. Peel I said I have no further wish to discuss this question with you in reference to the Guard as a matter of fact I have been more used to mounting sentries in the trenches, where a good few more ought to be, with a big emphasis on the \n\nought, this shut him up In the morning though later on while Capt Pearce was inspecting the lines he sent the Batt. Orderly Sergt up to me to give me the tip to have my lines clear for old Pearce was blowing them all up, so he is trying to square me, but he & I will never agree & if he gets snaky again I will ask to be paraded to the Colonel & state my grievances to him & ask to be relieved of my duties I’m full up of being bounced about by these men who have never seen a shot fired in anger.\n\n"}}