{"Document Name":{"0":"Diary_0276","1":"Diary_0276","2":"Diary_0276","3":"Diary_0276","4":"Diary_0276","5":"Diary_0276","6":"Diary_0276","7":"Diary_0276","8":"Diary_0276","9":"Diary_0276","10":"Diary_0276","11":"Diary_0276","12":"Diary_0276","13":"Diary_0276","14":"Diary_0276","15":"Diary_0276","16":"Diary_0276","17":"Diary_0276","18":"Diary_0276","19":"Diary_0276","20":"Diary_0276","21":"Diary_0276","22":"Diary_0276","23":"Diary_0276","24":"Diary_0276"},"Date":{"0":"unknown","1":1047.0,"2":1048.0,"3":1049.0,"4":1050.0,"5":1069.0,"6":1070.0,"7":1073.0,"8":1085.0,"9":1086.0,"10":1098.0,"11":1099.0,"12":1110.0,"13":1116.0,"14":1117.0,"15":1118.0,"16":1119.0,"17":1120.0,"18":1121.0,"19":1122.0,"20":1131.0,"21":1135.0,"22":1136.0,"23":1137.0,"24":1149.0},"Entry":{"0":"\n\n","1":"\n\nWe marched from the showground before daylight, most of us weary after the exciting farewells at Goulburn and from our friends in Sydney. As usual the march to the ship at Woolloomooloo Bay was a struggling mix up of lady friends & relatives so that it was a decided relief to say the last goodbye ere we filed up the gangway of the troopship \"Ascanius\".\n\nThere were over 1500 soldiers aboard – all reinforcements. We were all paid up to date, so that the deferred pay would date from embarkation. Each unit was kept together as much as possible by being classified for mess deck\n\naccommodation, & most of the tables elected permanent mess orderlies each man subscribing a shilling a week to the orderlies who were exempt from all drills or fatigue duties. This worked out satisfactorily, for the orderlies became efficient at their duties which was far better for all than taking it in turns to carry the food down from the galley. I, for one was so terrified at the prospect of collapsing with the stew in the hatchway when the ship was on the roll that I would have paid anything to dodge the job of mess orderly. We were rapidly meeting old friends on the different decks before we were well out to sea but we were all\n\ndog tired & depressed after the dissipation & sadness of parting with everybody, so sought our hammocks early after a last look at the vanishing coastline of New south wales & to a good many the last for all time.\n","2":"\n\nMal de Mer was decidedly in evidence provoking sympathy & ridicule. It was refreshing, however, to note the most conspicuous of the scoffers overtaken by retribution as with panic-stricken faces they sought the side of the ship. on the whole we were comfortable: the food was\n\nwholesome & there was a fair supply of it. The representatives of the Salvation Army & YMCA kept us well supplied with magazines & chewing gum till the last ran out on popular demand. There was a dry canteen dispensing tobacco, cigarettes, tinned fruit & soft drinks at reasonable prices. So far as I know all Australian transports are \"dry\" – at least as far as the men are concerned. The saloon where the officers foregathered was of course amply endowed with John Barleycorn & I believe the sergeants who had their own separate mess had a decreed allowance of grog. While\n\nthe other poor boys were bewailing their hard luck in being unable to get a pick-me-up I interviewed a seasoned steward & fastened the \"glad eye\" on him, assuring him that I was a discreet man & could he get me a bottle of whisky. He blandly made an appointment after dark which he kept & I exchanged with him fifteen shillings for a bottle of Walker’s. then I sought out my own especial pal & we discussed that bottle in a dark corner of the bulwarks. I may say here that for Australian soldiers – especially the young ones – it is better to be without a liquor canteen aboard ship.\n\nAfter the first couple of days they don’t worry about it & there is no public house to wander to the same as they have outside the military camps on land. In the crowded accommodation of a troop ship a few \"elevated\" men could destroy the comfort of every deck & fights would be innumerable. On land – in Australia – the authorities make the mistake of insisting in \"dry\" camps where canteens could be run under proper supervision, which would save a lot of men from yearning to get out of camp to run into the greater evils of the city.\n","3":"\n\nThe men by now were settled down to the sea life. Physical drill & fatigues absorbed a certain amount of energy & there were great gatherings of a game of chance called \"House\", & the Liverpool seamen from the foc’s’le who at first conducted the game must have made an enormous pile out of the profit per game, which is simple & lasts only a few minutes. A number of cards are issued at sixpence each. There are a certain number of rows of figures on each card. The promoter has a bag of numbered discs & as\n\nhe produces them one by one the corresponding number on a card is covered & the man who gets a complete row of numbers calls out \"House\" & takes the pool which might be anything from 7\/6 to £1. The promoter was only supposed to take 10 per cent which was ample profit but these impudent hard faced Liverpool gentlemen made no statement of accounts & allotted themselves very ample dividends on a game in which they risked nothing and had a sure \"make\" every time. \"Two up\" was prohibited but the lads managed to evade all surveillance for when a \"school\" was in full swing a few watchful\n\n\"spotters\" gave prompt warning of an approach of any of \"the heads\" whereat the school would \"smother up\" with great alacrity & the gamblers would be found innocently engaged in marine scenery or the appliances and adjuncts of the grand old ship as she churned her way through the waves.\n","4":" to","5":"\n\nThe hopes we had entertained of calling in at Melbourne were dissipated & we made an uneventful voyage to capetown under splendid weather conditions. With the exception of a few dozen\n\nwho were in hospital with the mumps, the lads were in excellent health & spirits. A good few whales were sighted & some of them presented the appearance of a submarine emerging from the vasty deep.\n","6":"\n\nAt daybreak the ship was stationary in Table Bay. The previous day we had sighted the brown & somewhat dismal coast of South Africa. In many respects it is like the Australian coast as a monotonously sad and desolate landscape. Everybody was soon on deck admiring this curious city nestling at the foot of a huge mountain. The last great military experience of\n\nCapetwon was the Boer war when the Bay was frequently crowded with transports. And as if to set off the military character of the place a great flock of sea gulls were resting on the water close to the ship in the perfect formation of a battalion on parade. It was the most impressive sight I have ever seen in the bird kingdom. Imagine line after line immaculately white, mathematically correct & with covered files. If it had been a lagoon a person could have reasonably assumed that these beautiful creatures had been specially trained. On one point there can be no doubt these birds floating\n\nin such serenity in the vicinity of so much human activity & noise knew that they were immune from attack or interference.\n\nIn the course of the forenoon the Colonel pompously assured the men that he would do his best to get them shore leave. it was a matter that rested entirely with the local military authorities & unfortunately recent Australian transports had given trouble. In the meantime we would have a route march to a park outside the town. On being paraded at the quay we saw a battalion of black troops bound for German East Africa. They were equipped pretty much the same\n\nas we were & looked a well set up lot of niggers but they were jabbering away all the time & it was beyond the power of the officers to make them preserve that disciplined silence which is so sternly observed by European troops. We marched along a beach parade lined with beautiful villas & reached a parched looking park enclosed with high iron railings. We had our own guards within & outside military police were on the watch so that a stampede into town to see the sights was almost impossible. And for the rest of our stay in Capetown we had one more trip to the same park\n\n& the night before clearance we were marched to a tea meeting given by the residents of Capetown. Altogether we were guarded much to our disgust like prisoners.\n","7":" to 30\n\nWe were out to sea & mustered for church parade in the afternoon, our next stopping place being Sierra Leone when everybody hoped we would get an unrestricted holiday. On deck every man had to have his lifebelt on for we were getting into the danger zone of submarine warfare. There were also regular boat drills every mess having a specified\n\nBoat to run to on an alarm. There was no celebration of \"crossing the line\" and we anchored in Freetown Harbour on a tropical day without a breath of cool air to ripple the surface of the water.\n","8":"\n\nThe capital of Sierra Leone presents a promising appearance on approach from the ocean. It is a good sized town of stone buildings & beyond are green hills where the farmers carry on profitable industries. There were a few French warships & transports in the Bay, &\n\nOthers were arriving daily. Before we left there were all told in that bay 15 transports carrying close on 30,000 Australian & N.Z. troops.\n","9":"\n\nThe long promised picnic was arranged, the boys before facing the temptations of the town being cautioned about sexual disease & warned that on return to the ship preventative remedies would be attended to by the A.M.C. we were packed into open coal lighters, standing upright like sprats in a barrel & under the oppressive heat & limited space several\n\nmen fainted during the tedious process of being towed to the pier. Most of us were temporarily blown out when we reached the shore where a large concourse of natives of all sorts & sizes awaited us. There were fruit sellers, cheap ornament vendors, traders in French silks &c clamouring to trade their wares. There were also a good few of sleek advance agents of the local brothels & sly grog shops & they secured not a few customers. To my disappointment there was no such thing as a European quarter; with the exception of a clergyman & a couple of officials Freetown is an absolutely dark town. The houses are\n\nout of repair, the goods are broken & rotten, there are hardly any decent footpaths. The superior coloured gentry ride about in sedan chairs & they comport themselves with a stately magnificence that denotes the aristocracy of colour as compared with the common black trash. There was a public washing place at the foot of a rocky cliff & here the women were rubbing out their clothes with flat stones. On the whole the poor people were a happy lot of codgers & had unbounded faith in the spending proclivities of the Australians. And they had a lot of the characteristics of the whites. I saw a\n\nneighbours quarrel – two stout negro women slang whanging each other & with the gestures of any back street denizens of Redfern, the Glebe or the ‘Loo, the husbands meanwhile languidly smoking & casually eyeing the disputants with a philosophically bored expression, quite satisfied to let them gas each other out. The fat babies were very noticeable in this strange flicker of humanity. They were like round eyed rabbits peering about from the shawl in which they were strapped to the mothers’ back & pot bellied little rascals were scampering about as full of life\n\nas any white man’s children. Silks, fruit & Jim crack ornaments were fairly cheap so that the Aussies were relieved of a fair amount of coin. Two local hotels were closed as is the custom when visiting troops are in the town. but plenty of grog was available in the houses of ill fame. Even rabid teetotallers would rather agree to the hotels or temporary canteens under strict military supervision being accessible to the troops instead of the abodes of vice and disease.\n\nLate in the afternoon we mustered near the sheds at the pier & lumbered aboard again. several\n\nmen were missing but were eventually recovered & heavily fined.\n\nDay after day passed by in the sweltering heat. Two French warships escorting three transports left the bay but returned after several days. It was stated that the return was occasioned by German raiders in the vicinity.\n","10":"\n\nWe were all heartily glad when we were ordered with four other transports and a naval escort – the Marmora – to proceed on our way to England. Every precaution was taken to ensure safety. At night there was not a glimmer\n\nof light to be seen on any of the six vessels & it was a crime to strike a match on any deck & all noise was prohibited. It was an awe inspiring sight to note all the dark shapes ploughing steadily through the water, so that when the moon was obscured the little fleet could not be observed unless at close range. We kept at an even pace bunched together within easy hailing distance of each other, the naval escort leading & each transport having at the stern an 18 pounder gun & crew which had been fitted up at Capetown.\n","11":" to 25\n\nThe quality & quantity of food on board began to slacken. This was due to the long stay at Sierra Leone & the fact that we had to carry our share of the men on the transport Port Lincoln which had grounded on the sand bank at the entrance to the harbour at Freetown, so that Christmas Dinner was a comparatively poor turn out.\n","12":" to 30\n\nOff the coast of Spain we were joined by seven Destroyers & these crafty little water rats took up\n\nTheir escorting positions just as we were committing to the deep a comrade who had died from appendicitis. It was done very quietly only a guard of honour from his own unit & the Anglican Chaplain attended to the last offices. The engines stopped for a minute; the little party carried the deceased to the stern; the Union Jack after the Chaplain had read a short service was withdrawn from the shot-weighted white shape which quietly slid along the plank into the depths below. I believe it is a rule on troopships to avoid a full ship ceremonial; no doubt\n\nit is intended to avoid the gloom & depression that followed these interments.\n\nThere was a fair amount of excitement on board when we were on a dark night passing the lighthouses off the coast of old England and it was on New Years Day that we entered Plymouth Sound, the emotions of even the most careless & rough being stirred at the spectacle of this great gateway to the Homestead of the Race.\n","13":"\n\n- January 1st 1917-\n\nIt was a dull grey morning as we moved slowly to our anchorage in Plymouth Sound. It was apparent to the most perfunctory civilian observer that the place was strongly fortified, batteries & barracks peeping unassumingly from the stony heights commanding the harbour.\n\nWe were to disembark late in the evening & on this day I had my last guard over our prisoners, one of whom was a cranky of man who was\n\nalleged to be incarcerated for talking about firing the ship in mid ocean. Anyhow all arrangements completed we marched to the railway line & entrained for Salisbury Plains. It was raining & the ground was pretty slippery but we all experienced a curious exhilaration to know we were bowling along through the green lanes of England & there was a distinct perfume about the atmosphere that was new to us. We detrained at a dark & lonely rural station & shouldered our kit bags to march about six miles to Hurdcott on the Plains. We tramped\n\nsteadily on through villages where everybody was in slumber under the thatched roofs. The soldiers were all curiously silent; there was no ribaldry or cursing as was invariably the case when returning to camp from a night march in Australia. The novelty of the surroundings, the sub.conscious whisper of heredity, the feeling that we were now on definitely preliminary stage of the Great Expedition – kept in check the cheap vulgarity which is inevitably associated with the congregation of soldiers and Members of Parliament.\n\nShortly after daybreak we were at the rest camp at Hurdcott, where we were given hot coffee & curry for breakfast in a long mess room. Then we were packed off to a hut for every 30 men. blankets & straw filled mattress were placed on a three plank trestle bedstead about five inches above the floor. We were soon in slumberland & remained there till close on dinner time after which we formed up for review before Colonel Abbott. Who approved us as a likely looking lot of men.\n","14":"\n\nWe were marched further\n\nto another camp in the Hurdcott division where we were to undergo active training before going across to France and we at once got to know the meaning of an English winter. Frozen taps in the morning, the little pools of water in the hard ground created a frosty slippery surface that made marching a fidgety & sensitive pilgrimage. At first the cold seemed to penetrate to the bone. Fortunately each hut was provided with a coal stove in the centre. The canteens were then selling good wholesome beer and stout for\n\n3 ½d a glass mug. The Y.M.C.A. was a popular rendezvous for the troops on the canteen. There was a good proportion of very moderate drinkers & a fair number of total abstainers. Men went where they liked & the very freedom from restraint conduced to orderliness. I noticed here the same as in New South Wales that the nuisance drunks were the men who went away from camp & obtained spirits – good, bad or indifferent – in the towns & villages. in the military canteen no spirits were served at all and the beer & stout could only affect the soft headed people who\n\n\t1917\n\nshould never touch it at all.\n","15":"\n\nFor the morning physical exercises, bayonet fighting, bombing and drill generally we were detached from our own officers & placed under special instructors & from then on till January 15 when we had four days leave in London we had a steady consistent training & the majority of us were well fitted to spread our legs over London. The food was fairly good considering the shortage in England & the demand made on the country’s resources to keep the rapidly increasing large armies in the field. Besides\n\nthree good meals a day we could store bread in the hut to make toast on the stove at night which with dripping & an occasional onion made a very palatable supper. Moreover we could clear out of camp from 5 o’clock till 10 at night, so that we could club together & take a motor to Wilton or Salisbury & revel in the delight of ham & eggs or an expensive fillet of steak. Half on to pay day the motoring would be retrenched & the heroes would saunter to the village of Barford-St-Martin & get in front of a great fireplace such as that described in Barnaby Rudge as the old Maypole Inn. At\n\nthis ancient hostelry beer cost 5d to 6d a pint and fairly good whisky & rum were obtainable at reasonable rates. Some of the old rustics were taciturn & hard to draw out. I think the outrageous rise in the price of beer & the inferior quality of what they used to get at less than half the price had gone into their hearts like cold steel.\n\n\"It’s snowing hard tonight, sir,\" said I to an old codger who was sadly gazing at the great fire.\n\n\"Yes.\"\n\n\"Will you allow me to replenish your pot, my friend.\"\n\n\"Thank you.\"\n\nWhen the foaming tankard was served I thought I could get in a conversation but his gaze was on the fire and he took no further notice of me.\n","16":"\n\nAs a member of coal fatigue party I went to a place beyond Fovant & we put in till lunch time shovelling coal into our own wagons. At 12 o’clock I went to the nearest \"Tommie\" canteen & met a number of the young territorials. They had recently been over in Ireland where they had found themselves very\n\nunpopular. No doubt the rebellion engineered by Roger Casement & the stringent measures that had to be adopted had made the sight of an English soldier a \n hateful \n distasteful one. They were bright young fellows & fairly well educated. They were unanimous in believing there would be a rush to Australia when the war was finally . There were two impelling reasons: (1) the climate; this was the worst winter they had ever experienced; and (2) – They were convinced that Australia presented a better field for the right brand of young men than did the old country.\n","17":" &","18":"\n\nSnowing steadily, the countryside looks grand in its white covering & the boys have taken to snowballing & guy making as if they had been brought up to it from childhood of course a percentage of Australian troops, about 20% I think, were reared in some part of Great Britain, so what the Australian natives don’t know they can rapidly pick up and I must say that snowballing is an exhilarating, healthy pastime. There is real joy in smiting thy enemy in the nape of the neck with a snow hand grenade & then dodging the\n\nonslaught of his friends till reinforcements come to your aid & the enemy is dispersed in headlong flight.\n\nTwo draughts for France have been despatched in the last few days. Once a man is warned for draft he mustn’t leave camp. If he does he is disgraced & gaoled. These departures as a rule took place in the evening. As soon as word came through the sergeants & corporals hastily commenced to beat their men up. Every man had his equipment ready to adjust, so there was no unnecessary delay. A large number would be having their last farewell\n\nat the canteen. The door would open with a bang. Sergeant enters, the snow flakes clinging to his shoulders.\n\n\"Now, then, you men for overseas, get your things & form up outside. This joint will have to close till you’re gone.\" The canteen keeper has already got the intimation & is briskly serving final drinks & charging the water bottles of the departing warriors with beer or stout or a combination of the two.\n\nLined up in the snow there are bluff & husky voiced farewells between mates about to be separated.\n\n:\"Good bye, Bill, I’ll soon be after you.\n\n\"Yes, old Jack, I’ll write\n\nwrite from the camp where we get our last gruelling before going into the line.\"\n\n\"Yes, old pal, that’s Etaps. You’ll get a month of the bull ring there.\"\n\nA fussy little officer had to straighten up the lines so as to be ready to move all at a moments notice. His rather tactless interference was resented by a bushie but his mate said reassuringly: \"Let ‘im alone, Toby, the poor little ------ is going with us & if he doesn’t mend his ways we’ll know what to do with him on the other side.\"\n\nThe officer could hear every word of this & his countenance\n\ntook on a thoughtful expression. A good many officers who didn’t try to understand their men in the training camps found a mental reconstruction when they had to share with them the business of life & death & grips with the enemy.\n","19":" to 14\n\nThe drilling, exercising & route marching were steadily carried on & the men were getting hardier every day. a small percentage from each company were sent to hospital for treatment. Certain complaints were made about shortages & the quality of the food. It was noticeable that whenever\n\nan official inspection was announced there was an all round improvement in the fare provided – both in quantity and quality; & then of course there were no complaints. One day, however, Colonel Abbott unexpectedly swooped upon the mess room at dinner time to investigate a complaint about \"dishcloth\" tea. He at once sampled it & made a wry face in doing so.\n\n\"Taste that,\" he said to the officer in charge.\n\nThe officer did so & said he did not think there was anything wrong with it.\n\n\"Would you like to drink it yourself?\" pursued the Colonel\n\nThe officer looked embarrassed but said nothing.\n\n\"In the first place,\" continued the Colonel, \"there is not sufficient sugar; and the tae is too washy. See that it does not occur again.\" and he went away to blow up the cook house. There after we had decent tea.\n\nOne of the saddest sights at Salisbury Plains was the punishment meted out to serious offenders who were to undergo imprisonment. The training battalions formed three sides of a hollow square, the official & delinquent forming the fourth side. The prisoner on his name being called stepped forward under escort,\n\nthe corporal removing the culprit’s hat & placing it on the ground behind him. Bareheaded there in the presence of the battalion he had disgraced the prisoner stood to attention, while the officer read out the proceedings & decision of the Court Martial, confirmed by General Sir Newton Moore. Sentences from six months to five years hard labour were awarded for desertion, being absent without leave when warned for draft, assaulting an officer or N.C.O. and other serious crimes. Some of the hardiest & most shameless delinquents affected a jaunty indifference but a great many who had probably acted in a headlong spirit,\n\nhardly realising what they were doing, stood there pale & keenly sensible of the degrading position in which they were placed. As each man was dealt with the corporal replaced his hat gave the order \"About turn\" & he was marched away.\n\nI have been reliably informed that as the war progressed in intensity, these offenders were allowed an opportunity to purge their offence by rejoining their former units or other reinforcements going into the firing line. and most of those who gladly availed themselves of the chance made ample amends in the field for their misdeeds.\n","20":"\n\nEarly in the morning we marched to Wilton & entrained for London, noting as we steamed through, the great utilisation of formerly idle land for producing vegetables. It was fairly open country till we reached the environs of London & then with a sudden crash we right in waterloo station.\n\nWe were lined up & marched over Westminster bridge to Horseferry Road. In the big yard of the A.I.F. Headquarters we were told where to apply for information & security against sexual disease & told to rendezvous at waterloo station on Friday evening for\n\nreturn home to camp, so that our disembarkation leave only amounted to four days inclusive of day of arrival & departure from London.\n\nWith a couple of chums I made for Peel House, a noble institution for soldiers, one shilling for meals & clean beds, pay as you go. some of our fellows who had plenty of money to spend stayed at leading hotels where you could get bed & breakfast for a pound. But we were quite satisfied with the fresh wholesome table at Peel House which was fitted up on the lines of a luxurious club. The reading room was such as could only be found at a fashionable club or hotel. Two big coal\n\nfires shed a cosy radiance over mahogany tables & beautifully stuffed arm chairs which were so comfortable as to be a special invitation for a tired man to go to sleep. The writing tables were provided with notepaper & envelopes timetables &c. Away from the writing table & the hard backed chairs a person could slip into the welcome arms of the stuffed lounge chairs & if he felt in a smoking humor he need not grope for matches, for on a little table at his elbow there was an ample supply of wooden matches free. This commodity was so scarce that civilians outside had to struggle for the privilege of paying\n\nfor them. There was of course an ample supply of books & magazines. We did not of course get separate rooms for a shilling but slept in big dormitories, where the sheets & everything else were scrupulously clean. Hairdressing saloons, boot cleaning rooms were available at usual rates. Free hot baths (1d only being charged for a towel) and other conveniences enabled all men, especially those in poor health, to get all they needed without going into the cold winter streets. The War Chest Club although not so elegant, was run on similar lines & at the same rates. Personally conducted tours of the sights of London were arranged\n\nat both institutions altogether \"Biljim\" of moderate means had good quarters to put up at and if he lost his bearings in any part of the metropolis the policeman was his cheerful guiding star and friend.\n\nThe people of London are kind & courteous & the Aussies are quite at home with them at short notice. The non-shouting regulation in hotels was somewhat embarrassing to the natural propensity of Australians. In a number of the back streets it was not observed very strictly but on the main thoroughfares a man had to drink on his lonesome or distribute the coins to the \"cobbers\" he was treating. As an instance I went into a\n\nwell crowded bar in Piccadilly & bought a whisky which I handed to my friend in a corner and when I went to the counter for another the barman snapped: \"I just gave you your drink let your mate come over to get his.\" And this perforce had to be done.\n\nLondon during our brief stay was cold & gloomy – in fact I don’t think old sol came out once for our benefit and the suppression of lighting in the evening made the noise & traffic – the rattle, bang, bash of motor lorries, busses & general vehicles – something to stand aghast at. The way the police handled\n\nthe terrible procession from six o’clock onwards was something to marvel at. when I crossed Westminster Bridge on the way to the station on the last day of leave just after six I took it in as a perilous enterprise although I am a city bred man. The streets were slippery as I crossed over from the House of Commons side, there was a haze over the Thames and the searchlights playing up for a possible enemy aircraft made up a weird scene that will last in the memory for life. Every bus was a trundling human bee hive & the steady, resolute, march of the umbrella’d macintoshed foot passengers kept on\n\nan unceasing flow although tens of thousands every few minutes in every street were being diverted down to the wonderful smooth gliding tubes. The astonishing fact about this underground labyrinth is that you can get in at any point & be deposited in any part of London you may desire. The girl porter or ticket seller tells you where to change & the trick seems to be as simple as walking into a Sydney refreshment shop amp; getting a cooler. The women are slashing drivers & conductors of busses & the V.A.D.’s are everywhere in cheerful busy legions. At Peel House I was waited upon at\n\ntable by a titled lady & the same sweet soul was there when I returned from France, a physical wreck, about eight or nine months afterwards. The sex God bless them, did their share amply & well, to win the war.\n\nAt Waterloo Station most of the company were assembled well ahead of time & after punishing the refreshment room, entrained, went to sleep & it was like the shattering of a beautiful dream to be kicked & cuffed into wakefulness to commence the dreary tramp from Wilton to Hurdcott. We were all subdued & silent when we rolled into Blanket Flat.\n","21":"\n\nUnanimity of agreement that it was a trip that had only one fault that it wasn’t one per cent long enough. The O.C. gave us a nominal morning’s work as the boys were tired after their \nlong","22":" in the wee small hours. Those who had any money left took a trip in the afternoon to see new made friends at Wilton & Salisbury in the afternoon, for our time in England was now drawing to a close. Of this we received a definite intimation at the Church parade next day.\n","23":" to 30\n\nHard solid drilling & fixing up our equipment for France. To give an idea of the thoroughness of British Army methods we were furnished a few weeks before our departure with special strong boots for the campaign. We wore them for a week to break them in & have defects corrected, for on the march feet are more important than stomach. A man can survive the loss of a few meals but if his feet are such that every step is an agony he can’t possibly last for fighting purposes. At the end of the week’s breaking in we had to label our boots & hand them in to the\n\nOrderly Room to be issued to us on the eve of departure.\n\nA few miles out from the camp we were inspected by the King beyond Fovant. His Majesty looked well. He glanced keenly up & down the lines & chatted pleasantly with the attending officer. He has that bagginess under the eyes which was such a pronounced characteristic of King Edward. Anyway we gave him three hearty cheers & he motored away. On the return to camp General Sir Newton Moore took the salute at a cross road corner. In appearance he looks like a fat publican out for a holiday.\n","24":"\n\nAll things inspected & deficiencies adjusted we marched to Wilton, the townspeople turning out to give us a hearty send off. The officers who had brought us from Australia- Lieuts Heath & Heugh – said good bye & hoped to be over after us soon. We woke up at Folkestone about 2 o’clock in the morning & were marched to an empty terrace on the marine parade, unfolded our blankets, made pillows of our packs. Goodbye trestle bed, stuffed mattress, stove in the middle of the hut. We will know thee not for many a day. we go to sleep with an idea that we were about to task the real\n\nginger of soldiering.\n\nOn turning out about 8.30 the same morning we found a scratch breakfast in the shape of tea & sandwiches. We were strictly guarded against going into town. a gigantic sausage shaped observation balloon was hovering well over our point of embarkation. about midday we were marched aboard a big ferry boat & under the vigilant guardianship of a destroyer made a safe but not direct passage to Boulogne. Like England the inhabitants had got used to the arrival & departure of troops, so our arrival created no surprise or excitement. The most enthusiastic\n\nwelcome came from the old Frenchwomen, many of them so old that they must have had a keen & sorrowful recollection of the War of 1870.\n\n"}}