{"Document Name":{"0":"Diary_0489","1":"Diary_0489","2":"Diary_0489","3":"Diary_0489","4":"Diary_0489","5":"Diary_0489","6":"Diary_0489","7":"Diary_0489","8":"Diary_0489","9":"Diary_0489","10":"Diary_0489","11":"Diary_0489","12":"Diary_0489","13":"Diary_0489","14":"Diary_0489","15":"Diary_0489","16":"Diary_0489","17":"Diary_0489","18":"Diary_0489","19":"Diary_0489","20":"Diary_0489","21":"Diary_0489","22":"Diary_0489","23":"Diary_0489","24":"Diary_0489","25":"Diary_0489","26":"Diary_0489","27":"Diary_0489","28":"Diary_0489","29":"Diary_0489","30":"Diary_0489","31":"Diary_0489","32":"Diary_0489","33":"Diary_0489","34":"Diary_0489","35":"Diary_0489","36":"Diary_0489","37":"Diary_0489","38":"Diary_0489","39":"Diary_0489","40":"Diary_0489","41":"Diary_0489","42":"Diary_0489","43":"Diary_0489","44":"Diary_0489","45":"Diary_0489","46":"Diary_0489","47":"Diary_0489","48":"Diary_0489","49":"Diary_0489","50":"Diary_0489","51":"Diary_0489","52":"Diary_0489","53":"Diary_0489","54":"Diary_0489","55":"Diary_0489","56":"Diary_0489","57":"Diary_0489","58":"Diary_0489","59":"Diary_0489","60":"Diary_0489","61":"Diary_0489","62":"Diary_0489","63":"Diary_0489","64":"Diary_0489","65":"Diary_0489","66":"Diary_0489","67":"Diary_0489","68":"Diary_0489","69":"Diary_0489","70":"Diary_0489"},"Date":{"0":"unknown","1":1251.0,"2":1252.0,"3":1253.0,"4":1254.0,"5":1255.0,"6":1256.0,"7":1257.0,"8":1258.0,"9":1259.0,"10":1260.0,"11":1261.0,"12":1262.0,"13":1263.0,"14":1264.0,"15":1265.0,"16":1266.0,"17":1267.0,"18":1268.0,"19":1269.0,"20":1270.0,"21":1271.0,"22":1272.0,"23":1273.0,"24":1274.0,"25":1275.0,"26":1276.0,"27":1277.0,"28":1278.0,"29":1279.0,"30":1280.0,"31":1281.0,"32":1282.0,"33":1283.0,"34":1284.0,"35":1285.0,"36":1286.0,"37":1287.0,"38":1288.0,"39":1289.0,"40":1290.0,"41":1291.0,"42":1292.0,"43":1293.0,"44":1294.0,"45":1295.0,"46":1296.0,"47":1297.0,"48":1298.0,"49":1299.0,"50":1300.0,"51":1301.0,"52":1302.0,"53":1304.0,"54":1305.0,"55":1306.0,"56":1307.0,"57":1308.0,"58":1309.0,"59":1310.0,"60":1311.0,"61":1312.0,"62":1313.0,"63":1314.0,"64":1315.0,"65":1316.0,"66":1317.0,"67":1318.0,"68":1319.0,"69":1320.0,"70":1321.0},"Entry":{"0":"\n\n","1":" Mametz\n\nA summer’s day. Word came through that 7th Divn in co-operation with 5th Division has at last got through Bullecourt and O.G. 2 is now entirely in our hands. The Scotch in their last go took about 300 prisoners and a few went out to bring them in. Some of the Germans had egg bombs hidden in their upraised hands and threw them into our chaps. Something \"regrettable\" happened after that – about 29 reached our lines alive!. The 2nd Australian diamond colours are well known to the Huns now say the men and prisoners say we are known as the \"diamond bastards\". This morning every available man is being trained as a Lewis gunner or a bomber and we are taking big steps to try and complete our N.C.Os up to strength. The present is the time for any man who wants to get promotion to step forward. Today a party of good old men went down to a new camp by the sea for a rest. One Scottie after their last cut at Bullecourt came in with a shattered left arm and a right\n\n12\/5\/17 Mametz\n\nhand dangling uselessly with a bullet through it. \"Taking prisoners indeed. I’d cut the throats of some if I hadn’t been onwell!\". Groves goes on leave today to England. During the morning our regimental band is hard at work practising and fast getting into shape. N.C.O’s class commenced this afternoon under Penna Alderson & R.S.M McIntyre. All new aspirants for stripes ready. Mess this evening was elaborate in honor of Dr. Craig’s majority – our embyro band amalgamated with 23rd for the evening and rendered a programme of music. The Colonel 2\/Lt Col Davis myself and C.M. Robinson made speeches and the old doctor responded very feelingly. Having wined the band masters and turned them free, Evans and others sang. The former gave us the Irish National Anthem in Gaelic and in English. A few of the more convivial souls proceeded to get well pissed in accordance with custom. Whatever our opinions about liquor in private life, there is no doubt it is a curse in the Army, the absolutely \"dry\" army will win the war.\n","2":" Mametz\n\nDisturbed by Stewart & Co. early in the morning and put up a good fight before losing a love lock. A close summery morning. The men all sit outside their huts in shirt sleeves and mope about – why don’t they shift us back into decent country where there would be some inducement to go for walks among pleasant surroundings. Church parade 11 a.m. as a brigade near the railway. A good sermon by Padre Durnford. After lunch went and saw General Gellibrand and had a confidential talk on some matters of regimental interest. Afterwards with Major Craig walked over to see General Smith and stayed there for a while yarning. That splitting box barrage seems one of neatest dodges for splitting attacking waves and making them lose their direction. Fighting Bob was looking very fit and well. All the men again idling outside their huts in the evening – it is dark at 9.30 pm. A move further back would be much better for all concerned.\n","3":" Mametz\n\nHeard today that we are moving back to Achieux for further rest. Work this morning was specialist training mostly. About 80 bombers and 90 Lewis gunners at work. Inspected the huts and found things fairly good as Thwaites is an able orderly officer. If not well watched a great deal of waste occurs here where so much canteen stuff can be bought to supplement the ration. Pork or beans and bully beef are very dead stock. Reviewed our new reinforcements and find them quite a good stamp. Weather continues very warm and thundery. After lunch saw N.C.O’s class at work and stayed with them until 4.00. just as we were forming up heavy rain came up and drenched us before we traversed the few hundred yards back to camp. Some German prisoners working round here and if carrying anything they salute by a sharp turn of the head smartly. Bazely was in after mess to say goodbye before going on leave – a dear little chap.\n","4":" Mametz\n\nA day of Court Martials. After making an inspection of the huts went to 21st H.Q. and there sat with Colonel Watson & Maddrell of the 23rd Battn. There were about 14 cases and during the day we finished 2 and partly finished a third. Awarded two sentences of 10 years penal servitude. Some tall swearing in the third case – one of theft against a Sergt Cook. A piece of the evidence. \"I sez there’s fishy work ‘ere, the Sargints run the rule over Jerry!\" which being interpreted is that the sergeant had stolen things of one Withington dubbed \"Jerry\" as a nickname. In the evening presided at a meeting of ptes. N.C.Os & officers regarding a sports meeting. Orders are now out for our move to Bouzaincourt but were cancelled late today by Division. Today it is rumoured that the Huns have retaken Bullecourt. Work today – Specialists, rifle shooting on the miniature range and some general bombing. General Gough was round.\n","5":" Mametz\n\nOn Courts Martial all day and acquitted one man who was being wronged by a little group of unscrupulous young perjurors. Other cases mostly that A.W.L which seems to be getting more prevalent as time goes on. About 4 Divisions of Cavalry moved up commencing early in the morning and we now hear that the Germans are in retirement again and, I suppose, doing their wretched destruction as they go back. Orders out for our move to Bouzaincourt tomorrow and a furphey that the Corps is being relieved. Had a yarn with Colonel Forbes about recent operations. Colonel W.R. Watson C.B. H.D. is a good sort and comic in his remarks about things in general. A dull day with some rain in the afternoon and and a foggy haze on the scene. At mess we drank to \"the King\" and on the tables we had white violets and blue with other flowers culled from stricken woods. A meeting of the big Sports Committee tonight.\n","6":" Mametz & Bouzaincourt \n\nUp early. A wet morning. Battalion moved to Bouzaincourt via La Boisselle Aveluy. As field officer of the day I started behind and inspected the Brigade camps with the Area Commandants. An astonishing amount of good gear abandoned – blankets greatcoats & ammunition. Pounds and pounds worth. One officer to my disgust ordered a lot into the incinerator!. Soon put him into his place. After getting a clean bill I got into the D.A.A S.M.G’s motor and went straight through via Albert. A pleasant drive the country looking well and the trees putting out fresh leaves. Many troops on the march today and much transports. Came into Bouzincourt and saw the Town Major. My billet closed as Madame was at Mass on account of the Feast of the Ascension. The church is an old one (1703) and passing one got a whiff of incense. Had some good talks to different people & find my French much improving. At the rear of our billet is a nice little trim kitchen garden, vivid green\n\n17\/5\/17 Bouzincourt\n\nbackground and much fruit blossom. For mess we went to a large two storied house of nice people – well dressed and neat mademoiselles and a dear little girl of about 7 whose father had been murdered up North by the Germans her mother died when she was a baby. After lunch went for a walk with the doctor along pleasant leafy lanes and looked back on the sweet little village nestling in green leaf and fruit blossom – a pretty sight. Just about 4.30 pm set out on horseback for Warloy riding via Henencourt – Milencourt . A little flat until a mile or two out and then commenced the most delightful views one could well imagine. All shades of restful green, rolling grass slopes and sprouting crops, no fences, woods and trim villages nestling in a verdant setting. Coming into Henencourt noticed the old church most unusually built and rather like a Public Hall in appearance. A one street village. An old inn \"Au Petit Caporal\" with oil picture of Napoleon outside and a barn for horses. At the end of\n\n17\/5\/17 Bouzincourt\n\nthe street is the chateau. Fine gates surmounted by a coat of arms and a grand old building behind – one wing in ruin. A glimpse of lovely old garden and many rows of trees so delicately green. Green, green, and restful loveliness everywhere. Through Millencourt – a neat little place – to Warloy which is entered by a tortuous winding road with a delightful avenue of blossoming fruit trees – a sight not to be forgotten quickly. A nice little town is Warloy – very clean and some good houses. Went to Bde H.Q. and had a talk with the General and arranged some Court Martial business with Colonel Watson. The latter is very comfortably installed, broached some Burgundy and talked in his usual way. A good billet. Rode home through this lovely scenery and war seemed a long way off. Reaching Bouzincourt found the streets full of soldiers many half tight. Much loud argument. A reaction after hardship, sex starvation & enforced temperance. Let us not forget these men have been through Hell and took the Hindenburg line.\n","7":" Bouzincourt\n\nColonel Davis left early for his leave to Paris, Marseilles, Nice &c. took over and commenced by getting the whole morning devoted to cleaning out the billets and their neighbourhood. At 11.30 set out again for Warloy and had a pleasant ride out over the same ground as yesterday. The Chateau has very fine woods behind it, the trees being planted in neat rows through which a glimpse of statuary and water can be gained. The Germans burnt the left wing. The old Marchioness is extremely ill and some of our doctors from Warloy attended her last night. The entrance to Warloy is down a hill by a very twisting road that well warrants the caution \"Ralentir\". It is a fine little village with numerous comfortable houses. There is a Parisienne with red stockings who entertains platoons and there are also many nice respectable people. Had dinner with General Gellibrand and then adjourned to the 24th HQ and with Colonel Watson tried a man by Court Martial & awarded him 2 years hard.\n\n18\/5\/17 Bouzincourt\n\nThis billet is very comfortable for them and pleasant gardens replace the inevitable \"fumier\". Rode home via Senlis – not half as pretty a road. Senlis is a disappointing and dirty village whose inhabitants appear as undesirable as itself. Many prisoners at work on the roads hereabouts. Most of these villages look very pretty as they are compact & down in the hollows surrounded by many lovely trees. For her austerity in winter, France, in Spring, makes full atonement. Bunning resumed duty today from hospital and Jackson came to light from the Officers Training Corps. Quite a large number at mess tonight. Take it alround our army telephones are wonderful. Conversation is clear, the outfit compact and wires can be run out anywhere. Not a little difficulty in finding suitable ground for the battalion to parade on owing to growing crops and cultivation. French allow people here to till soil & forbid keeping shops.\n","8":" Bouzincourt\n\nTo breakfast at our mess at the big two storied billet and afterwards walked for a little in the pleasaunce – a sweet garden of trim delved beds with many vegetables, hives of humming bees, fruit trees pruned and heavy with blossom and not a few crocuses, tulips and other pretty flowers. At 9.30 am the Battalion was formed up in mass on a pretty little piece of grass land just at the back of the cottages and surrounded by green tall elms and other trees. After giving them a few drill movements for steadiness under arms, turned them loose under the Company Commanders for strict inspection and good hard morning in drill and bayonet work. Fulton had 16 guns in full swing on instructional work and Gawler was imparting the secret of his murderous art to the bombers. Thorley was most busy with the sigs. And had a classroom also going where bareheaded Billjims most laboriously tried to decipher the buzzing\n\n19\/5\/17 Bouzaincourt \n\nof the buzzer. We also had a good class for N.CO..s in full swing under Alderson, Pearce and the R.S.M. The Band played the Battn in and they marched smartly. After lunch Fulton, Penna and Thwaites went into Amiens for weekend leave. Afternoon was spent as a half holiday and devoted to sport. Dr Sanbrook came over and stayed to mess – a pleasant meal with a good room full of young fellows all full of zest and gaiety. How many have passed in and out of our ranks since the war started. Today in the local church a French girl and an English tommy were married. Several squadrons of aeroplanes flew over some of a squat variety. Beckingsale, Smith H, & Smith J (Fighting Bob’s brother) were promoted. 2 Merits tonight and tomorrow Etheridge will get his star. What an incentive promotions & decorations are spurring men on in spite of the example of dead who similarly strived in their time.\n","9":" Bouzaincourt \n\nSunday. All day in the little church were special services and tomorrow the local folk make one of their excursions to the cemetery. Battalion formed up at 8.40 and marched headed by band to Church Army hut where was held a most enthusiastic service. The little padre preached a fine sermon. Hymns were accompanied by piano and clarionet. The National Anthem was played on the piano at the end and was rather amusing as some flourishes were introduced. Marched home the band playing well. Inspected all the billets and found them very good on the whole except for a few where pump water, soaking through heated fumiers, invaded the billets. Some of the cooks have their cookers and themselves looking very fine. Today the cooks prepared nettles and dandelions and they are said to be quite good and palatable. After lunch walked in the garden at the Chateau and had a long French conversation with Monsieur who is equally keen to learn English. Played with the dear little girl Chretienne Eloi who is in fair way\n\n20\/5\/17 Bouzincourt\n\nto be spoilt. Also yarned with her cousin a pleasant looking mademoiselle of 16 who was a little bashful at first but later told us all the village scandals, the English & Indian babies and the \"beaucoup m’selle malade\". A good and innocent girl – they speak of things more freely in France than we do. This garden very pleasant bordered with fruit blossom. Overhead some ‘planes flew at intervals. Mess in the evening was a happy meal and it was good to see all the officers together. The old order changeth. After mess promenaded once more and parted until all the family went to the Benediction. A couple of men ill today with trench fever possibly carried by lice. However we have baths and clean clothes tomorrow. Behaviour is excellent and much smatening up apparent. A bath tonight in Madame’s washtub. At first she interpreted my request for a \"bucket\" as \"bouquet\". A long summery day.\n","10":" Bouzincourt\n\nThe Battalion formed up on its fine little parade ground just near the back of the billets being played out by the band. Everywhere the eye looks there is restful green and lovely sprays of fruit blossom. Dark clouds were hanging round and warm showers started to fall forcing us to continue the parade indoors. Musketry lectures were the rule Lewis gunners and signallers hard at work under their officers. Thwaites has failed to return from Amiens – some of these chaps won’t play the game at all. In the afternoon went on parade again on the same ground for a good deal of close order drill and bayonet fighting. There is a subterranean tunnel running under this place from the Church and we hear rumours of one leading as far as Thiepval. In Albert are many refuges underground. Near Bapaume the Germans used an old subterranean passage running along a good distance.\n","11":" Bouzincourt\n\nA wet morning so parades had perforce to be held in the billets. Just about lunch time the General and the Brigade Major came in and after a talk for a while they stayed and dined with us. After lunch I was busy on routine until 3.30 and then to horse & rode to Warloy to attend a Conference of C.O.’s. A most pleasant ride and the last stretch (from Henecourt to Warloy) is enough to enchant one with its loveliness and softness. Discussed many matters in conference and then rode home again reaching there about 7.30. after mess the doctor and myself met Colonel Chap. Wray and Cue and yarned a little. We then adjourned to a French woman of rather superior class and indulged in French conversation all the evening. All talking at express speed and not doing too badly in the way of understanding either. Our French is very rapidly improving and the people are pleased to get \"les officiers\" to talk with them and exchange yarns. They are simple folk and live usually tranquil lives – the War has upset all:\n","12":" Bouzincourt\n\nAfter breakfast perambulated a little in the Chateau garden and at 9.30 am met Major-General Smyth V.C. C.B. at the old Church and he inspected the training and made no comments. A pleasant and rather warm morning and some good training was put in. about 80 bombers and rifle bombers were hard at work and some of them can throw to some tune. 120 Lewis gunners under 2 officers were also doing good work and an N.C.O’s class about 60 strong and 40 signallers also hard at work. Deduct thee specialists and your transport and details and you have a gigantic battalion to handle – I don’t think!. On account of Coy. Sports we made the afternoon parade 2-3.30. a big orderly room today on account of the difficulty in returning from Amiens – some good boys up. Formal mess with good bands. Afterwards spoke much French with many folk both at the Chateau and elsewhere and am getting quite an expert with so much practice at it.\n","13":" Bouzincourt\n\nAnother fine spring day. After breakfast watched a domestic comedy M’selle and her father trying to get an obstinate calf along. A fresh looking pretty m’selle in neat blouse but just the giggling age and with a raspy voice. Most of these French women have unpleasant speaking voices. Received word the General Smyth would be round on an inspection but he did not turn up.. capt. Kennedy evacuated sick. The usual big crowd of Lewis gunners, bombers and others hard at work. News arrived of the award of 17 well earnt Military Medals for the fight at Bullecourt. Our parade ground is well situated and the corners are little bowers of shade & of green leaf that are good to look upon. All round stretches a green and pleasant countryside. Some of our bombers have acquired the knack of throwing at good length. After lunch talked a while with M’selle and the little girl who is a dear little thing but very pale. The old man had 540000 left to him by a relative in America but did not alter his mode of life beyond erecting a good big house.\n\n24\/5\/17 Bouzincourt\n\nThe afternoon was another good \"goin\" of specialists and the rifle bombers put up some good barrages. The miniature range was also going under McKinnon & Kohn. Put in recommendations for the promotion of Rodda & Cawthorne and about half a dozen lieutenants. A fair number of Orderly Room cases on account of staying overtime in Amiens. The M.P.’s seem to put in the dirt on our good lads and little things like slipping on the handcuffs are not calculated to do very much good. In the street this afternoon met three fine and fashionable girls who make a living the easy way. A very great convenience for the men as these girls are quite nice. We now have a special prophlactic room with its blue light and all needing attention go there. Our clown has been evacuated V.D. at mess had rather a character of a lecture on Rations and cooking by an expert from Corps headquarters. How to utilise dandelions nettles &c as vegetables.\n","14":" Bouzincourt\n\nA warm day. In the morning fell in & marched to the Divisional School for gas experiments. Several clouds were released from the cylinders while we had our gas masks on and a good deal of smoke was released from smoke bombs making a good show. The men marched well and we had the Band out. During the afternoon Capt. Bunning took charge of the Battalion and Stewart and myself rode over to the Brigade Horse Show where the General & others were. A good turn out. We got four seconds. Afterwards rode down to Baizieux and saw Matthews. The German prisoners live in a pleasant place here. What a lovely place France is in Spring time!. We rode back through beautiful country like a garden where crops were all green and lovely and where women were working in the fields. Fruit blossom was heavy on the trees, the woods were thick and shaded with many colors of green and such a peaceful scene one could not well imagine.\n","15":" Bouzincourt\n\nA warm day. Morning parade as usual. \"A\" Coy went out to practice \"rabbit shooting\" or firing from the shoulder when on the move. All specialists hard at work. Half holiday in the afternoon was devoted to sports which proved a great success. The Transport events took place first and various running and jumping events followed. Vaulting was especially good. Crowds of men there. Boxing was continued after ten and there were some good and gory battles. One chap had his eye well opened up and the doctor had to put in a stitch. There was good hard thumping. The referee was not the best in the world. Altogether a very successful day and everyone enjoyed it greatly. Many little slacknesses keep coming to light. Saluting, swearing &c &c. young officers promoted from the ranks are not anything like the class they used to be and lack experience. Still this is only natural seeing what our casualties have been in the past.\n","16":" Bouzincourt Somme\n\nA warm lazy Sunday. Stewart got up early and went for a ride not getting back until 9 am. The Battalion paraded for service at 11 a.m. out in the grassy field and afterwards did a good march past. At the Chateau little Chretian had her photo taken by the old man – the essence of importance & bustle. She is a dear little girl and looked very nice. Madame went off with the doctor to see a rheumatic case. Monsieur le Cure bustling round his flock all importance. In billet all the afternoon writing out a lecture on the duties &c of an officer. After dinner walked in the garden yarning and then returned early to billet and to bed. Col. Davis came home about midnight. It was so close and muggy that sleep came slowly. The Colonel full of his trip to Paris which he considers easily the best place he has ever seen and the most beautiful.\n\n25\/5\/17 Bouzincourt\n\nOnly after lunch when jotting down the date here did realise that it is my birthday today! Another warm day which makes one feel a little tired and lack of energy. Battn. paraded in full marching order at 9.30 a.m. the band playing the old Regimental March to the tune of a \"Wee Deoch an’ Doris\". The packs mostly were neat and the flat blanket and waterproof sheet looked well. Steel helmets were carried under the pack supporting straps. The Pioneers and Engineers had a football match on part of the ground. We carried on the good work as usual the Lewis gunners firing a lot and having 8 guns in action at a time. Another crowd were getting instruction is the gentle art of rapid wiring – next time they do it may be out in the dark of a shell torn and corpse strewn No Mans Land. After parade was glad to put down a beer. The fellows are drinking a good deal of rum and coffee. Much of the issue rum is perilous – mixed dynamite & lightning!\n","17":" Bouzincourt\n\nMonsieur again took une photographie de la petite Chretienne\" – a solemn and serious ceremony. Yesterday and today being Fête de Pentecote and WhitSunday there are many preparations in the way of white dresses &c for the \"premiere communion\". Met Colonel Watson, Macgregor, & B.M. in the street just over for a look round. As the Engineers &c still use our parade ground this afternoon I cancelled the parade and put on the Sports finals instead. There was some excellent sport. The boxing resulted in a win for Sailor Parsons in his class and Caffrey lost on a foul to Binns in the heavyweights. Tugs of war also gave some good events and a very merry good afternoon’s sport was enjoyed by everyone. Spent the evening talking to Madame at the Regimental Office billet and drank a glass of her extra special pre-war brewed liquer – made by a select recipe and only produced on a grand occasions.\n","18":" Bouzincourt\n\nThe Colonel and the Doctor both left for England today, the latter on permission. The Battalion formed up in battle order at 9 am and to the strains of the band swung down the street in fine style. The mademoiselles and ‘les petites’ all came out to see les soldats and the musique and everyone’s chest went out well and great attention to the march. A little of the glorious side of War. My frisky horse prancing at the head of the column and nearly precipitated me into a crowd of German prisoners and a heap of blue metal! We marched to Millencourt by ploughed intensely delved fields all the way and there cooperated with the T.M.s in a furious bombing attack on a system of trenches. Each company did it in turn. Learnt in this tactical exercise the beauty of preparing a sketch of the position and circulating it with the narrative. On the whole the scheme was not badly carried out but there were many weak points noted. Returned \n\n29\/5\/17 Bouzincourt \n\nfor lunch about 1 p.m. and cut out the afternoon parade. Assembled all officers at 3 p.m. and an Engineer lectured on the prismatic compass & map reading. At mess we had quite a crowd as about half a dozen artillery men are attached. The band played during dinner and the King was drunk in the wine of the country with musical honours. After I criticised the morning’s work, Bunning followed with a lecture on Advanced Guards and another short speech about their application to our own selves by me closed the discussion. After walked in the garden and had a long talk with the old Monsieur and chatted about industries, socialism, strikes, Algeria, crops, the inevitable War & a little local scandal. Then home \"chez M. Dupray\" to read and to write and to count the days to my next permission à Paris and the stupidities there.\n","19":" Bouzincourt\n\nAt 9.30 am the Battalion moved off, followed by transport and cookers and marched via Millencourt . Troops in fighting order and the band playing. Little Chretian and her beaupere were out in the street to see the soldiers go by. A pleasant day and the country looked so soft and gentle with neat groves and the rolling undulations. Through Henencourt we turned to the right and then reached a fine field behind the Chateau where some troops were exercising. Some good .\n\nFormed up the battalion in bivouac formation in the rear of the paddock and piled arms, blew cook house and had a picnic lunch. On the side of the field nearest the Chateau rose a wood and a high grassy bank which formed a natural grandstand. A boxing stadium had been erected in one place here. The sports commenced after the other battalions had in turn arrived.\n\n30\/5\/17 Bouzincourt & Henencourt\n\nThe sports commenced and there were good events. One was a mademoiselles race and about 6 men were dressed as girls – splendid pretty girls too complete to scent and violet powder. It was impossible to distinguish them from the few genuine mademoiselles who were there. Some nurses came over during the afternoon. The boxing was good in parts. Acted as time keeper. Our man Caffrey knocked out his opponent with a hard hit right on the point. Acted as timekeeper for this. When all the boxing was finished we formed up and marched home getting into billet again about 10.15 p.m. Never have the men been in better heart for a long time. Singing, whistling & great esprit-de-corps. The Australian is very emotional and affected by surroundings. It was a splendid collection of men today all fit and well. At last they seem to be giving all of us a rest and there is talk of yet another couple of weeks of it.\n","20":" Bouzincourt\n\nFormed up at 9.30 and carried out a few rifle exercises prior to the companies carrying on with their specialist work. Switched a few surplus officers on to the Lewis gun under an instructor. Found another small parade ground after a pleasant town round leafy shady winding lanes. The grass full of the hum of bees and no sound or sign of the War. Later saw a poor old demented woman walking in long grass under trees raving – her 4 sons are all dead. A pretty futile business. Bombers, signallers and scouts all hard at work on the job. The guns were firing live stuff on the range. N.C.O.s class putting in some instruction. Dr MacMahon took Craig’s place.\n\n31\/5\/17 Bouzincourt\n\nMarie works about 14 hours a day poor girl from dawn to dark constantly on her feet. Her last task was loading dung on a cart. A comely pretty girl – is it any wonder that Paris streets claim so many rustic beauties. Here plain slavery – there ease and with pretty face, affluence for a while. Long hours are the lot of all farmworkers here.\n","21":"\n\nUsual routine with some bomb throwing (live) added to lecture & demonstration to two companies in rapid wiring and the construction of strong posts. A couple of orderly room cases A.W.L. Lewis gunners hard at their job, scouts and observers on theirs too. At the Chateau poor little Christien is kept hard at it from class to Mass and from Mass to class and M. le Cure attends nearly all day at the house. More than one person will thank God that premier Communions are not too often!. Being the night after paynight there was plenty zig zag and husky voices in fierce argument sent up barrages of bad language alround.\n\nBouzincourt","22":"\n\nMorning parade as usual. Marching order so that packs can be checked. Caned Lawlor up with some acidulated remarks. Lewis gunners practising firing on the move. After lunch rode down to Warloy with Stewart and went to Bde.H.Q. Saw Macgregor and heard a bit about the Stokes motor accident yesterday. 5 dead so far – 16 others wounded premature. Some rain as we rode home. The country the other side of Warloy is wonderfully pretty. After mess Stewart & Bunning came along from \"A\" Coy’s dinner which was a great success and run entirely by the privates and junior N.C.O.s. Much food and liquid as is usual. On Stewarts place was a card with \"Paddy\" on it and on Bunnings one with \"Bill\" on it. A great night with the boys & cost them 5 francs a head! Our chaps draw too much pay, 1 shilling per day should be the maximum. They waste all their draw in a couple of gaudy days after each pay day comes round.\n","23":" Bouzincourt\n\nSunday. The Battalion paraded at 11 am on the parade ground and Padre Lamble conducted the service preaching an excellent sermon. The Band played excellently. Had an inspection of hair &c on this parade and found it fairly satisfactory on the whole. After lunch had P.V. Martin up and gave him a bar for his medal. He was full of trouble and we went into matters carefully regarding pay &c and also what punishment was to be dished out to him when he would appear later in the afternoon at Orderly Room. After a talk we compromised on some C.B. as he objected to getting entries in his paybooks being already overdrawn. The Australian Army again!. \"Mr. Wiltshire is a just man\"! I tried a case of brawling round an estaminet. At dinner the band gave a number of items playing very well. Thurley is a good conductor. Monsieur took a photo of some of the \"bats\" in battle order out on the back door step.\n\nBouzincourt","24":"\n\nBright warm sunny morning with the bells of the little church pealing and white robed girls with floating viels going to the church like brides – premier communion. Rumour that the offensive started up north two days ago – may God rest the souls of many brave men: Had a long discussion with Monsieur at the Chateau about the War, espionage, socialists &c. He becomes greatly excited when he describes their deceit and reptilian cunning. Paraded at 9.30 – full marching order with blankets and steel helmets. Capt Webb, late South Pole Expedition, now of Engrs. gave a lecture on strong posts to \"DCo while \"C\" practised rapid wiring. A & B the same in the afternoon. Four Vickers gunners also reported and our Lewis men were much interested – some animated arguments commenced re their respective merits. We should go in this time with nearly every man trained right up in the Lewis gun bombs or other specialty. After lunch\n\n4\/6\/17 Bouzincourt\n\nusual parade – warm afternoon. Received word that Robinson is to go back to Australia \"S.N.L.R\" and pushed him off toute de suite. At Mess we had a lecture on Wood Fighting by J. Alderson and very good too. After mess walked for a little in the garden and there met the dear little 8 year old Christian who put up her small face so sweetly to be kissed. In the streets tonight a fair amount of Zig-Zag. It will be a good thing when they do close all the Estaminets. The curses of too much money and too much liquor are heavy on the A.I.F. Billet life is a wretched thing – what is there for the soldiers to do? Stewart discovered a big bomb dump today with thousands of bombs all evidently abandoned by some D.A.C. It is light these nights until nearly 10 pm – and here is of course daylight saved. Read in bed until nearly midnight. Stewart out catting one husband returned unexpectedly on leave.\n","25":" Bouzincourt\n\nAllowed Stewart and Alderson into Amiens Parade at 9.30 without band or buglers owing to our having lent them to the Artillery. A very hot day – quite homelike. The 4 Vickers instructors again reported and put through another lot of Lewis gunners. Other ordinary work carried on with. After lunch received word that General Birdwood was here and found him looking round the billets wearing an old felt hat, Australian flag on lance. General White was with him. General Birdwood was stuttering very much and his manner was peculiar – different to usual. Afternoon parade, lecture and pictures of strong posts – dreadfully hot. Not feeling in the pink came in early. Dealt with a few cases of absence without leave. The most common offence in the Army. Major Evans our guest at mess. The Band played a very good programme. Argued the point with Evans as we walked the garden until darkness had fully come.\n","26":" Bouzincourt\n\nThe Battalion passed its stating point – the Church – at 9 a.m. and marched out to near Aveluy there doing ordinary work and some swimming. I went to Warloy with our medal men for ceremonial parade. The men came down in motor lorries. Rode down with Flower as orderly a hot ride as the sun had full summer strength. To we Australians most agreeable. The local people have unearthed great big shady straw hats like sombrero’s under which they are nearly extinguished! Crops are looking well but the ground is very dry. The 23rd. & 24th. Were drawn up in hollow square and those who were to be decorated put in the centre. Colonels Lloyd & Murphy were there. After the General came on parade we awaited the G.O.C who was received with the general salute – rather a mess up as all officers did not salute – I completely forgot all about it! Andy Fisher was with Birdwood and has spoilt his appearance by shaving off his moustache. The ceremony of presenting\n\n6\/6\/17 Bouzincourt & Warloy\n\nmedals and ribbands was a long one. Some of the salutes were very funny as old \"dags\" hotted up. The march past was excellent and the step could not have been bettered as the lads swung by to the tune of the band. The marching of highly trained regulars. Rode back to home and had lunch and a sleep before setting out back for Warloy again. Stayed at Brigade and left my application for 4 days in Paris and then went round to Drummond of the MGCs. There was to be a lecture here but it proved a fiasco as the lecturer failed to turn up. Very annoying for our chaps who had come nearly 10 miles. Stayed to dinner with \nthe\n General Gellibrand – would that some of the English cracks could have seen him in his shirt and old tommie’s slacks!. He took the Hindenburg line anyway where they failed and ditto. Many other times. We argued about many things afterwards and I left about 9 p.m riding home slowly talking with Flower.\n","27":" Bouzincourt\n\nReveille 4 a.m. rose and shaved. A dull morning with the smell of rain and damp earth in the close air. Hundreds of birds chirping and twittering their morning song. All the men early on the job cleaning their rifles ready for today’s musketry. By devoting good time to first half hour inspection and being strict we never have trouble about dirty rifles. The men realise they have to make rifle cleaning as much a part of their daily routine as face washing is. Head of the column passed Church at 6.15 am and we had a pleasant march through Aveluy. Transport here went over the Anere on a causeway the water reaching up to the axles. The combination of wood and water here made a very pretty sight. Down sideroads to where the first line of German trenches was before the commencement of the Battle of the Somme and met the Divisional Musketry officer and started on a \n\n7\/6\/17 Bouzincourt\n\nfield firing course which carried us right up to Mouquet Farm now an innocent looking little debris heap covered with grass. We found a skull in a shell hole and several bodies of dead Germans still mouldering and unburied after nearly a year. The new chums gazed on these with fascination. After lunch a heavy shower wet most of us and not very many elected to remain for a swim. Passing the Corps School met Col. Fitzgerald and stayed there for the afternoon looking round. A fine organization and highly comfortable. Word through that Messines ridge is taken and 6000 prisoners. Gave little Christian her doll and she was delighted. At the Regimental office had a long talk with Madame and some of her lady friends about the war and things in general, getting all the local gossip. Am looking forward to my permission to Paris and hope that the doings up North won’t dislocate arrangements.\n","28":" Bouzincourt\n\nEveryone on a delousing expedition today at the Senlis baths where while washing the men’s clothes are put through the Foden lorry. Capt. Davis returned from 6th. T. Battn. This afternoons work was carried out independently on their own parade grounds and not feeling too well I did not go out on a parade. Things are very quiet in the village. The people are busy on their gardening and in the fields around where we hear much of the damage wrought by the horses. Only a very little perhaps but it means so much to them. Have talked much French to the people today and am acquiring some fluency in speech. Dealt with some orderly room cases and had a couple of talks with accused whereby we adjusted matters on an understanding that next time the acid would be applied with quite unusual vigour!. Lecture by Thorley tonight on signalling.\n","29":"\n\nBouzincourt Warloy Contay\n\nAwakened about 5 a.m. a bright cool and fresh summers morning. Stewart was also awake and from him learnt that the promised movement order had not arrived from Brigade and consequently I could not go from Albert by the morning train. After some deliberation decided to breakfast and get down to BdeH.Q. at Warloy & find out what had hapenned. Took Snowden as orderly and had a pleasant ride in the good fresh air. Just coming into the town Snowden’s crock crossed legs and crashed throwing him off. Fortunately he was not hurt. Both the knees of the horse were broken and bleeding very much so I pushed on leaving him to bathe his horses wounds and to brush himself. Saw Heath at BdeHQ and getting another orderly and horse I decided to push on to D.H.Q at Rubempre. It was a fairly long ride and took me through Contay first of all. A very pretty little place with such nice surroundings. This little village has a number of French protestants.\n\n9\/6\/17 Contay, Rubempre & Amiens\n\nLeaving Contay the road commenced to ascend hills until Herrisart was reached. From there across to Rubempre was a pleasant ride – the fields looking rather dry and many women working in them. From higher ground the number of woods scattered round was very striking and in one I noticed a fine chateau embowered in the trees. Rubempre is a village of ordinary type. Went to D.H.Q. and saw Colonel Relph about the accursed movement order. Went across and had a talk with General Smith and arranged for a ride into Amiens in the Brigade mess cart. With 3 days drove in via Perrigot Rainneville to Amiens. It was pleasant to see the country folk going about their peaceful occupations and passing us on the road. A striking thing going along was the close settlement – the churches steeples showed up from each village at one time about 8 were in sight. Some of the churches are surprisingly large and they are always on the highest point in the village.\n\n9\/6\/17 Amiens\n\nFor miles before you reach the town the old Cathedral is visible dominating every thing. Coming into the town the number of women was striking. Put up at the Hotel Belfort and then walked around to Goebert for some lunch. A few beggars in the streets and a very noticeable slackness in saluting not only among our own chaps but among the tommies as well. To the Cathedral and once more enjoyed the beauties of inside and out. Even here near the Chapels behind the High Altar was a prostitute trying to ply her trade. To the Railway station and got ticket order at the office of the R.S.O. then returning to the Hotel feeling tired. Left Amiens at 6.30 pm in company with Major Holme and reached there by 8.15. We come on the city suddenly and soon pass through the fortifications into the Gare du Nord. Had a little trouble in getting a taxi but got one at last and drove first to Hotel Lotti where Holmes stays and\n\n9\/6\/17 Paris\n\nthen to Elysee Palace Hotel and got a fine room with private bathroom for 12 francs. A great difference is noticeable in the streets as all the trees are out in full leaf. Tonight the Avenue des Champs Elysees was full of strollers and people sitting on the chairs. All the cafes were busy and crowds sitting outside. Had a walk round \n\nrue de Castiglione and Rue St Honore as far as the Place Vendome and then returned to hotel having a meet but it did not come off. The roar of the guns can be very clearly heard here tonight. Between Amiens and Paris there is some very beautiful country and a good deal of wood. We noticed some chateaus. Put down a good long iced drink before turning into a fine double bed. The crowds all round are uniformed and in most cases soldiers or sailors. Fountains were not playing on Place de la Concorde.\n","30":" Paris\n\nA very full day. Up at 9 a.m. and, after a breakfast of coffee and rolls, went out for a walk through the Avenue des Champs Elysees – delightfully cool and leafy at this early hour. Across the Place de la Concorde and visited the Tuilleries Gardens also in full leaf. The statuary here looks splendid against its background of green. Some of the worlds masterpieces are hereabouts. With characteristic disregard for convention there is here no attempt at the fig leaf. Had a good inspection of the outside of the Louvre and then went up to the Rue de Castiglione for some papers, buying some postcards in the Rued de Rivoli on the way. Then along the Rue de St Honore to the Concorde again and took a taxi back to my hotel – Elysee Palace. It is a fine hotel and has splendid hall and reception rooms and Gobelin tapestries (just like paintings on many walls. Before the war this was the \"plus chic hotel de Paris\". Met Mdlle Ella Comsha of Bucarest Roumania and we\n\n10\/6\/17 Paris\n\ntalked for quite a long time and then decided to go up to the Madeline for High Mass. We walked up and as we approached the Church we noticed that its front was draped with heavy curtains relieved with gold crosses &c and that there was a crowd on the steps and a narrow lane through the crowd. We went inside and had a look round the air full of fumes of incense. All the interior rather sombre and much like the old London churches except for the circular chapels all around the Church. About the Madeline there is a very old world air. The old chap who sits holding the dirty brush damp with holy water on which the faithful wet their fingers might have stepped out of the 1860’s and the old chaps who act as church functionaries wear ill cut suits like our grandfathers and have mutton chop whiskers &c. these chaps wear a metal chain like an old aldermans collar round their necks. Returning to the door we found the crowd much thicker and\n\n10\/6\/17 Paris\n\ntook up a position just without the door as the head of procession advanced. It had evidently been marshalled round the side. A banner and a priest preceded many little girls all clad in white carrying posies and wearing chaplets of white flowers. There were many of them and nuns with queer four cornered caps led them along and kept the ranks moving. Following these came other older girls wearing the white of first communion and with viels like a brides enveloping them. Close behind them came girls from 12-20 years of age all soberly dressed and wearing plain straw hats (about 1890!) – these were all inmates of orphanages. A pause now took place and a band took up its position. All the players wore little caps with feathers in them, presently my old friend the Suisse hove in sight, gorgeous in his 3 cornered hat, his 6 feet nothing new white silk stockings buckled shoes and a coat heavily slashed with gold lace. He carried a brass pike over his left shoulder\n\n10\/6\/17 Paris\n\nand had a drum majors staff in his right hand. Behind him came a banner bearer. (Before all this and following the orphan girls, the young boys had come nearly all in long trousers white waistcoats Eton collars &c with white streamers on their arms). Next came tiny boys in red cassocks and little white surplices who carried smoking censers from which thick incense fumes arose. Followed under a golden pall a fat and bare polled dignitary of the Church carrying the host enclosed in a brass sun. round his fat neck beads of sweat were forming for it was close. Old priests and nuns passed in with silent but moving lips and hear and there one saw the gleam of eye and fever of action that told of a smouldering fanaticism. On the highest step the celebrant paused the bulk of the crowd kneeled, and as the host was elevated the band on trumpets blared out something not unlike the Royal Salute, as the procession started the move on again the people pressed forward to touch the base of this\n\n\t\n\n10\/6\/17 Paris\n\nbrazen receptacle. They passed into the Church amid the smoke of incense and we walked back to the Hotel and talked till lunch time. The Avenue was crowded with cars, taxis, fashionably dressed folk and ever so many soldiers. At 1 pm I caught the Metro at Alina just outside the front door and made for the Café Weber outside which very many folk were seated. Had a good lunch among glare glitter and beauty and had a little Chablis ordinaire and a Benedictine. To the opera and there took train underground to St Germain de Pres. A very old church with paintings high up all round the nave. Over the door was the legend \"Liberte Egalite Fraternite\" and the place had once been used as a salt petre factory. From here via Rue Buonaparte to St Sulpice an old and enormous structure in front of which is a place with trees many seats and an excellent fountain. Entering a service was about to commence. There were great altars to the dead of this war and\n\n10\/6\/17 Paris\n\nrepresentative of the Croix de Guerre crowned all. At the back of the altar is a statue of the virgin standing on a globe nearly immersed in clouds – By clever lighting there is an excellent effect. Walked down Rue Ferron to the Musee de Luxembourg which was open. Inside there is lovely milk white statuary – most beautiful poems in stone. Her once again is desregard of convention and utter want of fig leaf. Many of Rodins sculptures. Much struck by one called the \"Supreme kiss\". A figure half naked woman, half monster has its claws deep sunk into the naked chest of a young man. The nails have penetrated into his vitals & in the marble are deep gaping scars from which the blood has not yet commenced to gush. In his death his lips are glued to those of his destroyer in absolute height of passion and abandonment. Went through to the paintings of Belgian English and Italian schools – some very good ones of the front and many works of modern masters. The Jardins de Luxembourg were\n\n10\/6\/17 Paris\n\ncrowded with people and the trees with interlacing leaves formed an overhead canopy. The terraces and galleries were fine. Made now for the Pantheon pausing to buy some postcards on the way and noticed Rodins \"Penseur\" on the steps. Going inside the vastness of this heathen temple strikes one. It is domed and laid out in the form of a pure cross. The walls are wonderfully painted with representations of the life of Jean D’Arc (from which all inscriptions derogatory to English have been erased during the War) – also a good deal of peinture of St Guinevere whose tomb was hereabouts. An old guide full of medals now started bawling \"Pour visiter les tombeaux\" in a peculiar voice and every one started to laugh at him. He then led us down many stairs to cool vaults like St. Pauls and there we saw Voltaires & Victor Hugo’s &c &c. The old guide rolling off his story was very funny. Taxied home and on paying asked fare \" 2 fr. Quarter vingt cinq\", gave chauffeur 5 fr.\n\n10\/6\/17 Paris\n\nHe returned two and seemed not too satisfied to keep the change. I did not realise until upstairs that I had given a great tip of 15 centimes. With Ella until 7 and then went down to Arrigonis by tube and in the old place had an Excellent Soup de poissons, some strawberries and a ¼ of Chianti. Back to the hotel and spent a most pleasant evening on a balcony in the cool watching traffic passing along the wooded avenue. No moon.\n","31":"\n\nAwoke and bathed and was out before 9 o’clock. Caught the metro and went down to Hotel Lotti and there saw Major Holmes who was just rising. We took a taxicab and went to Notre Dame and just inside we met a guide who showed us round. A Mass was being said. The nave was hung with the Allies flags including that of the United States which was yesterday deposited by General Pershing at a service in which Cardinal Mercier assisted. We saw all the statues\n\n11\/6\/17 Paris\n\nincluding one of very delicate work representing the lace of a priests surplice. The interior of Notre Dame is sombre – the two very large rose windows on each side are wonderful. The choir stall stone is carved in the same way as Amiens. From here we went round the side and viewed the Cathedral from there – all its gargoyles and buttresses a very fine sight. We now walked with our guide through a few very old houses in dirty surroundings to the very old Church of St Julien le Pauvres, an old semicircled grey stone place & small. It is used by the Russian Greek Roman Catholics. There is a good statue of the Virgin and the sacristan places are in the best positions to see it. The altar has on it a bird like a dove. A musty close smell about all this place. Just outside is a clear green space and two ladies were sitting here painting. Through the trees and looking across the river a grand\n\n11\/6\/17 Paris\n\nglimpse of Notre Dame could be got. We now walked through other streets to St Severin which is also an old church possessing many arches and queer twisted pillars and a tremendous lot of old stained glass. There were some ladies painting in here and there were also many old tombs as the church dates from the 6th century.\n\nWhile waiting for Holmes before setting out on this trip I reported to the A.P.M. and then walked round to the Church of St Roch being lucky enough to strike a musical service. Here they have a lot of old bells and some statues regarding the curing of deaf mutes.\n\nFrom St Severin we went to the Palace de Concieregie passing the Hotel Dieu (or Hospital) and part of the barracks for the Horse Guards. Turned into Saint Chapelle but it was closed and we could not get in. our guide now took us in & right through the Palace of Prison & Conciergerie.\n\n11\/6\/17 Paris\n\nWe saw the gate through which Marie Antoinette passed to the guillotine on the same day that 2000 odd others were also beheaded and also some yards out of which it would have been impossible to escape. One had bayonets stuck at its top near all the corners and another was the place where many prisoners were absolutely murdered the assassins hitting the steel into them as fast as they were thrown out. Passing through several halls we came to the residential part and saw different palatial rooms in which the courts sit and also saw the robing room where all the gowns are. But the gem of all was the magnificent Supreme Court. It is beyond description. In the 4 corners are pictures of Napoleon, Charlemagne Justinian and another – the 4 great law givers of the world. Justice pursuing Crime, the Light of Justice and another allegorical picture are done in the roof. Over the\n\n11\/6\/17 Paris\n\nend of the room is a big black oblong framed with gold and looking very blank. Our guide told us that Christ was meant to fill this but is left blank just to show how the French had completely wiped God out. The ceiling was most splendid here. Our guide left us here and we walked up through Les Halles along to the Grand Magasin de Louvre. Passing through here the perfumes were overpowering and erotic. The French devote great portion of their minds to sensuality – my own room has a porcelain fitting with selz wash after connexion and Holmes has the same. Back to hotel by tube and saw Ella dining with her mother tète-a-tète. After lunch I met Monsieur Comshe deputy Roumanian parliament, avocat, and director of the National Bank and also met a few others. Talking to them I faltered on in dreadful French only to find them later using good English.\n\n11\/6\/17 Paris\n\nAt 3.30 pm went out to the opera and from there did some shopping. All the streets full and the \"bon chapeau\" attracted much attention. Returned at 5.30 and was tete a tete with someone nice until 7.30. went then to Cafe Metier to dinner and had as a course some frogs which tasted delightful. Then home from the Opera but took the wrong change and landed out at the Invalides. Loss of time meant breaking an assignation and at least one officer of the Hotel Britanique went to bed quite desolate. Went to bed absolutely tired out and done up – twice as tired as all the exhaustion and fatigue of a hard day at the front. How fragile girls stand a life of constant tearing about and late hours I don’t know. From a window of the Conciergerie our guide showed us a crowd of girls waiting at a door. They were licensed prostitutes lined up for their weekly examination by the doctors.\n","32":" Paris\n\nBeing tired stayed in bed until late but at 10.30 a fine limousine drove up with a guide for our trip to Versailles. Went round to Hotel Lotti and there picked up Holmes. We drove right down the Champs Elysees to the Bois de Boulogne which was looking lovely. There were many boaters on the lake and our chauffeur pulled up so that we could look back over the lovely vista of wood and water where the two arms meet. It was very lovely but give me rather the junction at the Sale swing bridge when the wattles are out! From here we ran through avenues that met overhead like green tunnels and at last came out of the Bois. Through the close tree trunks came an occasional glimmer of sun, there were parties walking out and people riding on the riding tracks. In the air was the smell of the bush moist earth and fragrant leaf. From here we ran out into rather \nfragrant\n squalid winding streets very poor and dirty and this continued until we reached St Cloud. Here we swung\n\n12\/6\/17 Paris\n\nround on to a terrace where the castle had once been. The Germans burnt it down in 1870. We left the car here and went on to a high cliff where Wilhelm I stood while his guns bombarded in ’70. It was not a good day for birds eye view but underneath us the whole of Paris lay stretched out in panorama. To our left in the distance was \"the Bois\" & on every other hand stretched forests. Just behind us ran the St Cloud forest through which run wonderful drives and lanes. Terraces were tastefully laid out. Round the site of the old palace were many statues of mythological subjects. Getting in the car again we put up a fast run through the little town right across to Versailles and drove in through the Park gates up to the Main Court entrance. Here is where the revolutionary mob howled for the blood of their despotic rulers and jumped up at the balconies of the royal apartments. All the place was closed by order but our position as officers opened\n\n12\/6\/17 Paris\n\nthe doors (together with the justified expectation of palm oil by our vinous conductor). We went first into the Royal Chapel which has a magnificently painted ceiling in 3 parts. Ascending through a passage we stood on the balcony used by the royal family. To attempt to describe in detail what next we saw would be quite impossible as it is beyond description. Every inch of these wonderful rooms is either carved or painted. The wood work of the walls is chiselled into thousands of designs. Paintings by masters are in every room and on every ceilings. The old conductor spoke in terms of extreme unction as we went from one room to another. ‘C’est la salle a manger d’la reine Marie Antoinette’. \"C’est le cabinet de travail de l’Empresse Josephine, la premiere femme de Napoleon le premier\". The Salle de la Guerre is a small room full of the glorification of war. The walls are carved into representations of golden armour and mighty warriors and the paintings showed victorious battles.\n\n12\/6\/17 Paris\n\nTo one who did not know War in its filth there would be an impulse of desire for it in the blood, but the true note was struck by a huge chiselled plaque on the wall showing a mighty victor trampling anguished wounded under the feet of his rearing charger. All along are rooms each that of a different heathen God – Salle de Mars, Sale de Mercury &c. A long beautiful hall leads down to the Salle de Paix which illustrates the beauties of peace and home life. From the windows here we get fine views of gardens and tasteful scenery. Instead of flowers the thoughtful French have planted a crop of beans so that the ground will be producing food for the nation. We saw the bed chamber of Louis XIV a most palatial and magnificent room with Sevres vases and wonderful furniture. They preserve his perruque which is fitted most realistically on a portrait on the wall. This room is so gorgeous that one cannot imagine anyone sleeping there and we were not surprised\n\n12\/6\/17 Paris\n\nwhen our conductor led us into the smaller and more homelike private apartments behind. Although smaller, though there is no diminution of luxury and labor and art have been expended just as slavishly upon them. On each mantelshelf is a timepiece in itself a gem and Sevres vases quite priceless are also there. Gobelins and other tapestries are on many walls but some have been taken away for safe custody during hostilities. We also saw the apartments of Napoleon and Josephine all very marvellous and beyond description. Also their private apartments. The floors are all wood laths fitted on in principle no nails visible. Closely connected with all this place is the name of Marie Antionette and also the Madames Maintenon, Du Barry and other mistresses of great men. The luxury and prodigality of this enormous place is such as to fill one with a great wonderment that a ground down and subservient populace could so long stand such oppression and injustice without rising up\n\n12\/6\/17 Paris\n\nin their just and righteous anger and tearing into little pieces the selfish sensualists who did so much harm. Our guide amused us by saying that at one place \"Marie Antionette used to make her extravagances\". We saw some excellent mosaic work. One table represented the labour of 25 years – the most exquisite design done in the tiniest pieces of stone fitted cunningly together in intricate design. On coming back to the entrance we went across to the Grand Trianon which we found closed but a little backsheese to the dame of the Guardien and a little flattery to an old gentleman who is conservator got us in being officers. Our guide was much perturbed because I made to tip this venerable conservator. These Trianons were the country houses of the king & queen where they could live in a more homely fashion than in the immensity of Versailles palace itself. The Grand Trianon is quite as large as an ordinary palace. The rooms are all masterpieces of carving and painting. Here is an enormous vase of alabaster carved deliciously into intricate designs and patterns. In spite of its size there is an air of lightness about it.\n\n12\/6\/17 Paris\n\nAfter leaving the Grand Trianon we went to the carriages – all the state coaches in burnished gilt and gay trappings. That of Charles X was very fine and much larger than any others. There were also Napoleon’s carriages including those he used on active service in the field. Near by were the sedan chairs of the queens and of the royal mistresses and also their ice sledges. The harness for the state horses hung up in rear. To the Petit Trianon which is about the size of a fairly large mansion and very full of art treasures. Looking down from the front of the palace for miles a splendid avenue extends in terraces. There are many fountains – one of these is the Basin of Latour and represents people being turned into frogs – all spout water. The green squares of grass on each successive terrace stand out vivial and form the green carpet or \"tapis vert\". in the Petit Tranon all movable articles such as vases &c are connected by wires to prevent theft. Near here the Court Ladies had a model village where they were wont to play at being milk maids. The village still exists and may be seen\n\n12\/6\/17 Paris\n\nbut we had not the time. From here we had a very pleasant round run to St Germain en Laye which rises in big wooden bluffs above the Seine and dominates Paris. The German batteries were here during the siege of ’70. a fine old castle done by Francois mostly. We drove home passing close to the well known Valerien Mount which is strongly fortified. Dined at Metier in good comfort had a soup, some frogs, asparagus, ice a benedictine & some wine item 14 frs. Returned to hotel and spent a pleasant evening tete-a-tete on the balcony and then went up to room, where the people next door proved rather interesting with noise & action. As result of todays tour I am inclined to think that Paris is set in a forest. A roll and then took a \ncup\n taxi post haste to the Box office near Opera and collected my ticket. Went into Opera noticing the splendid foyer and arrived just before the overture of Verdi’s \"Aïda\" commenced. A fair house at\n","33":" Paris\n\nthis matinee considering that all seats were double price on account of it being a benefit for the employees of the Opera – in all about 1000. The performance was lovely – I attempt no description. My neighbour on the next seat was a little girl from the American Legation and, having been in Germany during the War her talk was very interesting. Broke the ice early in proceedings and found her an interesting little thing who spoke good English and had been in nearly every other capital except Paris. After the performance came back to hotel (about 1) and had another yarn with Ms’elle the femme de chambre who also speaks a little English. To dinner at the Cafe de la Pain encountering a dense crowd welcoming General Pershing and the other Americans. A good dinner at the Cafe de la Pain and then returned to Hotel for a rendez vous. After waiting until 10.30 fruitlessly took a taxi for La Place de l’Opera and being met there by a guide indulged in a real mad wild Parisian night not getting to bed until 1 pm. Got some good advice.\n","34":" Paris\n\nUp and out and 9 o’c and went by tube to the Opera. The Paris metro is first class. Here ordered some chocolate and then took a taxi to Gare du Nord and bought my ticket for tonight. Drove back to the Opera again and visited Lloyds Bank for some change. Returned to Hotel and met Ella and we went to Les invalides. All the open approach was covered with portable buildings for the fair which has just closed. In front of the building is a moat now full of grass. Along the terrace in front is a row of old guns. Entering we found all the place closed as usual, but an old man had permission to take officers & their friends round. However, having seen it all before, we contented ourselves with a view of all the captured trophies in the courtyard ranging from field and machine guns to aeroplanes. Returned to hotel most of the way on foot owing to the difficulty of getting taxis – the drivers\n\n14\/6\/17 Paris\n\nmost independent and take time off for lunch. Met Ella again at 1 p.m. and we went out by different doors and met at Claridges – this on account of a severe father, but Mdme. La mere est tres agrèable & sociable. To the Hotel Crillon for a tete-a-tete lunch. This is situated near the Marine offices at Place de la Concorde and was once portion of a royal palace. It is very chic General Pershing and his staff (USA) are here today and all the leading people many in gorgeous uniforms, came flocking up to pay their respects. Crowds of motors outside. We dined very quietly in the big dining room at a table pour deux and returned to hotel at 2 o’c. at 3 I went down to the Louvre by tube and an old chap showed me through the sculpture and paintings. All the good things are all taken away and stowed at Toulouse and elsewhere. Some of the work was very fine and the guide went into professional raptures over\n\n14\/6\/17 Paris\n\nit \"Quelle proportion: quelle mouvement\". There were some Moroccan Arabs in a little exposition of products of Morocco. Truth to tell I was too absolutely dog tired to appreciate the splendours of the place and yawned through several corridors. Saw the window where pages on the death of the King used to break a wand saying \"The King is dead! Long live the King\" and also the place where the balcony was where Charles X (?) waited for the death knell of the Huguenots to sound from the belfry of St Eustache opposite. Home by tube and lay down on the bed for an hour and a half absolutely knocked out. The French always call \nof\n a lady Madame if they are not certain whether she is Madame or Mademoiselle. From the top of Tour Eiffel the tricolor floats always but by an optical illusion the tower always looks much smaller than it really is. The Avenue Champs Elysees is the most wonderful street well imaginable and\n\n14\/6\/17 Paris\n\njust now looks particularly well as the trees are superb. The Arc de Triomphe stands out dominating its centre. Before lunch about an hour the Parisians go to their cafes fro an aperitif – a good excuse for a sit down and a gossip. The contrasts between the moral & the immoral life are here most apparent. The good girl has to work like a slave for small wage and long hours in a place like a close and fetid underground tube. Her sister sails by in the daintiest of clothes and with the most expensive scents & powders permeating her and her surroundings. Such work as she does is a pleasure. The waiters &c here are very funny and know I am going today and keep asking what time &c &c. Their tips mean so much to them. This trip will cost me about £26. (6 days.) and I have gone without nothing. Never less than 7\/6 to 10\/- for a meal – the pace can only be kept up for a little while and after all it is a rotten artificial existence and one will \n\n14\/6\/17 Paris\n\nbe quite glad to get back to work even after so short a rest. Virgil’s plea to town lovers to come to earth and enjoy the life of the honest husbandman should be well applied to both Paris and London now too. After a good rest packed everything up ready for a quick get away and paid the bill and dished out heavy tips. Made for the Cafe de la Pain and dined well with some Haut Sauterne. A gay sight is this chicest cafe in Paris and some beautiful women came in and out. Plenty of glad eye – indeed it is pathetic to see these poor brainless little beauties trying to \"catch\" a dinner. Walking in and out and lingering as long as they dare only perhaps to have no success in the end. One hears all languages guttural Teutonic and Slavonic on one side and the universal French on the other. Went back to hotel at 9.15 and met E. at 9.30 in the Writing Room and we took our leave on the balcony there. At 10.30 pushed off in a taxi and got a good seat in the Amiens train which left at 11.40 pm.\n","35":" Paris\n\nTravelled all night and changed at Amiens into the Albert train meeting Dr Craigs brother who is a LtCol. In the Highlanders. After breakfast walked out to Bouzaincourt in time to see the last of the transport commence to move off for Bapaume. The Battalion had already entrained at Varennes. Rode back via Pozieries to Berlancourt near Bapaume. All the country is very much altered as a thick growth of grass covers it all now. Reached tent camp in great heat and settled down there to await arrival of the Battalion. They marched in at just about 7 p.m. all a lather of sweat and very tired. The band played them in. had a formal mess with a very full crowd of officers and afterwards talked and yarned. The doctor far from well. Tonight we have the constant roar of guns sounding out in front. Stayed up until late writing and fixing up the accumulation of some days in correspondance and other clerical work.\n","36":" Beaulencourt N 1.7\n\nIn tent camp. Hot. Attended conference of C.O.’s at Bde H.Q.s\n","37":"\n\nHot day. Early church parade. Held conference of company commanders.\n","38":"\n\nUp and shaved before 7 a.m. Our band played at reveille. Rode out to some positions near Villers au Flos and took the company commanders over the ground we operate over tonight over trench bombing and flank extension practice.From the gun pits around here we used to be bombarded about Xmas time.Villers au Flos has been a pretty little place and boasted a fine chateau. Every house is of course in ruins in accordance with usage. Rode back and rested all the morning. General Smythe rode up with his lancer and A.O.C. and talked about nothing much and then Geo. Norman appeared back from hospital with a mutilated hand thanks to interfering with a Hun bombthrower. Thunderstorm brewing.\n\n18\/6\/17 Beaulencourt\n\nLeft at 4 p.m. and marched to O14C and from there launched an attack on a system of trenches and then bombed along 500 yards. Many faults came to light mostly in bombing. Did some rousing. Concluded the practice in heavy showers and then had tea in Villers au Flos. Our band played a bit for us and then they marched back under the subalterns. With the O.C.s rode over & reconnoitred Haplincourt Wood. My horse bucked a bit but managed to stick on. Had a good run home to camp and mess at 10 pm. Afterwards made a criticism on the afternoon’s operations. Not using their blocks is a common fault of the rising generation. Villers au Flos has been a very pretty little village and its chateau is all in ruins. Not a whole house remains standing in the place they have been collapsed by the enemy and the roofs settled down. A cool fragrant evening after the rain.\n","39":" Beaulencourt\n\nUp early but heavy rain came on and delayed our departure. The General came in and waited with us. Letting them put their waterproof sheets over their shoulders we marched out towards Haplincourt Wood and successively by companies launched an attack against that of Villers-au-Flos. About the first time we have ever done a good wood attack and it was very interesting and instructive. Had all the officers out afterwards and discussed the work with them. Marched home and looked forward to an afternoon off but was summoned to a conference at BdeH.Q. and kept there until late.After that routine,details and odds and ends until very late. Never are we busier than when these stunts are pending and for the C.O. the work is never ending. Leon Barbier of Mission francaise stayed to dinner with us and Colonel Craig dropped in for a yarn later on in the evening. Much like his brother.\n","40":" Beaulencourt\n\nBeing extremely tired slept in and had breakfast not rising till 10 am. Sent the Battalion out under Dooley for specialist training. At 5.30 p.m. rode out to Villers au Flos where a complete battalion containing 1 Co from each Battn. carried out an attack on the wood and portion of the village. Acted as umpire for the defence. The attack was slow in developing and was preceded by and carried out in heavy drenching rain. These woods are lovely and delight the eye with their delicious green. The folly of crossing open spaces was very evident but the right flank worked round cleverly and got the enemy in rear. In the chateau grounds is a little rock grotto and shrine and this property has been very nice in its time. Now the chateau is a heap of ruins. A B & C Coys went out on an outpost scheme – night outposts under Bunning. Plenty of mud everywhere by reason of the heavy rain. General Gellibrand in good form. Nice bar \nC.M.G.\n C.B. D.S.O. and bar & S.A.\n","41":" Beulencourt\n\nOur outposts last night got soaked to the skin but were very cheerful and held up all traffic in their practice sector bottling Col. Annan of the Pioneers for a time. Some of parties were \"stalking\" one another until late hours. Great interest being taken in this tactical work by everyone. The Battalion moved out at noon to carry out battle practice in musketry but orders were issued prohibiting ball firing which many thought would make a farce of the show. However by preparing surprise targets to encourage rapid sight setting, judging distance and trying fire control and orders, tackling strong posts &c the time was spent with profit. At 2.30 adjourned to 23rd officer’s mess for discussion conducted by General on yesterday’s operation and from there over the fields to a lecture by signals on the amplifier and power buzzer. General Smythe and many gilded staff folk turned up to this. Thwaites lectured on the Lewis gun in battle after mess.\n","42":" Beaulencourt\n\nWent to BdeH.Q. at 9.30 and saw the G.O.C. and B.M. about todays wood fighting. The Battalion moved off at 11 a.m. and I went on with the company commanders to reconnoitre. There were several heavy showers. Living so much out of doors as we are lately has given us a ferocious appetite and we can account for good meals. All the cookers were out and we had lunch at noon. At 2 p.m. the coys. went off to their jobs in defence of the wood, holding the fringe in 8 posts of sections with a similar second line covering gaps. Supports and reserves behind. A very pretty spot this and a fine green sward in front of the Chateau which doubtless in its time has seen many gay things – now in ruins. Sent the coys home independently being fed up of getting wet every night. Wearing the ground sheet capewise saves a lot of wet clothes. Rodd goes on leave tomorrow and Dooley will resume his company command. A fine evening a little cold.\n","43":" Beaulencourt\n\nThe Battalion marched out at 8 am to carry out attack on a village and jumped off at 8.45 capturing and consolidating the village by 10.15 am. Ordered a further advance on an objective to a flank – in the meanwhile heavy rain poured down and soaked all hands making them miserable. Sent the Battalion in under the Adjutant at 11.30 with the band heading the column. All the officers stayed behind for the practice of hearing about mistakes and discussing the operation. There were many points that came under notice. After lunch most went to an Officers Gymkana near Bapaume to which some nurses were invited. Personally went to sleep and gazed idly all the afternoon. Groves & Wolff both returned today from schools. Miles lectured after mess on the subject of Supplies. The doctor & myself discussed the chances of a permanent war. Everyone would look forward to its end now.\n","44":" Beaulencourt\n\nA day of rest. Church parade 10.30 am at which the Lt.G.M’s & M.G’s were present – a pleasant sunny morning with stirring breeze. Rode to BdeH.Q. and saw the General and the B.M. back to lunch about 1.30 p.m. and pushed off on foot to make a reconnaisance for tomorrow’s work. Returned about 4 and found a conference ordered at 5. rode down and we were in close council till 7. spent the evening lecturing the company commanders writing official correspondence, drafting orders and a hundred other things. These last few days have been some of the busiest imaginable. Groves is ordered off to the 6th. T.B. and a few others too. Greig’s supersession by two others has evidently much upset him. There are some very unpleasant jobs to be done in this life and one gets callous about them.\n","45":" Beaulencourt\n\nUp at 6 and left early with the Company Commanders to reconnoitre the ground for our mornings work. Stewart met us at 8 with the Battalion in artillery formations and we massed in a convenient sunken road. At 9.30 jumped off and took two trucks and then worked the loss of a copse and its recapture by means of a counter attack delivered by our supports. Had a pow-wow with the officers and then sent the Battalion in which we reconnoitre the ground for tomorrow. They returned in artillery formation but formed up on the hillside and marched in to the strains of the band which is coming on. Two new bandsmen & M.DC Ross were among a draft that marched in last night. Alderson drew up the operation order for the attack tomorrow and after tea all the officers and N.C.O.s went out over the ground. Returning a heavy shower came on and a run to the Q.M.’s store did not avoid a wetting. Just becoming dark at 10 pm.\n","46":" Beaulencourt\n\nBy 7.45 the battalion swung out in column of route to the sound of a rousing march from the band. Jumped off at 9 a.m. in an attack on Villers-au Flos which was defended by the 24th Battalion and everything went well. Afterwards at a conference of officers Colonel Watson & myself discussed the operation and the General said that to his mind the attack was excellently organised & delivered. \"Praise from Sir Rupert is praise indeed!\" Returned to camp at noon and rested most of the afternoon. After formal mess at which the band again performed, Evans gave a lecture on Transport. Spent the evening with Leon Barbier and conversed for nearly ½ hour in French – at least no English was used in the discussion and we covered many topics. Our regimental band is improving very fast. A Taube was over tonight and one battery of archies did some good shooting. Otherwise all quiet. Delightful mild evenings a healthy life this with abundance of fresh air.\n","47":" Beaulencourt\n\nMusketry \"C\" Coy went out at 5.15 a.m. and the others at intervals later. Rode out about 8.30 with Stewart and on the way had a spill the horse falling – unhurt. The platoons carried out a field practice using all their arms in conjunction and firing on strong posts and other prepared positions. Before lunch went down to Le Transloy and there reconnoitred the ground for our defence of that village tomorrow. A large ruined village. These villages are so extensive because all barns farm machinery &c are concentrated in them. The church was hard to find among the other ruins and consisted of a high heap of rubble from which there was a good birdseye view of the surroundings. Gave Stewart our dispositions to let him draft the Operation Order. Returned to camp. Charlie Fulton home again from leave – a good chap. Rested all afternoon. Did some French translation and other odd jobs till nearly midnight and wrote a few letters.\n","48":" Beaulencourt\n\nReveille 6. heavy rain prevented moving off at 7 a.m. at 7.1 marched in column of route to Le Transloy and there took up defensive positions and held against fierce attacks by 24th. Battalion under Col. Watson. The General came round and offered advice and criticism eminently practical. Returned to camp on foot at 1 pm. Very hot and a most fatiguing morning left us all very tired indeed. Rested until 5 o’c and arranged early mess. Rode out with Col. Duggan to reconnoitre tomorrow’s work and got caught and drenched in a fierce rain storm of hurricane intensity. Rode home via Brigade H.Q. seeing the General for further instructions. Their camp much upset and ours also. Tomorrow’s work cut out to straighten up. Spent evening doing Operation Orders and memos – a good deal of correspondence in today. Sparrow back from Paris and left for England & the 6th Training Battalion. A cold and windy night.\n","49":"\n\/6\/17 (?)\n\nAppear to have gone wrong a day somehow as several have remarked tomorrow is 1st. July & being the anniversary of offensive some bombardment is looked for. Morning devoted to cleaning and draining camp medical inspection, rifle, clothes & boot overhauling covering helmets with sacking All the morning the Band played selections. Afternoon drill and specialist training. Summoned to BdeHQ at 3p.m. to a conference the General doing a severe strafe over some quashed Court Martials. Returned to camp had a rest and then walked via Riencourt to Bancourt to see a platoon of the 48th. Divn carry out an attack. About 200-300 officers there mostly English & two Major Generals both in their dotage – old, old men who should be at home. Our G. (Smyth, with his V.C. and 3 rows looked a live wire. The practice was well done by the Tommies. Returned to Camp and, after mess, Penna gave an excellent lecture on Consolidation. During the evening Leon Barbier of the Mission Francaise came in and we discoursed at length and read the \"Petit Parisien\".\n","50":" Beaulencourt\n\nReveille 6. A threatening morning. Arranged to move off for attack practice at 8 a.m. and 23rd had already moved ahead when cancelling orders arrived. Visited Crowther & Duggan at","51":" lines. Returned to camp and the whole battalion paraded and drilled on grassy slope behind camp doing section drill bombing Lewis gunnery and signalling. At 11.30 with Stewart turned out & inspected the Transport Section where, of late, there has been a great improvement. Found them all smart and like new pins but got text for a lecture in a shortage in iron rations and some field dressings & a disc or two. Ordered the fixing & unfixing of bayonets – rather awkward for mounted men to do without practice. Heavy rain came on after lunch and parade was held indors as a consequence. Officers lectured and specialists did their own particular work. Jack returned today and came over for a talk looking very fit and well. Very cold tonight in this airy place.\n","52":" Beaulencourt\n\nLowering skies. Church parade at 10 am with the","53":" & 23rd. Battns. General Smythe was there. Lamble preached a good sermon. Men wore drill order and greatcoats and looked well. Pay day today much gambling and two up about the camp – nothing else fro the chaps to do. Stayed in all the afternoon and did some French exercises. In the evening orders arrived for tomorrow’s stunt and took the OCCorps out with me to reconnoitre the ground for our attack. Old German battery positions hereabouts and some of their graves. One grave bordered with aeroplane slats is of a British airman shot down by them. Till 11 p.m. issuing operation order for stunt tomorrow – a complicated affair of map references, barrage times and other complexities enough to drive one mad – one of the reasons why the Government pays me 30\/- a day! On the front much flash and roar of guns and all of it is not ours by any means. Tiny Heath was in to afternoon tea having been right forward\n","54":" Beaulencourt\n\nMoved out at 7.30 for an attack on Le Transloy which was defended by the 24th. Worked right round to our jumping off trench under cover of sunken roads and hopped off at 9 am. The attack did not go too well as there was a gap between coys on J.O.F. and in the final phase too much crowding on the right flank calling for some adverse criticism from the General. After watching the 21st do theirs we marched home. Laid down after lunch until 2.15 and then set off on horseback for Thilloy to witness an attack demonstration by a trained platoon. General Birdwood was there with others. The display was a good one and there were a good many there. After mess Dooley lectured on Night Operations and McKinnon followed. Jack came in for a talk. A mild and pleasant evening with much rumbling on the front. Had the company commanders up at 10 o’c and gave them orders for their inspection by the General tomorrow morning. Gas alarm 10.45 p.m. Scurry for helmets.\n\n3\/7\/17 Beaulencourt\n\nFirst parade 9 am. Strict inspection by OC Coys in preparation for that of the General which was timed to take place between 11 & 12. Open attack and company drill were practised and we found ourselves very rusty on these points. A very fine sunny day and one could not help marvelling at the great observation Fritz had from here over all our trenches and the land behind them. The air was fresh and it was good to draw it well down into the lungs. Struck all the tents in camp. At 2 p.m. put in some more similar practice out at the ground near camp. The \"regimental sore\" is giving some trouble again and causes me perhaps more worry than it would to one older and less sensitive. Jack came in after mess. Sent all the officers out to reconnoitre the line of advance for the battalion in case of attack and went out with Bunning to choose a place for the night operation tomorrow. Found a good German trench well wired.\n","55":" Beaulencourt\n\nHeavy rain fell during the night & made the place very mucky. The Companies moved out to their work – \"A\" to the musketry range and the balance to the adjoining grassy slopes for section and company drill. General Smythe rode up with a lancer to inspect our horses and had nothing fresh to say. Furphey of a great many troops going up forward through the villages adjoining. During the afternoon visited the General & found the man of blood immersed in a study of a swallow with a nest full of young ones. Saw Duggan and arranged the attaching of Gawler to the 21st Battalion, first telling that young person exactly my opinion of him. Also today had the pleasure of doing the same with Miles. At 8.30 p.m. we moved out to a night stunt and it worked well. General Gellibrand was out and told me of my promotion to Lieut Colonel. The men very keen on their work. One had charge of a \"prisoner\" who attempted to escape. He put a bullet after him. Sent the firer in to one guard under arrest.\n","56":" Beaulencourt\n\nAt 8.30 moved out in artillery formation to a large open attack practice carried out against the 23rd. Batt, the 21st. cooperating with us in the attack. It went fairly well. Afterwards the General criticised the operation in his usual style. Had a good gallop back to camp. Afternoon spent on odds and ends and it went very rapidly. At dinner in the evening they very kindly drank my health with musical honours and said some nice things. Jack was in afterwards for a while. All the evening drafting up a scheme for an outpost scheme tomorrow night. Being rather weak moonlight the operation will lose some of its value. Never in bed before midnight these times it is busy without a second in Command to take some of the work off one. Aeroplanes tonight doing night flying. Some rumble of guns on the front. Colonel Craig came in for a yarn and some supper.\n\n6\/7\/17 Beaulencourt\n\nA busy day. First parade 9.30-12 devoted to specialist training, the riflemen doing shooting on the range and the hand & rifle greneadiers used live stuff. Fulton had his gunners all out. Reconnoitred and allotted the ground for a stunt tonight and left the company commanders to make the necessary dispositions. After lunch rode off to Bancourt where all C.O.s were assembled. Generals Smythe, Gellibrand and Smith were there. The two former with pennons & lancer. Smythe spoke of our going into the GHQ Reserve and gave the details of a Divisional attack on Monday next. We then set off and made a reconnaisance of our line of advance – a very pleasant and delightful afternoon. Rode home and then got ready for a night stunt. The battalion marched out at 8.30 p.m. into night outposts and then withdrew to a flank and formed up on a J.O.T. on a front of 450 yards. It worked rather well. Bed 12.45 am.\n","57":" Beaulencourt\n\nAgain it is midnight before I get a chance to chronicle the doings of another busy day. Left on horseback at 10a.m. with the company commanders and rode over to Bancourt where we put in 3 hours making the most careful of reconnaisances. A pleasant morning and the smell of grass was in the air. After lunch wrote orders did odd jobs until leaving with Col Craig & the Dr. for Bapaume where we walked over for afternoon tea at the E.F.C. Canteen. Jack there. We discussed many topics and there was much Scotch wit between the two Craigs. After dinner Bde O.O. for Divisional battle came through and it was like a problem in Euclid working out the details. Got them into the type very late and felt very tired indeed. Every day now there are not wanting signs that the standard of breeding in officers is lowered. Coarseness in speech, carelessness in drinking and other habits are only too apparent in public places and are due to so many promotions from the ranks. The C.M.F. made some fine officers.\n\n8\/7\/17 Beaulencourt\n\nSunday. Much tempest during the night and continuance led to cancellation of church parades. Had a conference with the company commanders and after lunch all set off to make reconnaisance of the ground again. Rode out. The high ridge over the far side of the Bapaume – Peronne road is a wonderfully commanding one and looks down on all the surrounding country. All the N.C.O.s and officers were out. Went to conference at BdeH.Q. presided over by Colonel Watson and then returned to camp and wrote some letters. Rumours that the 5th Divn. have come back to Doullens for entrainment. A very fine and lovely evening after the rain. More conferring & preparation for the stunt of tomorrow. \"House\" is a game that is outrivalling two up as a pastime of the troops. Cox our runner is a funny little chap with tiny short legs & a smile. General Gellibrand is the Chief Umpire in the Divisional stunt tomorrow LtCol W.W.R.Watson C.B.V.D. reigning over the 6th. Bde in his stead.\n","58":" Beaulencourt\n\nUp betimes and the whole Battalion marched to the rear of Bancourt and there fed into the jumping off positions. This was rottenly done men strolling over the skyline and general mix up which could have been avoided by a little intelligent feeding forward gradually through saps. The 24th Battn were attacking on our left and the 5th Bde on the left of them. We started on a flare signal and worked well on. Umpires regulated the advance according to the situation. After capturing our trenches the 21st. passed on right through and were organized and then re-advanced in artillery formations right through them. After a fierce battle they put the","59":" Bde through us and then called a halt. Reached Camp again at about 4 pm very tired. Hear that Genl Gellibrand has got the 6th. Division and that Paton is coming here in his place. After a fine day it blows up stormy towards evening. Much dispirited to think of Gellibrand going away at this stage.\n","60":" Beaulencourt\n\nA relatively quiet and easy day. Fell in at 9.30 and worked until midday on specialist work among which was a good deal of bombing. The squads working along trenches. With Rodd there was a remarkably narrow escape by reason of a rifle grenade bursting in the cup but nobody was hurt. The Lewis gunners and other specialists were also hard at work in their own departments. In the afternoon everyone went bathing into Bapaume. At 3.30 sat as president of a Courtmartial with Elwood and Sale as members and tried a case of A.W.L. awarding a sentence of 2 years imprisonment – hard labour. A fine day with a slightly cold wind. Inspected Kohn’s platoon this morning & found it rotten. Did the remainder of it this evening and nothing smarter could have been desired. Owing to its absence from the ration our men are feeling the need of green stuff & don’t like the limejuice for many reasons especially while leave to Amiens now & then seems to give an outlet to their amourousness.\n","61":" Beaulencourt\n\nMorning was devoted to attending a lecture on Venereal Disease by Major Conrick & Archdeacon Ward. It was very good and informative but will not I think deter the conduct of many. A very pleasant day – long grass, sun, and a balmy breeze. In the afternoon the whole paraded from 2-5 on drill of various kinds (including saluting) and did good work. After parade went down to BdeH.Q. and saw the B.M. We are going up to Renescure. The King comes to Albert tomorrow. This about the chief news. Had a yarn with Colonel Watson about things in general and then a motor came and they all went down to Division. Early mess tonight on account of D Co concert which proved to be a great unqualified success. One chap was an actor with Bland Holt and gave some good sketches with others. An audience round the open platform was of several hundred men. Afterwards with Davis rode over the scene of work tomorrow.\n","62":" Beaulencourt\n\nAnother field day. Went to BdeHQ. At 9 am. Decked in a cap and white arm bands and met Colonel Watson and others and acted as an umpire at the tactical exercise which was fairly well done. The men are getting a bit stale on this field work unfortunately and could do with a change of syllabus. An exquisite sunny day with a cool wind. Dooley took charge of the Battalion for the purpose of the stunt. After the operation the inevitable powwow was held. Being a war in afternoon everyone had a sleep after lunch. Rohn’s lecture at Mess on sniping was quite good and started a series of questions & a discussion on different points. Put in the evening doing a little French and writing letters including one to marraine who is proving false. The snows of the Swiss Alps cool the Parisienne heart.\n","63":" Beaulencourt\n\nAnother perfect sunny day with cooling breezes. Day devoted to drill in the morning and the necessary culling out of the contents of the packs preliminary to our move which takes place on the 24th. Paton comes here & Watson goes to his Brigade almost tout de suite. Mixed programme in the morning including bayonet exercise to keep the blood lust going. After lunch a route march Villers au Flos – Reinecourt – about 4 miles and they were all out to it by the time we finished up. The day was warm and the men soft showing that we want much more of this before we can get up to the old standard. Indeed the standard will have to come down owing to the number of crocks we now have in the ranks. Old deformed chaps many of them – the flower has been weeded out of them. Conversed with Col. Craig and Leon Barbier during the evening. The old doc. looking very old and worn.\n","64":" Beaulencourt\n\nHad arranged to go to Amiens with the Craig brothers but transport failed us. The morning was devoted to specialist training. I went round with the doctor and did the rounds of the camp finding it good on the whole. Between Villers au Flos and the camp our bombers were operating. No one was in sight but the resounding bangs of the explosions were like the real thing. Some of the men were on rapid wiring. After lunch had a sleep and before tea went down and had a long talk with the General about matters of interior economy. Bridges (the new B.M.) has already arrived and is getting into the running. In the evening went over and saw Colonel Brazenor. The troops very cheerful tonight much singing & joy down the lines. Had a good evening with French text books. Our buglers (Muldoon Cummings & Dalton) played an exquisite \"last post\". The regiment is going well at present.\n\n\t\n","65":" Beaulencourt\n\nChurch parade 10 a.m. went off well. At 11.30 went to a conference at Bde.H.Q. and it was rather mournful as the dear old G. told us officially of his departure, Watson received his orders and Plant expects his Dies irae! There will be a great change of system ahead I am sure. Spent the afternoon quietly in camp reading and writing. After dinner Major James came up for a talk about some people he wishes to transfer to us. Put in a word for Spencer Carne. Jack came in for a while and Leon Barbier was also in. this evening was exquisitely mild. The sun went down and made Haplencourt Wood and the little village of Villers au Flos look very beautiful indeed. To think of the happy folk turned out by this cursed war!. Leon told me of the Garden of France round Orleans and near the Loire where the chateaux line the banks and nestle in green woods. Enticing.\n","66":" Beaulencourt\n\nMorning. General company training with some bayonet fighting to create lust for blood.\n\nAfternoon route march round the square Reinecourt – Villers au Flos. It proved rather a failure as rain commenced and everyone got properly wet before reaching camp again which we did at about 3.15 pm. In the evening orders arrived for attack practice. Walked up to Villers au Flos and did a reconnaissance of the village. Our horses met us at the church and we rode out along the road and almost over to Fremicourt. Very pretty open country not unlike a lot round the Heart at Sale. The wet grass smelt very pleasing and nice. Darkness came on about 9.45 and flashes of shrapnel showed up very clearly from the direction of the firing line. Worrying out at orders until very late and received request from Bde.to drum up a scheme for a bombing stunt for Div. a most worrying day – anyone can have this job. Now 20 to 12 m.n. Reveille 5 am!!\n","67":" Beaulencourt\n\nWhat a man of moods. Contrast conclusion of entry 14\/7\/17 with that of 16\/7\/17. Reveille 5.30am. feeling livery & nervy all strung up over nothing. Left camp at 7.30 and marched to Fremicourt where the whole Brigade rendezvoused well under cover of the contour of the ground. Jumped off at 10 in an attack against Villers au Flos in conjunction with the","68":" The first phases went well and our casualties would have been light indeed. Once in the village the attack naturally becomes broken up & it is extremely hard to keep control. Any alteration in plan or any trouble in the fighting is extremely hard to estimate at its true value for some time. During the afternoon went into details of the projected bombing attack which is going to necessitate great preparations & organization. Stewart goes to Paris tomorrow and Harricks will carry on in his place. Went to an excellent lecture by Wertheim on the German Army and its morale down at the Sugar Factory & returned to camp feeling very tired. \n\nAn extremely busy day. Stewart left early for Paris. The Battalion marched out in full marching order on a timed march to near Fremicourt and past Crossmills. Went into artillery formation getting well out into position. The General came along then, returned and did a complete change of direction forming a defensive flank to another position and then marched home via Villers au Flos. Very pretty country but doubt if the boys admired it as they were so heavily loaded up with gear. Returned to camp and found no less than 10 officers marched in – including 2 from the 24th. Battalion who returned later in the evening to their parent unit. In the afternoon busied myself with a bombing scheme and other training matters. After mess and a very good lecture by Rodda went down to Bde. H.Q. to fix up a few things and returned to bid Plant bon voyage. A great break up to our little family group here. Rumoured George is going too.\n","69":" Beaulencourt\n\nWorking like the devil all day long. At 9.30 commenced a big bombing stunt which did not go too well as we are rusty on the work and need much practice. Made Fulton cart 2000 pieces of brick to represent bombs from the village. Most elaborate organization in this operation. In the afternoon busy writing orders preparatory to another stunt tomorrow and a night operation tonight. At 5 o’c attended a lecture by Capt Johnson on Court Martials & Military Law – rather good. After mess walked out with all the officers and NCOs & went over the ground for tonights operation. Then returned and did other work until 9.40 pm when all moved off and silently defiled to our positions getting on to the J.O.T. to the nick of time and in silence that was contrasted markedly to the noise of the units in rear of us. The attack went fairly well on the whole and would have been a success in the actual thing. After supper to bed 12.30 am.\n","70":" Beaulencourt\n\nBreakfast in bed. Prepared to do some bomb practice during morning preparatory to an exhibition stunt at 2.15 pm when BM rang up and told me that Major General Smythe and his staff were coming down to see it at 11.15 am. Great preparations and over 2500 bombs to detonate and shift by limbers. Organized effort accomplished this and the stunt started. To time and worked fairly well but for details. The bomb supply was excellent and quite ample for our needs. Orders for another stunt arrived during the \nevening\n morning but I turned it over to Rodda to lick into shape and turned in for a rest. In the evening after mess rode out and reconnoitred the scene of tomorrows work and walked back to camp with two of my new subalterns Sutherland and Speck who are decent little chaps and full of quiet enthusiasm. Jack came in for a talk during the evening and stayed for a while. A quiet evening on the front. A balloon broke away today & the crew parachuted.\n\n"}}