{"Document Name":{"0":"Diary_0464","1":"Diary_0464","2":"Diary_0464","3":"Diary_0464","4":"Diary_0464","5":"Diary_0464","6":"Diary_0464","7":"Diary_0464","8":"Diary_0464","9":"Diary_0464","10":"Diary_0464","11":"Diary_0464","12":"Diary_0464","13":"Diary_0464","14":"Diary_0464","15":"Diary_0464","16":"Diary_0464","17":"Diary_0464","18":"Diary_0464","19":"Diary_0464","20":"Diary_0464","21":"Diary_0464","22":"Diary_0464","23":"Diary_0464","24":"Diary_0464","25":"Diary_0464","26":"Diary_0464","27":"Diary_0464","28":"Diary_0464","29":"Diary_0464"},"Date":{"0":"unknown","1":957.0,"2":958.0,"3":959.0,"4":960.0,"5":961.0,"6":962.0,"7":963.0,"8":966.0,"9":967.0,"10":968.0,"11":969.0,"12":970.0,"13":971.0,"14":972.0,"15":973.0,"16":974.0,"17":975.0,"18":976.0,"19":977.0,"20":978.0,"21":979.0,"22":980.0,"23":981.0,"24":982.0,"25":983.0,"26":984.0,"27":985.0,"28":986.0,"29":987.0},"Entry":{"0":"\n\n","1":"\n\nToday is hot but dry. There was no dew on the grass this morning, and our job was to clean out the canteen. After dinner I was put on stoking the hot water boiler for the Company’s baths, and will remain on until 10’ O’Clock tonight.\n\nWe were paid tonight. £ 2-13-0 being 1\/- per day since June 3.\n\nTonight we gave in our names and places we wished to go to for a 4 days holiday. As no more than 4 days were allowed I could not go to Ireland so decided to go to London (Waterloo Station)\n\n with some other pioneers.\n\nAeroplanes can be seen every day here, especially in the evenings. They are a common as birds, and their engines make a noise like a reaping machine.\n","2":"\n\nA nice day .It is rather cool in the evening. Stoking again from 11.30 am. to 10 p.m. Open camp this evening.\n","3":"\n\nChurch parade this morning. The Battalion was separated into R.C. C. G. and Presbyterian Methodists. C. of E. is the state Church here and that was the service used on the parade ground where all the Australian Battalions were assembled around an artificial hill, on the top of which stood the clergy. there were 4 ministers, and the Bishop of the Diocese, in their robes. One of the ministers held the Bishops Staff.\n\nThe sermon which was a very eloquent one, welcoming the Australian was preached by the Bishop. At the conclusion of the services the bishop gave his blessing holding the staff in his hand. After singing the National Anthem there was a march past the Bishop & Clergy.\n\nI am again stoking this evening from 12 . until 10. p.m. From the church parade grounds the furrows stone hinge of the early Britons can be plainly seen. \n\n I read a book on Stonehenge today.\n","4":"\n\nA nice morning. We had breakfast early and left Lark Hill camp \nat 10\n early marched into Amesbury Station which we left at 10.25. reaching Clapham Junction at 12.26 arriving at Waterloo Station about 1. O’Clock, we marched to the Australian Artiliary depot and were dismissed. We are to reassemble at Waterloo Station on Thursday August 3. at a quarter to 9.p.m.\n\nWe had dinner at the J.U.C.A. near the Military Depot but had to go to the Waterloo Branch for beds which are 6 d each.\n\nWe passed the world renowned House of Commons and West Minister Abbey. I also saw from Waterloo bridge the Captured german submarine in the Thames. It is not far from Waterloo bridge. This afternoon I\n\nsaw the Tower of London and Old St. Paul’s and Somerset House.\n\nI am staying at the J.U.C.A. near Waterloo Bridge. and Waterloo railway station. We came by the London & South western railway \nfrom\n to London \nto\n from Salisbury.\n","5":"\n\nA cloudy morning, but fine \n\nI have been sight seeing all day. First I went to St. Paul’s Cathedral. The great dome can be seen from miles around. The outside of the cathedral \ncan\n is black with age. I had a walk around the outside & then went in. A service was being held, when that was over the cript was free to visitors. In the cript which is under the church lies buried some of Englands finest men. There are guides to show visitors around and explain and give interesting facts concerning the different graves. All the graves lie beneath the floor with the exception of Wellington and Nelson. Their tombs are above the floor, the bodies being surrounded by stone surmounted by a monument. Wellingtons\n\nfuneral carriage is there. it was made out of captured guns and is a splendid specimen of cast bronze. it was made in 16, days, weight 18 tons and had 6 massive wheels. There is also a memorial of Florence nightingale and was unvealed by the Queen a few months ago. John Opie, Joseph Reynolds and many others lie buried there, and hugh tablets set in the floor mark the spot. A feature of these old buildings are the large numbers of pigeons that live in the roofs and caves and live on what they can pick up. They are very tame.\n\nIn the Strand I saw the Law courts, which are a hugh pile of buildings, and from there a friendly naval officer showed me over the Inns of Courts further up the Strand. Grays Inn, the middle Temple and these are parts of colleges. I was shown over the dining rooms of two. One of them is very ancient. Queen Elizabeth attended a dance here & probably took part. The windows are covered with paper since the war. Shakespeare conducted one of his plays here. \n\nNear here is the fountain that one of the characters in \n\nCharles Dickens works courted at. It is the same today as it was then. The other dining room is only about 50 years old. They are many ancient buildings about here, particularly the barristers & solicitors chambers. Today the names are inscribed on the doors in the same way as in ancient days. I saw here the House that Oliver Goldsmith lived in. his room was on the third floor.\n\nFrom here I went to Westminster Abbey, and on the way passed Charing Cross Hospital, Charing Cross Hotel, and Nelsons monument in Trafalgar Square.\n\nThe outside of Westminster Abbey is black with age and inside it is considerably knocked about in places. There are innumerable graves here. Many fine statues and Memorial slabs. One of the ancient graves is Thos Parr born 1483, died 1635 aged 152 years. He married at 80 had two children, when his wife died, He did not marry again until he was 120. The Dean his documents to prove that his age is authentic.\n\nThere are statues of William Pitt, Mirraelli, Gladstone, Peel and many others. In the chapel of Edward VII. there are some fine\n\nstatues, but several are covered up with sand bags for fear of an Zephlin raid. I saw the spot where Cromwell was buried, but his remains were removed in 1666 and placed outside the Abbey. The Church of St Margaret’s is in the Abbey grounds. One of the thombs covered up is that of Edward the Confessor.\n\nFrom here I went to St James Park, and saw Buckingham Palace in the near distance. They are also an ancient looking pile of buildings.\n","6":"\n\nA nice cool morning. I had a very late breakfast. I took the bus to the Tower of London and crossed over the Tower Bridge which is a wonderful structure lifting up in the middle to let ships pass under.\n\nTower of London is a very ancient structure & is a very wonderful place bring used at different times as a palace a prison and a fortress. It was commissioned by William the Conqueror, and now covers 18 acres. there are many Towers. After passing under the bloody Tower one passes into the armoury. The Jewel\n\nhouse contains the Crown jewels. There is the mase spurs, salt cellars, Tunkards and the Imperial State Crown with 4 arches, the Delhi Crown with eight arches. the Prince of Wales gold coronet, a gold sceptre. The Royal Sceptre which contains the largest cut diamonds in the World - the Stars of Africa, weighing 516 1.2 carats.\n\nIn the armoury there are guns, cannons, and armour of the XVI and XVII centuary also various swords and guns.\n\nI saw the block used at the execution of Simon Lord Lovat on 9th April 1746. Also a heading arc 1679.\n\nI saw Sir Walter Raleigh’s cell and various instruments of Punishment. I saw the cloak on which General Wolf was laid when wounded and upon which he died and the uniform of the Duke of Wellington.\n\nSt John’s chapel and the Traitor Gate also worth seeing.\n\nIn the grounds a plate marks the Site of the Scaffold on which was executed Queen Anne Boleyn, Queen Catherine Howard, Lady Jane Grey and others. In the Beauchamp Tower there are carvings on the walks, done by distinguished state prisoners. There is a moat around the Tower which is now used at a Parade ground.\n","7":"\n\nAnother nice day in London. Sir Roger Casement is to be executed this morning, unless he gets a reprieve which is unlikely. He is in Pentonville Prison. Later. He was executed this morning at 9. O’Clock and the crowd outside cheered.\n\nI was at Trafalgar Square this morning and from these to Hyde Park and the Marble Arch. They are very interesting place. Rotten Row is where the aristocracy go for their morning ride. It borders the Park. I was at he British Museum but was not inside as it is closed in war time. We are to go back to Lark Hill Salisbury Plains tonight by the 9 train. I am waiting for it now. We left Waterloo Station about 10 and reached Amesbury about 12.30. Marched out to the Lark Hill Camp and got into bed at 2 O’Clock.\n\nFriday Aug 4.1916.\n\nA dull cloudy day, warm at noon. I am back at the old job of stoking the hot water boiler. It is nice cosy job. I \n\nSaturday Aug 5, 1916\n\nAnother nice day. It was very cold last night. I did my washing today \n\nI was at Stonehenge this evening. It is about a mile from the camp. It is of great historical interest being the oldest place in England, coming next to the Pyramids in point of antiquity. Scientists put down its age as dating back to 1700 B.C. For years it origins has been a mystery but little by little its history has been unscrambled. Archaeologists, geologists and astronomers have excavations, observations & explanations to determine its probable age, history & use. Stonehenge is one of may crude stone circles in England. But it is unique in having its sarsen stones carefully though roughly worked, and containing a horseshoe within the circles. It was built by a race of men who had only slight knowledge of the use of bronze, and no knowledge of the use of iron. It consists of a circular earthwork, 300 ft in diameter. This is an avenue leading from the N. East to the “Hele Stone\" and enters the circular earth work enclosure. One large unworked “Hele Stone\" or “Friar’s Heel\" 6 feet high. A recumbent slab within the earthwork called the\n\n\"Slanghtering stone\" it is a Sarsen Stone found in the county of Wiltshire. Two small unhewen Sarsen stones lying N.W. and S.E of the circle of stones. there was probably another one in the West. There are all the stone outside the circle. the outer circle consists of a ring of lesser Sarsen stones with “imprints\" lintels morbised to them. the lintels are fitted together with toggle joints out of the original thirty imprints these “Trilithons\" are now standing. the diameter of this circle is about 108 feet, to that the Dome of St Pauls. Within this again is what once was a circle of smaller stones. They are less perfectly hewn and are known as “Foreign\" stones because they are not to be found in Wiltshire at the present day. These numbered between 30 and 40. Only seven are standing today nine are overthrown. The like cannot be found within 100 miles of Salisbury Plain while some can only be found upon the continent of Europe. Mineralbiologists have carefully examined fragments of these foreign\n\nstones and arrived at the conclusion that Stonehenge is certainly not a Wiltshire monument and probably not even British at all. Inside these are two circular forms shaped like a horse shoe. the first consists of five large Tritithons, hugh pylons of stone comprising two uprights and an import with the opening to the N. East. These Trilithlons rise gradually in height towards the South West. the largest group of stones fell a.d. 1620. Those next to the great Trilithon on the N.W. fell on Jan 3. 1797. Today only two of the \ngreat\n Inner Trilithons are standing. One upright of the great Trilithon (round made secure in 1901) is erect. Inside again is a horse shoe of less perfectly hewn foreign stones. Originally there were 15 or more averaging 8 ft high. Lying flat within these concentric circles and horseshoes is a single great tabular slab of micaceous sandstone called “Alta Stone\" From this slab, now almost buried beneath a fallen Trilithon, the\n\nvisitor may look in a North easterly direction and through the arches of the outer circle observe the “Hele Stone\" or “Friar’s Heel\", which stands at some considerable distance from the main structure. On the Summer Solstice (or longest day June 21) the Sun rises immediately over the top of this monolith, when viewed from the centre of the Altar Stone.\n\nThe surrounding plain which is of chalk formation is dotted in almost every direction with by Sepulchral mounds, or Barrows, which cluster to the number of 200 or more about the venerable stone circle.\n\nThere seems to be an irresistible connection between Stonehenge and the Burrows, and it is highly probably that the hands that raised Stonehenge have been laid to rest in the Barrows almost within the touch of the shadow of this medeival temple. Stonehenge and the Barrows are of contemporary origin and one series 15 explain the other Execavations that have been made into the Barrows show with one exception that they contain only one body, the ashes of which is contained in an earthen urne of very primitive make and almost devoid of any\n\nornaments. the earliest record of any of the great Sarsen stones fulling was in 1645 and the last fall was in 1900. The remainder have been made secure. The uprights of “Trilithons\" have been measured and their estimated weight vary from 65 to 70 tons. The Lintels or cross pieces weight from 20 to 25 tons. These huge stones can be found all over the plain and they have been picturesquchy called “Grey Wethers\" and it is not hard to picture them as a flock of titanic sheep, reclining at ease upon the pasturage of the Downs. The alternative name Sarsen is a corruption of the word “Saracen\" which means antagonistic to Christianity. the people of the middle ages attributed all stone circles and megalithic monuments to the work of heathens if not the devil, and was roundly condemned. Consequently the stones of Stonehenge were Saracen or heathen stones which has been shortened in time to Sarsen. There is slated grey Wethers appear on the Downs or a county that is devoid of any rock save chalk. They are the core or kernel of a much larger block of friable sandstone worn away on all sides by wind & weather. They existed\n\non the surface of the chalk from the time it rose from the \n surface\n bottom of the sea to its present position. they are therefore merely a small residue of a wide spread sandy deposit which once covered the whole of the South of England.\n\nIt has been suggested that the foreign stones from Kildare in Ireland, others Wales, Cornwall, Dartmoor, Shropshire or Cumberland where similar rocks abound. Another theory advanced is that he foreign stones were transported to the plain as boulders of the “glacial drift\" but geologists have produced no pebbles similar to the foreign stones. In all probability these foreign stones numbered 75.T there are but thirty. Similar stones are found in Brittany in France & the theory is advanced that they were used as ballast for ships that come over to Cornwell for tin.\n\nThe Sarsen stones to Trilithons were probably roughly hewn and transported to the plain on barges down the Avon river and then on rollers to Stonehenge. One of these stones is in the river near Stonehenge & the theory is that the barge got sunk and the builders could not remove the stone. Holes were sunk in the chalk of varying depths some 7 feet to suit the stones. The outside perpendicular\n\nfor the excavations show that it is all virgin chalk on the outside the inside was sloped and raised up. The stone was raised up the bank and slid down into the hole, where with ropes and levers it was pulled & pushed into an upright-position. the earth & chalk was then rammed in, the workmen thrown in some of their stone tools, hammers & chisels to push the mass. time was no object with the builder & the work was probably undertaken under the stimulus of religion. The final dressing was completed at Stonehenge, for the chippings were found embedded around the stones. The building of the group was continuous & no gap separates the Trilithons from the foreign uprights. In 1901 when the great Tritithon foundations were laid bare, the leaning upright restored to its original perpendicular position it was found to be 29 ft 8 in long while the other was only 25. They stand 21 feet high, as it was necessary to bed one stone deeper than the other in order that their twp summits should be level to receive the lintel or impost. One stone was sunk to a depth of 8 ft 3 in inches while the other was only 7 feet. The base of the shorter stone has a greater bearing area to compensate for the lack\n\nof depth. The imposts were raised one end at a time by placing blocks under them until the required height was obtained when it was levered over on to the lemons of the uprights.\n\nStonehenge marks the rising and setting of the Sun on the longest and shortest day of the year. It is a calender and is most probably connected with sun worship; In the Summer the sun rose roughly in the N. East and set in the N. West. In winter, on the other hand, it rose in the South East and set in the South West. It was in the interest of all that such observation should be definitely marked and kept in order to keep count of and determine the approaching seasons, The farmer depended upon the Sun for his crops, and it was essential that he should know the correct time to plough, sow & to reap. Stonehenge is so arranged as to mark the Sun at its Summer Solstice and there is little doubt that its was religious; probably a temple, in which the Sun may have been adored in some way.\n\nMost of the Burrows or groves are placed on the elevated parts of the Plain, and generally in site of the Great Temple. They may be roughly divided into the classes: - \n","8":" The long barrow and 2. the Round barrow, with its three variants, the Bowl, the Bell, and Disc Barrow. The long Barrow is the older form & may be referred to the Neolithic Age. There are 72 within the limits of Wiltshire, and 14 others have been destroyed within the past century. They stand alone, upon rising ground & vary from 200 to 700 feet in length. 3.0 to 50 ft in breadth and from 3 to 12 ft in height, The earth of which they are composed was dug out from a trench on each side of the mound. They be usually east & West & the eastern end is higher than the West. Within the higher end is the sepulchral deposit. There are two long barrows within a short distance of Stonehenge.\n\nFrom the Altar Stone with his back to the “Friars Hill\" the visitor can see a typical group of round barrows 7 in number. Wiltshire contains 2000 similar sepulchral mounds and within easy distance of Stonehenge there are 300 of them. The Bowl shaped round barrow has a diameter of from 20 to 60 feet and a height of from 3 to 5 feet. The round Bell barrows are entirely surrounded by\n\na circular ditch. The mound rises from 5 to 15 feet on a graceful conical form and the diameter is upwards of a hundred feet. The entire structure is larger & more impressive than the Bowl barrow.\n\nThe disc barrow resembles a flat disc surrounded by a deep rim. It consists of a circular area, level with the surrounding turf with a diameter of about 100 feet. The area is enclosed by a ditch with a bank on the outside. Within the centre is a mound of not more that a foot high containing the sepulchral deposit.\n\nSome fine cinerary urns spotting and stone weapons can be found in the Museum at Salisbury. There is a policeman at Stonehenge who kindly points out all objects of interest to the visitor, and at the office at the gates 4 postcards showing different views of Stonehenge can be obtained at 1d each and a book “Stonehenge\" by Frank Stevens price 1\/- gives and interesting and historical description of Stonehenge & the Barrowes\n\nSunday Aug 6, 1916\n\nA nice day. there was a general inspection this morning. “A\" \n\nI have a long walk this evening along with Handcock to Ralestin camp where some Australians from Egypt is camped. It is about 2 miles from Lark Hill Camp. In the distance about 4 miles away was pointed out to me Longfellows “Village blacksmith under the spreading chestnut tree\" \n","9":"\n\nA nice day but very cool in the morning. Again staffing today. I finished reading “On and Off the Turf in Australia\" by Nat Gould. I also finished reading yesterday “Stonehenge\" yesterday and today\" by Frank Stevens.\n","10":"\n\nVery cloudy this morning but bright & sunny this afternoon. I was up at the cook house today. It is much shorter hours than stoking the hot water boiler. “A\" \n","11":"\n\nVery cloudy & misty this morning but hot in the afternoon. I am again cleaning up the cook house & washing tins. I posted \n","12":"\n\nYesterday evening after tea I went to see the “Spreading Chestnut Tree & made famous by Longfellow in the Village Blacksmiths. The name of the village is Figheldean and I was accompanied by C. Handcock. The tree is said to be a thousand years old. The old shop is still there in full working order. It does a small country trade shoeing & general. The name of the blacksmith is Sheppard and the shop has been in the family for generations, the old village Church and, the old village church and churchyard is not far away. and I saw graves of many of the present blacksmiths ancestors. Some of the tomb stones were so old that the names were barely describable. The old shop is very old and dilipated with a tile roof, There was a wagon and 3 or 4 days outside to be repaired. The shop is small also the . Being after 6 when we approved the shop was closed. There was an M.P. from the Zealand forces on guard to protect the tree. Previous visitors having robbed it of a large amount of leaves. \n\nToday I was cleaning out the bathrooms and in the evening filled in time by washing a few tins. \n","13":"\n\nCool and cloudy all day. I was washing and cleaning all the baths this morning and in the evening a few odd jobs. We are to be paid at 7.’clock amount 10\/-\n\nAfter being paid I went into Amesbury with C. Handcock and saw the old church which has a nave 1000 years old and a massive door 700 years old. The church is named St Mary & St Melor and has a curious carved chestnut roof built in 1420. The huge door swings easily on its great hinges and has a massive lock and key. There is in the church in a glass case an old saxon cross 11,000 years old. There is also an old Norman font 1000 years old which was buried and restored to its place in the church. The church screen dates back to 1420. The Guinevere window contains fragments of glass dated back to 1216. There is on the wall a painting of an abcas of Queen Alfiedus convent founded in 980 in atonement for the murder of the son of Edward of Carfe Castle, Isle of Wight. This painting was covered with plaster and its existence \n\nunknown until a few years ago when a heating apparatus was misplaced in the church & the painting came through the plaster. The South window dates back to 1315. There is a loft above the Jesus Chapel. & it is a puzzle what it was built for. 1280 There is no trace of a floor.\n\nA hole made in the wall of the Church revealed a pillar that is thought to belong to a saxon church before the present church was built. There was dug up under the floor the find of a stone pillar \ndug up under\n & there are a number of consecration crosses cut in the walls. Where the roof joins the tops of the walls there are grinning heads, corbels, Judas in the Janus of Satan & the crown of thorns.\n\nThe boy Saint St. Melor this has his right hand and his left foot cut off because he should not reign. He was murdered & brought to Amesbury Chapel in 544 and there were pilgrimages to the boys Shrine.\n\nIn connection with this church there is on record. Jan 13. 1742 Mr Richard Andrews resigned his place to William Hiscor being a sitting on the fore seat.\n\nGave up our right in the singing gallery to W. Hiscor being a sitting in the first seat as witness my hand. \n\nElizabeth Andrews.\n\nI do authorise my son Francis and my son William to sit in my two places belonging to me in ye new gallery as witness my hand. William Andrews.\n\n Thomas Clifford sold his rights in \nthe\n ye first seat to Joseph Bishop for 14\/- being a place that he purchased at the building gallery.\n\nPaid Mr Joseph Crocker for the gallery 44 yards at 3d per yard 11\/-.\n\nThese notes were kindly supplied by Miss Mohill, 19 West St, Witton, Salisbury, Wilt who showed us all over the church & grounds & gave us a card of services & an invitation to her place, & a promise to show us all the historical places in Salisbury City.\n","14":"\n\nCloudy all day with a few drops of rain in the afternoon. After dinner & with Handcock, Matthews & N.Jorgensur\t, went to Figeldean to have a look at the Village and the Spreading chestnut Tree. The river Avon runs through the village. There are some very old houses with thatched roofs. One house had a date 1666 on it. It was 2 stories high. The shop was open. There are two forges. One has a round bellows and the oldest a long bellows raised high up on the old fashioned style. I also saw the Canadian\n\nHospital, and obtained a post card of it & also one of the Village. I got a leaf off the “Chestnut Tree\".\n\nThis evening pioneer A Holland strained himself lifting a bag of potatoes & was taken to the hospital. He is physically weak & small.\n","15":"\n\nCool and cloudy today. Cleaning up in the morning and writing letters in the afternoon. \n","16":" August 14, 1916\/\n\nA heavy shower this morning before breakfast and occasional showers all day. The Battalion had lectures when it was raining instead of drill. We cleared out the reading room and it will be used from this on for reading games etc.\n\nI had a letter from Mrs B Dilley Doord Hesh Cty Fermanagh Ireland.\n\nG.T.O. Enniskillen\n\nIreland\n","17":" Aug 15,1916.\n\nOccasional showers today. We had extra fatigues which made the work easy & we have finished early.\n","18":"\n\nOccasional showers all day. A very heavy shower at dinner time. We were busy all day cleaning up the lines in addition to the ordinary work. After tea I walked over to Harrington a little Village on the Avon about a mile away. It is a quaint little Village with some very old houses with thatch roofs and most of the two stories high. In one part called New Haven there is a street of new brick houses. We also saw an old water wheel that was used for generation power for a flour mill. Further on we came to Bulford passing some wheat fields on the way. There is a Church of England \n\n there. Both of these villages have old churches. I got 6 Post card views of the villages. The Manor House \n\nBulford is now used as an Hospital for sick soldiers. It is a 3 storied building.\n","19":" \n\nShowery all day. It was unpleasant working in it.\n","20":"\n\nNo rain today.\n\nIn the evening, with Matthews and Handcock I walked into Amesbury and had a look around the Village. It is the largest Village that I have been too on Salisbury Plain. In fact it is a little town, and has many fine new buildings including a new Police Station, school, Bank and several private houses. There are a lot of shops, and I noticed 4 stationers shops and 3 or 4 hotels, or rather public Houses as they are called here.\n","21":"\n\nCloudy but fine today. This morning I was out to Rolleston Camp in the wagonette – to help unload a load of ashes.\n\nIn the afternoon I walked into Amesbury with Handcock and went to the station \n","22":"\n\nWashed out the bath rooms this morning for the weekly inspection. I was called up to headquarters and informed that I was to go to Romsey tomorrow to attend a school for Farriery and cold shoeing. It has been fine all day. \n\nMonday Aug 21. 1916.\n\nThere was great excitement last night on account of a rumour that Battalion had to go away immediately. A company were ordered to pack up their kit bags & get their equipment ready. And went to bed with their clothes on. I went to the Y.M.C. A. in the evening after tea & \n\nwhen I came back a message was waiting for me to go to the Battalion Headquarters & report. From there I was forwarded to the 10th Machine gun Company’s office about 3\/4 of a mile away. The O.C. was away and I had to report back in the morning at 7 a.m. When we were all in bed the Seargent came along and ordered all out of bed to draw new blankets and a waterproof sheet. This over we again got to bed this time with our clothes on and slept until morning. We were all up at a quarterd to six packed up our kits \n\nAnd returned our old blankets (3 each) to the stones. These were English blankets& were lent to us since we came into camp. Our new blankets are Australian and we have only one each. I reported at the M.G. Co. office at 7 am this morning for instructions and I am to meet others who are going to the school at Romsey at Amesbury Railway Station at 2.15 p.m.\n\nI walked into the station and carried my kit bag and blankets & waterproof sheet. At 2.15 we boarded the train for Salisbury passing Porton on the way, arriving at Salisbury about 3 O’clock. Here we changed trains. At 3.15 we took a train","23":" class carriage) for Romsey. From Amesbury to Salisbury our carriage was second class which is almost a good as the Victorian first. We passed several little villages and arrived at Romsey about 4 O’clock. We put our luggage in the wagonette and marched out to the camp which is about 2 miles from the town. Romsey is very much larger than Amesbury and is more compact but like all old places in England\n\nThe streets are narrow and crooked and the shops are not in line with the footpath. Romsey has a very decent Railway Station, something like what you would see in a big town in Victoria. It is as big a station as Shepperton but built in a different style. \n\nThe railway station at Salisbury is a very large one, with a great many platforms and trains are passing through very frequently. There is a big business done here for Salisbury is a city with some 25,000 of a population. As we were leaving it we saw the famous old cathedral, with its spire towering \nsom\n 404 ft. high and can be seen for miles around. I believe it is the highest spire in England. We had tea as soon as we arrived at the camp. Then we drew 3 blankets each a straw mattress and a straw pillow, also boards and stands for our beds. The beds are the same as as at Lark Hill Camp, being 6 in. above the ground but are much more comfortable on account of the mattress. The huts are different, being\n\nportable with iron roofs and common sides. Nevertheless they are comfortable and hold only 6 men each. There is no hot water laid on for the baths and the huts, stores, nurses baths etc are not laid out on the well organised plan that prevails on Salisbury Plains Camps.\n\nRomsey","24":"\n\nAfter parade and roll call this morning we were drafted in batches of 5 to each shoeing forge. The all the Australians were called in to the lecture room and given a lecture by the Vet. on the anatomy of the horses foot. There were diagrams on the wall and also all the bones of a horses foot, also the hoofs and tendons . After that we went back to the shoeing forge. In each forge there are 3 fires and 3 instructors with 5 pupils each. We did not do much work before dinner. At 2 pm, we paraded for roll call and went back to the forges and shod 3 mules on the front foot only. We were dismissed at 4.30. I had a very easy day. There are 22 Australians in the school. All the others are English.\n\nTommies from various English regiments. There are about 200 pupils in the school all told. The full course will last 2 months, unless the pupil is called away to rejoin his unit. That will be when his battalion has instructions to go to the front. There are 3 fires in each shop with 3 instructors. There are 38 instructors in all. There are about 2000 mules to shoe, but there are plenty of men to do the work. \n","25":"\n\nA cloudy day with a few showers after dinner.\n\nOur class shod 3 mules on the front feet only in the morning and after dinner 1 kicking horse on the front feet only. It was thrown and shod on the ground. We had a very day. In the evening I walked into Romney and had a look round the town.. much bigger than I expected. There is a Y.M.C.A. there, I called in and got some writing paper & envelopes. I had a drink at the “Horse & Jockey Hotel and saw 3 very quaint notices on the walls, I took a copy of them. Romsey has a\n\na population of some 5 or 6 thousand. It has 4 flour mills and a large Farriery and the river Test runs through the town. There are a large Congregational Church near the Abbey around which a stream of water flows through a race to drive a water wheel for a flour mill. The church is well built and of recent construction. It is mostly flints except the foundations, converse windows and doors which are all dressed stones. There is a statue of Lord Palmerstone in a square at the intersection of several streets near the abbey, and there is also a big arch over a street leading from the square to the Abbey. There is also a Y.M.C.A. institute for soldiers in the town as well as one at the Camp near the Isolation Vetenery Hospital.\n","26":"\n\nCloudy with occasional light showers. Y.M.C.A. and bought a dozen post cards of Romney & district.\n\nThe usual programme to do of shoeing & inspection. I was at the Camp Y.M.C.A. and I bought a dozen post cards of Romsey district.\n","27":"\n\nCloudy & showery this morning. Our class put on 1 pair of shoes before breakfast. After breakfast we took off the hind shoes of a lot of horses in the stalls. They are to be shipped away.\n\nIt rained nearly all the afternoon, and as we were allotted outside work, we stayed on the forge and did nothing\n","28":"\n\nA dull day, a little shoeing before dinner, and after dinner fatigue work – filling fire buckets. At 2.30 went into Romsey. Last night a steam lorry bolted down a steep high going to Romsey. The road was long and narrow & winding. The lorry which had a great speed on when near the foot of the hill struck an English soldier who was walking up. He was badly smashed up. It then went up a bank and collided with a big tree and overturned throwing all the occupants out, some of whom were Australians. They escaped with a severe shaking and some bruises. The soldier who was knocked down was taken to the hospital in an ambulance but died on the way. I passed the scene of the accident on the way into Romsey. This afternoon I had a good look over the Abbey. It is capable of holding\n\nwith comfort 1000 people. There are some beautiful stained glass windows, numerous vaults in the church and memorial tablets. It contains the vault over which is a large memorial stone and statue in a prone position of “Sir William Tebby born at Romsey 1623 and lies buried in this church. Patriot and Philosopher who by his powerful intellect, scientific works & industry became a benefactor to h is family and an indefiatable industry became a benefactor to his family and an ornamont country. Died 1687. There are many memorial inscriptions on the walls, some in latin, & some in old English, in which all the S’s are f.f. There are recent inscriptions to the memory of soldiers who have died in this war in France. I went up a high winding stone stairs, along a long passage, through narrow doors and then up another flight of winding stairs and on the roof of the clock tower from which a fine view of the town & surrounding hills can be seen. There is a fine pipe organ in the church and smaller ones in the chapels. The walls of the church are very high so high that to look down from some of the passages on the way to the Tower, the chairs and people look very small.\n\nA few years ago a new porch was built on the church to replace the old one. I tis built in the old Norman style to match the church. The nuns door and crufix is on the side of the church. The roof of the church is of lead. There are some fine other churches in the town. The Congregational church is a beautiful building built of flint with dressed white stone on the corners, windows & doors. The Roman Catholic church is a brick building. It will only hold a few hundred people. The also has a church. I had a walk around the town. There are a great many narrow winding streets radiating from an open space in the centre of the town. In this space there is a statue of Lord Palmerston. There are numerous rapid streams walled in and running through the town, under streets, and buildings and alongside the footwalks. The footwalks are only about 3 ft 6 in wide, just wide enough for two to walk abreast. At the Congregational church there is an arch over the street. The streams in the town are\n\nused to drive water which to drive power to work the various mills in the town. There are many shops of every description in the town including a pawn broker, and they all appear to do a good business. Everything is much cheaper in Romsey than in other places I have visited in England. Post cards 6 for 2d better quality 1\/- dozen. There are in the shops for Sales bargains of all in goods, Jewellery & watches. Pictures etc. but living is dear. Meat 1\/- reduced rates. Cooked ham 1\/10 per lb. Small cakes 1d each.\n","29":"\n\nA stormy day with frequent showers. The church parade was abondanded owing to the rain. R.C. and non-Conformists paraded some time previous and were marched into the town but the Church of England service was held in the open. After tea I walked into Romsey with J.W. Dalziel of 39 Battalion & had a few drinks. The hotels are open on Sunday from 6 to 9.\n\n"}}