{"Document Name":{"0":"Diary_0323","1":"Diary_0323","2":"Diary_0323","3":"Diary_0323","4":"Diary_0323","5":"Diary_0323","6":"Diary_0323","7":"Diary_0323","8":"Diary_0323","9":"Diary_0323","10":"Diary_0323","11":"Diary_0323","12":"Diary_0323","13":"Diary_0323","14":"Diary_0323","15":"Diary_0323","16":"Diary_0323","17":"Diary_0323","18":"Diary_0323","19":"Diary_0323","20":"Diary_0323","21":"Diary_0323","22":"Diary_0323","23":"Diary_0323","24":"Diary_0323","25":"Diary_0323","26":"Diary_0323","27":"Diary_0323","28":"Diary_0323","29":"Diary_0323","30":"Diary_0323","31":"Diary_0323","32":"Diary_0323","33":"Diary_0323","34":"Diary_0323","35":"Diary_0323","36":"Diary_0323","37":"Diary_0323","38":"Diary_0323","39":"Diary_0323","40":"Diary_0323","41":"Diary_0323","42":"Diary_0323","43":"Diary_0323","44":"Diary_0323","45":"Diary_0323","46":"Diary_0323","47":"Diary_0323","48":"Diary_0323","49":"Diary_0323","50":"Diary_0323","51":"Diary_0323","52":"Diary_0323","53":"Diary_0323","54":"Diary_0323","55":"Diary_0323","56":"Diary_0323","57":"Diary_0323","58":"Diary_0323","59":"Diary_0323","60":"Diary_0323","61":"Diary_0323","62":"Diary_0323","63":"Diary_0323","64":"Diary_0323","65":"Diary_0323","66":"Diary_0323","67":"Diary_0323","68":"Diary_0323","69":"Diary_0323","70":"Diary_0323","71":"Diary_0323","72":"Diary_0323","73":"Diary_0323","74":"Diary_0323","75":"Diary_0323","76":"Diary_0323","77":"Diary_0323","78":"Diary_0323","79":"Diary_0323","80":"Diary_0323","81":"Diary_0323","82":"Diary_0323","83":"Diary_0323","84":"Diary_0323","85":"Diary_0323","86":"Diary_0323","87":"Diary_0323","88":"Diary_0323","89":"Diary_0323","90":"Diary_0323","91":"Diary_0323","92":"Diary_0323","93":"Diary_0323","94":"Diary_0323","95":"Diary_0323","96":"Diary_0323","97":"Diary_0323","98":"Diary_0323","99":"Diary_0323","100":"Diary_0323","101":"Diary_0323","102":"Diary_0323","103":"Diary_0323","104":"Diary_0323","105":"Diary_0323","106":"Diary_0323","107":"Diary_0323","108":"Diary_0323","109":"Diary_0323","110":"Diary_0323","111":"Diary_0323","112":"Diary_0323","113":"Diary_0323","114":"Diary_0323","115":"Diary_0323","116":"Diary_0323","117":"Diary_0323","118":"Diary_0323","119":"Diary_0323","120":"Diary_0323","121":"Diary_0323","122":"Diary_0323","123":"Diary_0323","124":"Diary_0323","125":"Diary_0323","126":"Diary_0323","127":"Diary_0323","128":"Diary_0323","129":"Diary_0323","130":"Diary_0323","131":"Diary_0323","132":"Diary_0323","133":"Diary_0323","134":"Diary_0323","135":"Diary_0323","136":"Diary_0323","137":"Diary_0323","138":"Diary_0323","139":"Diary_0323","140":"Diary_0323","141":"Diary_0323","142":"Diary_0323","143":"Diary_0323","144":"Diary_0323","145":"Diary_0323","146":"Diary_0323","147":"Diary_0323","148":"Diary_0323","149":"Diary_0323","150":"Diary_0323","151":"Diary_0323","152":"Diary_0323","153":"Diary_0323","154":"Diary_0323"},"Date":{"0":"unknown","1":1006.0,"2":1008.0,"3":1009.0,"4":1010.0,"5":1012.0,"6":1013.0,"7":1014.0,"8":1015.0,"9":1016.0,"10":1017.0,"11":1018.0,"12":1019.0,"13":1020.0,"14":1021.0,"15":1023.0,"16":1024.0,"17":1025.0,"18":1026.0,"19":1027.0,"20":1028.0,"21":1029.0,"22":1030.0,"23":1031.0,"24":1032.0,"25":1033.0,"26":1034.0,"27":1035.0,"28":1036.0,"29":1037.0,"30":1038.0,"31":1039.0,"32":1040.0,"33":1041.0,"34":1042.0,"35":1043.0,"36":1044.0,"37":1045.0,"38":1046.0,"39":1047.0,"40":1048.0,"41":1049.0,"42":1050.0,"43":1051.0,"44":1052.0,"45":1053.0,"46":1054.0,"47":1055.0,"48":1056.0,"49":1057.0,"50":1058.0,"51":1059.0,"52":1060.0,"53":1061.0,"54":1062.0,"55":1063.0,"56":1064.0,"57":1065.0,"58":1066.0,"59":1067.0,"60":1068.0,"61":1069.0,"62":1070.0,"63":1071.0,"64":1072.0,"65":1073.0,"66":1074.0,"67":1075.0,"68":1076.0,"69":1077.0,"70":1078.0,"71":1079.0,"72":1080.0,"73":1081.0,"74":1082.0,"75":1083.0,"76":1089.0,"77":1090.0,"78":1091.0,"79":1092.0,"80":1093.0,"81":1094.0,"82":1095.0,"83":1096.0,"84":1097.0,"85":1098.0,"86":1099.0,"87":1100.0,"88":1101.0,"89":1102.0,"90":1103.0,"91":1104.0,"92":1105.0,"93":1106.0,"94":1107.0,"95":1108.0,"96":1109.0,"97":1110.0,"98":1111.0,"99":1112.0,"100":1113.0,"101":1114.0,"102":1116.0,"103":1117.0,"104":1118.0,"105":1119.0,"106":1120.0,"107":1121.0,"108":1122.0,"109":1123.0,"110":1124.0,"111":1125.0,"112":1126.0,"113":1127.0,"114":1128.0,"115":1129.0,"116":1130.0,"117":1131.0,"118":1132.0,"119":1133.0,"120":1134.0,"121":1135.0,"122":1136.0,"123":1137.0,"124":1138.0,"125":1139.0,"126":1140.0,"127":1141.0,"128":1142.0,"129":1143.0,"130":1144.0,"131":1145.0,"132":1146.0,"133":1147.0,"134":1148.0,"135":1149.0,"136":1150.0,"137":1151.0,"138":1152.0,"139":1153.0,"140":1154.0,"141":1155.0,"142":1156.0,"143":1157.0,"144":1158.0,"145":1159.0,"146":1160.0,"147":1161.0,"148":1162.0,"149":1163.0,"150":1164.0,"151":1165.0,"152":1166.0,"153":1167.0,"154":1168.0},"Entry":{"0":"\n\nWord came through that 6 Squadron had to journey to Megeibrah, one of our advanced posts near Ogratina, a distance of 50 miles across heavy sand. The rest of the regt. will follow in a few days time. Incidentally M. was visited by Taubes to-day and bombed.\n\n","1":"\n\nC Squad marched out at 6 a.m. Great news from all fronts. Aust’s Casualty list now published, size is terrific, such a lot of my mates have gone under.\n","2":"\n\nDr. & Col. went down to the lakes to the fishing party, did not return, very short handed in regt. My two A.M.C. men go down to stables and exercise, they are learning to ride. Our mess is now in a flourishing condition, as good as any hotel. Wrote a poem today at expense of Gerardy, sent it to Bulletin.\n","3":"\n\nWe hear we are to move off at end of week so I put a pass in to go to Cairo on duty. I will go up on Wed.\n\nTeusday\n\nParty back from Alex. had a good time, definite orders now in about us moving, obtained my pass will go to Cairo first thing in a.m.\n","4":"\n\nSaddled up before Reveille, borrowed spurs did not notice sharp rowells, my own are dummies, conseq. when arrived at Railhead I saw that I had drawn blood on my gallant little mare, I could have kicked myself. After many changes finally arrived at Ishmaillia where I caught train for Cairo, and once more arrived at the old city, after clean up at Anzac Hostel, commenced work, visited various places, and at p.m. called to their great surprise on O’R.’s, spent very pleasant evening before returning. Have about twenty orders for diff. chaps and have got them horribly mixed up.\n","5":"\n\nHad the great opport. of seeing the Mahmal or procession of the holy carpet to Mecca. It was the first one for three years. It is a wonderful sight, cannot describe it here, afterwards went out to H’polis had lunch with Mrs. F. dissappointed in my business. Our old camp is now a Turkish prison camp. Returned to No. 3 A.H., saw Mr. R., returning to Aust., found old unit leaving for Eng., new one from Melb., met many old friends including Sgt. Emmet, just returned, had a reunion. Then finished bus, in Cairo, went to Kursaal in even. Met Tracker T., had a great time, wish this would last.\n","6":"\n\nBusy all day, ordinance, Shepheards, Red Cross etc., then with mate went out to hosp. to say goodbye to Frank & V. St. K., & Gil. J., G. Harris in Hospital, returned hostel for lunch then commenced shopping, everything messed up, verbal messages etc., don’t know how my exs. stand. Went to O’R’s for tea, stayed till late, said good bye then went to meet Tracker, did not turn up. Run fair, Ghizurih Tram yd. Rawhia.\n\nSaturday 23rd Sept.\n\nFinished bus. and caught train to Ishamillia. Gwennie came to see me off, eventually I reached Serapium where I\n\nmet part of the 11th. They inf. me that they were relieving us to-morrow and we were off to Megiebrah. I had to walk home from Railhead no horse to meet me, arrived home 7 p.m. tired, found A.M.C. all packed up ready to start at 8 p.m. I have to ride, but the others will go by barge on the canal to El Ferdan.\n","7":"\n\nRev. 4.30, all A.M.C. goods on roadway ready for barge, doctor & I left with the main body at 8 p.m., poor old Zigi heavily loaded. General Ward took the salute as we marched past, good trip all the nine miles to Ferry Post R.Hd. where we fed up, very friendly the Sgts. of the 4th Welsh invited us to dinner, we had a great two hrs, then we saddled again and rode 7 miles further on to El Ferdan R. Hd., where we bivouaced, here we stayed with","8":" Sgts. Mess, did sick parade.\n","9":"\n\nIn the saddle again at 5 p.m., trekked over heavy country to a well called Mahadit, had lunch & fed, then pushed on another nine miles to a beautiful date palmed oasis called Barda, here we found part of B Squad, who have been out a month. The trees are laden with ripe dates & afford a lovely shade, but the camp itself is a death trap if we were attacked and it is quite possible, as yesterday\n\nour convoy was fired on, no damage, we are now right in the enemy country. Bivouaced and fed for the night. Zigi took to the brackish water splendidly, sent two men back sick.\n\nTeusday","10":"\n\nAway from camp again at 8 p.m., our next stage was over very heavy loose sand ridges some of them remarkable in shape, after 4 hrs. in saddle arrived at a well called Jeffiear where part of B Squad had dug some fine wells, we camped here but took long time to water, Zigi got in first and had a good feed but I went hungry, saddled up again in a scorching sun and commenced our last and worst stage of our 50 mile trek. The country was deadly, passed S.E. of Dueidan and finally arrived at Megeibrah where the 11th beat the Turks, dead camels and Turks lent a pleasant odour to our welcome, watered at a fine well then I made tea for H.Qrs. Sgts. and camped for the night feeling quite fresh and well after a hard ride. We relieve the Yeomanry to-morrow. We are camped next to two camel corps, Imp. & Aust., they were in action three days ago, this country is only suitable for camels but the L.H. are finding and digging wells where even the Bedouins gave up hope. A Bedouin spy was caught to-day, he had a lot of Turkish dispatches on him. God knows where he got his water.\n","11":"\n\nStood to arms at 4.30 and at 6.00 all horses were taken off lines and scattered about as between 7 & 8 a.m. a Taube has been flying over and dropping bombs. Rough riders left at 9 a.m. and I went over and made a humpy for sick parades, no tents just shelters & mia mia made out of nothing and yet they are dotted all around the camp, moved in and did sick parade, will be glad when my stuff comes as nobody has cigs., tobac., matches or anything but bully to eat.\n","12":"\n\nCol. Scott of the 9th L.H. rode in to-day from El Mazar reporting that he had two officers killed by snipers. Camel Corp returned from reconnaissance, report they were 15 miles from El Arish, no enemy seen save two prisoners who say the Turks are preparing to evacuate El Arish.\n","13":"\n\nSmokeless, hungry, matchless, this is Hell, men will give any price for tobacco or cigs., no sign of camels coming yet to relieve our pangs. To-day went out into enemy country to a date oasis 5 miles from the camp, found a deserted Turkish camp & tons of equipment, had a big feed of beautiful luscious black dates, brought two\n\nsacks home, could fill 5 waggons there of the finest dates in the world, and there they are just rotting on the trees waiting to be picked by the Bedouin hand that will not see them again for many months.\n","14":"\n\nNo camels yet, luckily getting good rations but as there is no wood they are badly cooked, heard to-day that Fleurent had fallen. It is reported that probably the first three brigades of L.H. will be equipped as cavalry and lances, God forbid that we should get camels, here we are surrounded with them and it is a positive fact that men become deranged with them, the men here seemed to be half looney. It is a hell of a life as they have to live like Arabs.\n","15":"\n\nNo sign of camels coming yet, things deadly monotonous, not a thing to read, nothing to smoke, only to play cards our only pastime. Col. & Dr. went out to Bayud to-day for three days leaving me R.M.O. We hear that our mail has gone astray. The nights are becoming terribly cold, and it hurts to rise at 4 a.m. and saddle up in the dark.\n","16":"\n\nDr. back from Bayud, Zigi has a sore back in conseq. Goods arriving to-morrow. Played cards all day lost steadily, my luck has been terrible lately and tonight when I had a full hand I bet up and my opponent had four aces, so here in this diary I make a resolution not to play cards again on a.service. I get the cards but fortune has sat on me, so I intend trying to keep this resolution. It is a buggar having to look after two horses as Dr. has lost his groom and I am filling the breach. Have just heard about my com. The G.O.C., Sir Arch Murray refused to sign any commissions other than those stopping in Egypt, he says a trained L.H. man is too valuable to go to France as Inf. or Art. It is flattering but not very satisfactory, as they were all through save the final signature.\n\nTeusday","17":"\n\nNo doubt this is a circus of a regt. I curse the day I ever saw it, continually messing about, now an order has come out that we have to return to El Ferdan again and in orders it says definitely that 4th, 11th & 12th Regts. are to be camel regts. by the 1st Nov., we to be known as the 2nd Camel Regt. The very thought of it is\n\nawfull about 6 p.m. the camels arrived and what a mess up, four cases of Med. goods came, and they were Red Cross goods I got in Cairo, all my precious goods, instruments etc. and personal equipment was sent two days ago God knows where it is now, too full for words here, a lot of mail came and those were all papers the letters being left behind, however, plenty of tobacco and Jerry half tanked helped me let my troubles end in smoke.\n","18":"\n\nConfirmed in orders about camels, every man is doing his best to get out of it. Two officers are going to Cairo for instruction. No letter from Hal yet, one from Leon, all well, anxious about former. Dr. & Jerry & Col. & bat. went for ride to buried city 11 miles away. I was R.M.O. and had to send the W.O. to hosp. with Malarial D.Ts.\n","19":"\n\nWe have reason to believe that the Sheriff of Mecca has raised a revolt and is endeavouring to cut the Turks off from El-Arish. There are 4,000 Turks and a German\n\nstaff \none\n two days march from Bayud and to-night we were all issued with extra ammunition and horse bandoliers – Significant.\n","20":"\n\nPossibility of C Squad coming in, Camel Corp now out on reconnaissance 25 miles from Bayud, every night strange lights are seen by our patrol. Every man would like to get into action mounted before we lose our camels.\n","21":"\n\nCamel patrol back with 40 captured camels. They report that Turks are in a strongly entrenched position in a rocky range of hills and it is quite possible we will have a go at them before returning for our camels – G. Forbid.\n","22":"\n\nWell at last we get our long awaited opportunity, we have our action orders and on Teusday we go out in force to take Magarah a stronghold on the way to El Arish. 11th & R.R. will make our brigade, we have a big job to do and it is God help our horses, sink or swim, and we are going to swim, we are all excitement and eager.\n","23":"\n\nAll excitement every man stuffing feed in to his horse as the task ahead is the severest test on horses yet called for in war. We know very little save that we will trek to Bayud to-morrow and join C Squad. Three days ago a man set off to ride to Negiliet, to procure canteen stores, he has not turned up yet, we surmise he got lost.\n\nTeusday","24":"\n\nNo alarm this morning, set off at 9 a.m., poor Zigi heavily loaded with me in the saddle, she must have carried 14 stone. It was pitiful to see the faces of the unfort. beggars who had to stay at home, it nearly broke their hearts, all well to Bayud, the country was very rough all sand drifts and loose hills. Arrived at 2 p.m., met C squad. Surprised at enormous preparations made here. A Taube dropped bombs six miles from here, how he missed seeing us is a wonder. Had a b & b tea & posted the picquet. I am in charge of Headquarter Horse lines, slept in saddle blanket saturated with sweat, over 3000 camels arrived during the night.\n","25":"\n\nDid two rough sick parades, watered, 11th Regs. marched in looking very business like then a few more camel corps, then later the R. Riders, it was a great strain on the wells but they stood well although towards evening the water was very thick. All is excitement in preparation. General Dallas & his staff arrived to-day, over 7,000 camels are to be used for transport alone, showing the big nature of the stunt, we have a task next to impossible to achieve but we are all eager and prepared. To-day one of our camel patrol met a hostile tribe of Bedouin who beat them by numbers using old flintlock rifles.\n","26":"\n\nOff to-morrow to our fate. God help us to be successful. The organization is perfect so far, save that the wells and pumps are not doing to well, it took four hours to water to-night, had to go down twice, Marching orders out. I stuffed feed after feed into old Zigi all night, we pinched three bales of fibre .\n","27":"\n\nOur last day here. Sunday morning we attack, old Col. Royston now Gen. rode over to-day from Third Bde., the boys cheered him to the echo, he made a speech wishing us every luck in our attempt, saddled & watered at 4.30 then moved off, it was a great sight 11th Yeom. & us in that order, then Yeom. went apart, camel corps separated, it was a great though hard march to Zagadan where our camels had carted water and food. The country was indescribably rough, the worst I ever rode over, all canyons, hods & loose sand ridges, in places the horses were down to their hocks in sand as soft as flour, we were not allowed to talk or smoke and had to dismount and lead every ¼ hour, then a heavy dew fell and it was bitterly cold when we arrived at Zagadan, tied up and fed, it was so cold that I gave Zigi my blanket for a rug and slept cold all night, or rather for the two hours left till daylight, we camp here to-day and ride on to Magarah at dusk, this regt. has been given the post of honour and we are the main attacking party, we expect heavy\n\ncasualties, the others will be on flanking strategical movements, so this time to-morrow we will either have a wonderful success or a terrible loss – Kismit.\n","28":"\n\nCold bitter night, commenced work right away, fatigue parties all day, carting fodder, rations and water, dressing sores, etc. Towards dusk we watered again, a meagre two gallons per horse, then commenced our big march all night, never will I forget that twenty mile ride in pitch darkness over country that cannot be described we would climb a mountain of loose floury sand then go down the other side at an angle of 50° we could not smoke, or talk and the pace was painfully slow many times I fell asleep in the saddle, old Zigi plodded on never tiring then a heavy dense fog got up and our compass was the only guide, eventually the fog cleared and we rode into a pass 4 hrs. late, then another fog came up and we could just discern an inky rise, grim & forboding – that was our goal, we had to take as soon as the fog lifted, it was now bright daylight and the\n\nSunday morning\n\n11th linked up with us, they had captured 5 Turkish prisoners, and 4 Bedouins, bad beggars wearing clothes they had captured from one of our camel patrols, then out of the darkness of the hills came a sharp rifle fire that rattled us, then came the great word “mount for action\", oh never will I forget those moments there was the Turkish stronghold pouring a deadly fire into us, on the left another mountain of loose stone, in front of us a hard flat of stone sand. The Indian mountain battery took up position also our machine guns, then we got our orders to gallop to the hills, it was wonderful, it was splendid just like a parade ground the regt. galloped in in troop formation extending and wheeling whilst overhead a rain of bullets poured, the Dr. went with one squadron, I with the other, jumping hillocks, the horses were just as excited as we were. Then we reached the foot of the hills, and dismounted, handed our horses over to horse holders who retired at the gallop to safety. Then commenced\n\nour climb, every yard we went up we came back half, nothing daunted the troops reached the ridge, whilst on the other side, plainly could we see the plucky Turks standing up firing at us. They made great targets, and our fellows had some great shooting for two hours a Turkish officer on a horse could plainly be seen rallying his men on the flat, bullets spitting all round him, but he never attempted to take cover, then the enemy cleared back into a further stronghold, which the mountain battery poured shrapnel into, wounded and dead Turks could be seen every where, but as yet our regs. had no casualties. Then one of our officers scaled the other side of the redoubt and captured the trench six Turks throwing up their hands, I could see a poor beggar of a Turk badly hit on the flat, so with my officers permission I climbed down to him. A sniper fired five shots at me but they all went wide, I reached the poor beggar dressed his badly shattered leg and dragged him into the shade\n\nand gave him some morphine to allay his suffering, I left him then for a party of our men were waving to me from the hill, it took me half an hour to climb up over the loose stones and when I reached the top the soles of my boots were torn off, in the redoubt I found four dead, and three badly wounded, one had six wounds in him I dressed him, then a signal came to retire at once, so some more prisoners were taken down, then my stretcher party carried the wounded down, their screams were terrible one german looking beggar hung on to my legs and would not let go, we could see the others mounting for retirement, so knowing that Magarah had fallen, we eventually reached the bottom of the hill I had then to go back to my first wounded man, I found four prisoners carrying him in a camel cacolet then picked them up and I retired to where I left my horse, I was so done up that I consumed three nips of brandy, we had to shoot three badly wounded horses before\n\nretiring from the flat, snipers were still busy and firing on us, just as the last party was leaving one of our Sergts. fell off his horse exhausted and I had to stay with him until a cacolet came back, I was a bit scared of being taken prisoners because Turks could plainly be seen emerging from their hiding places however I got him away and it took me two hours to catch the column, before I learned the news of the other regt, after a seven mile ride we reached a valley where our camel transport had carted water and food for our poor horses, how they drank their meagre allowance? We made a cup of tea here, it was the finest cup I ever drank. We then learned that we had no casualties, the","29":" had one man killed and two wounded, and the R.R. 1 wounded, we lost about 5 horses and four camels in our great reconnaissance victory, we lay down to sleep that night & slept the sleep of the just, alongside me were 17 big Turkish prisoners Zigi walked all over me looking for more feed.\n","30":"\n\nMoved off again to Zagadan, we were the rearguard, it was a most imposing sight, this full victorious retirement of 7000 camels & 1200 horses and men we were astounded when we saw in daylight the type of country we had ridden over, the sun beat down mercilessly and our tired and jaded horses suffered, we soon finished our water bottles and by the time we reached the valley of Zagadan we knew what thirst meant, however we got their, then the work started, lumping fantasses & rations, it was hard labour, the ambulance came in then the poor Turk that was so badly wounded died on the way in, I wish now I had left him where he was – but he had only a 100 to 1 chance of life, the others are all doing well, they recognized me & shook hands. One of the Bedouins was a supposed loyal subject of the Sultan, he is to be shot after his trial. We slept \nvery cold\n that night.\n\nTeusday","31":"\n\nWe are the head of the column to-day and consequently got away early in the morning, the ride to\n\nBayud seemed the longest of all, it always does when nearing home, two miles from Bayud, a man fainted with exhaustion I brought him to and stayed with him until the cacolets came up, all the canvas troughs were full, and the horses rushed them, I thought old Zigi was never going to lift to her head out of it, most of the horses finished well, but none better than this mare, the way she galloped into action after her 20 mile ride made me as proud as if she was a Cup winner. Generals Dallas & Mott arrived in and we believe they are sending in a splendid report about us. A heavy dew fell at night and when I awoke my blankets were ringing wet, I had rheumatics badly until the sun arose.\n","32":"\n\nTwo years today since I embarked in Australia. We rested all day at Bayud for two reasons, one to give our leg weary horses a spell, the other to record our vote for Conscription in Australia, it is a coincidence that I should vote for others to come over here two years to\n\nthe day since I left to do my bit. We \nall\n had our first wash for 5 days here, it was much appreciated. We are all doing our own cooking and to-day we had fresh bread & meat, it is a great change after biscuits & bully, my poor teeth have suffered lately. General Dallas has put in a splendid report about our regt., apparently Magarah is the furthest inland from the Canal yet done by troops in Sinai. We go back to Megeibra to-morrow morning, thence El Ferdan.\n","33":"\n\nWe were the advance column to-day and watered and set out at 8 a.m. back to Megeibra about an hour after we left an enemy Taube flew over at a great height, and we at once dismounted to look like bushes & shrubs, he flew over without apparently seeing us and then the anti aircraft gun at Negilet spotted him and their shooting was splendid, they wheeled him in the direction of Bayud but his birds had flown by two hours, not to be out done he returned and dropped bombs over Negilet. After a tediously monotonous journey we\n\narrived at M., where we were rushed for news of the scrap by our unfort. mates who were left behind. I found my stuff alright and was happy to sleep under a bit of a hessian cover that night.\n","34":"\n\nIn the saddle again our last stage, left camp at 8 a.m. in the van rode right on to Jeffin but did not water, finished 20 mile ride in the beautiful date oasis called Baada, plenty of water for horse & men, good camp all night, to-morrow we go right in to El-Ferdan.\n","35":"\n\nOff again at 7 a.m. we leading rode direct to Mahadan where the regt. halted for lunch. I rode on alone to El-Ferdan. Old Zigi walked at a great pace knowing she was nearing civiz I arrived there and was rushed for news of the scrap after a great meal at the canteen my A.M.C. men took me to the goods, it was all there by some miraculous fluke, nothing lost at all, I have to stay here with A Squad as R.M.O. but the regt.\n\nwill go on to Ferry Post Railhead & man to outposts, so accordingly I had to get some equipment & sorted out enough to carry on here. I had it done by the time the regt. was in, as soon as they arrived they took the canteen by force & I don’t blame them a bit poor beggars they had been through the hardest trek yet accomplished in Sinai. I was dead dog tired when the G.M.C.A. Secty. came up to me and asked me would I give an item at the concert that night, I did so and met with a great reception, trebly encored “midst cries of more Pills\". I could not see it out & just lay down knocked up in the legs although not really tired. I am promising myself a holiday here.\n\nSaturday 21st Oct. (C. Cup Day)\n\nCommenced work right away, had to load all my stuff on to camels, & get my men mounted at the last minute the Dr. wanted me to go with him, but I stuck out for my rights. If I went down with him I would work my inside\n\nout and get no more praise for it, so he can have a bit of the worry for a change. The two squadrons & HQrs. moved out at 11 a.m., and I rigged a place up, made myself comfy and did a big sick parade of septic sores, etc. Then I had a glorious shave & bath & changed into clean clothes, the first for three weeks?\n","36":"\n\nWrote a long letter home to Mother, p.c’s to all the others, did sick parade & Sanitary Inspection & put man in hospital, Sir Arch Murray the G.O.C. of Egypt inspected the camp to-day, all bunting & show, had a retinue and bodyguard as big as a regt. It hurts to come back to camp discipline after our wild free life the past three weeks. Started our mess to-day I have been appointed Caterer, busy procuring goods all day.\n","37":" Oct.My mare got micked last night I was very wild over it, have reason to believe that all is chaos at Ferry Post, glad I am well out of it I have our little mess very comfy now but is an expensive job going round to the\n\ndifferent messes buying goods, alongside us are the Welsh Fusiliers and they have a great mess, they are mostly big lion hearted Wesh miners, and a very jolly crew, they had a stadium and a boxing match in p.m., at which two of our chaps beat two of theirs, we had a celebration afterwards.\n\nTeusday","38":"\n\nMail in, mine has gone to Ferry Post, will be over to-morrow, rode to El-Ferdan Rly. for more goods, did not return till late, our officers of this the reserve regt. camped close handy, challenged a team for shooting, our chaps went up and got beaten by three pots.\n","39":"\n\nHad a good rest, things now fairly well settled. Mail in, none for me, mine out with regt.\n","40":"\n\nGave a horse to Welsh Sgt. Major and we rode to El-Ferdan on the Canal we called at the Hereford & other messes and then had good time with R.T.O., a good sport ordered all our goods for the merchants, then came\n\nhome, it took two hours for us to cross canal. First time S.M. rode a horse, he was not sorry to get off.\n","41":"\n\nBlack kit bags back, all my stuff tayeb , I have had great luck with it, can now dress decently, my mail came in & I got seven letters, three from Ev, one from my mother, replied at once.\n","42":"\n\nRode 7 miles to the other camp, saw the Dr., all O.K., then went up to the mess, it was like a huge hotel, they made a big fuss of me and insisted on me staying to a smoke social they were giving to the Sgt’s of a Welsh regt. I stayed, recited and then I remember no more. There was a beautiful Welsh Choir singing & they must have gone to my head.\n","43":"\n\nLeft after breakfast, they were a sorry looking lot that sat down that morning. S.M. Sgt. & myself rode home, arrived safely, had to then do a sick parade & purchase mess goods, leave starts tomorrow.\n","44":"\n\nBeen scrapping on Western Front with Senussi, we may find ourselves down there yet went down by train to the Canal for a swim, enjoyed it, spent evening at R.W.F. mess.\n\nTeusday","45":"\n\nSpent day writing letters, etc. we are finding patrols now. A lot of double squadron Sgts. came over to tea and we spent a pleasant bridge evening.\n","46":"\n\nDouble Squadron gone Abbassia for camels, had our boxing tournament with 7th Welsh in p.m., good sport, we only had one man beaten in the p.m. and that was very close, I see by the paper that the old Hosp. ship Galeka blew up in the English Channel, poor old Galeka, what memories it brings to mind, my three trips on her, twice with wounded and once myself a patient. All day I have had a raging fever on me, but can keep it down, I am subject to attacks of Dengue, but they only last a couple of days, if I lie up I am settled, I must keep moving to ward it off, any excitement keeps me from giving in to it, and I suffer and no one knows any thing about it.\n","47":"\n\nPay day, first lot went on leave, I am endeavouring to get away this day week, very cold at night now, one must wear flannels. Letter from Lionel all well.\n","48":"\n\nContinued boxing to-day. I had gloves on, sadly out of condition, only went two rounds. Double Squadrons left to-day for camels, I paid back all borrowed money and showed a £4 profit with the mess this week.\n","49":"\n\nBoxing at Wesh in p.m., big mail came in I rec. my letters all containing good news, put me in a happy frame of mind, recited that night at Y.M.C.A. Concert, was doubly encored.\n","50":"\n\nThere is a big move on somewhere, troops arriving in thousands at Moascar would not be surprised if we were fighting at Xmas. Spent day answering letters.\n","51":"\n\nWe have a sweep on Melb. Cup, and it was drawn to-day, I as usual drew outsiders. Woloroi won the Derby.\n\nTeusday","52":"\n\nCup Day the third I have been away from, it\n\nwas a cold bitter day here, almost like winter, as soon as it becomes cold, I feel it in my rheumatic joints.\n","53":"\n\nPut in for leave to Cairo expect to go up on Friday. Boxing at Welsh, our fellows went very well, one winning the bowman.\n","54":"\n\nSham fight on to-day at Canal. I told the Maj. I was too old to play soldiers so got out of it. Our chaps drove “enemy\" right back on the Canal.\n","55":"\n\nPass through left camp early in a.m., eventually arrived at Cairo, busy first day. O.Rs welcomed me, stayed Anzac Hostel. Cairo very quiet.\n","56":"\n\nHearing of possibility of Hospital ship jobs returning home went out to Abbassia to see Herb E., introduced me to a Cpt. who was willing to swap jobs if my Dr. signed transfer, so I will probably come up here for a month before getting the job, am highly excited at probability, met Gwennie in p.m. took her to Nuns thence to a Matinee, had Xmas Cards printed, they are splendid, my own idea, printer said if he had idea earlier\n\ncould have made £500 out of it, equal profits, I am kicking myself for my procrastination.\n","57":"\n\nOut to Hosp. again to complete arrangements, p.m. went to Shubra and called on Nuns, they took Gwennie, Bob & Lewis to Luna Park, spent a very pleasant evening with them, the best holiday they ever had, sent Xmas letters to home at night.\n","58":"\n\nCaught early train back and just as I left Cairo a Taube flew over for the first time and dropped bombs on Cairo, they killed fourteen people, 1 soldier and wounded a lot, it terrified the nigs, arrived El-Ferdan, no horse for me so had to walk, when Tommy officer asked me to ride his horse home I did so with celerity. At camp had busy time making up for lost time both with my work & mess.\n\nTeusday","59":"\n\nRode over to regs. Dr. at first did not like idea of me leaving him but finally shook hands and in a splendid way thanked me for what I had done in the past and signed my transfer, he then paraded me to\n\nthe Col. who complimented me in flowing words. When my fellow Sgts. heard it they gave a concert & invitation dinner to R.F.A. Sgts. I had to recite 5 times encored each time, stayed that night.\n","60":"\n\nSent all my Xmas cards away, big mail came in. I got no less than 18 letters my father is very ill and it is for that reason I want to get home, all other letters brought good news. Big move on, troops are leaving & exchanging here, gave farewell night to Welsh Sgts. at our mess.\n","61":"\n\nAnxiously awaiting answer from Cairo, wrote home and two Ev. Rec. some lovely Xmas presents to-day including a beautiful wallet from Ev.\n","62":"\n\nSpent day writing, time hangs very heavily now, camp very quiet.\n","63":"\n\nMy mare is in great nick. I gallop her every morning. Send 10 men away to each day for Dental treatment.\n","64":"\n\nMonaster has fallen, good news from all fronts we are disgusted with Conscription failing\n\nin Aust.\n","65":"\n\nRec. word that the other man backed out and will not come down, am too disgusted to write here my diary is all mixed up wrong dates etc. I sent in my application to A.D.M.S. throwing in my stripes if I get the trip. Cannot write fully here.\n\nTeusday","66":"\n\nThings anyhow, do not care if I do my work or not. Horribly disgusted with Army & all concerned.\n","67":"\n\nSham fight on again. I got out of it by taking a dental party over coming back they jumped a Tommy Sanitation Camp fence and pulled half it down I expect to get strafed over it.\n","68":"\n\nHad my teeth attended to yesterday. Met a lot of Essendon men in mess tonight. Oaklands Hunt men had great reminiscence evening.\n","69":"\n\nThings deadly quiet in camp, nothing exiting happened all the week, am so disgusted and fed up, I let my diary go to hell and wrote\n\nit up once a week.\n","70":"\n\nRode over to dentist again rumours in camp that probability of 4th L.H. Bde. being formed again.\n","71":"\n\nRec. a lovely parcel from Mother containing every thing that I wanted it was beautifully packed and all in good order.\n","72":"\n\nTwelve months to-day since the snow fell at Gallipoli. Cold night here but sunny day. We hear that El-Arish is off, it is raging with Cholera.\n\nTeusday","73":"\n\nClipped my mare to-day, she looks splendid. Met Gordon Lyons from Essendon, had great yarn with him in the mess.\n","74":"\n\nto\n\nSunday 3rd Nov.\n\nNothing doing the past three days, every day passes like its predecessor. It is deadly monotonous to-day with an orderly I rode 14 miles into Ishamallia to buy goods for the mess, spent a pleasant day there before returning home, a long ride.\n","75":" \n\nThe regt. has gone further to Hell now, N.C.O’s are throwing in stripes to transfer and Officers are leaving, it is just one life of discontent.\n\nTeusday","76":" \n\nMy mare is in great nick and every morning the Farrier Sergt. and I go for a gallop, his pony is a clinker, he beat me two mornings running over a sprint of two furlongs.\n","77":"\n\nZig my mare beat Tommy badly this morning over a longer distance, the latter I found out is only smart away whilst mine does not get going until she has had a couple of furlongs.\n","78":"\n\nRode over to the regt. on business, called at Duntroon outpost on way in, they have arranged for a six days sports carnival for Xmas week, they were practicing for mounted events whilst I was there. Just as I was leaving the Adjt. called me in to show me a letter from the A.D.M.S. asking was my case a genuine one. I have to take evidence over to-morrow.\n","79":"\n\nRode to regt. with evidence, sent it to orderly room, had a trial sports meeting\n\nin p.m., very laughable.\n","80":"\n\nEverybody is trying to join the Flying Corp (68th Squadron, my two sergt. mates expect to get in. Another football match to-day – Rugby) another man slipped the cartilage of his knee, I put it back and sent him to hosp., he is the third this week.\n","81":"\n\nAnother football match and another casualty, a man wrenched his knee – four to hospital in one week.\n","82":"\n\nMy two mates sergts. got their transfer to Flying Corp, go in the morning so the Vet. Sergt. and I decided to give them a night, it was a wild and wooly one. I was the only sober one there at the finish, carried the aviators home on a stretcher and put three others to bed.\n\nTeusday","83":"\n\nPracticing for Sports meeting. I thought Zigi was a good thing but she is too fast, she bolted in the flag race half a mile before I turned her and knocked all the posts out in the bending race.\n","84":"\n\nGave our tent a cleaning out since the others have gone, it took us two hours digging\n\nin the sand to get rid of the cig. butts and matches, the squadron went to Ferry post where the regt. was inspected by Gen. Wood.\n","85":"\n\nQuiet day, rumours about El-A. again – French gaining big vics at Verdun.\n","86":"\n\nPapers full of peace proposals, all German bluff – sent a man to Hospital with query throat.\n","87":"\n\nMail day. I did not get an extra big one, one from Sull who is camped at Kantara.\n","88":"\n\nObtained leave to visit Kantara, arrived there after troublesome journey only to find that Sull had gone to Mazar the previous day, however I spent pleasant day with old mates who all are well, rec. news that Charly Owen an old mate of mine died on his way home to Australia, this leaves me the sole surviving member of the original L.H.F.A. Bearers & Tent Division, on returning my mate met me with my mare at the canal.\n","89":"\n\nSpent day writing letters.\n\nTeusday","90":"\n\nReport came through that man with query throat had Dypheria. I had to isolate all his mates and had busy day throat swabbing etc.\n\nTeusday 19th\n\nFresh Dyp. case came in to-day with patrol. I am in a dicky position having no Doctor here, however worked like a nig. all day.\n","91":"\n\nAnniversary of evacuation. Officers, N.C.O’s and men celebrated it by a wild impromtu night in the mess.\n","92":"\n\nMany sore heads about to-day. More regimental promotions. Great news reached the camp that El-Arish had fallen with practically no casualties, enemy abandoned it. Full particulars not here yet.\n","93":"\n\nRode over to regt. to see Doc., he was away, spent day there and just as I arrived home I let Zigi roll after unsaddling and she ran in behind another horse who lashed out and opened up her forearm, bursting an artery I was awfully upset over it but dressed and stitched it up.\n","94":"\n\nRode to the Canal with the football team to play the Welsh, gave them a hiding, at night all the Camel Detail Sergts. were up at the mess to say goodbye before going to Abbassia for camels.\n","95":"\n\nI was busy all day arranging for to-morrow’s Dinner, I am priding myself on my catering abilities. Managed to get hold of three live ducks so we intend doing it well & I spent £15 on the mess. The troopers had a baksheesh barrel of beer and they sung all night.\n","96":"\n\nMy Third Xmas on A.S. In the a.m. we had our Xmas billies presented to us, they were fine, all the morning officers from other regts. and our own were in the mess. I even obtained a table cloth and the table looked lovely. When the bugler sounded Cookhouse, the Major, Officers and Sergts. went to the troopers mess to wish them the customary greetings then Sergt’s Mess was blown and we all trooped \ninto\n to our mess, then the ducks were brought in and as caterer I read the mock menu. The dinner was perfect, one that I will never forget\n\nconsidering the conditions. The president moved a vote of thanks for my work. In the p.m. the G.M.Cs had a sports meeting and our chaps won all the athletic events. In the evening presentation of prizes, carol singing and concert, I recited in great form and had good audience, rec. three encores, made big hit, my pieces seemed to be just suited to the audience. This brought to a close my happiest third Xmas day on active service.\n","97":"\n\nThey say it only rains once a year and this time it picked on a holiday, and right in the middle of a boxing tournament it poured, and everybody got drenched, we had no cover as all our shelter is meant for shade being made of rush matting.\n","98":"\n\nCommencement of sports meeting at Ferry Post railhead. To-day we all rode over to see A Squadron play B Squadron but after a great game A were beaten.\n","99":"\n\nC Squadron beat H.Qrs., great day over there. I did not go over as my camp was raided by General Staff on Xmas Eve\n\njust after dinner and they found a few things dirty as might be expected, they sent in a strafing report, but the officers and Doc. are sticking to me. It made me feel more like a rebel than any previous Tommyism.\n","100":"\n\nWhilst we were enjoying ourselves at our sports meeting our gallant comrades attacked El-Arish and took it, the great reports coming through make me mad to think I am not participating, as they have the enemy on the run. It is cruel not to be in at the death, but it is my own fault for ever transferring into such a show regt. as this.\n","101":"\n\nMore victories for our mates. Magadaba has fallen and the Turks are in full retreat towards Bersheba, Light Horse doing wonderful work, whilst we are holding a sports meeting.\n\nSaturday 31st\n\nThey are fighting like Hell and are now in fertile country whilst we are still in the desert. It was the last day of our sports, B Squadron won the pennant but I did not pay a great deal of attention to it being too disgusted with the regt.\n","102":"\n\nMonday 1st Jan.\n\nA cold bleak day passed quietly, I made two firm resolutions that I hope I may keep.\n\nTeusday","103":"\n\nMany of my mates were killed at Magdaba, the prisoners are now coming in to Cairo. Another case of Dyp. broke out to-day and the squadron had marching orders to exchange with C Squadron at Ferry Post, I had to stay behind. A regular khamsun blew all day taking tents and sheds followed by heavy rain at night.\n","104":"\n\nWound up mess to-day, members greatly surprised when I read statement of accounts, paid dividend of 50% & with reserve capital of £ 12. I was voted thanks & bonus. Recd. letter from 16th A.G.H. offering me staff sergeancy, am going up to-morrow to see about it. The Doc. has obtained his majority so may leave us shortly.\n","105":"\n\nRained heavily all day, Mate and I set off on horseback to ride to Canal to catch night train and thereby get extra leave, cold, wet ride, arrived at Cairo after\n\ntedious journey at 12.30 p.m.\n","106":"\n\nSame old Cairo, busy all day rushing about, went to A.D.M.S. to enquire about my neglected furlough, he smiled and opening a draw showed me a confidential report. Sergt. Morris genuine case – to go 15th inst. I was so delighted that I walked out of the building dazed, I had to rush round and tell O’Raff’s all about it, there delight was mine. God Forbid that any thing should happen now. I turned the s.s. job down but hate to think of the regt. going into action without me in it.\n","107":"\n\nChasing all over city looking for A.P.M. to extend my leave, wired the regt., reply granted then met the smiling old Doc., also on leave. I congrated him on his majority and he my on my trip, but we will both leave the regt. together. Spent pleasant day but pavement tires one out, took O’Roff. family to dance at British Club, slept Anzac Hostel, returning first train in the morning. I cannot yet realise I am going to home sweet home.\n","108":"\n\nArose from our comfy beds at 5.30, had bkfast., Mrs. Rickman, matron of the Hostel, had a box of sandwiches ready for us, caught morning train and slept to Ferdan arriving at regt. before lunch, had lot of work to make up.\n","109":"\n\nAnother English mail boat Torpedoed in the Med., this submarine menace is growing fast, two out of three consec. mails have been lost. Could not write to-day as I am so uncertain as to the boat. It looks as if the regt. is going to Mesopotamia. Troops are concentrating near Suez.\n","110":"\n\nTook patients to Canal for Hospital I am at present M.O. for the post of Railhead with over 300 nigs. as well to look after.\n","111":"\n\nGreat news has come through that the L.H. have captured Rafa 13 miles from El A. The Turks never had a show, 2,300 surrended, we killed 600 & our casualties all told were only 300, principally amongst New Zealanders.\n\nTeusday","112":"\n\nRode to regt., all well, expecting to move this coming week to Jeneft near Suez. My boat has\n\nbeen delayed another week, do not expect it to go before 30th.\n","113":"\n\nHeard of a few of my mates who went under at El A. Mail in, I got 9 letters, my father is no better, hope he is better, making me wish that boat would hurry.\n","114":"\n\nEvery trooper has been issued with wallets now. Expect to go Friday with big force concentrating at Nekhl.\n","115":"\n\nRode to regt. Doc. wrote to A.D.M.S. asking if regt. left could I go to LL A.G.D. every beggar in the camp is asking me to take parcels home for him. Drew my wallets. About a dozen are after my mare. I will be sorry to lose her\n","116":"\n\nTroops rode to Canal to play Artillery football and got beaten I did my washing\n","117":"\n\nRode to regt., all expecting move this week, on pins & needles about my trip.\n","118":"\n\nOur lads at Rafa repulsed a counter attack and took a lot more prisoners Nothing new to report\n\nMy last day in the desert.\n","119":"\n\nI rode over to regt. and nothing in orderly room about me so played in a cricket team, H.Qrs. Sgts. agst. C Squad Sgts., and just as I was fielding a wire was brought to me telling that I had to report at Suez that night, it was all bustle then chaps running at me with letters and parcels to take home. Shook hands with Col. & Doc., both thanked me for what I had done then mounted on \nold\n Zigi I galloped for Ferdan the cricketers knocked off to cheer me. Accompanied by Doc’s groom who will take Zigi back. Arrived Ferdan, told the good news, handed mare & equip. in, packed my bag then the Sgts. made me a presentation and speech and called for cheers, while they were singing A.L. Syme the Major came down & presented me with a written letter of thanks, my mate & others rode to the canal where I left the desert at last and caught the 8 train to Suez after a tedious slow journey arrived at Port Tewfik at 1-30 in the morning, found an hotel (Savoy) and tired as I was I could not sleep, for excitement so ended my last day of 30 months of the desert\n\nWednesday\n","120":"\n\nIn morning after 3 hrs. wait for breakfast, I reported to S.M.O. he said that boat would not be in, so I asked for leave to Cairo which I got and after 7 hrs. train traveling I arrived there, after wash went straight to O’Raffs to tend my last farewell, Gwen took me to the sisters to say good bye then home again I could hardly say good bye to these fine people but at 12 p.m. I tore myself away and missed Mrs. O’R who has been a mother to me. Went to Anzac Hostel and left special instructions to call me in time for 7 a.m. train.\n","121":"\n\nAwoke and found it was three to seven, I had not been called pulling on my trousers I grabbed my clothes jumped into a waiting gharry and whilst galloping to stn. dressed, arrived there to see train leaving. Full of chagrin I returned to Hostel and blew off my feelings. At 10 a.m. a big crowd of returning men came down and we caught the train at eleven% finally arriving at Tewfik at 5 p.m. where we embarked on the lovely old Euripides, commenced work immediately, unpacking drugs etc., busy till midnight.\n\nFriday\n","122":"\n\nEarly in a.m. commenced work unpacking drugs. I have been given charge of dispensary. Just had the place in order when patients arrived with sisters, I had to leave my work and go down to the wards and try and straighten things out, allotting patients etc. Chaos indescribable to many bosses and no workers. Bad convalescents and malingerers, about midnight we had things fairly settled then I had to start dispensing.\n","123":"\n\nThere are only 6 Medical men aboard and only two of us are tenth division men so I realized I had some walk ahead of me, there are 4 sisters and they have 40 bad cases between them, I have been given charge of 220 and I was going for my life all day I won’t be settled for a week, we sailed at 10-30 a.m. and at last I am off to dear old Australia, so I don’t care how I work\n\nTeusday","124":"\n\nThings a little better to-day I have a cabin now, as I am acting staff sergt. Every man of my 220 was prescribed for I have a system now, but my two orderlies are useless I have the whole responsibility\n","125":" \n\nWe have a lovely mess, and are travelling 2nd class, food is perfect, pleasant day. Had more time to-day. W.O. relieved me of my twenty dressings. After I have been with two Drs. I have to dispense and then make out reqns. & diet sheets. However am gradually getting things settled but my ankles ache with the running about on the hard deck after the desert.\n","126":"\n\nPassed Aden during night fell foul of Ship’s Capt. to-day, Maleish. Sisters help me a bit now by taking my worst patients into their hosp. Iodine, mans eyes in place. 10% Argyol xxx\n","127":"\n\nI have most of my bad patients moved to the sisters ward now. Things going much better I feed my light diets on Jellies & Custards now. Made great time all day. Had hour to myself in p.m.\n","128":"\n\nAlthough hot we are having ideal weather and after a stuffy day in the wards one feels the benefit of a blow on decks when the night duty relieves us. To-night we had an indifferent sort of concert, I was recalled three times Desert stuff appeals to men present. We have every convenience of saloon travelling and I almost think myself a civilian again.\n","129":"\n\nChurch service on well deck by Archbishop Chaplain General who is returning home. I could not spare a minute in the morning from 6 a.m. to 12 I have about an hour off at 3 p.m. She is a great boat and averaging 16 knots all day & night.\n","130":"\n\nBeastly hot but calm sea, not a ripple. My Wards are working well now. It is an ideal trip and we are having a great trip. I have two good M.O’s and the sisters are very decent. Our newly launched cruiser Brisbane passed us, making for Malta for repairs, she had a fire on board a few days previously.\n","131":"\n\nPaid a small sum to-day. Had interesting operation in p.m. – Subcutaneous Hydrogen Injection for Myalgia, was wonderfully successful. I have about an hour off in p.m. and allow my orderlies the same.\n","132":"\n\nArrive at Colombo to-morrow sent two patients to sister to-day.\n","133":"\n\nArrived at Colombo at day break and went right in, no one was allowed ashore until two, the usual rumours of plague etc. taking place. However nearly all the \n\nwalking cases went ashore. I did not get away till three and after purchasing a few things we went for a three hours rickshaw ride, returning to the boat at 6-30 p.m. MALING-et-INTOX – Disgusted -\n","134":"\n\nAfter disgraceful episodes of last night all leave stopped save for the bad patients. I was like a mother arranging a picnic in a.m. telling the couples off and to take each others hand. I stayed aboard and let my orderlies go. Some Ladies came aboard in p.m. and although the heat was stifling I had to get dressed and show them through my wards where they distributed flowers etc. Then came the Commandant of Ceylon and all his retinue to inspect the ship. It is rumoured that France has declared war on Holland, they are holding all Dutch ships up in this port. One of my patients ran amok with a dagger but I got him into a cabin very quietly.\n","135":"\n\nCoaling until 4 p.m. when the gangway was pulled up and we sailed. Eight seamen off the Brisbane invalided back are returning on this boat, I have them in my ward. It was lovely to be travelling again, there was not a breath of air in Colombo. I used just saturate night and day. All the wasters who played up are doing cells now.\n","136":"\n\nC.P. in a.m. by Archbishop, quiet day, everybody seems to want to sleep, I have hour off in p.m. but cannot - it is splendid to think now that our next stop is going to be Australia\n","137":"\n\nThere are two many senior offs. & N.C.O’s on this boat and they are all clashing it is highly amusing. Last night we struck a tropical cloud burst, the hatches were open and when I went on duty in a.m. the wards had water 3\" deep, the patients were drenched.\n\nTeusday","138":"\n\nSpent day cleaning up, no one worse for it, change in duty roster now. Had enjoyable concert at night, recited four times. The W.O. and I as partners are yet undefeated at whist, we beat all comers.\n","139":"\n\nUsual kind of day, I rather pride myself now as a ward Sgt. Everything going smoothly. In the same waters as we got the Emden on 9th Nov. Of all the patients on board there are only about two who were there.\n","140":"\n\nSea very calm, big swell on, boat pitched a bit, it makes one very squeamy to stay long below. Sister Lyons pinched all my jelly to-day – I’ll get hers to-morrow.\n","141":"\n\nChoppy sea, a few seasick, hope to reach Freemantle on Teusday next.\n","142":"\n\nAll Victorians paraded to-day for roll call, I have an idea I will have to go right on to Sydney as W. Officer. I hope not as I am getting very anxious to see old Melb. heads according to wireless probability of America joining as our next ally\n","143":"\n\nC.P. by Bishop in a.m., quiet day.\n","144":"\n\nChoppy sea, a few seasick, arrive Freemantle to-morrow.\n\nTeusday","145":"\n\nWe sighted land about 10 a.m., our dear Australia the sight I have longed for on so many occasions we finally anchored outside Freemantle harbour and placed in quarantine. All the W. Aussies got their mits up to disembark but after two hours waiting they were told to go below till morning. At nine p.m. all clocks were set back 2 hours owing to the Daylight Savings Bill. That means once & instead of Ten I went to bed at Twelve and arose at 3-30 p.m. I felt sorry for The Wet’s so near and yet so far I was informed I have to act as Warrant Officer to Melbourne, the other man getting off here.\n","146":"\n\nAs early as 8 a.m. the wharf had friends of the lads to welcome them home, and every train disgorged loads of dear Australian girls and women \ns\n , their tears made me feel homesick the first time in thirty months, at 10 p.m. the Wet’s disembarked. A band came down from Perth to play for us, and the people showered fruit and cigarettes on us. Then 20 German prisoners came aboard to be interned at Liverpool, then 100 Artillery and Tunnelling reinforcements to join up in Melb. As my service has been so long I could not help my thoughts as they embarked. If they go through what I have they will see some service. Then we steamed out, streamers and tears our accompaniment. I took over my duties of Warrant Officer and worked 18 hours before I tumbled to sleep to dream of dear old Melbourne.\n","147":"\n\nMade good speed all day round the Leeuwin, the boat rolled and all the new hands were sick. I am horribly short handed and doing 4 mens work, and I knocked up but it is only for a day or two so I’ll stick it.\n","148":"\n\nFell to my lot to issue Red Cross goods on \n\ntop of all my other work, am really run down, and longing for a spell away from drugs, patients and hospital work.\n","149":"\n\nStruck heavy seas, boat rolled terribly, bottles & patients flying always. At five o’clock a wireless was received saying boat was not to call at Melbourne but go right on to Sydney – why we know not – but all S. Austs. and Melb. lads are furious.\n","150":"\n\nBoat still rolling – a lot are seasick. Everyone except Sydney people are wearing a very glum expression, however we expected the staff to go on at any rate I had to put the dispenser on night duty so when I can find a spare moment I have to do the ship’s dispensing I won’t be sorry to get off.\n","151":"\n\nPassed Melbourne to our regret and through the night Cape Howe. All our kits are being fumigated, but I have packed two bags. I am dreading disembarkation, so far everything has been messed up.\n\nTeusday","152":"\n\nPassed Gabo Island, Jervis Bay quite closely and finally anchored in Rose Bay late at\n\nnight.\n","153":"\n\nMoved into WooloomoolooWharf and as soon as the boat moored the embarkation staff came aboard and there was a wire for me. Sergt. Morris, father dying, return at once. I was broken up and could do nothing I was so dazed. The O.C., Officers and men were all sympathy. Our kits were left behind for fumigation and as we went down the gangway, we were met by motor cars who took us through cheering crowds to Rose Hall Convalescent Home – there we were entertained by kind V.A.D’s. I could appreciate nothing. I wandered round Sydney until the train went. Cheers, flowers, fruit and gifts were showered on us but I felt too low spirited to appreciate it. I worked till twelve up and down the train checking patients and caring for the mental cases, turned in in sleeper compartment and slept well.\n","154":"\n\nArrived Albury 5-30 a.m., had breakfast then on to dear old Melb. The train could not go fast enough for me and we arrived at Spencer St. at noon.\n\nI jumped out of the train and rushed to the barricade and in two secs kissed my dear old sister, we took a cab home and I learned that my father was terribly low but just living for me. As we drew near the house I whistled and over the fence came dear old Tam, he knew me immediately and jumped all over me then my darling little mother looking splendid, oh how happy I was, they prepared me for Dad and I went into his room – my poor father – he is just alive, he is emaciated but happy to meet his son he could not speak save - I have lived for this my son. I stayed with him all the afternoon he is so proud of me. I am proud to think also that I returned to him with honours.\n\nA few hours home and I forgot I had ever been away – so now dear diary I have kept you all these long thirty months, we have seen much and suffered much. You are my remembrance of all so now I am home again I will close up.\n\nPerhaps I may go again but once home my memory will keep its own secrets – so I bid you farewell.\n\n"}}